[
    {
        "order": 1,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03753",
        "abs_url": "https://arxiv.org/abs/2511.03753",
        "pdf_url": "https://arxiv.org/pdf/2511.03753",
        "title": "Federated Learning with Gramian Angular Fields for Privacy-Preserving ECG Classification on Heterogeneous IoT Devices",
        "authors": [
            "Youssef Elmir",
            "Yassine Himeur",
            "Abbes Amira"
        ],
        "comments": "06 pages, 03 figures, accepted for presentation at the 7th IEEE Computing, Communications and IoT Applications Conference (ComComAp 2025)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE); Networking and Internet Architecture (cs.NI)",
        "abstract": "This study presents a federated learning (FL) framework for privacy-preserving electrocardiogram (ECG) classification in Internet of Things (IoT) healthcare environments. By transforming 1D ECG signals into 2D Gramian Angular Field (GAF) images, the proposed approach enables efficient feature extraction through Convolutional Neural Networks (CNNs) while ensuring that sensitive medical data remain local to each device. This work is among the first to experimentally validate GAF-based federated ECG classification across heterogeneous IoT devices, quantifying both performance and communication efficiency. To evaluate feasibility in realistic IoT settings, we deployed the framework across a server, a laptop, and a resource-constrained Raspberry Pi 4, reflecting edge-cloud integration in IoT ecosystems. Experimental results demonstrate that the FL-GAF model achieves a high classification accuracy of 95.18% in a multi-client setup, significantly outperforming a single-client baseline in both accuracy and training time. Despite the added computational complexity of GAF transformations, the framework maintains efficient resource utilization and communication overhead. These findings highlight the potential of lightweight, privacy-preserving AI for IoT-based healthcare monitoring, supporting scalable and secure edge deployments in smart health systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03768",
        "abs_url": "https://arxiv.org/abs/2511.03768",
        "pdf_url": "https://arxiv.org/pdf/2511.03768",
        "title": "What's in Common? Multimodal Models Hallucinate When Reasoning Across Scenes",
        "authors": [
            "Candace Ross",
            "Florian Bordes",
            "Adina Williams",
            "Polina Kirichenko",
            "Mark Ibrahim"
        ],
        "comments": "10 pages, 6 figures. Accepted to NeurIPS Datasets & Benchmarks 2025",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "Multimodal language models possess a remarkable ability to handle an open-vocabulary's worth of objects. Yet the best models still suffer from hallucinations when reasoning about scenes in the real world, revealing a gap between their seemingly strong performance on existing perception benchmarks that are saturating and their reasoning in the real world. To address this gap, we build a novel benchmark of in-the-wild scenes that we call Common-O. With more than 10.5k examples using exclusively new images not found in web training data to avoid contamination, Common-O goes beyond just perception, inspired by cognitive tests for humans, to probe reasoning across scenes by asking \"what's in common?\". We evaluate leading multimodal language models, including models specifically trained to perform chain-of-thought reasoning. We find that perceiving objects in single images is tractable for most models, yet reasoning across scenes is very challenging even for the best models, including reasoning models. Despite saturating many leaderboards focusing on perception, the best performing model only achieves 35% on Common-O -- and on Common-O Complex, consisting of more complex scenes, the best model achieves only 1%. Curiously, we find models are more prone to hallucinate when similar objects are present in the scene, suggesting models may be relying on object co-occurrence seen during training. Among the models we evaluated, we found scale can provide modest improvements while models explicitly trained with multi-image inputs show bigger improvements, suggesting scaled multi-image training may offer promise. We make our benchmark publicly available to spur research into the challenge of hallucination when reasoning across scenes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03774",
        "abs_url": "https://arxiv.org/abs/2511.03774",
        "pdf_url": "https://arxiv.org/pdf/2511.03774",
        "title": "Contamination Detection for VLMs using Multi-Modal Semantic Perturbation",
        "authors": [
            "Jaden Park",
            "Mu Cai",
            "Feng Yao",
            "Jingbo Shang",
            "Soochahn Lee",
            "Yong Jae Lee"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent advances in Vision-Language Models (VLMs) have achieved state-of-the-art performance on numerous benchmark tasks. However, the use of internet-scale, often proprietary, pretraining corpora raises a critical concern for both practitioners and users: inflated performance due to test-set leakage. While prior works have proposed mitigation strategies such as decontamination of pretraining data and benchmark redesign for LLMs, the complementary direction of developing detection methods for contaminated VLMs remains underexplored. To address this gap, we deliberately contaminate open-source VLMs on popular benchmarks and show that existing detection approaches either fail outright or exhibit inconsistent behavior. We then propose a novel simple yet effective detection method based on multi-modal semantic perturbation, demonstrating that contaminated models fail to generalize under controlled perturbations. Finally, we validate our approach across multiple realistic contamination strategies, confirming its robustness and effectiveness. The code and perturbed dataset will be released publicly.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03806",
        "abs_url": "https://arxiv.org/abs/2511.03806",
        "pdf_url": "https://arxiv.org/pdf/2511.03806",
        "title": "FusionDP: Foundation Model-Assisted Differentially Private Learning for Partially Sensitive Features",
        "authors": [
            "Linghui Zeng",
            "Ruixuan Liu",
            "Atiquer Rahman Sarkar",
            "Xiaoqian Jiang",
            "Joyce C. Ho",
            "Li Xiong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Ensuring the privacy of sensitive training data is crucial in privacy-preserving machine learning. However, in practical scenarios, privacy protection may be required for only a subset of features. For instance, in ICU data, demographic attributes like age and gender pose higher privacy risks due to their re-identification potential, whereas raw lab results are generally less sensitive. Traditional DP-SGD enforces privacy protection on all features in one sample, leading to excessive noise injection and significant utility degradation. We propose FusionDP, a two-step framework that enhances model utility under feature-level differential privacy. First, FusionDP leverages large foundation models to impute sensitive features given non-sensitive features, treating them as external priors that provide high-quality estimates of sensitive attributes without accessing the true values during model training. Second, we introduce a modified DP-SGD algorithm that trains models on both original and imputed features while formally preserving the privacy of the original sensitive features. We evaluate FusionDP on two modalities: a sepsis prediction task on tabular data from PhysioNet and a clinical note classification task from MIMIC-III. By comparing against privacy-preserving baselines, our results show that FusionDP significantly improves model performance while maintaining rigorous feature-level privacy, demonstrating the potential of foundation model-driven imputation to enhance the privacy-utility trade-off for various modalities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03807",
        "abs_url": "https://arxiv.org/abs/2511.03807",
        "pdf_url": "https://arxiv.org/pdf/2511.03807",
        "title": "Fair and Explainable Credit-Scoring under Concept Drift: Adaptive Explanation Frameworks for Evolving Populations",
        "authors": [
            "Shivogo John"
        ],
        "comments": "18 pages, 14 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Evolving borrower behaviors, shifting economic conditions, and changing regulatory landscapes continuously reshape the data distributions underlying modern credit-scoring systems. Conventional explainability techniques, such as SHAP, assume static data and fixed background distributions, making their explanations unstable and potentially unfair when concept drift occurs. This study addresses that challenge by developing adaptive explanation frameworks that recalibrate interpretability and fairness in dynamically evolving credit models. Using a multi-year credit dataset, we integrate predictive modeling via XGBoost with three adaptive SHAP variants: (A) per-slice explanation reweighting that adjusts for feature distribution shifts, (B) drift-aware SHAP rebaselining with sliding-window background samples, and (C) online surrogate calibration using incremental Ridge regression. Each method is benchmarked against static SHAP explanations using metrics of predictive performance (AUC, F1), directional and rank stability (cosine, Kendall tau), and fairness (demographic parity and recalibration). Results show that adaptive methods, particularly rebaselined and surrogate-based explanations, substantially improve temporal stability and reduce disparate impact across demographic groups without degrading predictive accuracy. Robustness tests, including counterfactual perturbations, background sensitivity analysis, and proxy-variable detection, confirm the resilience of adaptive explanations under real-world drift conditions. These findings establish adaptive explainability as a practical mechanism for sustaining transparency, accountability, and ethical reliability in data-driven credit systems, and more broadly, in any domain where decision models evolve with population change.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03809",
        "abs_url": "https://arxiv.org/abs/2511.03809",
        "pdf_url": "https://arxiv.org/pdf/2511.03809",
        "title": "One Size Does Not Fit All: Architecture-Aware Adaptive Batch Scheduling with DEBA",
        "authors": [
            "François Belias",
            "Naser Ezzati-Jivan",
            "Foutse Khomh"
        ],
        "comments": "14 pages",
        "subjects": "Machine Learning (cs.LG); Performance (cs.PF)",
        "abstract": "Adaptive batch size methods aim to accelerate neural network training, but existing approaches apply identical adaptation strategies across all architectures, assuming a one-size-fits-all solution. We introduce DEBA (Dynamic Efficient Batch Adaptation), an adaptive batch scheduler that monitors gradient variance, gradient norm variation and loss variation to guide batch size adaptations. Through systematic evaluation across six architectures (ResNet-18/50, DenseNet-121, EfficientNet-B0, MobileNet-V3, ViT-B16) on CIFAR-10 and CIFAR-100, with five random seeds per configuration, we demonstrate that the architecture fundamentally determines adaptation efficacy. Our findings reveal that: (1) lightweight and medium-depth architectures (MobileNet-V3, DenseNet-121, EfficientNet-B0) achieve a 45-62% training speedup with simultaneous accuracy improvements of 1-7%; (2) shallow residual networks (ResNet-18) show consistent gains of +2.4 - 4.0% in accuracy, 36 - 43% in speedup, while deep residual networks (ResNet-50) exhibit high variance and occasional degradation; (3) already-stable architectures (ViT-B16) show minimal speedup (6%) despite maintaining accuracy, indicating that adaptation benefits vary with baseline optimization characteristics. We introduce a baseline characterization framework using gradient stability metrics (stability score, gradient norm variation) that predicts which architectures will benefit from adaptive scheduling. Our ablation studies reveal critical design choices often overlooked in prior work: sliding window statistics (vs. full history) and sufficient cooldown periods (5+ epochs) between adaptations are essential for success. This work challenges the prevailing assumption that adaptive methods generalize across architectures and provides the first systematic evidence that batch size adaptation requires an architecture-aware design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03824",
        "abs_url": "https://arxiv.org/abs/2511.03824",
        "pdf_url": "https://arxiv.org/pdf/2511.03824",
        "title": "Sketch-Augmented Features Improve Learning Long-Range Dependencies in Graph Neural Networks",
        "authors": [
            "Ryien Hosseini",
            "Filippo Simini",
            "Venkatram Vishwanath",
            "Rebecca Willett",
            "Henry Hoffmann"
        ],
        "comments": "To appear at NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph Neural Networks learn on graph-structured data by iteratively aggregating local neighborhood information. While this local message passing paradigm imparts a powerful inductive bias and exploits graph sparsity, it also yields three key challenges: (i) oversquashing of long-range information, (ii) oversmoothing of node representations, and (iii) limited expressive power. In this work we inject randomized global embeddings of node features, which we term \\textit{Sketched Random Features}, into standard GNNs, enabling them to efficiently capture long-range dependencies. The embeddings are unique, distance-sensitive, and topology-agnostic -- properties which we analytically and empirically show alleviate the aforementioned limitations when injected into GNNs. Experimental results on real-world graph learning tasks confirm that this strategy consistently improves performance over baseline GNNs, offering both a standalone solution and a complementary enhancement to existing techniques such as graph positional encodings. Our source code is available at \\href{this https URL}{this https URL}.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03828",
        "abs_url": "https://arxiv.org/abs/2511.03828",
        "pdf_url": "https://arxiv.org/pdf/2511.03828",
        "title": "From Static to Dynamic: Enhancing Offline-to-Online Reinforcement Learning via Energy-Guided Diffusion Stratification",
        "authors": [
            "Lipeng Zu",
            "Hansong Zhou",
            "Xiaonan Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Transitioning from offline to online reinforcement learning (RL) poses critical challenges due to distributional shifts between the fixed behavior policy in the offline dataset and the evolving policy during online learning. Although this issue is widely recognized, few methods attempt to explicitly assess or utilize the distributional structure of the offline data itself, leaving a research gap in adapting learning strategies to different types of samples. To address this challenge, we propose an innovative method, Energy-Guided Diffusion Stratification (StratDiff), which facilitates smoother transitions in offline-to-online RL. StratDiff deploys a diffusion model to learn prior knowledge from the offline dataset. It then refines this knowledge through energy-based functions to improve policy imitation and generate offline-like actions during online fine-tuning. The KL divergence between the generated action and the corresponding sampled action is computed for each sample and used to stratify the training batch into offline-like and online-like subsets. Offline-like samples are updated using offline objectives, while online-like samples follow online learning strategies. We demonstrate the effectiveness of StratDiff by integrating it with off-the-shelf methods Cal-QL and IQL. Extensive empirical evaluations on D4RL benchmarks show that StratDiff significantly outperforms existing methods, achieving enhanced adaptability and more stable performance across diverse RL settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03831",
        "abs_url": "https://arxiv.org/abs/2511.03831",
        "pdf_url": "https://arxiv.org/pdf/2511.03831",
        "title": "Higher-Order Causal Structure Learning with Additive Models",
        "authors": [
            "James Enouen",
            "Yujia Zheng",
            "Ignavier Ng",
            "Yan Liu",
            "Kun Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Statistics Theory (math.ST); Machine Learning (stat.ML)",
        "abstract": "Causal structure learning has long been the central task of inferring causal insights from data. Despite the abundance of real-world processes exhibiting higher-order mechanisms, however, an explicit treatment of interactions in causal discovery has received little attention. In this work, we focus on extending the causal additive model (CAM) to additive models with higher-order interactions. This second level of modularity we introduce to the structure learning problem is most easily represented by a directed acyclic hypergraph which extends the DAG. We introduce the necessary definitions and theoretical tools to handle the novel structure we introduce and then provide identifiability results for the hyper DAG, extending the typical Markov equivalence classes. We next provide insights into why learning the more complex hypergraph structure may actually lead to better empirical results. In particular, more restrictive assumptions like CAM correspond to easier-to-learn hyper DAGs and better finite sample complexity. We finally develop an extension of the greedy CAM algorithm which can handle the more complex hyper DAG search space and demonstrate its empirical usefulness in synthetic experiments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03836",
        "abs_url": "https://arxiv.org/abs/2511.03836",
        "pdf_url": "https://arxiv.org/pdf/2511.03836",
        "title": "Enhancing Q-Value Updates in Deep Q-Learning via Successor-State Prediction",
        "authors": [
            "Lipeng Zu",
            "Hansong Zhou",
            "Xiaonan Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep Q-Networks (DQNs) estimate future returns by learning from transitions sampled from a replay buffer. However, the target updates in DQN often rely on next states generated by actions from past, potentially suboptimal, policy. As a result, these states may not provide informative learning signals, causing high variance into the update process. This issue is exacerbated when the sampled transitions are poorly aligned with the agent's current policy. To address this limitation, we propose the Successor-state Aggregation Deep Q-Network (SADQ), which explicitly models environment dynamics using a stochastic transition model. SADQ integrates successor-state distributions into the Q-value estimation process, enabling more stable and policy-aligned value updates. Additionally, it explores a more efficient action selection strategy with the modeled transition structure. We provide theoretical guarantees that SADQ maintains unbiased value estimates while reducing training variance. Our extensive empirical results across standard RL benchmarks and real-world vector-based control tasks demonstrate that SADQ consistently outperforms DQN variants in both stability and learning efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03877",
        "abs_url": "https://arxiv.org/abs/2511.03877",
        "pdf_url": "https://arxiv.org/pdf/2511.03877",
        "title": "Benchmark Datasets for Lead-Lag Forecasting on Social Platforms",
        "authors": [
            "Kimia Kazemian",
            "Zhenzhen Liu",
            "Yangfanyu Yang",
            "Katie Z Luo",
            "Shuhan Gu",
            "Audrey Du",
            "Xinyu Yang",
            "Jack Jansons",
            "Kilian Q Weinberger",
            "John Thickstun",
            "Yian Yin",
            "Sarah Dean"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Social and collaborative platforms emit multivariate time-series traces in which early interactions-such as views, likes, or downloads-are followed, sometimes months or years later, by higher impact like citations, sales, or reviews. We formalize this setting as Lead-Lag Forecasting (LLF): given an early usage channel (the lead), predict a correlated but temporally shifted outcome channel (the lag). Despite the ubiquity of such patterns, LLF has not been treated as a unified forecasting problem within the time-series community, largely due to the absence of standardized datasets. To anchor research in LLF, here we present two high-volume benchmark datasets-arXiv (accesses -> citations of 2.3M papers) and GitHub (pushes/stars -> forks of 3M repositories)-and outline additional domains with analogous lead-lag dynamics, including Wikipedia (page views -> edits), Spotify (streams -> concert attendance), e-commerce (click-throughs -> purchases), and LinkedIn profile (views -> messages). Our datasets provide ideal testbeds for lead-lag forecasting, by capturing long-horizon dynamics across years, spanning the full spectrum of outcomes, and avoiding survivorship bias in sampling. We documented all technical details of data curation and cleaning, verified the presence of lead-lag dynamics through statistical and classification tests, and benchmarked parametric and non-parametric baselines for regression. Our study establishes LLF as a novel forecasting paradigm and lays an empirical foundation for its systematic exploration in social and usage data. Our data portal with downloads and documentation is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03911",
        "abs_url": "https://arxiv.org/abs/2511.03911",
        "pdf_url": "https://arxiv.org/pdf/2511.03911",
        "title": "DecoHD: Decomposed Hyperdimensional Classification under Extreme Memory Budgets",
        "authors": [
            "Sanggeon Yun",
            "Hyunwoo Oh",
            "Ryozo Masukawa",
            "Mohsen Imani"
        ],
        "comments": "Accepted to DATE 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Decomposition is a proven way to shrink deep networks without changing I/O. We bring this idea to hyperdimensional computing (HDC), where footprint cuts usually shrink the feature axis and erode concentration and robustness. Prior HDC decompositions decode via fixed atomic hypervectors, which are ill-suited for compressing learned class prototypes. We introduce DecoHD, which learns directly in a decomposed HDC parameterization: a small, shared set of per-layer channels with multiplicative binding across layers and bundling at the end, yielding a large representational space from compact factors. DecoHD compresses along the class axis via a lightweight bundling head while preserving native bind-bundle-score; training is end-to-end, and inference remains pure HDC, aligning with in/near-memory accelerators. In evaluation, DecoHD attains extreme memory savings with only minor accuracy degradation under tight deployment budgets. On average it stays within about 0.1-0.15% of a strong non-reduced HDC baseline (worst case 5.7%), is more robust to random bit-flip noise, reaches its accuracy plateau with up to ~97% fewer trainable parameters, and -- in hardware -- delivers roughly 277x/35x energy/speed gains over a CPU (AMD Ryzen 9 9950X), 13.5x/3.7x over a GPU (NVIDIA RTX 4090), and 2.0x/2.4x over a baseline HDC ASIC.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03924",
        "abs_url": "https://arxiv.org/abs/2511.03924",
        "pdf_url": "https://arxiv.org/pdf/2511.03924",
        "title": "On Predicting Sociodemographics from Mobility Signals",
        "authors": [
            "Ekin Uğurel",
            "Cynthia Chen",
            "Brian H. Y. Lee",
            "Filipe Rodrigues"
        ],
        "comments": "22 pages, 8 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Inferring sociodemographic attributes from mobility data could help transportation planners better leverage passively collected datasets, but this task remains difficult due to weak and inconsistent relationships between mobility patterns and sociodemographic traits, as well as limited generalization across contexts. We address these challenges from three angles. First, to improve predictive accuracy while retaining interpretability, we introduce a behaviorally grounded set of higher-order mobility descriptors based on directed mobility graphs. These features capture structured patterns in trip sequences, travel modes, and social co-travel, and significantly improve prediction of age, gender, income, and household structure over baselines features. Second, we introduce metrics and visual diagnostic tools that encourage evenness between model confidence and accuracy, enabling planners to quantify uncertainty. Third, to improve generalization and sample efficiency, we develop a multitask learning framework that jointly predicts multiple sociodemographic attributes from a shared representation. This approach outperforms single-task models, particularly when training data are limited or when applying models across different time periods (i.e., when the test set distribution differs from the training set).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03928",
        "abs_url": "https://arxiv.org/abs/2511.03928",
        "pdf_url": "https://arxiv.org/pdf/2511.03928",
        "title": "SynQuE: Estimating Synthetic Dataset Quality Without Annotations",
        "authors": [
            "Arthur Chen",
            "Victor Zhong"
        ],
        "comments": "Under review",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce and formalize the Synthetic Dataset Quality Estimation (SynQuE) problem: ranking synthetic datasets by their expected real-world task performance using only limited unannotated real data. This addresses a critical and open challenge where data is scarce due to collection costs or privacy constraints. We establish the first comprehensive benchmarks for this problem by introducing and evaluating proxy metrics that choose synthetic data for training to maximize task performance on real data. We introduce the first proxy metrics for SynQuE by adapting distribution and diversity-based distance measures to our context via embedding models. To address the shortcomings of these metrics on complex planning tasks, we propose LENS, a novel proxy that leverages large language model reasoning. Our results show that SynQuE proxies correlate with real task performance across diverse tasks, including sentiment analysis, Text2SQL, web navigation, and image classification, with LENS consistently outperforming others on complex tasks by capturing nuanced characteristics. For instance, on text-to-SQL parsing, training on the top-3 synthetic datasets selected via SynQuE proxies can raise accuracy from 30.4% to 38.4 (+8.1)% on average compared to selecting data indiscriminately. This work establishes SynQuE as a practical framework for synthetic data selection under real-data scarcity and motivates future research on foundation model-based data characterization and fine-grained data selection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03938",
        "abs_url": "https://arxiv.org/abs/2511.03938",
        "pdf_url": "https://arxiv.org/pdf/2511.03938",
        "title": "LogHD: Robust Compression of Hyperdimensional Classifiers via Logarithmic Class-Axis Reduction",
        "authors": [
            "Sanggeon Yun",
            "Hyunwoo Oh",
            "Ryozo Masukawa",
            "Pietro Mercati",
            "Nathaniel D. Bastian",
            "Mohsen Imani"
        ],
        "comments": "Accepted to DATE 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Hyperdimensional computing (HDC) suits memory, energy, and reliability-constrained systems, yet the standard \"one prototype per class\" design requires $O(CD)$ memory (with $C$ classes and dimensionality $D$). Prior compaction reduces $D$ (feature axis), improving storage/compute but weakening robustness. We introduce LogHD, a logarithmic class-axis reduction that replaces the $C$ per-class prototypes with $n\\!\\approx\\!\\lceil\\log_k C\\rceil$ bundle hypervectors (alphabet size $k$) and decodes in an $n$-dimensional activation space, cutting memory to $O(D\\log_k C)$ while preserving $D$. LogHD uses a capacity-aware codebook and profile-based decoding, and composes with feature-axis sparsification. Across datasets and injected bit flips, LogHD attains competitive accuracy with smaller models and higher resilience at matched memory. Under equal memory, it sustains target accuracy at roughly $2.5$-$3.0\\times$ higher bit-flip rates than feature-axis compression; an ASIC instantiation delivers $498\\times$ energy efficiency and $62.6\\times$ speedup over an AMD Ryzen 9 9950X and $24.3\\times$/$6.58\\times$ over an NVIDIA RTX 4090, and is $4.06\\times$ more energy-efficient and $2.19\\times$ faster than a feature-axis HDC ASIC baseline.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03953",
        "abs_url": "https://arxiv.org/abs/2511.03953",
        "pdf_url": "https://arxiv.org/pdf/2511.03953",
        "title": "Conditional Score Learning for Quickest Change Detection in Markov Transition Kernels",
        "authors": [
            "Wuxia Chen",
            "Taposh Banerjee",
            "Vahid Tarokh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP); Statistics Theory (math.ST); Methodology (stat.ME); Machine Learning (stat.ML)",
        "abstract": "We address the problem of quickest change detection in Markov processes with unknown transition kernels. The key idea is to learn the conditional score $\\nabla_{\\mathbf{y}} \\log p(\\mathbf{y}|\\mathbf{x})$ directly from sample pairs $( \\mathbf{x},\\mathbf{y})$, where both $\\mathbf{x}$ and $\\mathbf{y}$ are high-dimensional data generated by the same transition kernel. In this way, we avoid explicit likelihood evaluation and provide a practical way to learn the transition dynamics. Based on this estimation, we develop a score-based CUSUM procedure that uses conditional Hyvarinen score differences to detect changes in the kernel. To ensure bounded increments, we propose a truncated version of the statistic. With Hoeffding's inequality for uniformly ergodic Markov processes, we prove exponential lower bounds on the mean time to false alarm. We also prove asymptotic upper bounds on detection delay. These results give both theoretical guarantees and practical feasibility for score-based detection in high-dimensional Markov models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03966",
        "abs_url": "https://arxiv.org/abs/2511.03966",
        "pdf_url": "https://arxiv.org/pdf/2511.03966",
        "title": "PrivacyCD: Hierarchical Unlearning for Protecting Student Privacy in Cognitive Diagnosis",
        "authors": [
            "Mingliang Hou",
            "Yinuo Wang",
            "Teng Guo",
            "Zitao Liu",
            "Wenzhou Dou",
            "Jiaqi Zheng",
            "Renqiang Luo",
            "Mi Tian",
            "Weiqi Luo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The need to remove specific student data from cognitive diagnosis (CD) models has become a pressing requirement, driven by users' growing assertion of their \"right to be forgotten\". However, existing CD models are largely designed without privacy considerations and lack effective data unlearning mechanisms. Directly applying general purpose unlearning algorithms is suboptimal, as they struggle to balance unlearning completeness, model utility, and efficiency when confronted with the unique heterogeneous structure of CD models. To address this, our paper presents the first systematic study of the data unlearning problem for CD models, proposing a novel and efficient algorithm: hierarchical importanceguided forgetting (HIF). Our key insight is that parameter importance in CD models exhibits distinct layer wise characteristics. HIF leverages this via an innovative smoothing mechanism that combines individual and layer, level importance, enabling a more precise distinction of parameters associated with the data to be unlearned. Experiments on three real world datasets show that HIF significantly outperforms baselines on key metrics, offering the first effective solution for CD models to respond to user data removal requests and for deploying high-performance, privacy preserving AI systems",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03972",
        "abs_url": "https://arxiv.org/abs/2511.03972",
        "pdf_url": "https://arxiv.org/pdf/2511.03972",
        "title": "Non-Asymptotic Optimization and Generalization Bounds for Stochastic Gauss-Newton in Overparameterized Models",
        "authors": [
            "Semih Cayci"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "An important question in deep learning is how higher-order optimization methods affect generalization. In this work, we analyze a stochastic Gauss-Newton (SGN) method with Levenberg-Marquardt damping and mini-batch sampling for training overparameterized deep neural networks with smooth activations in a regression setting. Our theoretical contributions are twofold. First, we establish finite-time convergence bounds via a variable-metric analysis in parameter space, with explicit dependencies on the batch size, network width and depth. Second, we derive non-asymptotic generalization bounds for SGN using uniform stability in the overparameterized regime, characterizing the impact of curvature, batch size, and overparameterization on generalization performance. Our theoretical results identify a favorable generalization regime for SGN in which a larger minimum eigenvalue of the Gauss-Newton matrix along the optimization path yields tighter stability bounds.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03976",
        "abs_url": "https://arxiv.org/abs/2511.03976",
        "pdf_url": "https://arxiv.org/pdf/2511.03976",
        "title": "PETRA: Pretrained Evolutionary Transformer for SARS-CoV-2 Mutation Prediction",
        "authors": [
            "Xu Zou"
        ],
        "comments": "preprint",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Genomics (q-bio.GN)",
        "abstract": "Since its emergence, SARS-CoV-2 has demonstrated a rapid and unpredictable evolutionary trajectory, characterized by the continual emergence of immune-evasive variants. This poses persistent challenges to public health and vaccine development. While large-scale generative pre-trained transformers (GPTs) have revolutionized the modeling of sequential data, their direct applications to noisy viral genomic sequences are limited. In this paper, we introduce PETRA(Pretrained Evolutionary TRAnsformer), a novel transformer approach based on evolutionary trajectories derived from phylogenetic trees rather than raw RNA sequences. This method effectively mitigates sequencing noise and captures the hierarchical structure of viral evolution. With a weighted training framework to address substantial geographical and temporal imbalances in global sequence data, PETRA excels in predicting future SARS-CoV-2 mutations, achieving a weighted recall@1 of 9.45% for nucleotide mutations and 17.10\\% for spike amino-acid mutations, compared to 0.49% and 6.64% respectively for the best baseline. PETRA also demonstrates its ability to aid in the real-time mutation prediction of major clades like 24F(XEC) and 25A(LP.8.1). The code is open sourced on this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03981",
        "abs_url": "https://arxiv.org/abs/2511.03981",
        "pdf_url": "https://arxiv.org/pdf/2511.03981",
        "title": "Structural Priors and Modular Adapters in the Composable Fine-Tuning Algorithm of Large-Scale Models",
        "authors": [
            "Yuxiao Wang",
            "Di Wu",
            "Feng Liu",
            "Zhimin Qiu",
            "Chenrui Hu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper proposes a composable fine-tuning method that integrates graph structural priors with modular adapters to address the high computational cost and structural instability faced by large-scale pre-trained models in multi-task adaptation. The method introduces a relation matrix to model dependencies among tasks, explicitly encoding correlations between nodes and paths into graph structural priors, which provide unified structural constraints for adapter weight allocation and path selection. Modular adapters are embedded into different layers through low-rank mapping and a pluggable mechanism, enabling efficient cross-task composition and reuse under prior guidance. This mechanism not only improves parameter efficiency and training stability but also alleviates path conflicts and redundant computation in multi-task scenarios. Furthermore, experiments on hyperparameter sensitivity, environmental sensitivity, and data sensitivity are conducted to systematically analyze key factors such as routing temperature, gating thresholds, and relation matrix regularization strength, verifying the consistency and superior performance of the method under structural constraints. The results demonstrate that the proposed framework significantly enhances task prediction accuracy, adapter weight allocation precision, and overall computational efficiency while maintaining model lightweight design, highlighting the synergistic advantages of graph priors and modular mechanisms in composable fine-tuning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03983",
        "abs_url": "https://arxiv.org/abs/2511.03983",
        "pdf_url": "https://arxiv.org/pdf/2511.03983",
        "title": "TwIST: Rigging the Lottery in Transformers with Independent Subnetwork Training",
        "authors": [
            "Michael Menezes",
            "Barbara Su",
            "Xinze Feng",
            "Yehya Farhat",
            "Hamza Shili",
            "Anastasios Kyrillidis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "We introduce TwIST, a distributed training framework for efficient large language model (LLM) sparsification. TwIST trains multiple subnetworks in parallel, periodically aggregates their parameters, and resamples new subnetworks during training. This process identifies high-quality subnetworks (\"golden tickets\") without requiring post-training procedures such as calibration or Hessian-based recovery. As a result, TwIST enables zero-cost pruning at deployment time while achieving perplexity competitive with state-of-the-art post-training sparsification methods. The benefits are most pronounced under aggressive sparsity (e.g., 50%+), where TwIST significantly outperforms baseline methods; for example, reaching 23.14 PPL compared to 31.64 for the closest prior approach. Unlike unstructured pruning, TwIST produces structured, dense matrices that offer practical inference speedups and memory reductions on commodity hardware (e.g., CPUs) that do not support efficient sparse computation. TwIST provides an efficient training-time path to deployable sparse LLMs without additional fine-tuning or recovery overhead.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03986",
        "abs_url": "https://arxiv.org/abs/2511.03986",
        "pdf_url": "https://arxiv.org/pdf/2511.03986",
        "title": "Use of Continuous Glucose Monitoring with Machine Learning to Identify Metabolic Subphenotypes and Inform Precision Lifestyle Changes",
        "authors": [
            "Ahmed A. Metwally",
            "Heyjun Park",
            "Yue Wu",
            "Tracey McLaughlin",
            "Michael P. Snyder"
        ],
        "comments": "18 pages, 8 figures",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "The classification of diabetes and prediabetes by static glucose thresholds obscures the pathophysiological dysglycemia heterogeneity, primarily driven by insulin resistance (IR), beta-cell dysfunction, and incretin deficiency. This review demonstrates that continuous glucose monitoring and wearable technologies enable a paradigm shift towards non-invasive, dynamic metabolic phenotyping. We show evidence that machine learning models can leverage high-resolution glucose data from at-home, CGM-enabled oral glucose tolerance tests to accurately predict gold-standard measures of muscle IR and beta-cell function. This personalized characterization extends to real-world nutrition, where an individual's unique postprandial glycemic response (PPGR) to standardized meals, such as the relative glucose spike to potatoes versus grapes, could serve as a biomarker for their metabolic subtype. Moreover, integrating wearable data reveals that habitual diet, sleep, and physical activity patterns, particularly their timing, are uniquely associated with specific metabolic dysfunctions, informing precision lifestyle interventions. The efficacy of dietary mitigators in attenuating PPGR is also shown to be phenotype-dependent. Collectively, this evidence demonstrates that CGM can deconstruct the complexity of early dysglycemia into distinct, actionable subphenotypes. This approach moves beyond simple glycemic control, paving the way for targeted nutritional, behavioral, and pharmacological strategies tailored to an individual's core metabolic defects, thereby paving the way for a new era of precision diabetes prevention.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04000",
        "abs_url": "https://arxiv.org/abs/2511.04000",
        "pdf_url": "https://arxiv.org/pdf/2511.04000",
        "title": "Towards Scalable Meta-Learning of near-optimal Interpretable Models via Synthetic Model Generations",
        "authors": [
            "Kyaw Hpone Myint",
            "Zhe Wu",
            "Alexandre G.R. Day",
            "Giri Iyengar"
        ],
        "comments": "9 pages, 3 figures, Neurips 2025 GenAI in Finance Workshop",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (stat.ML)",
        "abstract": "Decision trees are widely used in high-stakes fields like finance and healthcare due to their interpretability. This work introduces an efficient, scalable method for generating synthetic pre-training data to enable meta-learning of decision trees. Our approach samples near-optimal decision trees synthetically, creating large-scale, realistic datasets. Using the MetaTree transformer architecture, we demonstrate that this method achieves performance comparable to pre-training on real-world data or with computationally expensive optimal decision trees. This strategy significantly reduces computational costs, enhances data generation flexibility, and paves the way for scalable and efficient meta-learning of interpretable decision tree models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04002",
        "abs_url": "https://arxiv.org/abs/2511.04002",
        "pdf_url": "https://arxiv.org/pdf/2511.04002",
        "title": "Memory- and Latency-Constrained Inference of Large Language Models via Adaptive Split Computing",
        "authors": [
            "Mingyu Sung",
            "Vikas Palakonda",
            "Suhwan Im",
            "Sunghwan Moon",
            "Il-Min Kim",
            "Sangseok Yun",
            "Jae-Mo Kang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Large language models (LLMs) have achieved near-human performance across diverse reasoning tasks, yet their deployment on resource-constrained Internet-of-Things (IoT) devices remains impractical due to massive parameter footprints and memory-intensive autoregressive decoding. While split computing offers a promising solution by partitioning model execution between edge devices and cloud servers, existing approaches fail to address the unique challenges of autoregressive inference, particularly the iterative token generation process and expanding key-value (KV) cache requirements. This work introduces the first autoregressive-aware split computing framework designed explicitly for LLM deployment on edge devices. Our approach makes three key contributions. First, we develop one-point split compression (OPSC), a mixed-precision quantization scheme that prevents out-of-memory failures by strategically partitioning models into front-end and back-end segments with different precision levels. Second, we propose a two-stage intermediate compression pipeline that combines threshold splitting (TS) and token-wise adaptive bit quantization (TAB-Q) to preserve accuracy-critical activations while dramatically reducing communication overhead. Third, we formulate a unified optimization framework that jointly selects optimal split points, quantization settings, and sequence lengths to satisfy strict memory and latency constraints. Extensive evaluations across diverse LLMs and hardware platforms demonstrate superior performance compared to state-of-the-art quantization methods, including SmoothQuant, OmniQuant, and Atom. The framework achieves a 1.49 inference speedup and significant communication overhead reduction while maintaining or improving model accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04040",
        "abs_url": "https://arxiv.org/abs/2511.04040",
        "pdf_url": "https://arxiv.org/pdf/2511.04040",
        "title": "Enhancing Multimodal Protein Function Prediction Through Dual-Branch Dynamic Selection with Reconstructive Pre-Training",
        "authors": [
            "Xiaoling Luo",
            "Peng Chen",
            "Chengliang Liu",
            "Xiaopeng Jin",
            "Jie Wen",
            "Yumeng Liu",
            "Junsong Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE); Biomolecules (q-bio.BM)",
        "abstract": "Multimodal protein features play a crucial role in protein function prediction. However, these features encompass a wide range of information, ranging from structural data and sequence features to protein attributes and interaction networks, making it challenging to decipher their complex interconnections. In this work, we propose a multimodal protein function prediction method (DSRPGO) by utilizing dynamic selection and reconstructive pre-training mechanisms. To acquire complex protein information, we introduce reconstructive pre-training to mine more fine-grained information with low semantic levels. Moreover, we put forward the Bidirectional Interaction Module (BInM) to facilitate interactive learning among multimodal features. Additionally, to address the difficulty of hierarchical multi-label classification in this task, a Dynamic Selection Module (DSM) is designed to select the feature representation that is most conducive to current protein function prediction. Our proposed DSRPGO model improves significantly in BPO, MFO, and CCO on human datasets, thereby outperforming other benchmark models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04063",
        "abs_url": "https://arxiv.org/abs/2511.04063",
        "pdf_url": "https://arxiv.org/pdf/2511.04063",
        "title": "DartQuant: Efficient Rotational Distribution Calibration for LLM Quantization",
        "authors": [
            "Yuantian Shao",
            "Yuanteng Chen",
            "Peisong Wang",
            "Jianlin Yu",
            "Jing Lin",
            "Yiwu Yao",
            "Zhihui Wei",
            "Jian Cheng"
        ],
        "comments": "NeurIPS 2025, 10 pages, 12 figures",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Quantization plays a crucial role in accelerating the inference of large-scale models, and rotational matrices have been shown to effectively improve quantization performance by smoothing outliers. However, end-to-end fine-tuning of rotational optimization algorithms incurs high computational costs and is prone to overfitting. To address this challenge, we propose an efficient distribution-aware rotational calibration method, DartQuant, which reduces the complexity of rotational optimization by constraining the distribution of the activations after rotation. This approach also effectively reduces reliance on task-specific losses, thereby mitigating the risk of overfitting. Additionally, we introduce the QR-Orth optimization scheme, which replaces expensive alternating optimization with a more efficient solution. In a variety of model quantization experiments, DartQuant demonstrates superior performance. Compared to existing methods, it achieves 47$\\times$ acceleration and 10$\\times$ memory savings for rotational optimization on a 70B model. Furthermore, it is the first to successfully complete rotational calibration for a 70B model on a single 3090 GPU, making quantization of large language models feasible in resource-constrained environments. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04071",
        "abs_url": "https://arxiv.org/abs/2511.04071",
        "pdf_url": "https://arxiv.org/pdf/2511.04071",
        "title": "Left Atrial Segmentation with nnU-Net Using MRI",
        "authors": [
            "Fatemeh Hosseinabadi",
            "Seyedhassan Sharifi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Accurate segmentation of the left atrium (LA) from cardiac MRI is critical for guiding atrial fibrillation (AF) ablation and constructing biophysical cardiac models. Manual delineation is time-consuming, observer-dependent, and impractical for large-scale or time-sensitive clinical workflows. Deep learning methods, particularly convolutional architectures, have recently demonstrated superior performance in medical image segmentation tasks. In this study, we applied the nnU-Net framework, an automated, self-configuring deep learning segmentation architecture, to the Left Atrial Segmentation Challenge 2013 dataset. The dataset consists of thirty MRI scans with corresponding expert-annotated masks. The nnU-Net model automatically adapted its preprocessing, network configuration, and training pipeline to the characteristics of the MRI data. Model performance was quantitatively evaluated using the Dice similarity coefficient (DSC), and qualitative results were compared against expert segmentations. The proposed nnU?Net model achieved a mean Dice score of 93.5, demonstrating high overlap with expert annotations and outperforming several traditional segmentation approaches reported in previous studies. The network exhibited robust generalization across variations in left atrial shape, contrast, and image quality, accurately delineating both the atrial body and proximal pulmonary veins.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04073",
        "abs_url": "https://arxiv.org/abs/2511.04073",
        "pdf_url": "https://arxiv.org/pdf/2511.04073",
        "title": "Learning Filter-Aware Distance Metrics for Nearest Neighbor Search with Multiple Filters",
        "authors": [
            "Ananya Sutradhar",
            "Suryansh Gupta",
            "Ravishankar Krishnaswamy",
            "Haiyang Xu",
            "Aseem Rastogi",
            "Gopal Srinivasa"
        ],
        "comments": "1st Workshop on Vector Databases at International Conference on Machine Learning, 2025",
        "subjects": "Machine Learning (cs.LG); Databases (cs.DB); Information Retrieval (cs.IR)",
        "abstract": "Filtered Approximate Nearest Neighbor (ANN) search retrieves the closest vectors for a query vector from a dataset. It enforces that a specified set of discrete labels $S$ for the query must be included in the labels of each retrieved vector. Existing graph-based methods typically incorporate filter awareness by assigning fixed penalties or prioritizing nodes based on filter satisfaction. However, since these methods use fixed, data in- dependent penalties, they often fail to generalize across datasets with diverse label and vector distributions. In this work, we propose a principled alternative that learns the optimal trade-off between vector distance and filter match directly from the data, rather than relying on fixed penalties. We formulate this as a constrained linear optimization problem, deriving weights that better reflect the underlying filter distribution and more effectively address the filtered ANN search problem. These learned weights guide both the search process and index construction, leading to graph structures that more effectively capture the underlying filter distribution and filter semantics. Our experiments demonstrate that adapting the distance function to the data significantly im- proves accuracy by 5-10% over fixed-penalty methods, providing a more flexible and generalizable framework for the filtered ANN search problem.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04094",
        "abs_url": "https://arxiv.org/abs/2511.04094",
        "pdf_url": "https://arxiv.org/pdf/2511.04094",
        "title": "KoTaP: A Panel Dataset for Corporate Tax Avoidance, Performance, and Governance in Korea",
        "authors": [
            "Hyungjong Na",
            "Wonho Song",
            "Seungyong Han",
            "Donghyeon Jo",
            "Sejin Myung",
            "Hyungjoon Kim"
        ],
        "comments": "18 pages, 3 figures, 8 tables. Submitted to Scientific Data; currently under review. Data and codebook available at Zenodo (DOI: https://doi.org/10.5281/zenodo.17149808)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This study introduces the Korean Tax Avoidance Panel (KoTaP), a long-term panel dataset of non-financial firms listed on KOSPI and KOSDAQ between 2011 and 2024. After excluding financial firms, firms with non-December fiscal year ends, capital impairment, and negative pre-tax income, the final dataset consists of 12,653 firm-year observations from 1,754 firms. KoTaP is designed to treat corporate tax avoidance as a predictor variable and link it to multiple domains, including earnings management (accrual- and activity-based), profitability (ROA, ROE, CFO, LOSS), stability (LEV, CUR, SIZE, PPE, AGE, INVREC), growth (GRW, MB, TQ), and governance (BIG4, FORN, OWN). Tax avoidance itself is measured using complementary indicators cash effective tax rate (CETR), GAAP effective tax rate (GETR), and book-tax difference measures (TSTA, TSDA) with adjustments to ensure interpretability. A key strength of KoTaP is its balanced panel structure with standardized variables and its consistency with international literature on the distribution and correlation of core indicators. At the same time, it reflects distinctive institutional features of Korean firms, such as concentrated ownership, high foreign shareholding, and elevated liquidity ratios, providing both international comparability and contextual uniqueness. KoTaP enables applications in benchmarking econometric and deep learning models, external validity checks, and explainable AI analyses. It further supports policy evaluation, audit planning, and investment analysis, making it a critical open resource for accounting, finance, and interdisciplinary research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04124",
        "abs_url": "https://arxiv.org/abs/2511.04124",
        "pdf_url": "https://arxiv.org/pdf/2511.04124",
        "title": "Decomposable Neuro Symbolic Regression",
        "authors": [
            "Giorgio Morales",
            "John W. Sheppard"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Symbolic regression (SR) models complex systems by discovering mathematical expressions that capture underlying relationships in observed data. However, most SR methods prioritize minimizing prediction error over identifying the governing equations, often producing overly complex or inaccurate expressions. To address this, we present a decomposable SR method that generates interpretable multivariate expressions leveraging transformer models, genetic algorithms (GAs), and genetic programming (GP). In particular, our explainable SR method distills a trained ``opaque'' regression model into mathematical expressions that serve as explanations of its computed function. Our method employs a Multi-Set Transformer to generate multiple univariate symbolic skeletons that characterize how each variable influences the opaque model's response. We then evaluate the generated skeletons' performance using a GA-based approach to select a subset of high-quality candidates before incrementally merging them via a GP-based cascade procedure that preserves their original skeleton structure. The final multivariate skeletons undergo coefficient optimization via a GA. We evaluated our method on problems with controlled and varying degrees of noise, demonstrating lower or comparable interpolation and extrapolation errors compared to two GP-based methods, three neural SR methods, and a hybrid approach. Unlike them, our approach consistently learned expressions that matched the original mathematical structure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04132",
        "abs_url": "https://arxiv.org/abs/2511.04132",
        "pdf_url": "https://arxiv.org/pdf/2511.04132",
        "title": "Exploring the Feasibility of End-to-End Large Language Model as a Compiler",
        "authors": [
            "Hongbin Zhang",
            "Shihao Gao",
            "Yang Liu",
            "Mingjie Xing",
            "Yanjun Wu",
            "Chen Zhao"
        ],
        "comments": "This work has been accepted by IJCNN 2025 and submitted to the IEEE for publication",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In recent years, end-to-end Large Language Model (LLM) technology has shown substantial advantages across various domains. As critical system software and infrastructure, compilers are responsible for transforming source code into target code. While LLMs have been leveraged to assist in compiler development and maintenance, their potential as an end-to-end compiler remains largely unexplored. This paper explores the feasibility of LLM as a Compiler (LaaC) and its future directions. We designed the CompilerEval dataset and framework specifically to evaluate the capabilities of mainstream LLMs in source code comprehension and assembly code generation. In the evaluation, we analyzed various errors, explored multiple methods to improve LLM-generated code, and evaluated cross-platform compilation capabilities. Experimental results demonstrate that LLMs exhibit basic capabilities as compilers but currently achieve low compilation success rates. By optimizing prompts, scaling up the model, and incorporating reasoning methods, the quality of assembly code generated by LLMs can be significantly enhanced. Based on these findings, we maintain an optimistic outlook for LaaC and propose practical architectural designs and future research directions. We believe that with targeted training, knowledge-rich prompts, and specialized infrastructure, LaaC has the potential to generate high-quality assembly code and drive a paradigm shift in the field of compilation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04147",
        "abs_url": "https://arxiv.org/abs/2511.04147",
        "pdf_url": "https://arxiv.org/pdf/2511.04147",
        "title": "Exchange Policy Optimization Algorithm for Semi-Infinite Safe Reinforcement Learning",
        "authors": [
            "Jiaming Zhang",
            "Yujie Yang",
            "Haoning Wang",
            "Liping Zhang",
            "Shengbo Eben Li"
        ],
        "comments": "Submitted to the Journal of Machine Learning Research (JMLR), under review",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Safe reinforcement learning (safe RL) aims to respect safety requirements while optimizing long-term performance. In many practical applications, however, the problem involves an infinite number of constraints, known as semi-infinite safe RL (SI-safe RL). Such constraints typically appear when safety conditions must be enforced across an entire continuous parameter space, such as ensuring adequate resource distribution at every spatial location. In this paper, we propose exchange policy optimization (EPO), an algorithmic framework that achieves optimal policy performance and deterministic bounded safety. EPO works by iteratively solving safe RL subproblems with finite constraint sets and adaptively adjusting the active set through constraint expansion and deletion. At each iteration, constraints with violations exceeding the predefined tolerance are added to refine the policy, while those with zero Lagrange multipliers are removed after the policy update. This exchange rule prevents uncontrolled growth of the working set and supports effective policy training. Our theoretical analysis demonstrates that, under mild assumptions, strategies trained via EPO achieve performance comparable to optimal solutions with global constraint violations strictly remaining within a prescribed bound.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04155",
        "abs_url": "https://arxiv.org/abs/2511.04155",
        "pdf_url": "https://arxiv.org/pdf/2511.04155",
        "title": "Learning to Land Anywhere: Transferable Generative Models for Aircraft Trajectories",
        "authors": [
            "Olav Finne Praesteng Larsen",
            "Massimiliano Ruocco",
            "Michail Spitieris",
            "Abdulmajid Murad",
            "Martina Ragosta"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Access to trajectory data is a key requirement for developing and validating Air Traffic Management (ATM) solutions, yet many secondary and regional airports face severe data scarcity. This limits the applicability of machine learning methods and the ability to perform large-scale simulations or \"what-if\" analyses. In this paper, we investigate whether generative models trained on data-rich airports can be efficiently adapted to data-scarce airports using transfer learning. We adapt state-of-the-art diffusion- and flow-matching-based architectures to the aviation domain and evaluate their transferability between Zurich (source) and Dublin (target) landing trajectory datasets. Models are pretrained on Zurich and fine-tuned on Dublin with varying amounts of local data, ranging from 0% to 100%. Results show that diffusion-based models achieve competitive performance with as little as 5% of the Dublin data and reach baseline-level performance around 20%, consistently outperforming models trained from scratch across metrics and visual inspections. Latent flow matching and latent diffusion models also benefit from pretraining, though with more variable gains, while flow matching models show weaker generalization. Despite challenges in capturing rare trajectory patterns, these findings demonstrate the potential of transfer learning to substantially reduce data requirements for trajectory generation in ATM, enabling realistic synthetic data generation even in environments with limited historical records.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04158",
        "abs_url": "https://arxiv.org/abs/2511.04158",
        "pdf_url": "https://arxiv.org/pdf/2511.04158",
        "title": "Deep Learning Approach for Clinical Risk Identification Using Transformer Modeling of Heterogeneous EHR Data",
        "authors": [
            "Anzhuo Xie",
            "Wei-Chen Chang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This study proposes a Transformer-based longitudinal modeling method to address challenges in clinical risk classification with heterogeneous Electronic Health Record (EHR) data, including irregular temporal patterns, large modality differences, and complex semantic structures. The method takes multi-source medical features as input and employs a feature embedding layer to achieve a unified representation of structured and unstructured data. A learnable temporal encoding mechanism is introduced to capture dynamic evolution under uneven sampling intervals. The core model adopts a multi-head self-attention structure to perform global dependency modeling on longitudinal sequences, enabling the aggregation of long-term trends and short-term fluctuations across different temporal scales. To enhance semantic representation, a semantic-weighted pooling module is designed to assign adaptive importance to key medical events, improving the discriminative ability of risk-related features. Finally, a linear mapping layer generates individual-level risk scores. Experimental results show that the proposed model outperforms traditional machine learning and temporal deep learning models in accuracy, recall, precision, and F1-Score, achieving stable and precise risk identification in multi-source heterogeneous EHR environments and providing an efficient and reliable framework for clinical intelligent decision-making.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04160",
        "abs_url": "https://arxiv.org/abs/2511.04160",
        "pdf_url": "https://arxiv.org/pdf/2511.04160",
        "title": "On Joint Regularization and Calibration in Deep Ensembles",
        "authors": [
            "Laurits Fredsgaard",
            "Mikkel N. Schmidt"
        ],
        "comments": "39 pages, 8 figures, 11 tables",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Deep ensembles are a powerful tool in machine learning, improving both model performance and uncertainty calibration. While ensembles are typically formed by training and tuning models individually, evidence suggests that jointly tuning the ensemble can lead to better performance. This paper investigates the impact of jointly tuning weight decay, temperature scaling, and early stopping on both predictive performance and uncertainty quantification. Additionally, we propose a partially overlapping holdout strategy as a practical compromise between enabling joint evaluation and maximizing the use of data for training. Our results demonstrate that jointly tuning the ensemble generally matches or improves performance, with significant variation in effect size across different tasks and metrics. We highlight the trade-offs between individual and joint optimization in deep ensemble training, with the overlapping holdout strategy offering an attractive practical solution. We believe our findings provide valuable insights and guidance for practitioners looking to optimize deep ensemble models. Code is available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04162",
        "abs_url": "https://arxiv.org/abs/2511.04162",
        "pdf_url": "https://arxiv.org/pdf/2511.04162",
        "title": "ScaleDL: Towards Scalable and Efficient Runtime Prediction for Distributed Deep Learning Workloads",
        "authors": [
            "Xiaokai Wang",
            "Shaoyuan Huang",
            "Yuting Li",
            "Xiaofei Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep neural networks (DNNs) form the cornerstone of modern AI services, supporting a wide range of applications, including autonomous driving, chatbots, and recommendation systems. As models increase in size and complexity, DNN workloads like training and inference tasks impose unprecedented demands on distributed computing resources, making the accurate prediction of runtime essential for optimizing development and resource allocation. Traditional methods rely on additive computational unit models, limiting their accuracy and generalizability. In contrast, graph-enhanced modeling improves performance but significantly increases data collection costs. Therefore, there is a critical need for a method that strikes a balance between accuracy, generalizability, and the costs of data collection. To address these challenges, we propose ScaleDL, a novel runtime prediction framework that combines nonlinear layer-wise modeling with graph neural network (GNN)-based cross-layer interaction mechanism, enabling accurate DNN runtime prediction and hierarchical generalizability across different network architectures. Additionally, we employ the D-optimal method to reduce data collection costs. Experiments on the workloads of five popular DNN models prove that ScaleDL enhances runtime prediction accuracy and generalizability, achieving 6$\\times$ lower MRE and 5$\\times$ lower RMSE compared to baseline models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04214",
        "abs_url": "https://arxiv.org/abs/2511.04214",
        "pdf_url": "https://arxiv.org/pdf/2511.04214",
        "title": "Block Rotation is All You Need for MXFP4 Quantization",
        "authors": [
            "Yuantian Shao",
            "Peisong Wang",
            "Yuanteng Chen",
            "Chang Xu",
            "Zhihui Wei",
            "Jian Cheng"
        ],
        "comments": "9 pages, 10 figures",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Large language models (LLMs) have achieved remarkable success, but their rapidly growing scale imposes prohibitive costs in memory, computation, and energy. Post-training quantization (PTQ) is a promising solution for efficient deployment, yet achieving accurate W4A4 quantization remains an open challenge. While most existing methods are designed for INT4 formats, the emergence of MXFP4 -- a new FP4 format with various hardware support (NVIDIA, AMD, Intel)-- raises questions about the applicability of current techniques. In this work, we establish a comprehensive benchmark of PTQ methods under the MXFP4 format. Through systematic evaluation, we find that methods like GPTQ consistently deliver strong performance, whereas rotation-based approaches, which are almost used by all state-of-the-art approaches, suffer from severe incompatibility with MXFP4. We further provide the first in-depth analysis of this conflict, tracing its root to a fundamental mismatch between MXFP4's PoT (power-of-two) block scaling and the redistribution of outlier energy via global rotation. Building on this insight, we propose a simple yet effective block rotation strategy that adapts rotation-based methods to MXFP4, leading to substantial accuracy improvements across diverse LLMs. Our findings not only offer clear guidance for practitioners but also set a foundation for advancing PTQ research under emerging low-precision formats.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04217",
        "abs_url": "https://arxiv.org/abs/2511.04217",
        "pdf_url": "https://arxiv.org/pdf/2511.04217",
        "title": "The Strong Lottery Ticket Hypothesis for Multi-Head Attention Mechanisms",
        "authors": [
            "Hikari Otsuka",
            "Daiki Chijiwa",
            "Yasuyuki Okoshi",
            "Daichi Fujiki",
            "Susumu Takeuchi",
            "Masato Motomura"
        ],
        "comments": "22 pages, 8 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "The strong lottery ticket hypothesis (SLTH) conjectures that high-performing subnetworks, called strong lottery tickets (SLTs), are hidden in randomly initialized neural networks. Although recent theoretical studies have established the SLTH across various neural architectures, the SLTH for transformer architectures still lacks theoretical understanding. In particular, the current theory of the SLTH does not yet account for the multi-head attention (MHA) mechanism, a core component of transformers. To address this gap, we introduce a theoretical analysis of the existence of SLTs within MHAs. We prove that, if a randomly initialized MHA of $H$ heads and input dimension $d$ has the hidden dimension $O(d\\log(Hd^{3/2}))$ for the key and value, it contains an SLT that approximates an arbitrary MHA with the same input dimension with high probability. Furthermore, by leveraging this theory for MHAs, we extend the SLTH to transformers without normalization layers. We empirically validate our theoretical findings, demonstrating that the approximation error between the SLT within a source model (MHA and transformer) and an approximate target counterpart decreases exponentially by increasing the hidden dimension of the source model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04244",
        "abs_url": "https://arxiv.org/abs/2511.04244",
        "pdf_url": "https://arxiv.org/pdf/2511.04244",
        "title": "Guided by Stars: Interpretable Concept Learning Over Time Series via Temporal Logic Semantics",
        "authors": [
            "Irene Ferfoglia",
            "Simone Silvetti",
            "Gaia Saveri",
            "Laura Nenzi",
            "Luca Bortolussi"
        ],
        "comments": "submitted to Journal of Artificial Intelligence Research (JAIR), 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series classification is a task of paramount importance, as this kind of data often arises in safety-critical applications. However, it is typically tackled with black-box deep learning methods, making it hard for humans to understand the rationale behind their output. To take on this challenge, we propose a novel approach, STELLE (Signal Temporal logic Embedding for Logically-grounded Learning and Explanation), a neuro-symbolic framework that unifies classification and explanation through direct embedding of trajectories into a space of temporal logic concepts. By introducing a novel STL-inspired kernel that maps raw time series to their alignment with predefined STL formulae, our model jointly optimises accuracy and interpretability, as each prediction is accompanied by the most relevant logical concepts that characterise it. This yields (i) local explanations as human-readable STL conditions justifying individual predictions, and (ii) global explanations as class-characterising formulae. Experiments demonstrate that STELLE achieves competitive accuracy while providing logically faithful explanations, validated on diverse real-world benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04332",
        "abs_url": "https://arxiv.org/abs/2511.04332",
        "pdf_url": "https://arxiv.org/pdf/2511.04332",
        "title": "Differentially Private In-Context Learning with Nearest Neighbor Search",
        "authors": [
            "Antti Koskela",
            "Tejas Kulkarni",
            "Laith Zumot"
        ],
        "comments": "NeurIPS Lock-LLM Workshop 2025",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Cryptography and Security (cs.CR)",
        "abstract": "Differentially private in-context learning (DP-ICL) has recently become an active research topic due to the inherent privacy risks of in-context learning. However, existing approaches overlook a critical component of modern large language model (LLM) pipelines: the similarity search used to retrieve relevant context data. In this work, we introduce a DP framework for in-context learning that integrates nearest neighbor search of relevant examples in a privacy-aware manner. Our method outperforms existing baselines by a substantial margin across all evaluated benchmarks, achieving more favorable privacy-utility trade-offs. To achieve this, we employ nearest neighbor retrieval from a database of context data, combined with a privacy filter that tracks the cumulative privacy cost of selected samples to ensure adherence to a central differential privacy budget. Experimental results on text classification and document question answering show a clear advantage of the proposed method over existing baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04401",
        "abs_url": "https://arxiv.org/abs/2511.04401",
        "pdf_url": "https://arxiv.org/pdf/2511.04401",
        "title": "Spurious Correlation-Aware Embedding Regularization for Worst-Group Robustness",
        "authors": [
            "Subeen Park",
            "Joowang Kim",
            "Hakyung Lee",
            "Sunjae Yoo",
            "Kyungwoo Song"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Deep learning models achieve strong performance across various domains but often rely on spurious correlations, making them vulnerable to distribution shifts. This issue is particularly severe in subpopulation shift scenarios, where models struggle in underrepresented groups. While existing methods have made progress in mitigating this issue, their performance gains are still constrained. They lack a rigorous theoretical framework connecting the embedding space representations with worst-group error. To address this limitation, we propose Spurious Correlation-Aware Embedding Regularization for Worst-Group Robustness (SCER), a novel approach that directly regularizes feature representations to suppress spurious cues. We show theoretically that worst-group error is influenced by how strongly the classifier relies on spurious versus core directions, identified from differences in group-wise mean embeddings across domains and classes. By imposing theoretical constraints at the embedding level, SCER encourages models to focus on core features while reducing sensitivity to spurious patterns. Through systematic evaluation on multiple vision and language, we show that SCER outperforms prior state-of-the-art studies in worst-group accuracy. Our code is available at \\href{this https URL}{this https URL}.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04418",
        "abs_url": "https://arxiv.org/abs/2511.04418",
        "pdf_url": "https://arxiv.org/pdf/2511.04418",
        "title": "The Illusion of Certainty: Uncertainty quantification for LLMs fails under ambiguity",
        "authors": [
            "Tim Tomov",
            "Dominik Fuchsgruber",
            "Tom Wollschläger",
            "Stephan Günnemann"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Accurate uncertainty quantification (UQ) in Large Language Models (LLMs) is critical for trustworthy deployment. While real-world language is inherently ambiguous, reflecting aleatoric uncertainty, existing UQ methods are typically benchmarked against tasks with no ambiguity. In this work, we demonstrate that while current uncertainty estimators perform well under the restrictive assumption of no ambiguity, they degrade to close-to-random performance on ambiguous data. To this end, we introduce MAQA* and AmbigQA*, the first ambiguous question-answering (QA) datasets equipped with ground-truth answer distributions estimated from factual co-occurrence. We find this performance deterioration to be consistent across different estimation paradigms: using the predictive distribution itself, internal representations throughout the model, and an ensemble of models. We show that this phenomenon can be theoretically explained, revealing that predictive-distribution and ensemble-based estimators are fundamentally limited under ambiguity. Overall, our study reveals a key shortcoming of current UQ methods for LLMs and motivates a rethinking of current modeling paradigms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04445",
        "abs_url": "https://arxiv.org/abs/2511.04445",
        "pdf_url": "https://arxiv.org/pdf/2511.04445",
        "title": "ForecastGAN: A Decomposition-Based Adversarial Framework for Multi-Horizon Time Series Forecasting",
        "authors": [
            "Syeda Sitara Wishal Fatima",
            "Afshin Rahimi"
        ],
        "comments": "Portions of this work were previously published in the author's Master's thesis at University of Windsor (2024)",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Time series forecasting is essential across domains from finance to supply chain management. This paper introduces ForecastGAN, a novel decomposition based adversarial framework addressing limitations in existing approaches for multi-horizon predictions. Although transformer models excel in long-term forecasting, they often underperform in short-term scenarios and typically ignore categorical features. ForecastGAN operates through three integrated modules: a Decomposition Module that extracts seasonality and trend components; a Model Selection Module that identifies optimal neural network configurations based on forecasting horizon; and an Adversarial Training Module that enhances prediction robustness through Conditional Generative Adversarial Network training. Unlike conventional approaches, ForecastGAN effectively integrates both numerical and categorical features. We validate our framework on eleven benchmark multivariate time series datasets that span various forecasting horizons. The results show that ForecastGAN consistently outperforms state-of-the-art transformer models for short-term forecasting while remaining competitive for long-term horizons. This research establishes a more generalizable approach to time series forecasting that adapts to specific contexts while maintaining strong performance across diverse data characteristics without extensive hyperparameter tuning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04456",
        "abs_url": "https://arxiv.org/abs/2511.04456",
        "pdf_url": "https://arxiv.org/pdf/2511.04456",
        "title": "Federated Stochastic Minimax Optimization under Heavy-Tailed Noises",
        "authors": [
            "Xinwen Zhang",
            "Hongchang Gao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Heavy-tailed noise has attracted growing attention in nonconvex stochastic optimization, as numerous empirical studies suggest it offers a more realistic assumption than standard bounded variance assumption. In this work, we investigate nonconvex-PL minimax optimization under heavy-tailed gradient noise in federated learning. We propose two novel algorithms: Fed-NSGDA-M, which integrates normalized gradients, and FedMuon-DA, which leverages the Muon optimizer for local updates. Both algorithms are designed to effectively address heavy-tailed noise in federated minimax optimization, under a milder condition. We theoretically establish that both algorithms achieve a convergence rate of $O({1}/{(TNp)^{\\frac{s-1}{2s}}})$. To the best of our knowledge, these are the first federated minimax optimization algorithms with rigorous theoretical guarantees under heavy-tailed noise. Extensive experiments further validate their effectiveness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04469",
        "abs_url": "https://arxiv.org/abs/2511.04469",
        "pdf_url": "https://arxiv.org/pdf/2511.04469",
        "title": "Towards Causal Market Simulators",
        "authors": [
            "Dennis Thumm",
            "Luis Ontaneda Mijares"
        ],
        "comments": "ICAIF 2025 Workshop on Rethinking Financial Time-Series",
        "subjects": "Machine Learning (cs.LG); Computational Finance (q-fin.CP); Other Statistics (stat.OT)",
        "abstract": "Market generators using deep generative models have shown promise for synthetic financial data generation, but existing approaches lack causal reasoning capabilities essential for counterfactual analysis and risk assessment. We propose a Time-series Neural Causal Model VAE (TNCM-VAE) that combines variational autoencoders with structural causal models to generate counterfactual financial time series while preserving both temporal dependencies and causal relationships. Our approach enforces causal constraints through directed acyclic graphs in the decoder architecture and employs the causal Wasserstein distance for training. We validate our method on synthetic autoregressive models inspired by the Ornstein-Uhlenbeck process, demonstrating superior performance in counterfactual probability estimation with L1 distances as low as 0.03-0.10 compared to ground truth. The model enables financial stress testing, scenario analysis, and enhanced backtesting by generating plausible counterfactual market trajectories that respect underlying causal mechanisms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04485",
        "abs_url": "https://arxiv.org/abs/2511.04485",
        "pdf_url": "https://arxiv.org/pdf/2511.04485",
        "title": "Q3R: Quadratic Reweighted Rank Regularizer for Effective Low-Rank Training",
        "authors": [
            "Ipsita Ghosh",
            "Ethan Nguyen",
            "Christian Kümmerle"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Optimization and Control (math.OC)",
        "abstract": "Parameter-efficient training, based on low-rank optimization, has become a highly successful tool for fine-tuning large deep-learning models. However, these methods fail at low-rank pre-training tasks where maintaining the low-rank structure and the objective remains a challenging task. We propose the Quadratic Reweighted Rank Regularizer dubbed Q3R, which leads to a novel low-rank inducing training strategy inspired by the iteratively reweighted least squares (IRLS) framework. Q3R is based on a quadratic regularizer term which majorizes a smoothed log determinant serving as rank surrogate objective. Unlike other low-rank training techniques, Q3R is able to train weight matrices with prescribed, low target ranks of models that achieve comparable predictive performance as dense models, with small computational overhead, while remaining fully compatible with existing architectures. For example, we demonstrated one experiment where we are able to truncate $60\\%$ and $80\\%$ of the parameters of a ViT-Tiny model with $~1.3\\%$ and $~4\\%$ accuracy drop in CIFAR-10 performance respectively. The efficacy of Q3R is confirmed on Transformers across both image and language tasks, including for low-rank fine-tuning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04505",
        "abs_url": "https://arxiv.org/abs/2511.04505",
        "pdf_url": "https://arxiv.org/pdf/2511.04505",
        "title": "Alternative Fairness and Accuracy Optimization in Criminal Justice",
        "authors": [
            "Shaolong Wu",
            "James Blume",
            "Geshi Yeung"
        ],
        "comments": "Accepted for presentation at the AAAI 2026 AI Governance Workshop (AIGOV). 24 pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computers and Society (cs.CY)",
        "abstract": "Algorithmic fairness has grown rapidly as a research area, yet key concepts remain unsettled, especially in criminal justice. We review group, individual, and process fairness and map the conditions under which they conflict. We then develop a simple modification to standard group fairness. Rather than exact parity across protected groups, we minimize a weighted error loss while keeping differences in false negative rates within a small tolerance. This makes solutions easier to find, can raise predictive accuracy, and surfaces the ethical choice of error costs. We situate this proposal within three classes of critique: biased and incomplete data, latent affirmative action, and the explosion of subgroup constraints. Finally, we offer a practical framework for deployment in public decision systems built on three pillars: need-based decisions, Transparency and accountability, and narrowly tailored definitions and solutions. Together, these elements link technical design to legitimacy and provide actionable guidance for agencies that use risk assessment and related tools.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04514",
        "abs_url": "https://arxiv.org/abs/2511.04514",
        "pdf_url": "https://arxiv.org/pdf/2511.04514",
        "title": "Linear Mode Connectivity under Data Shifts for Deep Ensembles of Image Classifiers",
        "authors": [
            "C. Hepburn",
            "T. Zielke",
            "A.P. Raulf"
        ],
        "comments": "16 pages, 22 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The phenomenon of linear mode connectivity (LMC) links several aspects of deep learning, including training stability under noisy stochastic gradients, the smoothness and generalization of local minima (basins), the similarity and functional diversity of sampled models, and architectural effects on data processing. In this work, we experimentally study LMC under data shifts and identify conditions that mitigate their impact. We interpret data shifts as an additional source of stochastic gradient noise, which can be reduced through small learning rates and large batch sizes. These parameters influence whether models converge to the same local minimum or to regions of the loss landscape with varying smoothness and generalization. Although models sampled via LMC tend to make similar errors more frequently than those converging to different basins, the benefit of LMC lies in balancing training efficiency against the gains achieved from larger, more diverse ensembles. Code and supplementary materials will be made publicly available at this https URL in due course.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04518",
        "abs_url": "https://arxiv.org/abs/2511.04518",
        "pdf_url": "https://arxiv.org/pdf/2511.04518",
        "title": "Comparing EPGP Surrogates and Finite Elements Under Degree-of-Freedom Parity",
        "authors": [
            "Obed Amo",
            "Samit Ghosh",
            "Markus Lange-Hegermann",
            "Bogdan Raiţă",
            "Michael Pokojovy"
        ],
        "comments": "14 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA); Machine Learning (stat.ML)",
        "abstract": "We present a new benchmarking study comparing a boundary-constrained Ehrenpreis--Palamodov Gaussian Process (B-EPGP) surrogate with a classical finite element method combined with Crank--Nicolson time stepping (CN-FEM) for solving the two-dimensional wave equation with homogeneous Dirichlet boundary conditions. The B-EPGP construction leverages exponential-polynomial bases derived from the characteristic variety to enforce the PDE and boundary conditions exactly and employs penalized least squares to estimate the coefficients. To ensure fairness across paradigms, we introduce a degrees-of-freedom (DoF) matching protocol. Under matched DoF, B-EPGP consistently attains lower space-time $L^2$-error and maximum-in-time $L^{2}$-error in space than CN-FEM, improving accuracy by roughly two orders of magnitude.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04522",
        "abs_url": "https://arxiv.org/abs/2511.04522",
        "pdf_url": "https://arxiv.org/pdf/2511.04522",
        "title": "End-to-End Reinforcement Learning of Koopman Models for eNMPC of an Air Separation Unit",
        "authors": [
            "Daniel Mayfrank",
            "Kayra Dernek",
            "Laura Lang",
            "Alexander Mitsos",
            "Manuel Dahmen"
        ],
        "comments": "manuscript (8 pages, 5 figures, 1 table), supplementary materials (5 pages, 1 figure, 1 table)",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "With our recently proposed method based on reinforcement learning (Mayfrank et al. (2024), Comput. Chem. Eng. 190), Koopman surrogate models can be trained for optimal performance in specific (economic) nonlinear model predictive control ((e)NMPC) applications. So far, our method has exclusively been demonstrated on a small-scale case study. Herein, we show that our method scales well to a more challenging demand response case study built on a large-scale model of a single-product (nitrogen) air separation unit. Across all numerical experiments, we assume observability of only a few realistically measurable plant variables. Compared to a purely system identification-based Koopman eNMPC, which generates small economic savings but frequently violates constraints, our method delivers similar economic performance while avoiding constraint violations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04534",
        "abs_url": "https://arxiv.org/abs/2511.04534",
        "pdf_url": "https://arxiv.org/pdf/2511.04534",
        "title": "Uncertainty Quantification for Reduced-Order Surrogate Models Applied to Cloud Microphysics",
        "authors": [
            "Jonas E. Katona",
            "Emily K. de Jong",
            "Nipun Gunawardena"
        ],
        "comments": "Accepted at the NeurIPS 2025 Workshop on Machine Learning and the Physical Sciences (ML4PS). 11 pages, 4 figures, 1 table. LLNL-CONF-2010541",
        "subjects": "Machine Learning (cs.LG); Atmospheric and Oceanic Physics (physics.ao-ph); Computational Physics (physics.comp-ph)",
        "abstract": "Reduced-order models (ROMs) can efficiently simulate high-dimensional physical systems, but lack robust uncertainty quantification methods. Existing approaches are frequently architecture- or training-specific, which limits flexibility and generalization. We introduce a post hoc, model-agnostic framework for predictive uncertainty quantification in latent space ROMs that requires no modification to the underlying architecture or training procedure. Using conformal prediction, our approach estimates statistical prediction intervals for multiple components of the ROM pipeline: latent dynamics, reconstruction, and end-to-end predictions. We demonstrate the method on a latent space dynamical model for cloud microphysics, where it accurately predicts the evolution of droplet-size distributions and quantifies uncertainty across the ROM pipeline.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04573",
        "abs_url": "https://arxiv.org/abs/2511.04573",
        "pdf_url": "https://arxiv.org/pdf/2511.04573",
        "title": "ARETE: an R package for Automated REtrieval from TExt with large language models",
        "authors": [
            "Vasco V. Branco",
            "Jandó Benedek",
            "Lidia Pivovarova",
            "Luís Correia",
            "Pedro Cardoso"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "1. A hard stop for the implementation of rigorous conservation initiatives is our lack of key species data, especially occurrence data. Furthermore, researchers have to contend with an accelerated speed at which new information must be collected and processed due to anthropogenic activity. Publications ranging from scientific papers to gray literature contain this crucial information but their data are often not machine-readable, requiring extensive human work to be retrieved. 2. We present the ARETE R package, an open-source software aiming to automate data extraction of species occurrences powered by large language models, namely using the chatGPT Application Programming Interface. This R package integrates all steps of the data extraction and validation process, from Optical Character Recognition to detection of outliers and output in tabular format. Furthermore, we validate ARETE through systematic comparison between what is modelled and the work of human annotators. 3. We demonstrate the usefulness of the approach by comparing range maps produced using GBIF data and with those automatically extracted for 100 species of spiders. Newly extracted data allowed to expand the known Extent of Occurrence by a mean three orders of magnitude, revealing new areas where the species were found in the past, which mayhave important implications for spatial conservation planning and extinction risk assessments. 4. ARETE allows faster access to hitherto untapped occurrence data, a potential game changer in projects requiring such data. Researchers will be able to better prioritize resources, manually verifying selected species while maintaining automated extraction for the majority. This workflow also allows predicting available bibliographic data during project planning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04590",
        "abs_url": "https://arxiv.org/abs/2511.04590",
        "pdf_url": "https://arxiv.org/pdf/2511.04590",
        "title": "Complexity as Advantage: A Regret-Based Perspective on Emergent Structure",
        "authors": [
            "Oshri Naparstek"
        ],
        "comments": "15 pages. Under preparation for submission to ICML 2026. Feedback welcome",
        "subjects": "Machine Learning (cs.LG); Information Theory (cs.IT)",
        "abstract": "We introduce Complexity as Advantage (CAA), a framework that defines the complexity of a system relative to a family of observers. Instead of measuring complexity as an intrinsic property, we evaluate how much predictive regret a system induces for different observers attempting to model it. A system is complex when it is easy for some observers and hard for others, creating an information advantage. We show that this formulation unifies several notions of emergent behavior, including multiscale entropy, predictive information, and observer-dependent structure. The framework suggests that \"interesting\" systems are those positioned to create differentiated regret across observers, providing a quantitative grounding for why complexity can be functionally valuable. We demonstrate the idea through simple dynamical models and discuss implications for learning, evolution, and artificial agents.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04594",
        "abs_url": "https://arxiv.org/abs/2511.04594",
        "pdf_url": "https://arxiv.org/pdf/2511.04594",
        "title": "Regret Lower Bounds for Decentralized Multi-Agent Stochastic Shortest Path Problems",
        "authors": [
            "Utkarsh U. Chavan",
            "Prashant Trivedi",
            "Nandyala Hemachandra"
        ],
        "comments": "To appear in 39th Conference on Neural Information Processing Systems (NeurIPS 2025)",
        "subjects": "Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Multi-agent systems (MAS) are central to applications such as swarm robotics and traffic routing, where agents must coordinate in a decentralized manner to achieve a common objective. Stochastic Shortest Path (SSP) problems provide a natural framework for modeling decentralized control in such settings. While the problem of learning in SSP has been extensively studied in single-agent settings, the decentralized multi-agent variant remains largely unexplored. In this work, we take a step towards addressing that gap. We study decentralized multi-agent SSPs (Dec-MASSPs) under linear function approximation, where the transition dynamics and costs are represented using linear models. Applying novel symmetry-based arguments, we identify the structure of optimal policies. Our main contribution is the first regret lower bound for this setting based on the construction of hard-to-learn instances for any number of agents, $n$. Our regret lower bound of $\\Omega(\\sqrt{K})$, over $K$ episodes, highlights the inherent learning difficulty in Dec-MASSPs. These insights clarify the learning complexity of decentralized control and can further guide the design of efficient learning algorithms in multi-agent systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04598",
        "abs_url": "https://arxiv.org/abs/2511.04598",
        "pdf_url": "https://arxiv.org/pdf/2511.04598",
        "title": "Environment Agnostic Goal-Conditioning, A Study of Reward-Free Autonomous Learning",
        "authors": [
            "Hampus Åström",
            "Elin Anna Topp",
            "Jacek Malec"
        ],
        "comments": "8 pages without cover, references and supplementary materials, 11 with. Submitted to RLC 2025's workshop RLBrew and IMOL 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In this paper we study how transforming regular reinforcement learning environments into goal-conditioned environments can let agents learn to solve tasks autonomously and reward-free. We show that an agent can learn to solve tasks by selecting its own goals in an environment-agnostic way, at training times comparable to externally guided reinforcement learning. Our method is independent of the underlying off-policy learning algorithm. Since our method is environment-agnostic, the agent does not value any goals higher than others, leading to instability in performance for individual goals. However, in our experiments, we show that the average goal success rate improves and stabilizes. An agent trained with this method can be instructed to seek any observations made in the environment, enabling generic training of agents prior to specific use cases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04641",
        "abs_url": "https://arxiv.org/abs/2511.04641",
        "pdf_url": "https://arxiv.org/pdf/2511.04641",
        "title": "Efficient probabilistic surrogate modeling techniques for partially-observed large-scale dynamical systems",
        "authors": [
            "Hans Harder",
            "Abhijeet Vishwasrao",
            "Luca Guastoni",
            "Ricardo Vinuesa",
            "Sebastian Peitz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper is concerned with probabilistic techniques for forecasting dynamical systems described by partial differential equations (such as, for example, the Navier-Stokes equations). In particular, it is investigating and comparing various extensions to the flow matching paradigm that reduce the number of sampling steps. In this regard, it compares direct distillation, progressive distillation, adversarial diffusion distillation, Wasserstein GANs and rectified flows. Moreover, experiments are conducted on a set of challenging systems. In particular, we also address the challenge of directly predicting 2D slices of large-scale 3D simulations, paving the way for efficient inflow generation for solvers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04647",
        "abs_url": "https://arxiv.org/abs/2511.04647",
        "pdf_url": "https://arxiv.org/pdf/2511.04647",
        "title": "Optimal Inference Schedules for Masked Diffusion Models",
        "authors": [
            "Sitan Chen",
            "Kevin Cong",
            "Jerry Li"
        ],
        "comments": "33 pages, 1 figure",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "A major bottleneck of standard auto-regressive large language models is that their inference process is inherently sequential, resulting in very long and costly inference times. To circumvent this, practitioners proposed a class of language models called diffusion language models, of which the masked diffusion model (MDM) is the most successful. The MDM is able to sample tokens out-of-order and, ostensibly, many tokens at once and in parallel. However, there is very limited rigorous understanding of how much parallel sampling these models can perform without noticeable degradation in their sampling performance. Prior work of Li and Cai obtained some preliminary bounds, but these are not tight for many natural classes of distributions. In this work, we give a new, exact characterization of the expected divergence between the true distribution and the sampled distribution, for any distribution and any unmasking schedule for the sampler, showing an elegant connection to the theory of univariate function approximation. By leveraging this connection, we then attain a number of novel lower and upper bounds for this problem. While the connection to function approximation in principle gives the optimal unmasking schedule for any distribution, we show that it is in general impossible to compete with it without strong a priori knowledge of the distribution, even in seemingly benign settings. However, we also demonstrate new upper bounds and new sampling schedules in terms of well-studied information-theoretic properties of the base distribution, namely, its total correlation and dual total correlation, which show that in some natural settings, one can sample in $O(log n)$ steps without any visible loss in performance, where $n$ is the total sequence length.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04653",
        "abs_url": "https://arxiv.org/abs/2511.04653",
        "pdf_url": "https://arxiv.org/pdf/2511.04653",
        "title": "TT-Prune: Joint Model Pruning and Resource Allocation for Communication-efficient Time-triggered Federated Learning",
        "authors": [
            "Xinlu Zhang",
            "Yansha Deng",
            "Toktam Mahmoodi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated learning (FL) offers new opportunities in machine learning, particularly in addressing data privacy concerns. In contrast to conventional event-based federated learning, time-triggered federated learning (TT-Fed), as a general form of both asynchronous and synchronous FL, clusters users into different tiers based on fixed time intervals. However, the FL network consists of a growing number of user devices with limited wireless bandwidth, consequently magnifying issues such as stragglers and communication overhead. In this paper, we introduce adaptive model pruning to wireless TT-Fed systems and study the problem of jointly optimizing the pruning ratio and bandwidth allocation to minimize the training loss while ensuring minimal learning latency. To answer this question, we perform convergence analysis on the gradient l_2 norm of the TT-Fed model based on model pruning. Based on the obtained convergence upper bound, a joint optimization problem of pruning ratio and wireless bandwidth is formulated to minimize the model training loss under a given delay threshold. Then, we derive closed-form solutions for wireless bandwidth and pruning ratio using Karush-Kuhn-Tucker(KKT) conditions. The simulation results show that model pruning could reduce the communication cost by 40% while maintaining the model performance at the same level.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04659",
        "abs_url": "https://arxiv.org/abs/2511.04659",
        "pdf_url": "https://arxiv.org/pdf/2511.04659",
        "title": "Nowcast3D: Reliable precipitation nowcasting via gray-box learning",
        "authors": [
            "Huaguan Chen",
            "Wei Han",
            "Haofei Sun",
            "Ning Lin",
            "Xingtao Song",
            "Yunfan Yang",
            "Jie Tian",
            "Yang Liu",
            "Ji-Rong Wen",
            "Xiaoye Zhang",
            "Xueshun Shen",
            "Hao Sun"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Atmospheric and Oceanic Physics (physics.ao-ph)",
        "abstract": "Extreme precipitation nowcasting demands high spatiotemporal fidelity and extended lead times, yet existing approaches remain limited. Numerical Weather Prediction (NWP) and its deep-learning emulations are too slow and coarse for rapidly evolving convection, while extrapolation and purely data-driven models suffer from error accumulation and excessive smoothing. Hybrid 2D radar-based methods discard crucial vertical information, preventing accurate reconstruction of height-dependent dynamics. We introduce a gray-box, fully three-dimensional nowcasting framework that directly processes volumetric radar reflectivity and couples physically constrained neural operators with datadriven learning. The model learns vertically varying 3D advection fields under a conservative advection operator, parameterizes spatially varying diffusion, and introduces a Brownian-motion--inspired stochastic term to represent unresolved motions. A residual branch captures small-scale convective initiation and microphysical variability, while a diffusion-based stochastic module estimates uncertainty. The framework achieves more accurate forecasts up to three-hour lead time across precipitation regimes and ranked first in 57\\% of cases in a blind evaluation by 160 meteorologists. By restoring full 3D dynamics with physical consistency, it offers a scalable and robust pathway for skillful and reliable nowcasting of extreme precipitation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04666",
        "abs_url": "https://arxiv.org/abs/2511.04666",
        "pdf_url": "https://arxiv.org/pdf/2511.04666",
        "title": "Forgetting is Everywhere",
        "authors": [
            "Ben Sanati",
            "Thomas L. Lee",
            "Trevor McInroe",
            "Aidan Scannell",
            "Nikolay Malkin",
            "David Abel",
            "Amos Storkey"
        ],
        "comments": "Project page: this https URL",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "A fundamental challenge in developing general learning algorithms is their tendency to forget past knowledge when adapting to new data. Addressing this problem requires a principled understanding of forgetting; yet, despite decades of study, no unified definition has emerged that provides insights into the underlying dynamics of learning. We propose an algorithm- and task-agnostic theory that characterises forgetting as a lack of self-consistency in a learner's predictive distribution over future experiences, manifesting as a loss of predictive information. Our theory naturally yields a general measure of an algorithm's propensity to forget. To validate the theory, we design a comprehensive set of experiments that span classification, regression, generative modelling, and reinforcement learning. We empirically demonstrate how forgetting is present across all learning settings and plays a significant role in determining learning efficiency. Together, these results establish a principled understanding of forgetting and lay the foundation for analysing and improving the information retention capabilities of general learning algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04667",
        "abs_url": "https://arxiv.org/abs/2511.04667",
        "pdf_url": "https://arxiv.org/pdf/2511.04667",
        "title": "Multi-Method Analysis of Mathematics Placement Assessments: Classical, Machine Learning, and Clustering Approaches",
        "authors": [
            "Julian D. Allagan",
            "Dasia A. Singleton",
            "Shanae N. Perry",
            "Gabrielle C. Morgan",
            "Essence A. Morgan"
        ],
        "comments": "28 pages, 8 table, 4figures, NAM conference",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This study evaluates a 40-item mathematics placement examination administered to 198 students using a multi-method framework combining Classical Test Theory, machine learning, and unsupervised clustering. Classical Test Theory analysis reveals that 55\\% of items achieve excellent discrimination ($D \\geq 0.40$) while 30\\% demonstrate poor discrimination ($D < 0.20$) requiring replacement. Question 6 (Graph Interpretation) emerges as the examination's most powerful discriminator, achieving perfect discrimination ($D = 1.000$), highest ANOVA F-statistic ($F = 4609.1$), and maximum Random Forest feature importance (0.206), accounting for 20.6\\% of predictive power. Machine learning algorithms demonstrate exceptional performance, with Random Forest and Gradient Boosting achieving 97.5\\% and 96.0\\% cross-validation accuracy. K-means clustering identifies a natural binary competency structure with a boundary at 42.5\\%, diverging from the institutional threshold of 55\\% and suggesting potential overclassification into remedial categories. The two-cluster solution exhibits exceptional stability (bootstrap ARI = 0.855) with perfect lower-cluster purity. Convergent evidence across methods supports specific refinements: replace poorly discriminating items, implement a two-stage assessment, and integrate Random Forest predictions with transparency mechanisms. These findings demonstrate that multi-method integration provides a robust empirical foundation for evidence-based mathematics placement optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03684",
        "abs_url": "https://arxiv.org/abs/2511.03684",
        "pdf_url": "https://arxiv.org/pdf/2511.03684",
        "title": "Simulation-Based Validation of an Integrated 4D/5D Digital-Twin Framework for Predictive Construction Control",
        "authors": [
            "Atena Khoshkonesh",
            "Mohsen Mohammadagha",
            "Navid Ebrahimi"
        ],
        "comments": "",
        "subjects": "Computational Engineering, Finance, and Science (cs.CE); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Persistent cost and schedule deviations remain a major challenge in the U.S. construction industry, revealing the limitations of deterministic CPM and static document-based estimating. This study presents an integrated 4D/5D digital-twin framework that couples Building Information Modeling (BIM) with natural-language processing (NLP)-based cost mapping, computer-vision (CV)-driven progress measurement, Bayesian probabilistic CPM updating, and deep-reinforcement-learning (DRL) resource-leveling. A nine-month case implementation on a Dallas-Fort Worth mid-rise project demonstrated measurable gains in accuracy and efficiency: 43% reduction in estimating labor, 6% reduction in overtime, and 30% project-buffer utilization, while maintaining an on-time finish at 128 days within P50-P80 confidence bounds. The digital-twin sandbox also enabled real-time \"what-if\" forecasting and traceable cost-schedule alignment through a 5D knowledge graph. Findings confirm that integrating AI-based analytics with probabilistic CPM and DRL enhances forecasting precision, transparency, and control resilience. The validated workflow establishes a practical pathway toward predictive, adaptive, and auditable construction management.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03735",
        "abs_url": "https://arxiv.org/abs/2511.03735",
        "pdf_url": "https://arxiv.org/pdf/2511.03735",
        "title": "Friction on Demand: A Generative Framework for the Inverse Design of Metainterfaces",
        "authors": [
            "Valentin Mouton",
            "Adrien Mélot"
        ],
        "comments": "Preprint",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Systems and Control (eess.SY); Computational Physics (physics.comp-ph)",
        "abstract": "Designing frictional interfaces to exhibit prescribed macroscopic behavior is a challenging inverse problem, made difficult by the non-uniqueness of solutions and the computational cost of contact simulations. Traditional approaches rely on heuristic search over low-dimensional parameterizations, which limits their applicability to more complex or nonlinear friction laws. We introduce a generative modeling framework using Variational Autoencoders (VAEs) to infer surface topographies from target friction laws. Trained on a synthetic dataset composed of 200 million samples constructed from a parameterized contact mechanics model, the proposed method enables efficient, simulation-free generation of candidate topographies. We examine the potential and limitations of generative modeling for this inverse design task, focusing on balancing accuracy, throughput, and diversity in the generated solutions. Our results highlight trade-offs and outline practical considerations when balancing these objectives. This approach paves the way for near-real-time control of frictional behavior through tailored surface topographies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03746",
        "abs_url": "https://arxiv.org/abs/2511.03746",
        "pdf_url": "https://arxiv.org/pdf/2511.03746",
        "title": "A Dynamic Recurrent Adjacency Memory Network for Mixed-Generation Power System Stability Forecasting",
        "authors": [
            "Guang An Ooi",
            "Otavio Bertozzi",
            "Mohd Asim Aftab",
            "Charalambos Konstantinou",
            "Shehab Ahmed"
        ],
        "comments": "Submitted to IEEE Transactions on Power Systems",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "Modern power systems with high penetration of inverter-based resources exhibit complex dynamic behaviors that challenge the scalability and generalizability of traditional stability assessment methods. This paper presents a dynamic recurrent adjacency memory network (DRAMN) that combines physics-informed analysis with deep learning for real-time power system stability forecasting. The framework employs sliding-window dynamic mode decomposition to construct time-varying, multi-layer adjacency matrices from phasor measurement unit and sensor data to capture system dynamics such as modal participation factors, coupling strengths, phase relationships, and spectral energy distributions. As opposed to processing spatial and temporal dependencies separately, DRAMN integrates graph convolution operations directly within recurrent gating mechanisms, enabling simultaneous modeling of evolving dynamics and temporal dependencies. Extensive validations on modified IEEE 9-bus, 39-bus, and a multi-terminal HVDC network demonstrate high performance, achieving 99.85\\%, 99.90\\%, and 99.69\\% average accuracies, respectively, surpassing all tested benchmarks, including classical machine learning algorithms and recent graph-based models. The framework identifies optimal combinations of measurements that reduce feature dimensionality by 82\\% without performance degradation. Correlation analysis between dominant measurements for small-signal and transient stability events validates generalizability across different stability phenomena. DRAMN achieves state-of-the-art accuracy while providing enhanced interpretability for power system operators, making it suitable for real-time deployment in modern control centers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03756",
        "abs_url": "https://arxiv.org/abs/2511.03756",
        "pdf_url": "https://arxiv.org/pdf/2511.03756",
        "title": "Bifidelity Karhunen-Loève Expansion Surrogate with Active Learning for Random Fields",
        "authors": [
            "Aniket Jivani",
            "Cosmin Safta",
            "Beckett Y. Zhou",
            "Xun Huan"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Fluid Dynamics (physics.flu-dyn); Applications (stat.AP)",
        "abstract": "We present a bifidelity Karhunen-Loève expansion (KLE) surrogate model for field-valued quantities of interest (QoIs) under uncertain inputs. The approach combines the spectral efficiency of the KLE with polynomial chaos expansions (PCEs) to preserve an explicit mapping between input uncertainties and output fields. By coupling inexpensive low-fidelity (LF) simulations that capture dominant response trends with a limited number of high-fidelity (HF) simulations that correct for systematic bias, the proposed method enables accurate and computationally affordable surrogate construction. To further improve surrogate accuracy, we form an active learning strategy that adaptively selects new HF evaluations based on the surrogate's generalization error, estimated via cross-validation and modeled using Gaussian process regression. New HF samples are then acquired by maximizing an expected improvement criterion, targeting regions of high surrogate error. The resulting BF-KLE-AL framework is demonstrated on three examples of increasing complexity: a one-dimensional analytical benchmark, a two-dimensional convection-diffusion system, and a three-dimensional turbulent round jet simulation based on Reynolds-averaged Navier--Stokes (RANS) and enhanced delayed detached-eddy simulations (EDDES). Across these cases, the method achieves consistent improvements in predictive accuracy and sample efficiency relative to single-fidelity and random-sampling approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03770",
        "abs_url": "https://arxiv.org/abs/2511.03770",
        "pdf_url": "https://arxiv.org/pdf/2511.03770",
        "title": "Deep Learning-Driven Downscaling for Climate Risk Assessment of Projected Temperature Extremes in the Nordic Region",
        "authors": [
            "Parthiban Loganathan",
            "Elias Zea",
            "Ricardo Vinuesa",
            "Evelyn Otero"
        ],
        "comments": "",
        "subjects": "Geophysics (physics.geo-ph); Machine Learning (cs.LG)",
        "abstract": "Rapid changes and increasing climatic variability across the widely varied Koppen-Geiger regions of northern Europe generate significant needs for adaptation. Regional planning needs high-resolution projected temperatures. This work presents an integrative downscaling framework that incorporates Vision Transformer (ViT), Convolutional Long Short-Term Memory (ConvLSTM), and Geospatial Spatiotemporal Transformer with Attention and Imbalance-Aware Network (GeoStaNet) models. The framework is evaluated with a multicriteria decision system, Deep Learning-TOPSIS (DL-TOPSIS), for ten strategically chosen meteorological stations encompassing the temperate oceanic (Cfb), subpolar oceanic (Cfc), warm-summer continental (Dfb), and subarctic (Dfc) climate regions. Norwegian Earth System Model (NorESM2-LM) Coupled Model Intercomparison Project Phase 6 (CMIP6) outputs were bias-corrected during the 1951-2014 period and subsequently validated against earlier observations of day-to-day temperature metrics and diurnal range statistics. The ViT showed improved performance (Root Mean Squared Error (RMSE): 1.01 degrees C; R^2: 0.92), allowing for production of credible downscaled projections. Under the SSP5-8.5 scenario, the Dfc and Dfb climate zones are projected to warm by 4.8 degrees C and 3.9 degrees C, respectively, by 2100, with expansion in the diurnal temperature range by more than 1.5 degrees C. The Time of Emergence signal first appears in subarctic winter seasons (Dfc: approximately 2032), signifying an urgent need for adaptation measures. The presented framework offers station-based, high-resolution estimates of uncertainties and extremes, with direct uses for adaptation policy over high-latitude regions with fast environmental change.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03797",
        "abs_url": "https://arxiv.org/abs/2511.03797",
        "pdf_url": "https://arxiv.org/pdf/2511.03797",
        "title": "Learning Paths for Dynamic Measure Transport: A Control Perspective",
        "authors": [
            "Aimee Maurais",
            "Bamdad Hosseini",
            "Youssef Marzouk"
        ],
        "comments": "To appear at NeurIPS 2025 Workshop on Frontiers of Probabilistic Inference: Sampling Meets Learning",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Computation (stat.CO)",
        "abstract": "We bring a control perspective to the problem of identifying paths of measures for sampling via dynamic measure transport (DMT). We highlight the fact that commonly used paths may be poor choices for DMT and connect existing methods for learning alternate paths to mean-field games. Based on these connections we pose a flexible family of optimization problems for identifying tilted paths of measures for DMT and advocate for the use of objective terms which encourage smoothness of the corresponding velocities. We present a numerical algorithm for solving these problems based on recent Gaussian process methods for solution of partial differential equations and demonstrate the ability of our method to recover more efficient and smooth transport models compared to those which use an untilted reference path.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03845",
        "abs_url": "https://arxiv.org/abs/2511.03845",
        "pdf_url": "https://arxiv.org/pdf/2511.03845",
        "title": "To See or To Read: User Behavior Reasoning in Multimodal LLMs",
        "authors": [
            "Tianning Dong",
            "Luyi Ma",
            "Varun Vasudevan",
            "Jason Cho",
            "Sushant Kumar",
            "Kannan Achan"
        ],
        "comments": "Accepted by the 39th Conference on Neural Information Processing Systems (NeurIPS 2025) Workshop: Efficient Reasoning",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Multimodal Large Language Models (MLLMs) are reshaping how modern agentic systems reason over sequential user-behavior data. However, whether textual or image representations of user behavior data are more effective for maximizing MLLM performance remains underexplored. We present \\texttt{BehaviorLens}, a systematic benchmarking framework for assessing modality trade-offs in user-behavior reasoning across six MLLMs by representing transaction data as (1) a text paragraph, (2) a scatter plot, and (3) a flowchart. Using a real-world purchase-sequence dataset, we find that when data is represented as images, MLLMs next-purchase prediction accuracy is improved by 87.5% compared with an equivalent textual representation without any additional computational cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03849",
        "abs_url": "https://arxiv.org/abs/2511.03849",
        "pdf_url": "https://arxiv.org/pdf/2511.03849",
        "title": "Which Similarity-Sensitive Entropy?",
        "authors": [
            "Phuc Nguyen",
            "Josiah Couch",
            "Rahul Bansal",
            "Alexandra Morgan",
            "Chris Tam",
            "Miao Li",
            "Rima Arnaout",
            "Ramy Arnaout"
        ],
        "comments": "21 pages, 8 figures",
        "subjects": "Information Theory (cs.IT); Machine Learning (cs.LG); Populations and Evolution (q-bio.PE)",
        "abstract": "A canonical step in quantifying a system is to measure its entropy. Shannon entropy and other traditional entropy measures capture only the information encoded in the frequencies of a system's elements. Recently, Leinster, Cobbold, and Reeve (LCR) introduced a method that also captures the rich information encoded in the similarities and differences among elements, yielding similarity-sensitive entropy. More recently, the Vendi score (VS) was introduced as an alternative, raising the question of how LCR and VS compare, and which is preferable. Here we address these questions conceptually, analytically, and experimentally, using 53 machine-learning datasets. We show that LCR and VS can differ by orders of magnitude and can capture complementary information about a system, except in limiting cases. We demonstrate that both LCR and VS depend on how similarities are scaled and introduce the concept of ``half distance'' to parameterize this dependence. We prove that VS provides an upper bound on LCR for several values of the Rényi-Hill order parameter and conjecture that this bound holds for all values. We conclude that VS is preferable only when interpreting elements as linear combinations of a more fundamental set of ``ur-elements'' or when the system or dataset possesses a quantum-mechanical character. In the broader circumstance where one seeks simply to capture the rich information encoded by similarity, LCR is favored; nevertheless, for certain half-distances the two methods can complement each other.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03876",
        "abs_url": "https://arxiv.org/abs/2511.03876",
        "pdf_url": "https://arxiv.org/pdf/2511.03876",
        "title": "Computed Tomography (CT)-derived Cardiovascular Flow Estimation Using Physics-Informed Neural Networks Improves with Sinogram-based Training: A Simulation Study",
        "authors": [
            "Jinyuxuan Guo",
            "Gurnoor Singh Khurana",
            "Alejandro Gonzalo Grande",
            "Juan C. del Alamo",
            "Francisco Contijoch"
        ],
        "comments": "",
        "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Medical Physics (physics.med-ph)",
        "abstract": "Background: Non-invasive imaging-based assessment of blood flow plays a critical role in evaluating heart function and structure. Computed Tomography (CT) is a widely-used imaging modality that can robustly evaluate cardiovascular anatomy and function, but direct methods to estimate blood flow velocity from movies of contrast evolution have not been developed. Purpose: This study evaluates the impact of CT imaging on Physics-Informed Neural Networks (PINN)-based flow estimation and proposes an improved framework, SinoFlow, which uses sinogram data directly to estimate blood flow. Methods: We generated pulsatile flow fields in an idealized 2D vessel bifurcation using computational fluid dynamics and simulated CT scans with varying gantry rotation speeds, tube currents, and pulse mode imaging settings. We compared the performance of PINN-based flow estimation using reconstructed images (ImageFlow) to SinoFlow. Results: SinoFlow significantly improved flow estimation performance by avoiding propagating errors introduced by filtered backprojection. SinoFlow was robust across all tested gantry rotation speeds and consistently produced lower mean squared error and velocity errors than ImageFlow. Additionally, SinoFlow was compatible with pulsed-mode imaging and maintained higher accuracy with shorter pulse widths. Conclusions: This study demonstrates the potential of SinoFlow for CT-based flow estimation, providing a more promising approach for non-invasive blood flow assessment. The findings aim to inform future applications of PINNs to CT images and provide a solution for image-based estimation, with reasonable acquisition parameters yielding accurate flow estimates.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03882",
        "abs_url": "https://arxiv.org/abs/2511.03882",
        "pdf_url": "https://arxiv.org/pdf/2511.03882",
        "title": "Investigating Robot Control Policy Learning for Autonomous X-ray-guided Spine Procedures",
        "authors": [
            "Florence Klitzner",
            "Blanca Inigo",
            "Benjamin D. Killeen",
            "Lalithkumar Seenivasan",
            "Michelle Song",
            "Axel Krieger",
            "Mathias Unberath"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "Imitation learning-based robot control policies are enjoying renewed interest in video-based robotics. However, it remains unclear whether this approach applies to X-ray-guided procedures, such as spine instrumentation. This is because interpretation of multi-view X-rays is complex. We examine opportunities and challenges for imitation policy learning in bi-plane-guided cannula insertion. We develop an in silico sandbox for scalable, automated simulation of X-ray-guided spine procedures with a high degree of realism. We curate a dataset of correct trajectories and corresponding bi-planar X-ray sequences that emulate the stepwise alignment of providers. We then train imitation learning policies for planning and open-loop control that iteratively align a cannula solely based on visual information. This precisely controlled setup offers insights into limitations and capabilities of this method. Our policy succeeded on the first attempt in 68.5% of cases, maintaining safe intra-pedicular trajectories across diverse vertebral levels. The policy generalized to complex anatomy, including fractures, and remained robust to varied initializations. Rollouts on real bi-planar X-rays further suggest that the model can produce plausible trajectories, despite training exclusively in simulation. While these preliminary results are promising, we also identify limitations, especially in entry point precision. Full closed-look control will require additional considerations around how to provide sufficiently frequent feedback. With more robust priors and domain knowledge, such models may provide a foundation for future efforts toward lightweight and CT-free robotic intra-operative spinal navigation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03890",
        "abs_url": "https://arxiv.org/abs/2511.03890",
        "pdf_url": "https://arxiv.org/pdf/2511.03890",
        "title": "Shape Deformation Networks for Automated Aortic Valve Finite Element Meshing from 3D CT Images",
        "authors": [
            "Linchen Qian",
            "Jiasong Chen",
            "Ruonan Gong",
            "Wei Sun",
            "Minliang Liu",
            "Liang Liang"
        ],
        "comments": "",
        "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Accurate geometric modeling of the aortic valve from 3D CT images is essential for biomechanical analysis and patient-specific simulations to assess valve health or make a preoperative plan. However, it remains challenging to generate aortic valve meshes with both high-quality and consistency across different patients. Traditional approaches often produce triangular meshes with irregular topologies, which can result in poorly shaped elements and inconsistent correspondence due to inter-patient anatomical variation. In this work, we address these challenges by introducing a template-fitting pipeline with deep neural networks to generate structured quad (i.e., quadrilateral) meshes from 3D CT images to represent aortic valve geometries. By remeshing aortic valves of all patients with a common quad mesh template, we ensure a uniform mesh topology with consistent node-to-node and element-to-element correspondence across patients. This consistency enables us to simplify the learning objective of the deep neural networks, by employing a loss function with only two terms (i.e., a geometry reconstruction term and a smoothness regularization term), which is sufficient to preserve mesh smoothness and element quality. Our experiments demonstrate that the proposed approach produces high-quality aortic valve surface meshes with improved smoothness and shape quality, while requiring fewer explicit regularization terms compared to the traditional methods. These results highlight that using structured quad meshes for the template and neural network training not only ensures mesh correspondence and quality but also simplifies the training process, thus enhancing the effectiveness and efficiency of aortic valve modeling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03892",
        "abs_url": "https://arxiv.org/abs/2511.03892",
        "pdf_url": "https://arxiv.org/pdf/2511.03892",
        "title": "A general technique for approximating high-dimensional empirical kernel matrices",
        "authors": [
            "Chiraag Kaushik",
            "Justin Romberg",
            "Vidya Muthukumar"
        ],
        "comments": "32 pages",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We present simple, user-friendly bounds for the expected operator norm of a random kernel matrix under general conditions on the kernel function $k(\\cdot,\\cdot)$. Our approach uses decoupling results for U-statistics and the non-commutative Khintchine inequality to obtain upper and lower bounds depending only on scalar statistics of the kernel function and a ``correlation kernel'' matrix corresponding to $k(\\cdot,\\cdot)$. We then apply our method to provide new, tighter approximations for inner-product kernel matrices on general high-dimensional data, where the sample size and data dimension are polynomially related. Our method obtains simplified proofs of existing results that rely on the moment method and combinatorial arguments while also providing novel approximation results for the case of anisotropic Gaussian data. Finally, using similar techniques to our approximation result, we show a tighter lower bound on the bias of kernel regression with anisotropic Gaussian data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03900",
        "abs_url": "https://arxiv.org/abs/2511.03900",
        "pdf_url": "https://arxiv.org/pdf/2511.03900",
        "title": "GRAD: Graph-Retrieved Adaptive Decoding for Hallucination Mitigation",
        "authors": [
            "Manh Nguyen",
            "Sunil Gupta",
            "Dai Do",
            "Hung Le"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Hallucination mitigation remains a persistent challenge for large language models (LLMs), even as model scales grow. Existing approaches often rely on external knowledge sources, such as structured databases or knowledge graphs, accessed through prompting or retrieval. However, prompt-based grounding is fragile and domain-sensitive, while symbolic knowledge integration incurs heavy retrieval and formatting costs. Motivated by knowledge graphs, we introduce Graph-Retrieved Adaptive Decoding (GRAD), a decoding-time method that grounds generation in corpus-derived evidence without retraining. GRAD constructs a sparse token transition graph by accumulating next-token logits across a small retrieved corpus in a single forward pass. During decoding, graph-retrieved logits are max-normalized and adaptively fused with model logits to favor high-evidence continuations while preserving fluency. Across three models and a range of question-answering benchmarks spanning intrinsic, extrinsic hallucination, and factuality tasks, GRAD consistently surpasses baselines, achieving up to 9.7$\\%$ higher intrinsic accuracy, 8.6$\\%$ lower hallucination rates, and 6.9$\\%$ greater correctness compared to greedy decoding, while attaining the highest truth--informativeness product score among all methods. GRAD offers a lightweight, plug-and-play alternative to contrastive decoding and knowledge graph augmentation, demonstrating that statistical evidence from corpus-level token transitions can effectively steer generation toward more truthful and verifiable outputs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03909",
        "abs_url": "https://arxiv.org/abs/2511.03909",
        "pdf_url": "https://arxiv.org/pdf/2511.03909",
        "title": "Vectorized Computation of Euler Characteristic Functions and Transforms",
        "authors": [
            "Jessi Cisewski-Kehe",
            "Brittany Terese Fasy",
            "Alexander McCleary",
            "Eli Quist",
            "Jack Ruder"
        ],
        "comments": "",
        "subjects": "Computational Geometry (cs.CG); Machine Learning (cs.LG); Algebraic Topology (math.AT)",
        "abstract": "The weighted Euler characteristic transform (WECT) and Euler characteristic function (ECF) have proven to be useful tools in a variety of applications. However, current methods for computing these functions are neither optimized for speed nor do they scale to higher-dimensional settings. In this work, we present a vectorized framework for computing such topological transforms using tensor operations, which is highly optimized for GPU architectures and works in full generality across geometric simplicial complexes (or cubical complexes) of arbitrary dimension. Experimentally, the framework demonstrates significant speedups (up to $180 \\times$) over existing methods when computing the WECT and ECF across a variety of image datasets. Computation of these transforms is implemented in a publicly available Python package called pyECT.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03952",
        "abs_url": "https://arxiv.org/abs/2511.03952",
        "pdf_url": "https://arxiv.org/pdf/2511.03952",
        "title": "High-dimensional limit theorems for SGD: Momentum and Adaptive Step-sizes",
        "authors": [
            "Aukosh Jagannath",
            "Taj Jones-McCormick",
            "Varnan Sarangian"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We develop a high-dimensional scaling limit for Stochastic Gradient Descent with Polyak Momentum (SGD-M) and adaptive step-sizes. This provides a framework to rigourously compare online SGD with some of its popular variants. We show that the scaling limits of SGD-M coincide with those of online SGD after an appropriate time rescaling and a specific choice of step-size. However, if the step-size is kept the same between the two algorithms, SGD-M will amplify high-dimensional effects, potentially degrading performance relative to online SGD. We demonstrate our framework on two popular learning problems: Spiked Tensor PCA and Single Index Models. In both cases, we also examine online SGD with an adaptive step-size based on normalized gradients. In the high-dimensional regime, this algorithm yields multiple benefits: its dynamics admit fixed points closer to the population minimum and widens the range of admissible step-sizes for which the iterates converge to such solutions. These examples provide a rigorous account, aligning with empirical motivation, of how early preconditioners can stabilize and improve dynamics in settings where online SGD fails.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.03963",
        "abs_url": "https://arxiv.org/abs/2511.03963",
        "pdf_url": "https://arxiv.org/pdf/2511.03963",
        "title": "Robust inference using density-powered Stein operators",
        "authors": [
            "Shinto Eguchi"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We introduce a density-power weighted variant for the Stein operator, called the $\\gamma$-Stein operator. This is a novel class of operators derived from the $\\gamma$-divergence, designed to build robust inference methods for unnormalized probability models. The operator's construction (weighting by the model density raised to a positive power $\\gamma$ inherently down-weights the influence of outliers, providing a principled mechanism for robustness. Applying this operator yields a robust generalization of score matching that retains the crucial property of being independent of the model's normalizing constant. We extend this framework to develop two key applications: the $\\gamma$-kernelized Stein discrepancy for robust goodness-of-fit testing, and $\\gamma$-Stein variational gradient descent for robust Bayesian posterior approximation. Empirical results on contaminated Gaussian and quartic potential models show our methods significantly outperform standard baselines in both robustness and statistical efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04114",
        "abs_url": "https://arxiv.org/abs/2511.04114",
        "pdf_url": "https://arxiv.org/pdf/2511.04114",
        "title": "Automated and Explainable Denial of Service Analysis for AI-Driven Intrusion Detection Systems",
        "authors": [
            "Paul Badu Yakubu",
            "Lesther Santana",
            "Mohamed Rahouti",
            "Yufeng Xin",
            "Abdellah Chehri",
            "Mohammed Aledhari"
        ],
        "comments": "13 pages, 2 figures, 11 tables, IET Information Security",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "With the increasing frequency and sophistication of Distributed Denial of Service (DDoS) attacks, it has become critical to develop more efficient and interpretable detection methods. Traditional detection systems often struggle with scalability and transparency, hindering real-time response and understanding of attack vectors. This paper presents an automated framework for detecting and interpreting DDoS attacks using machine learning (ML). The proposed method leverages the Tree-based Pipeline Optimization Tool (TPOT) to automate the selection and optimization of ML models and features, reducing the need for manual experimentation. SHapley Additive exPlanations (SHAP) is incorporated to enhance model interpretability, providing detailed insights into the contribution of individual features to the detection process. By combining TPOT's automated pipeline selection with SHAP interpretability, this approach improves the accuracy and transparency of DDoS detection. Experimental results demonstrate that key features such as mean backward packet length and minimum forward packet header length are critical in detecting DDoS attacks, offering a scalable and explainable cybersecurity solution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04228",
        "abs_url": "https://arxiv.org/abs/2511.04228",
        "pdf_url": "https://arxiv.org/pdf/2511.04228",
        "title": "REMIND: Input Loss Landscapes Reveal Residual Memorization in Post-Unlearning LLMs",
        "authors": [
            "Liran Cohen",
            "Yaniv Nemcovesky",
            "Avi Mendelson"
        ],
        "comments": "Pre-print version under review",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Machine unlearning aims to remove the influence of specific training data from a model without requiring full retraining. This capability is crucial for ensuring privacy, safety, and regulatory compliance. Therefore, verifying whether a model has truly forgotten target data is essential for maintaining reliability and trustworthiness. However, existing evaluation methods often assess forgetting at the level of individual inputs. This approach may overlook residual influence present in semantically similar examples. Such influence can compromise privacy and lead to indirect information leakage. We propose REMIND (Residual Memorization In Neighborhood Dynamics), a novel evaluation method aiming to detect the subtle remaining influence of unlearned data and classify whether the data has been effectively forgotten. REMIND analyzes the model's loss over small input variations and reveals patterns unnoticed by single-point evaluations. We show that unlearned data yield flatter, less steep loss landscapes, while retained or unrelated data exhibit sharper, more volatile patterns. REMIND requires only query-based access, outperforms existing methods under similar constraints, and demonstrates robustness across different models, datasets, and paraphrased inputs, making it practical for real-world deployment. By providing a more sensitive and interpretable measure of unlearning effectiveness, REMIND provides a reliable framework to assess unlearning in language models. As a result, REMIND offers a novel perspective on memorization and unlearning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04243",
        "abs_url": "https://arxiv.org/abs/2511.04243",
        "pdf_url": "https://arxiv.org/pdf/2511.04243",
        "title": "Twirlator: A Pipeline for Analyzing Subgroup Symmetry Effects in Quantum Machine Learning Ansatzes",
        "authors": [
            "Valter Uotila",
            "Väinö Mehtola",
            "Ilmo Salmenperä",
            "Bo Zhao"
        ],
        "comments": "8 pages; 8 figures",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "Leveraging data symmetries has been a key driver of performance gains in geometric deep learning and geometric and equivariant quantum machine learning. While symmetrization appears to be a promising method, its practical overhead, such as additional gates, reduced expressibility, and other factors, is not well understood in quantum machine learning. In this work, we develop an automated pipeline to measure various characteristics of quantum machine learning ansatzes with respect to symmetries that can appear in the learning task. We define the degree of symmetry in the learning problem as the size of the subgroup it admits. Subgroups define partial symmetries, which have not been extensively studied in previous research, which has focused on symmetries defined by whole groups. Symmetrizing the 19 common ansatzes with respect to these varying-sized subgroup representations, we compute three classes of metrics that describe how the common ansatz structures behave under varying amounts of symmetries. The first metric is based on the norm of the difference between the original and symmetrized generators, while the second metric counts depth, size, and other characteristics from the symmetrized circuits. The third class of metrics includes expressibility and entangling capability. The results demonstrate varying gate overhead across the studied ansatzes and confirm that increased symmetry reduces expressibility of the circuits. In most cases, increased symmetry increases entanglement capability. These results help select sufficiently expressible and computationally efficient ansatze patterns for geometric quantum machine learning applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04275",
        "abs_url": "https://arxiv.org/abs/2511.04275",
        "pdf_url": "https://arxiv.org/pdf/2511.04275",
        "title": "Online Conformal Inference with Retrospective Adjustment for Faster Adaptation to Distribution Shift",
        "authors": [
            "Jungbin Jun",
            "Ilsang Ohn"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Conformal prediction has emerged as a powerful framework for constructing distribution-free prediction sets with guaranteed coverage assuming only the exchangeability assumption. However, this assumption is often violated in online environments where data distributions evolve over time. Several recent approaches have been proposed to address this limitation, but, typically, they slowly adapt to distribution shifts because they update predictions only in a forward manner, that is, they generate a prediction for a newly observed data point while previously computed predictions are not updated. In this paper, we propose a novel online conformal inference method with retrospective adjustment, which is designed to achieve faster adaptation to distributional shifts. Our method leverages regression approaches with efficient leave-one-out update formulas to retroactively adjust past predictions when new data arrive, thereby aligning the entire set of predictions with the most recent data distribution. Through extensive numerical studies performed on both synthetic and real-world data sets, we show that the proposed approach achieves faster coverage recalibration and improved statistical efficiency compared to existing online conformal prediction methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04291",
        "abs_url": "https://arxiv.org/abs/2511.04291",
        "pdf_url": "https://arxiv.org/pdf/2511.04291",
        "title": "Robustness of Minimum-Volume Nonnegative Matrix Factorization under an Expanded Sufficiently Scattered Condition",
        "authors": [
            "Giovanni Barbarino",
            "Nicolas Gillis",
            "Subhayan Saha"
        ],
        "comments": "38 pages, 4 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Signal Processing (eess.SP); Numerical Analysis (math.NA)",
        "abstract": "Minimum-volume nonnegative matrix factorization (min-vol NMF) has been used successfully in many applications, such as hyperspectral imaging, chemical kinetics, spectroscopy, topic modeling, and audio source separation. However, its robustness to noise has been a long-standing open problem. In this paper, we prove that min-vol NMF identifies the groundtruth factors in the presence of noise under a condition referred to as the expanded sufficiently scattered condition which requires the data points to be sufficiently well scattered in the latent simplex generated by the basis vectors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04309",
        "abs_url": "https://arxiv.org/abs/2511.04309",
        "pdf_url": "https://arxiv.org/pdf/2511.04309",
        "title": "DeepPAAC: A New Deep Galerkin Method for Principal-Agent Problems",
        "authors": [
            "Michael Ludkovski",
            "Changgen Xie",
            "Zimu Zhu"
        ],
        "comments": "",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "We consider numerical resolution of principal-agent (PA) problems in continuous time. We formulate a generic PA model with continuous and lump payments and a multi-dimensional strategy of the agent. To tackle the resulting Hamilton-Jacobi-Bellman equation with an implicit Hamiltonian we develop a novel deep learning method: the Deep Principal-Agent Actor Critic (DeepPAAC) Actor-Critic algorithm. DeepPAAC is able to handle multi-dimensional states and controls, as well as constraints. We investigate the role of the neural network architecture, training designs, loss functions, etc. on the convergence of the solver, presenting five different case studies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04321",
        "abs_url": "https://arxiv.org/abs/2511.04321",
        "pdf_url": "https://arxiv.org/pdf/2511.04321",
        "title": "AIM: Software and Hardware Co-design for Architecture-level IR-drop Mitigation in High-performance PIM",
        "authors": [
            "Yuanpeng Zhang",
            "Xing Hu",
            "Xi Chen",
            "Zhihang Yuan",
            "Cong Li",
            "Jingchen Zhu",
            "Zhao Wang",
            "Chenguang Zhang",
            "Xin Si",
            "Wei Gao",
            "Qiang Wu",
            "Runsheng Wang",
            "Guangyu Sun"
        ],
        "comments": "18 pages, 22 figures, accepted by ISCA 2025",
        "subjects": "Hardware Architecture (cs.AR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "SRAM Processing-in-Memory (PIM) has emerged as the most promising implementation for high-performance PIM, delivering superior computing density, energy efficiency, and computational precision. However, the pursuit of higher performance necessitates more complex circuit designs and increased operating frequencies, which exacerbate IR-drop issues. Severe IR-drop can significantly degrade chip performance and even threaten reliability. Conventional circuit-level IR-drop mitigation methods, such as back-end optimizations, are resource-intensive and often compromise power, performance, and area (PPA). To address these challenges, we propose AIM, comprehensive software and hardware co-design for architecture-level IR-drop mitigation in high-performance PIM. Initially, leveraging the bit-serial and in-situ dataflow processing properties of PIM, we introduce Rtog and HR, which establish a direct correlation between PIM workloads and IR-drop. Building on this foundation, we propose LHR and WDS, enabling extensive exploration of architecture-level IR-drop mitigation while maintaining computational accuracy through software optimization. Subsequently, we develop IR-Booster, a dynamic adjustment mechanism that integrates software-level HR information with hardware-based IR-drop monitoring to adapt the V-f pairs of the PIM macro, achieving enhanced energy efficiency and performance. Finally, we propose the HR-aware task mapping method, bridging software and hardware designs to achieve optimal improvement. Post-layout simulation results on a 7nm 256-TOPS PIM chip demonstrate that AIM achieves up to 69.2% IR-drop mitigation, resulting in 2.29x energy efficiency improvement and 1.152x speedup.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04355",
        "abs_url": "https://arxiv.org/abs/2511.04355",
        "pdf_url": "https://arxiv.org/pdf/2511.04355",
        "title": "Where Do LLMs Still Struggle? An In-Depth Analysis of Code Generation Benchmarks",
        "authors": [
            "Amir Molzam Sharifloo",
            "Maedeh Heydari",
            "Parsa Kazerooni",
            "Daniel Maninger",
            "Mira Mezini"
        ],
        "comments": "To be published in Proceedings of 2025 2nd IEEE/ACM International Conference on AI-powered Software (AIware), Data & Benchmark Track",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) have achieved remarkable success in code generation, and the race to improve their performance has become a central focus of AI research. Benchmarks and leaderboards are increasingly popular, offering quantitative rankings of LLMs. However, they provide limited insight into the tasks that LLMs consistently fail to solve - information that is crucial for understanding current limitations and guiding the development of more capable models. To address this gap, we examined code generation tasks across four popular benchmarks, identifying those that major LLMs are most likely to fail. To understand the causes of these failures, we investigated whether the static complexity of solution code contributes to them, followed by a systematic inspection of 114 tasks that LLMs consistently struggled with. Our analysis revealed four recurring patterns of weaknesses in LLMs, as well as common complications within benchmark tasks that most often lead to failure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04361",
        "abs_url": "https://arxiv.org/abs/2511.04361",
        "pdf_url": "https://arxiv.org/pdf/2511.04361",
        "title": "Causal Regime Detection in Energy Markets With Augmented Time Series Structural Causal Models",
        "authors": [
            "Dennis Thumm"
        ],
        "comments": "EurIPS 2025 Workshop Causality for Impact: Practical challenges for real-world applications of causal methods",
        "subjects": "Computational Finance (q-fin.CP); Machine Learning (cs.LG); Other Statistics (stat.OT)",
        "abstract": "Energy markets exhibit complex causal relationships between weather patterns, generation technologies, and price formation, with regime changes occurring continuously rather than at discrete break points. Current approaches model electricity prices without explicit causal interpretation or counterfactual reasoning capabilities. We introduce Augmented Time Series Causal Models (ATSCM) for energy markets, extending counterfactual reasoning frameworks to multivariate temporal data with learned causal structure. Our approach models energy systems through interpretable factors (weather, generation mix, demand patterns), rich grid dynamics, and observable market variables. We integrate neural causal discovery to learn time-varying causal graphs without requiring ground truth DAGs. Applied to real-world electricity price data, ATSCM enables novel counterfactual queries such as \"What would prices be under different renewable generation scenarios?\".",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04384",
        "abs_url": "https://arxiv.org/abs/2511.04384",
        "pdf_url": "https://arxiv.org/pdf/2511.04384",
        "title": "Multi-Task Learning for Visually Grounded Reasoning in Gastrointestinal VQA",
        "authors": [
            "Itbaan Safwan",
            "Muhammad Annas Shaikh",
            "Muhammad Haaris",
            "Ramail Khan",
            "Muhammad Atif Tahir"
        ],
        "comments": "This is a working paper submitted for Medico 2025: Visual Question Answering (with multimodal explanations) for Gastrointestinal Imaging at MediaEval 2025. 5 pages, 3 figures and 1 table",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "We present a multi-task framework for the MediaEval Medico 2025 challenge, leveraging a LoRA-tuned Florence-2 model for simultaneous visual question answering (VQA), explanation generation, and visual grounding. The proposed system integrates three curated datasets: (1) Kvasir-VQA-x1 for question-answer learning, (2) a synthetically enriched explanation dataset offering structured medical reasoning, and (3) text-to-region pairs linking visual features with segmentation masks. This multi-task setup enables the model to jointly learn visual grounding, reasoning, and interpretation, producing responses that are both accurate and interpretable. Extensive evaluation demonstrates that our approach substantially improves over single-task baselines in both answer accuracy and visual localization, highlighting the effectiveness of grounded multi-task learning for medical VQA applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04403",
        "abs_url": "https://arxiv.org/abs/2511.04403",
        "pdf_url": "https://arxiv.org/pdf/2511.04403",
        "title": "Online Bayesian Experimental Design for Partially Observed Dynamical Systems",
        "authors": [
            "Sara Pérez-Vieites",
            "Sahel Iqbal",
            "Simo Särkkä",
            "Dominik Baumann"
        ],
        "comments": "19 pages, 5 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Computation (stat.CO)",
        "abstract": "Bayesian experimental design (BED) provides a principled framework for optimizing data collection, but existing approaches do not apply to crucial real-world settings such as dynamical systems with partial observability, where only noisy and incomplete observations are available. These systems are naturally modeled as state-space models (SSMs), where latent states mediate the link between parameters and data, making the likelihood -- and thus information-theoretic objectives like the expected information gain (EIG) -- intractable. In addition, the dynamical nature of the system requires online algorithms that update posterior distributions and select designs sequentially in a computationally efficient manner. We address these challenges by deriving new estimators of the EIG and its gradient that explicitly marginalize latent states, enabling scalable stochastic optimization in nonlinear SSMs. Our approach leverages nested particle filters (NPFs) for efficient online inference with convergence guarantees. Applications to realistic models, such as the susceptible-infected-recovered (SIR) and a moving source location task, show that our framework successfully handles both partial observability and online computation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04439",
        "abs_url": "https://arxiv.org/abs/2511.04439",
        "pdf_url": "https://arxiv.org/pdf/2511.04439",
        "title": "The Peril of Preference: Why GRPO fails on Ordinal Rewards",
        "authors": [
            "Anisha Garg",
            "Ganesh Venkatesh"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Group-relative Policy Optimization's (GRPO) simplicity makes it highly desirable for adapting LLMs to become experts at specific tasks. But this simplicity also makes it ill-specified as we seek to enhance RL training with richer, non-binary feedback. When using ordinal rewards to give partial credit, GRPO's simplicity starts to hurt, as its group-average baseline often assigns a positive advantage to failed trajectories and reinforces incorrect behavior. We introduce Correctness Relative Policy Optimization (CoRPO), a new formulation that solves this flaw. CoRPO uses an adaptive baseline that enforces a minimum quality threshold, ensuring failed solutions are never positively reinforced. Once the policy consistently meets this threshold, the baseline automatically transitions to a relative preference mode, pushing the model to find optimal solutions rather than just \"acceptable\" ones. We empirically validate CoRPO on a code verification task, where it demonstrates more stable convergence and better out-of-domain generalization. This work represents a critical step in our broader research program to enable LLMs to learn genuinely new capabilities through reinforcement learning. We achieve this by enabling LLMs to learn from rich, multi-dimensional feedback - progressing from binary to ordinal rewards in this work, and onward to denser, per-step supervision.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04454",
        "abs_url": "https://arxiv.org/abs/2511.04454",
        "pdf_url": "https://arxiv.org/pdf/2511.04454",
        "title": "Fitting Reinforcement Learning Model to Behavioral Data under Bandits",
        "authors": [
            "Hao Zhu",
            "Jasper Hoffmann",
            "Baohe Zhang",
            "Joschka Boedecker"
        ],
        "comments": "",
        "subjects": "Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG); Optimization and Control (math.OC); Neurons and Cognition (q-bio.NC)",
        "abstract": "We consider the problem of fitting a reinforcement learning (RL) model to some given behavioral data under a multi-armed bandit environment. These models have received much attention in recent years for characterizing human and animal decision making behavior. We provide a generic mathematical optimization problem formulation for the fitting problem of a wide range of RL models that appear frequently in scientific research applications, followed by a detailed theoretical analysis of its convexity properties. Based on the theoretical results, we introduce a novel solution method for the fitting problem of RL models based on convex relaxation and optimization. Our method is then evaluated in several simulated bandit environments to compare with some benchmark methods that appear in the literature. Numerical results indicate that our method achieves comparable performance to the state-of-the-art, while significantly reducing computation time. We also provide an open-source Python package for our proposed method to empower researchers to apply it in the analysis of their datasets directly, without prior knowledge of convex optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04461",
        "abs_url": "https://arxiv.org/abs/2511.04461",
        "pdf_url": "https://arxiv.org/pdf/2511.04461",
        "title": "Data-driven uncertainty-aware seakeeping prediction of the Delft 372 catamaran using ensemble Hankel dynamic mode decomposition",
        "authors": [
            "Giorgio Palma",
            "Andrea Serani",
            "Matteo Diez"
        ],
        "comments": "",
        "subjects": "Systems and Control (eess.SY); Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG)",
        "abstract": "In this study, we present and validate an ensemble-based Hankel Dynamic Mode Decomposition with control (HDMDc) for uncertainty-aware seakeeping predictions of a high-speed catamaran, namely the Delft 372 model. Experimental measurements (time histories) of wave elevation at the longitudinal center of gravity, heave, pitch, notional flight-deck velocity, notional bridge acceleration, and total resistance were collected from irregular wave basin tests on a 1:33.3 scale replica of the Delft 372 model under sea state 5 conditions at Fr = 0.425, and organized into training, validation, and test sets. The HDMDc algorithm constructs an equation-free linear reduced-order model of the seakeeping vessel by augmenting states and inputs with their time-lagged copies to capture nonlinear and memory effects. Two ensembling strategies, namely Bayesian HDMDc (BHDMDc), which samples hyperparameters considered stochastic variables with prior distribution to produce posterior mean forecasts with confidence intervals, and Frequentist HDMDc (FHDMDc), which aggregates multiple model obtained over data subsets, are compared in providing seakeeping prediction and uncertainty quantification. The FHDMDc approach is found to improve the accuracy of the predictions compared to the deterministic counterpart, also providing robust uncertainty estimation; whereas the application of BHDMDc to the present test case is not found beneficial in comparison to the deterministic model. FHDMDc-derived probability density functions for the motions closely match both experimental data and URANS results, demonstrating reliable and computationally efficient seakeeping prediction for design and operational support.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04484",
        "abs_url": "https://arxiv.org/abs/2511.04484",
        "pdf_url": "https://arxiv.org/pdf/2511.04484",
        "title": "Online Algorithms for Repeated Optimal Stopping: Achieving Both Competitive Ratio and Regret Bounds",
        "authors": [
            "Tsubasa Harada",
            "Yasushi Kawase",
            "Hanna Sumita"
        ],
        "comments": "33 pages",
        "subjects": "Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG)",
        "abstract": "We study the repeated optimal stopping problem, which generalizes the classical optimal stopping problem with an unknown distribution to a setting where the same problem is solved repeatedly over $T$ rounds. In this framework, we aim to design algorithms that guarantee a competitive ratio in each round while also achieving sublinear regret across all rounds. Our primary contribution is a general algorithmic framework that achieves these objectives simultaneously for a wide array of repeated optimal stopping problems. The core idea is to dynamically select an algorithm for each round, choosing between two candidates: (1) an empirically optimal algorithm derived from the history of observations, and (2) a sample-based algorithm with a proven competitive ratio guarantee. Based on this approach, we design an algorithm that performs no worse than the baseline sample-based algorithm in every round, while ensuring that the total regret is bounded by $\\tilde{O}(\\sqrt{T})$. We demonstrate the broad applicability of our framework to canonical problems, including the prophet inequality, the secretary problem, and their variants under adversarial, random, and i.i.d. input models. For example, for the repeated prophet inequality problem, our method achieves a $1/2$-competitive ratio from the second round on and an $\\tilde{O}(\\sqrt{T})$ regret. Furthermore, we establish a regret lower bound of $\\Omega(\\sqrt{T})$ even in the i.i.d. model, confirming that our algorithm's performance is almost optimal with respect to the number of rounds.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04539",
        "abs_url": "https://arxiv.org/abs/2511.04539",
        "pdf_url": "https://arxiv.org/pdf/2511.04539",
        "title": "Unified Generative Latent Representation for Functional Brain Graphs",
        "authors": [
            "Subati Abulikemu",
            "Tiago Azevedo",
            "Michail Mamalakis",
            "John Suckling"
        ],
        "comments": "NeurIPS 2025 Workshop on Symmetry and Geometry in Neural Representations",
        "subjects": "Neurons and Cognition (q-bio.NC); Machine Learning (cs.LG)",
        "abstract": "Functional brain graphs are often characterized with separate graph-theoretic or spectral descriptors, overlooking how these properties covary and partially overlap across brains and conditions. We anticipate that dense, weighted functional connectivity graphs occupy a low-dimensional latent geometry along which both topological and spectral structures display graded variations. Here, we estimated this unified graph representation and enabled generation of dense functional brain graphs through a graph transformer autoencoder with latent diffusion, with spectral geometry providing an inductive bias to guide learning. This geometry-aware latent representation, although unsupervised, meaningfully separated working-memory states and decoded visual stimuli, with performance further enhanced by incorporating neural dynamics. From the diffusion modeled distribution, we were able to sample biologically plausible and structurally grounded synthetic dense graphs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04550",
        "abs_url": "https://arxiv.org/abs/2511.04550",
        "pdf_url": "https://arxiv.org/pdf/2511.04550",
        "title": "Confidential Computing for Cloud Security: Exploring Hardware based Encryption Using Trusted Execution Environments",
        "authors": [
            "Dhruv Deepak Agarwal",
            "Aswani Kumar Cherukuri"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "The growth of cloud computing has revolutionized data processing and storage capacities to another levels of scalability and flexibility. But in the process, it has created a huge challenge of security, especially in terms of safeguarding sensitive data. Classical security practices, including encryption at rest and during transit, fail to protect data in use and expose it to various possible breaches. In response to this problem , Confidential Computing has been a tool ,seeking to secure data in processing by usage of hardware-based Trusted Execution Environments (TEEs). TEEs, including Intel's Software Guard Extensions (SGX) and ARM's TrustZone, offers protected contexts within the processor, where data is kept confidential ,intact and secure , even with malicious software or compromised operating systems. In this research, we have explored the architecture and security features of TEEs like Intel SGX and ARM TrustZone, and their effectiveness in improving cloud data security. From a thorough literature survey ,we have analyzed the deployment strategies, performance indicators, and practical uses of these TEEs for the same purpose. In addition, we have discussed the issues regarding deployment, possible weaknesses, scalability issues, and integration issues. Our results focuses on the central position of TEEs in strengthening and advancing cloud security infrastructures, pointing towards their ability to create a secure foundation for Confidential Computing.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04564",
        "abs_url": "https://arxiv.org/abs/2511.04564",
        "pdf_url": "https://arxiv.org/pdf/2511.04564",
        "title": "Uncertainties in Physics-informed Inverse Problems: The Hidden Risk in Scientific AI",
        "authors": [
            "Yoh-ichi Mototake",
            "Makoto Sasaki"
        ],
        "comments": "17 pages, 6 figures",
        "subjects": "Computational Physics (physics.comp-ph); Machine Learning (cs.LG)",
        "abstract": "Physics-informed machine learning (PIML) integrates partial differential equations (PDEs) into machine learning models to solve inverse problems, such as estimating coefficient functions (e.g., the Hamiltonian function) that characterize physical systems. This framework enables data-driven understanding and prediction of complex physical phenomena. While coefficient functions in PIML are typically estimated on the basis of predictive performance, physics as a discipline does not rely solely on prediction accuracy to evaluate models. For example, Kepler's heliocentric model was favored owing to small discrepancies in planetary motion, despite its similar predictive accuracy to the geocentric model. This highlights the inherent uncertainties in data-driven model inference and the scientific importance of selecting physically meaningful solutions. In this paper, we propose a framework to quantify and analyze such uncertainties in the estimation of coefficient functions in PIML. We apply our framework to reduced model of magnetohydrodynamics and our framework shows that there are uncertainties, and unique identification is possible with geometric constraints. Finally, we confirm that we can estimate the reduced model uniquely by incorporating these constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04567",
        "abs_url": "https://arxiv.org/abs/2511.04567",
        "pdf_url": "https://arxiv.org/pdf/2511.04567",
        "title": "Machine Learning for Electron-Scale Turbulence Modeling in W7-X",
        "authors": [
            "Ionut-Gabriel Farcas",
            "Don Lawrence Carl Agapito Fernando",
            "Alejandro Banon Navarro",
            "Gabriele Merlo",
            "Frank Jenko"
        ],
        "comments": "13 pages, 7 tables, 11 figures",
        "subjects": "Plasma Physics (physics.plasm-ph); Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "Constructing reduced models for turbulent transport is essential for accelerating profile predictions and enabling many-query tasks such as uncertainty quantification, parameter scans, and design optimization. This paper presents machine-learning-driven reduced models for Electron Temperature Gradient (ETG) turbulence in the Wendelstein 7-X (W7-X) stellarator. Each model predicts the ETG heat flux as a function of three plasma parameters: the normalized electron temperature radial gradient ($\\omega_{T_e}$), the ratio of normalized electron temperature and density radial gradients ($\\eta_e$), and the electron-to-ion temperature ratio ($\\tau$). We first construct models across seven radial locations using regression and an active machine-learning-based procedure. This process initializes models using low-cardinality sparse-grid training data and then iteratively refines their training sets by selecting the most informative points from a pre-existing simulation database. We evaluate the prediction capabilities of our models using out-of-sample datasets with over $393$ points per location, and $95\\%$ prediction intervals are estimated via bootstrapping to assess prediction uncertainty. We then investigate the construction of generalized reduced models, including a generic, position-independent model, and assess their heat flux prediction capabilities at three additional locations. Our models demonstrate robust performance and predictive accuracy comparable to the original reference simulations, even when applied beyond the training domain.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04568",
        "abs_url": "https://arxiv.org/abs/2511.04568",
        "pdf_url": "https://arxiv.org/pdf/2511.04568",
        "title": "Riesz Regression As Direct Density Ratio Estimation",
        "authors": [
            "Masahiro Kato"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Econometrics (econ.EM); Statistics Theory (math.ST); Methodology (stat.ME)",
        "abstract": "Riesz regression has garnered attention as a tool in debiased machine learning for causal and structural parameter estimation (Chernozhukov et al., 2021). This study shows that Riesz regression is closely related to direct density-ratio estimation (DRE) in important cases, including average treat- ment effect (ATE) estimation. Specifically, the idea and objective in Riesz regression coincide with the one in least-squares importance fitting (LSIF, Kanamori et al., 2009) in direct density-ratio estimation. While Riesz regression is general in the sense that it can be applied to Riesz representer estimation in a wide class of problems, the equivalence with DRE allows us to directly import exist- ing results in specific cases, including convergence-rate analyses, the selection of loss functions via Bregman-divergence minimization, and regularization techniques for flexible models, such as neural networks. Conversely, insights about the Riesz representer in debiased machine learning broaden the applications of direct density-ratio estimation methods. This paper consolidates our prior results in Kato (2025a) and Kato (2025b).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04576",
        "abs_url": "https://arxiv.org/abs/2511.04576",
        "pdf_url": "https://arxiv.org/pdf/2511.04576",
        "title": "Physics-Informed Neural Networks and Neural Operators for Parametric PDEs: A Human-AI Collaborative Analysis",
        "authors": [
            "Zhuo Zhang",
            "Xiong Xiong",
            "Sen Zhang",
            "Yuan Zhao",
            "Xi Yang"
        ],
        "comments": "61 pages, 3 figures. Submitted to The 1st International Conference on AI Scientists (ICAIS 2025)",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "PDEs arise ubiquitously in science and engineering, where solutions depend on parameters (physical properties, boundary conditions, geometry). Traditional numerical methods require re-solving the PDE for each parameter, making parameter space exploration prohibitively expensive. Recent machine learning advances, particularly physics-informed neural networks (PINNs) and neural operators, have revolutionized parametric PDE solving by learning solution operators that generalize across parameter spaces. We critically analyze two main paradigms: (1) PINNs, which embed physical laws as soft constraints and excel at inverse problems with sparse data, and (2) neural operators (e.g., DeepONet, Fourier Neural Operator), which learn mappings between infinite-dimensional function spaces and achieve unprecedented generalization. Through comparisons across fluid dynamics, solid mechanics, heat transfer, and electromagnetics, we show neural operators can achieve computational speedups of $10^3$ to $10^5$ times faster than traditional solvers for multi-query scenarios, while maintaining comparable accuracy. We provide practical guidance for method selection, discuss theoretical foundations (universal approximation, convergence), and identify critical open challenges: high-dimensional parameters, complex geometries, and out-of-distribution generalization. This work establishes a unified framework for understanding parametric PDE solvers via operator learning, offering a comprehensive, incrementally updated resource for this rapidly evolving field",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04611",
        "abs_url": "https://arxiv.org/abs/2511.04611",
        "pdf_url": "https://arxiv.org/pdf/2511.04611",
        "title": "evomap: A Toolbox for Dynamic Mapping in Python",
        "authors": [
            "Maximilian Matthe"
        ],
        "comments": "Accepted for publication by the Journal of Statistical Software",
        "subjects": "Mathematical Software (cs.MS); Machine Learning (cs.LG); Software Engineering (cs.SE)",
        "abstract": "This paper presents evomap, a Python package for dynamic mapping. Mapping methods are widely used across disciplines to visualize relationships among objects as spatial representations, or maps. However, most existing statistical software supports only static mapping, which captures objects' relationships at a single point in time and lacks tools to analyze how these relationships evolve. evomap fills this gap by implementing the dynamic mapping framework EvoMap, originally proposed by Matthe, Ringel, and Skiera (2023), which adapts traditional static mapping methods for dynamic analyses. The package supports multiple mapping techniques, including variants of Multidimensional Scaling (MDS), Sammon Mapping, and t-distributed Stochastic Neighbor Embedding (t-SNE). It also includes utilities for data preprocessing, exploration, and result evaluation, offering a comprehensive toolkit for dynamic mapping applications. This paper outlines the foundations of static and dynamic mapping, describes the architecture and functionality of evomap, and illustrates its application through an extensive usage example.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04619",
        "abs_url": "https://arxiv.org/abs/2511.04619",
        "pdf_url": "https://arxiv.org/pdf/2511.04619",
        "title": "Dynamic causal discovery in Alzheimer's disease through latent pseudotime modelling",
        "authors": [
            "Natalia Glazman",
            "Jyoti Mangal",
            "Pedro Borges",
            "Sebastien Ourselin",
            "M. Jorge Cardoso"
        ],
        "comments": "Accepted to the NeurIPS 2025 Workshop on CauScien: Uncovering Causality in Science",
        "subjects": "Applications (stat.AP); Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG)",
        "abstract": "The application of causal discovery to diseases like Alzheimer's (AD) is limited by the static graph assumptions of most methods; such models cannot account for an evolving pathophysiology, modulated by a latent disease pseudotime. We propose to apply an existing latent variable model to real-world AD data, inferring a pseudotime that orders patients along a data-driven disease trajectory independent of chronological age, then learning how causal relationships evolve. Pseudotime outperformed age in predicting diagnosis (AUC 0.82 vs 0.59). Incorporating minimal, disease-agnostic background knowledge substantially improved graph accuracy and orientation. Our framework reveals dynamic interactions between novel (NfL, GFAP) and established AD markers, enabling practical causal discovery despite violated assumptions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04622",
        "abs_url": "https://arxiv.org/abs/2511.04622",
        "pdf_url": "https://arxiv.org/pdf/2511.04622",
        "title": "ODE approximation for the Adam algorithm: General and overparametrized setting",
        "authors": [
            "Steffen Dereich",
            "Arnulf Jentzen",
            "Sebastian Kassing"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG); Probability (math.PR)",
        "abstract": "The Adam optimizer is currently presumably the most popular optimization method in deep learning. In this article we develop an ODE based method to study the Adam optimizer in a fast-slow scaling regime. For fixed momentum parameters and vanishing step-sizes, we show that the Adam algorithm is an asymptotic pseudo-trajectory of the flow of a particular vector field, which is referred to as the Adam vector field. Leveraging properties of asymptotic pseudo-trajectories, we establish convergence results for the Adam algorithm. In particular, in a very general setting we show that if the Adam algorithm converges, then the limit must be a zero of the Adam vector field, rather than a local minimizer or critical point of the objective function. In contrast, in the overparametrized empirical risk minimization setting, the Adam algorithm is able to locally find the set of minima. Specifically, we show that in a neighborhood of the global minima, the objective function serves as a Lyapunov function for the flow induced by the Adam vector field. As a consequence, if the Adam algorithm enters a neighborhood of the global minima infinitely often, it converges to the set of global minima.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04665",
        "abs_url": "https://arxiv.org/abs/2511.04665",
        "pdf_url": "https://arxiv.org/pdf/2511.04665",
        "title": "Real-to-Sim Robot Policy Evaluation with Gaussian Splatting Simulation of Soft-Body Interactions",
        "authors": [
            "Kaifeng Zhang",
            "Shuo Sha",
            "Hanxiao Jiang",
            "Matthew Loper",
            "Hyunjong Song",
            "Guangyan Cai",
            "Zhuo Xu",
            "Xiaochen Hu",
            "Changxi Zheng",
            "Yunzhu Li"
        ],
        "comments": "Website: this https URL",
        "subjects": "Robotics (cs.RO); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Robotic manipulation policies are advancing rapidly, but their direct evaluation in the real world remains costly, time-consuming, and difficult to reproduce, particularly for tasks involving deformable objects. Simulation provides a scalable and systematic alternative, yet existing simulators often fail to capture the coupled visual and physical complexity of soft-body interactions. We present a real-to-sim policy evaluation framework that constructs soft-body digital twins from real-world videos and renders robots, objects, and environments with photorealistic fidelity using 3D Gaussian Splatting. We validate our approach on representative deformable manipulation tasks, including plush toy packing, rope routing, and T-block pushing, demonstrating that simulated rollouts correlate strongly with real-world execution performance and reveal key behavioral patterns of learned policies. Our results suggest that combining physics-informed reconstruction with high-quality rendering enables reproducible, scalable, and accurate evaluation of robotic manipulation policies. Website: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2025-11-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-07?abs=True",
        "arxiv_id": "2511.04681",
        "abs_url": "https://arxiv.org/abs/2511.04681",
        "pdf_url": "https://arxiv.org/pdf/2511.04681",
        "title": "Dark Energy Survey Year 3 results: Simulation-based $w$CDM inference from weak lensing and galaxy clustering maps with deep learning. I. Analysis design",
        "authors": [
            "A. Thomsen",
            "J. Bucko",
            "T. Kacprzak",
            "V. Ajani",
            "J. Fluri",
            "A. Refregier",
            "D. Anbajagane",
            "F. J. Castander",
            "A. Ferté",
            "M. Gatti",
            "N. Jeffrey",
            "A. Alarcon",
            "A. Amon",
            "K. Bechtol",
            "M. R. Becker",
            "G. M. Bernstein",
            "A. Campos",
            "A. Carnero Rosell",
            "C. Chang",
            "R. Chen",
            "A. Choi",
            "M. Crocce",
            "C. Davis",
            "J. DeRose",
            "S. Dodelson",
            "C. Doux",
            "K. Eckert",
            "J. Elvin-Poole",
            "S. Everett",
            "P. Fosalba",
            "D. Gruen",
            "I. Harrison",
            "K. Herner",
            "E. M. Huff",
            "M. Jarvis",
            "N. Kuropatkin",
            "P.-F. Leget",
            "N. MacCrann",
            "J. McCullough",
            "J. Myles",
            "A. Navarro-Alsina",
            "S. Pandey",
            "A. Porredon",
            "J. Prat",
            "M. Raveri",
            "M. Rodriguez-Monroy",
            "R. P. Rollins",
            "A. Roodman",
            "E. S. Rykoff",
            "C. Sánchez",
            "L. F. Secco",
            "E. Sheldon",
            "T. Shin",
            "M. A. Troxel",
            "I. Tutusaus",
            "T. N. Varga",
            "N. Weaverdyck",
            "R. H. Wechsler",
            "B. Yanny",
            "B. Yin",
            "Y. Zhang",
            "J. Zuntz",
            "S. Allam",
            "F. Andrade-Oliveira",
            "D. Bacon",
            "J. Blazek",
            "D. Brooks",
            "R. Camilleri",
            "J. Carretero",
            "R. Cawthon",
            "L. N. da Costa",
            "M. E. da Silva Pereira",
            "T. M. Davis",
            "J. De Vicente",
            "S. Desai",
            "P. Doel",
            "J. García-Bellido",
            "G. Gutierrez",
            "S. R. Hinton",
            "D. L. Hollowood",
            "K. Honscheid",
            "D. J. James",
            "K. Kuehn",
            "O. Lahav",
            "S. Lee",
            "J. L. Marshall",
            "J. Mena-Fernández",
            "F. Menanteau",
            "R. Miquel",
            "J. Muir",
            "R. L. C. Ogando",
            "A. A. Plazas Malagón",
            "E. Sanchez",
            "D. Sanchez Cid",
            "I. Sevilla-Noarbe",
            "M. Smith",
            "E. Suchyta",
            "M. E. C. Swanson",
            "D. Thomas",
            "C. To",
            "D. L. Tucker"
        ],
        "comments": "38 pages, 14 figures, submitted",
        "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG)",
        "abstract": "Data-driven approaches using deep learning are emerging as powerful techniques to extract non-Gaussian information from cosmological large-scale structure. This work presents the first simulation-based inference (SBI) pipeline that combines weak lensing and galaxy clustering maps in a realistic Dark Energy Survey Year 3 (DES Y3) configuration and serves as preparation for a forthcoming analysis of the survey data. We develop a scalable forward model based on the CosmoGridV1 suite of N-body simulations to generate over one million self-consistent mock realizations of DES Y3 at the map level. Leveraging this large dataset, we train deep graph convolutional neural networks on the full survey footprint in spherical geometry to learn low-dimensional features that approximately maximize mutual information with target parameters. These learned compressions enable neural density estimation of the implicit likelihood via normalizing flows in a ten-dimensional parameter space spanning cosmological $w$CDM, intrinsic alignment, and linear galaxy bias parameters, while marginalizing over baryonic, photometric redshift, and shear bias nuisances. To ensure robustness, we extensively validate our inference pipeline using synthetic observations derived from both systematic contaminations in our forward model and independent Buzzard galaxy catalogs. Our forecasts yield significant improvements in cosmological parameter constraints, achieving $2-3\\times$ higher figures of merit in the $\\Omega_m - S_8$ plane relative to our implementation of baseline two-point statistics and effectively breaking parameter degeneracies through probe combination. These results demonstrate the potential of SBI analyses powered by deep learning for upcoming Stage-IV wide-field imaging surveys.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]