[
    {
        "order": 1,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07470",
        "abs_url": "https://arxiv.org/abs/2511.07470",
        "pdf_url": "https://arxiv.org/pdf/2511.07470",
        "title": "Slimmable NAM: Neural Amp Models with adjustable runtime computational cost",
        "authors": [
            "Steven Atkinson"
        ],
        "comments": "2 pages, 2 figures. Accepted to NeurIPS 2025 workshop on AI for Music",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This work demonstrates \"slimmable Neural Amp Models\", whose size and computational cost can be changed without additional training and with negligible computational overhead, enabling musicians to easily trade off between the accuracy and compute of the models they are using. The method's performance is quantified against commonly-used baselines, and a real-time demonstration of the model in an audio effect plug-in is developed.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07472",
        "abs_url": "https://arxiv.org/abs/2511.07472",
        "pdf_url": "https://arxiv.org/pdf/2511.07472",
        "title": "Multivariate Variational Autoencoder",
        "authors": [
            "Mehmet Can Yavuz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "We present the Multivariate Variational Autoencoder (MVAE), a VAE variant that preserves Gaussian tractability while lifting the diagonal posterior restriction. MVAE factorizes each posterior covariance, where a \\emph{global} coupling matrix $\\mathbf{C}$ induces dataset-wide latent correlations and \\emph{per-sample} diagonal scales modulate local uncertainty. This yields a full-covariance family with analytic KL and an efficient reparameterization via $\\mathbf{L}=\\mathbf{C}\\mathrm{diag}(\\boldsymbol{\\sigma})$. Across Larochelle-style MNIST variants, Fashion-MNIST, CIFAR-10, and CIFAR-100, MVAE consistently matches or improves reconstruction (MSE~$\\downarrow$) and delivers robust gains in calibration (NLL/Brier/ECE~$\\downarrow$) and unsupervised structure (NMI/ARI~$\\uparrow$) relative to diagonal-covariance VAEs with matched capacity, especially at mid-range latent sizes. Latent-plane visualizations further indicate smoother, more coherent factor traversals and sharper local detail. We release a fully reproducible implementation with training/evaluation scripts and sweep utilities to facilitate fair comparison and reuse.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07473",
        "abs_url": "https://arxiv.org/abs/2511.07473",
        "pdf_url": "https://arxiv.org/pdf/2511.07473",
        "title": "RELEAP: Reinforcement-Enhanced Label-Efficient Active Phenotyping for Electronic Health Records",
        "authors": [
            "Yang Yang",
            "Kathryn Pollak",
            "Bibhas Chakraborty",
            "Molei Liu",
            "Doudou Zhou",
            "Chuan Hong"
        ],
        "comments": "20 pages, 5 figures, 1 table. Includes supplementary material. Submitted to JAMIA Open. † These authors contributed equally. *Corresponding author: Chuan Hong",
        "subjects": "Machine Learning (cs.LG); Computers and Society (cs.CY)",
        "abstract": "Objective: Electronic health record (EHR) phenotyping often relies on noisy proxy labels, which undermine the reliability of downstream risk prediction. Active learning can reduce annotation costs, but most rely on fixed heuristics and do not ensure that phenotype refinement improves prediction performance. Our goal was to develop a framework that directly uses downstream prediction performance as feedback to guide phenotype correction and sample selection under constrained labeling budgets. Materials and Methods: We propose Reinforcement-Enhanced Label-Efficient Active Phenotyping (RELEAP), a reinforcement learning-based active learning framework. RELEAP adaptively integrates multiple querying strategies and, unlike prior methods, updates its policy based on feedback from downstream models. We evaluated RELEAP on a de-identified Duke University Health System (DUHS) cohort (2014-2024) for incident lung cancer risk prediction, using logistic regression and penalized Cox survival models. Performance was benchmarked against noisy-label baselines and single-strategy active learning. Results: RELEAP consistently outperformed all baselines. Logistic AUC increased from 0.774 to 0.805 and survival C-index from 0.718 to 0.752. Using downstream performance as feedback, RELEAP produced smoother and more stable gains than heuristic methods under the same labeling budget. Discussion: By linking phenotype refinement to prediction outcomes, RELEAP learns which samples most improve downstream discrimination and calibration, offering a more principled alternative to fixed active learning rules. Conclusion: RELEAP optimizes phenotype correction through downstream feedback, offering a scalable, label-efficient paradigm that reduces manual chart review and enhances the reliability of EHR-based risk prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07481",
        "abs_url": "https://arxiv.org/abs/2511.07481",
        "pdf_url": "https://arxiv.org/pdf/2511.07481",
        "title": "Comparing Reconstruction Attacks on Pretrained Versus Full Fine-tuned Large Language Model Embeddings on Homo Sapiens Splice Sites Genomic Data",
        "authors": [
            "Reem Al-Saidi",
            "Erman Ayday",
            "Ziad Kobti"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This study investigates embedding reconstruction attacks in large language models (LLMs) applied to genomic sequences, with a specific focus on how fine-tuning affects vulnerability to these attacks. Building upon Pan et al.'s seminal work demonstrating that embeddings from pretrained language models can leak sensitive information, we conduct a comprehensive analysis using the HS3D genomic dataset to determine whether task-specific optimization strengthens or weakens privacy protections. Our research extends Pan et al.'s work in three significant dimensions. First, we apply their reconstruction attack pipeline to pretrained and fine-tuned model embeddings, addressing a critical gap in their methodology that did not specify embedding types. Second, we implement specialized tokenization mechanisms tailored specifically for DNA sequences, enhancing the model's ability to process genomic data, as these models are pretrained on natural language and not DNA. Third, we perform a detailed comparative analysis examining position-specific, nucleotide-type, and privacy changes between pretrained and fine-tuned embeddings. We assess embeddings vulnerabilities across different types and dimensions, providing deeper insights into how task adaptation shifts privacy risks throughout genomic sequences. Our findings show a clear distinction in reconstruction vulnerability between pretrained and fine-tuned embeddings. Notably, fine-tuning strengthens resistance to reconstruction attacks in multiple architectures -- XLNet (+19.8\\%), GPT-2 (+9.8\\%), and BERT (+7.8\\%) -- pointing to task-specific optimization as a potential privacy enhancement mechanism. These results highlight the need for advanced protective mechanisms for language models processing sensitive genomic data, while highlighting fine-tuning as a potential privacy-enhancing technique worth further exploration.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07484",
        "abs_url": "https://arxiv.org/abs/2511.07484",
        "pdf_url": "https://arxiv.org/pdf/2511.07484",
        "title": "Counterfactual Forecasting of Human Behavior using Generative AI and Causal Graphs",
        "authors": [
            "Dharmateja Priyadarshi Uddandarao",
            "Ravi Kiran Vadlamani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computational Engineering, Finance, and Science (cs.CE); Methodology (stat.ME)",
        "abstract": "This study presents a novel framework for counterfactual user behavior forecasting that combines structural causal models with transformer-based generative artificial intelligence. To model fictitious situations, the method creates causal graphs that map the connections between user interactions, adoption metrics, and product features. The framework generates realistic behavioral trajectories under counterfactual conditions by using generative models that are conditioned on causal variables. Tested on datasets from web interactions, mobile applications, and e-commerce, the methodology outperforms conventional forecasting and uplift modeling techniques. Product teams can effectively simulate and assess possible interventions prior to deployment thanks to the framework improved interpretability through causal path visualization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07486",
        "abs_url": "https://arxiv.org/abs/2511.07486",
        "pdf_url": "https://arxiv.org/pdf/2511.07486",
        "title": "Provably Efficient Sample Complexity for Robust CMDP",
        "authors": [
            "Sourav Ganguly",
            "Arnob Ghosh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Machine Learning (stat.ML)",
        "abstract": "We study the problem of learning policies that maximize cumulative reward while satisfying safety constraints, even when the real environment differs from a simulator or nominal model. We focus on robust constrained Markov decision processes (RCMDPs), where the agent must maximize reward while ensuring cumulative utility exceeds a threshold under the worst-case dynamics within an uncertainty set. While recent works have established finite-time iteration complexity guarantees for RCMDPs using policy optimization, their sample complexity guarantees remain largely unexplored. In this paper, we first show that Markovian policies may fail to be optimal even under rectangular uncertainty sets unlike the {\\em unconstrained} robust MDP. To address this, we introduce an augmented state space that incorporates the remaining utility budget into the state representation. Building on this formulation, we propose a novel Robust constrained Value iteration (RCVI) algorithm with a sample complexity of $\\mathcal{\\tilde{O}}(|S||A|H^5/\\epsilon^2)$ achieving at most $\\epsilon$ violation using a generative model where $|S|$ and $|A|$ denote the sizes of the state and action spaces, respectively, and $H$ is the episode length. To the best of our knowledge, this is the {\\em first sample complexity guarantee} for RCMDP. Empirical results further validate the effectiveness of our approach.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07500",
        "abs_url": "https://arxiv.org/abs/2511.07500",
        "pdf_url": "https://arxiv.org/pdf/2511.07500",
        "title": "Methodological Precedence in Health Tech: Why ML/Big Data Analysis Must Follow Basic Epidemiological Consistency. A Case Study",
        "authors": [
            "Marco Roccetti"
        ],
        "comments": "2 Tables; ML/Big data paper on medical data",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The integration of advanced analytical tools, including Machine Learning (ML) and massive data processing, has revolutionized health research, promising unprecedented accuracy in diagnosis and risk prediction. However, the rigor of these complex methods is fundamentally dependent on the quality and integrity of the underlying datasets and the validity of their statistical design. We propose an emblematic case where advanced analysis (ML/Big Data) must necessarily be subsequent to the verification of basic methodological coherence. This study highlights a crucial cautionary principle: sophisticated analyses amplify, rather than correct, severe methodological flaws rooted in basic design choices, leading to misleading or contradictory findings. By applying simple, standard descriptive statistical methods and established national epidemiological benchmarks to a recently published cohort study on vaccine outcomes and psychiatric events, we expose multiple, statistically irreconcilable paradoxes. These paradoxes, including an implausible risk reduction for a chronic disorder in a high-risk group and contradictory incidence rate comparisons, definitively invalidate the reported hazard ratios (HRs). We demonstrate that the observed effects are mathematical artifacts stemming from an uncorrected selection bias in the cohort construction. This analysis serves as a robust reminder that even the most complex health studies must first pass the test of basic epidemiological consistency before any conclusion drawn from subsequent advanced ML or statistical modeling can be considered valid or publishable. We conclude that robust methods, such as Propensity Score Matching, are essential for achieving valid causal inference from administrative data in the absence of randomization",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07572",
        "abs_url": "https://arxiv.org/abs/2511.07572",
        "pdf_url": "https://arxiv.org/pdf/2511.07572",
        "title": "SCALAR: Benchmarking SAE Interaction Sparsity in Toy LLMs",
        "authors": [
            "Sean P. Fillingham",
            "Andrew Gordon",
            "Peter Lai",
            "Xavier Poncini",
            "David Quarel",
            "Stefan Heimersheim"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Mechanistic interpretability aims to decompose neural networks into interpretable features and map their connecting circuits. The standard approach trains sparse autoencoders (SAEs) on each layer's activations. However, SAEs trained in isolation don't encourage sparse cross-layer connections, inflating extracted circuits where upstream features needlessly affect multiple downstream features. Current evaluations focus on individual SAE performance, leaving interaction sparsity unexamined. We introduce SCALAR (Sparse Connectivity Assessment of Latent Activation Relationships), a benchmark measuring interaction sparsity between SAE features. We also propose \"Staircase SAEs\", using weight-sharing to limit upstream feature duplication across downstream features. Using SCALAR, we compare TopK SAEs, Jacobian SAEs (JSAEs), and Staircase SAEs. Staircase SAEs improve relative sparsity over TopK SAEs by $59.67\\% \\pm 1.83\\%$ (feedforward) and $63.15\\% \\pm 1.35\\%$ (transformer blocks). JSAEs provide $8.54\\% \\pm 0.38\\%$ improvement over TopK for feedforward layers but cannot train effectively across transformer blocks, unlike Staircase and TopK SAEs which work anywhere in the residual stream. We validate on a $216$K-parameter toy model and GPT-$2$ Small ($124$M), where Staircase SAEs maintain interaction sparsity improvements while preserving feature interpretability. Our work highlights the importance of interaction sparsity in SAEs through benchmarking and comparing promising architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07603",
        "abs_url": "https://arxiv.org/abs/2511.07603",
        "pdf_url": "https://arxiv.org/pdf/2511.07603",
        "title": "One Router to Route Them All: Homogeneous Expert Routing for Heterogeneous Graph Transformers",
        "authors": [
            "Georgiy Shakirov",
            "Albert Arakelov"
        ],
        "comments": "14 pages, 4 figures; 2 tables; work in progress, feedback welcome",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "A common practice in heterogeneous graph neural networks (HGNNs) is to condition parameters on node/edge types, assuming types reflect semantic roles. However, this can cause overreliance on surface-level labels and impede cross-type knowledge transfer. We explore integrating Mixture-of-Experts (MoE) into HGNNs--a direction underexplored despite MoE's success in homogeneous settings. Crucially, we question the need for type-specific experts. We propose Homogeneous Expert Routing (HER), an MoE layer for Heterogeneous Graph Transformers (HGT) that stochastically masks type embeddings during routing to encourage type-agnostic specialization. Evaluated on IMDB, ACM, and DBLP for link prediction, HER consistently outperforms standard HGT and a type-separated MoE baseline. Analysis on IMDB shows HER experts specialize by semantic patterns (e.g., movie genres) rather than node types, confirming routing is driven by latent semantics. Our work demonstrates that regularizing type dependence in expert routing yields more generalizable, efficient, and interpretable representations--a new design principle for heterogeneous graph learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07633",
        "abs_url": "https://arxiv.org/abs/2511.07633",
        "pdf_url": "https://arxiv.org/pdf/2511.07633",
        "title": "FlowTIE: Flow-based Transport of Intensity Equation for Phase Gradient Estimation from 4D-STEM Data",
        "authors": [
            "Arya Bangun",
            "Maximilian Töllner",
            "Xuan Zhao",
            "Christian Kübel",
            "Hanno Scharr"
        ],
        "comments": "7 pages, 3 figures, Machine Learning and the Physical Sciences Workshop, NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce FlowTIE, a neural-network-based framework for phase reconstruction from 4D-Scanning Transmission Electron Microscopy (STEM) data, which integrates the Transport of Intensity Equation (TIE) with a flow-based representation of the phase gradient. This formulation allows the model to bridge data-driven learning with physics-based priors, improving robustness under dynamical scattering conditions for thick specimen. The validation on simulated datasets of crystalline materials, benchmarking to classical TIE and gradient-based optimization methods are presented. The results demonstrate that FlowTIE improves phase reconstruction accuracy, fast, and can be integrated with a thick specimen model, namely multislice method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07649",
        "abs_url": "https://arxiv.org/abs/2511.07649",
        "pdf_url": "https://arxiv.org/pdf/2511.07649",
        "title": "Adaptive Graph Learning with Transformer for Multi-Reservoir Inflow Prediction",
        "authors": [
            "Pengfei Hu",
            "Ming Fan",
            "Xiaoxue Han",
            "Chang Lu",
            "Wei Zhang",
            "Hyun Kang",
            "Yue Ning",
            "Dan Lu"
        ],
        "comments": "ICDM 2025 DMESS Workshop",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Reservoir inflow prediction is crucial for water resource management, yet existing approaches mainly focus on single-reservoir models that ignore spatial dependencies among interconnected reservoirs. We introduce AdaTrip as an adaptive, time-varying graph learning framework for multi-reservoir inflow forecasting. AdaTrip constructs dynamic graphs where reservoirs are nodes with directed edges reflecting hydrological connections, employing attention mechanisms to automatically identify crucial spatial and temporal dependencies. Evaluation on thirty reservoirs in the Upper Colorado River Basin demonstrates superiority over existing baselines, with improved performance for reservoirs with limited records through parameter sharing. Additionally, AdaTrip provides interpretable attention maps at edge and time-step levels, offering insights into hydrological controls to support operational decision-making. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07651",
        "abs_url": "https://arxiv.org/abs/2511.07651",
        "pdf_url": "https://arxiv.org/pdf/2511.07651",
        "title": "Enhancing Binary Encoded Crime Linkage Analysis Using Siamese Network",
        "authors": [
            "Yicheng Zhan",
            "Fahim Ahmed",
            "Amy Burrell",
            "Matthew J. Tonkin",
            "Sarah Galambos",
            "Jessica Woodhams",
            "Dalal Alrajeh"
        ],
        "comments": "AAAI 2026, 7 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG); Computers and Society (cs.CY)",
        "abstract": "Effective crime linkage analysis is crucial for identifying serial offenders and enhancing public safety. To address limitations of traditional crime linkage methods in handling high-dimensional, sparse, and heterogeneous data, we propose a Siamese Autoencoder framework that learns meaningful latent representations and uncovers correlations in complex crime data. Using data from the Violent Crime Linkage Analysis System (ViCLAS), maintained by the Serious Crime Analysis Section of the UK's National Crime Agency, our approach mitigates signal dilution in sparse feature spaces by integrating geographic-temporal features at the decoder stage. This design amplifies behavioral representations rather than allowing them to be overshadowed at the input level, yielding consistent improvements across multiple evaluation metrics. We further analyze how different domain-informed data reduction strategies influence model performance, providing practical guidance for preprocessing in crime linkage contexts. Our results show that advanced machine learning approaches can substantially enhance linkage accuracy, improving AUC by up to 9% over traditional methods while offering interpretable insights to support investigative decision-making.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07657",
        "abs_url": "https://arxiv.org/abs/2511.07657",
        "pdf_url": "https://arxiv.org/pdf/2511.07657",
        "title": "CAE: Character-Level Autoencoder for Non-Semantic Relational Data Grouping",
        "authors": [
            "Veera V S Bhargav Nunna",
            "Shinae Kang",
            "Zheyuan Zhou",
            "Virginia Wang",
            "Sucharitha Boinapally",
            "Michael Foley"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Enterprise relational databases increasingly contain vast amounts of non-semantic data - IP addresses, product identifiers, encoded keys, and timestamps - that challenge traditional semantic analysis. This paper introduces a novel Character-Level Autoencoder (CAE) approach that automatically identifies and groups semantically identical columns in non-semantic relational datasets by detecting column similarities based on data patterns and structures. Unlike conventional Natural Language Processing (NLP) models that struggle with limitations in semantic interpretability and out-of-vocabulary tokens, our approach operates at the character level with fixed dictionary constraints, enabling scalable processing of large-scale data lakes and warehouses. The CAE architecture encodes text representations of non-semantic relational table columns and extracts high-dimensional feature embeddings for data grouping. By maintaining a fixed dictionary size, our method significantly reduces both memory requirements and training time, enabling efficient processing of large-scale industrial data environments. Experimental evaluation demonstrates substantial performance gains: our CAE approach achieved 80.95% accuracy in top 5 column matching tasks across relational datasets, substantially outperforming traditional NLP approaches such as Bag of Words (47.62%). These results demonstrate its effectiveness for identifying and clustering identical columns in relational datasets. This work bridges the gap between theoretical advances in character-level neural architectures and practical enterprise data management challenges, providing an automated solution for schema understanding and data profiling of non-semantic industrial datasets at scale.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07658",
        "abs_url": "https://arxiv.org/abs/2511.07658",
        "pdf_url": "https://arxiv.org/pdf/2511.07658",
        "title": "ZeroSim: Zero-Shot Analog Circuit Evaluation with Unified Transformer Embeddings",
        "authors": [
            "Xiaomeng Yang",
            "Jian Gao",
            "Yanzhi Wang",
            "Xuan Zhang"
        ],
        "comments": "Accepted by ICCAD 2025",
        "subjects": "Machine Learning (cs.LG); Hardware Architecture (cs.AR)",
        "abstract": "Although recent advancements in learning-based analog circuit design automation have tackled tasks such as topology generation, device sizing, and layout synthesis, efficient performance evaluation remains a major bottleneck. Traditional SPICE simulations are time-consuming, while existing machine learning methods often require topology-specific retraining or manual substructure segmentation for fine-tuning, hindering scalability and adaptability. In this work, we propose ZeroSim, a transformer-based performance modeling framework designed to achieve robust in-distribution generalization across trained topologies under novel parameter configurations and zero-shot generalization to unseen topologies without any fine-tuning. We apply three key enabling strategies: (1) a diverse training corpus of 3.6 million instances covering over 60 amplifier topologies, (2) unified topology embeddings leveraging global-aware tokens and hierarchical attention to robustly generalize to novel circuits, and (3) a topology-conditioned parameter mapping approach that maintains consistent structural representations independent of parameter variations. Our experimental results demonstrate that ZeroSim significantly outperforms baseline models such as multilayer perceptrons, graph neural networks and transformers, delivering accurate zero-shot predictions across different amplifier topologies. Additionally, when integrated into a reinforcement learning-based parameter optimization pipeline, ZeroSim achieves a remarkable speedup (13x) compared to conventional SPICE simulations, underscoring its practical value for a wide range of analog circuit design automation tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07694",
        "abs_url": "https://arxiv.org/abs/2511.07694",
        "pdf_url": "https://arxiv.org/pdf/2511.07694",
        "title": "Probabilities Are All You Need: A Probability-Only Approach to Uncertainty Estimation in Large Language Models",
        "authors": [
            "Manh Nguyen",
            "Sunil Gupta",
            "Hung Le"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) exhibit strong performance across various natural language processing (NLP) tasks but remain vulnerable to hallucinations, generating factually incorrect or misleading outputs. Uncertainty estimation, often using predictive entropy estimation, is key to addressing this issue. However, existing methods often require multiple samples or extra computation to assess semantic entropy. This paper proposes an efficient, training-free uncertainty estimation method that approximates predictive entropy using the responses' top-$K$ probabilities. Moreover, we employ an adaptive mechanism to determine $K$ to enhance flexibility and filter out low-confidence probabilities. Experimental results on three free-form question-answering datasets across several LLMs demonstrate that our method outperforms expensive state-of-the-art baselines, contributing to the broader goal of enhancing LLM trustworthiness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07701",
        "abs_url": "https://arxiv.org/abs/2511.07701",
        "pdf_url": "https://arxiv.org/pdf/2511.07701",
        "title": "Diffusion Guided Adversarial State Perturbations in Reinforcement Learning",
        "authors": [
            "Xiaolin Sun",
            "Feidi Liu",
            "Zhengming Ding",
            "ZiZhan Zheng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Reinforcement learning (RL) systems, while achieving remarkable success across various domains, are vulnerable to adversarial attacks. This is especially a concern in vision-based environments where minor manipulations of high-dimensional image inputs can easily mislead the agent's behavior. To this end, various defenses have been proposed recently, with state-of-the-art approaches achieving robust performance even under large state perturbations. However, after closer investigation, we found that the effectiveness of the current defenses is due to a fundamental weakness of the existing $l_p$ norm-constrained attacks, which can barely alter the semantics of image input even under a relatively large perturbation budget. In this work, we propose SHIFT, a novel policy-agnostic diffusion-based state perturbation attack to go beyond this limitation. Our attack is able to generate perturbed states that are semantically different from the true states while remaining realistic and history-aligned to avoid detection. Evaluations show that our attack effectively breaks existing defenses, including the most sophisticated ones, significantly outperforming existing attacks while being more perceptually stealthy. The results highlight the vulnerability of RL agents to semantics-aware adversarial perturbations, indicating the importance of developing more robust policies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07702",
        "abs_url": "https://arxiv.org/abs/2511.07702",
        "pdf_url": "https://arxiv.org/pdf/2511.07702",
        "title": "Intelligent Optimization of Multi-Parameter Micromixers Using a Scientific Machine Learning Framework",
        "authors": [
            "Meraj Hassanzadeh",
            "Ehsan Ghaderi",
            "Mohamad Ali Bijarchi",
            "Siamak Kazemzadeh Hannani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computational Physics (physics.comp-ph); Fluid Dynamics (physics.flu-dyn)",
        "abstract": "Multidimensional optimization has consistently been a critical challenge in engineering. However, traditional simulation-based optimization methods have long been plagued by significant limitations: they are typically capable of optimizing only a single problem at a time and require substantial computational time for meshing and numerical simulation. This paper introduces a novel framework leveraging cutting-edge Scientific Machine Learning (Sci-ML) methodologies to overcome these inherent drawbacks of conventional approaches. The proposed method provides instantaneous solutions to a spectrum of complex, multidimensional optimization problems. A micromixer case study is employed to demonstrate this methodology. An agent, operating on a Deep Reinforcement Learning (DRL) architecture, serves as the optimizer to explore the relationships between key problem parameters. This optimizer interacts with an environment constituted by a parametric Physics-Informed Neural Network (PINN), which responds to the agent's actions at a significantly higher speed than traditional numerical methods. The agent's objective, conditioned on the Schmidt number is to discover the optimal geometric and physical parameters that maximize the micromixer's efficiency. After training the agent across a wide range of Schmidt numbers, we analyzed the resulting optimal designs. Across this entire spectrum, the achieved efficiency was consistently greater than the baseline, normalized value. The maximum efficiency occurred at a Schmidt number of 13.3, demonstrating an improvement of approximately 32%. Finally, a comparative analysis with a Genetic Algorithm was conducted under equivalent conditions to underscore the advantages of the proposed method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07724",
        "abs_url": "https://arxiv.org/abs/2511.07724",
        "pdf_url": "https://arxiv.org/pdf/2511.07724",
        "title": "A Ranking-Based Optimization Algorithm for the Vehicle Relocation Problem in Car Sharing Services",
        "authors": [
            "Piotr Szwed",
            "Paweł Skrzynski",
            "Jarosław Wąs"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The paper addresses the Vehicle Relocation Problem in free-floating car-sharing services by presenting a solution focused on strategies for repositioning vehicles and transferring personnel with the use of scooters. Our method begins by dividing the service area into zones that group regions with similar temporal patterns of vehicle presence and service demand, allowing the application of discrete optimization methods. In the next stage, we propose a fast ranking-based algorithm that makes its decisions on the basis of the number of cars available in each zone, the projected probability density of demand, and estimated trip durations. The experiments were carried out on the basis of real-world data originating from a major car-sharing service operator in Poland. The results of this algorithm are evaluated against scenarios without optimization that constitute a baseline and compared with the results of an exact algorithm to solve the Mixed Integer Programming (MIP) model. As performance metrics, the total travel time was used. Under identical conditions (number of vehicles, staff, and demand distribution), the average improvements with respect to the baseline of our algorithm and MIP solver were equal to 8.44\\% and 19.6\\% correspondingly. However, it should be noted that the MIP model also mimicked decisions on trip selection, which are excluded by current services business rules. The analysis of results suggests that, depending on the size of the workforce, the application of the proposed solution allows for improving performance metrics by roughly 3%-10%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07730",
        "abs_url": "https://arxiv.org/abs/2511.07730",
        "pdf_url": "https://arxiv.org/pdf/2511.07730",
        "title": "Multistep Quasimetric Learning for Scalable Goal-conditioned Reinforcement Learning",
        "authors": [
            "Bill Chunyuan Zheng",
            "Vivek Myers",
            "Benjamin Eysenbach",
            "Sergey Levine"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "Learning how to reach goals in an environment is a longstanding challenge in AI, yet reasoning over long horizons remains a challenge for modern methods. The key question is how to estimate the temporal distance between pairs of observations. While temporal difference methods leverage local updates to provide optimality guarantees, they often perform worse than Monte Carlo methods that perform global updates (e.g., with multi-step returns), which lack such guarantees. We show how these approaches can be integrated into a practical GCRL method that fits a quasimetric distance using a multistep Monte-Carlo return. We show our method outperforms existing GCRL methods on long-horizon simulated tasks with up to 4000 steps, even with visual observations. We also demonstrate that our method can enable stitching in the real-world robotic manipulation domain (Bridge setup). Our approach is the first end-to-end GCRL method that enables multistep stitching in this real-world manipulation domain from an unlabeled offline dataset of visual observations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07734",
        "abs_url": "https://arxiv.org/abs/2511.07734",
        "pdf_url": "https://arxiv.org/pdf/2511.07734",
        "title": "Global Optimization on Graph-Structured Data via Gaussian Processes with Spectral Representations",
        "authors": [
            "Shu Hong",
            "Yongsheng Mei",
            "Mahdi Imani",
            "Tian Lan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Social and Information Networks (cs.SI); Signal Processing (eess.SP)",
        "abstract": "Bayesian optimization (BO) is a powerful framework for optimizing expensive black-box objectives, yet extending it to graph-structured domains remains challenging due to the discrete and combinatorial nature of graphs. Existing approaches often rely on either full graph topology-impractical for large or partially observed graphs-or incremental exploration, which can lead to slow convergence. We introduce a scalable framework for global optimization over graphs that employs low-rank spectral representations to build Gaussian process (GP) surrogates from sparse structural observations. The method jointly infers graph structure and node representations through learnable embeddings, enabling efficient global search and principled uncertainty estimation even with limited data. We also provide theoretical analysis establishing conditions for accurate recovery of underlying graph structure under different sampling regimes. Experiments on synthetic and real-world datasets demonstrate that our approach achieves faster convergence and improved optimization performance compared to prior methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07767",
        "abs_url": "https://arxiv.org/abs/2511.07767",
        "pdf_url": "https://arxiv.org/pdf/2511.07767",
        "title": "Schedulers for Schedule-free: Theoretically inspired hyperparameters",
        "authors": [
            "Yuen-Man Pun",
            "Matthew Buchholz",
            "Robert M. Gower"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The recently proposed schedule-free method has been shown to achieve strong performance when hyperparameter tuning is limited. The current theory for schedule-free only supports a constant learning rate, where-as the implementation used in practice uses a warm-up schedule. We show how to extend the last-iterate convergence theory of schedule-free to allow for any scheduler, and how the averaging parameter has to be updated as a function of the learning rate. We then perform experiments showing how our convergence theory has some predictive power with regards to practical executions on deep neural networks, despite that this theory relies on assuming convexity. When applied to the warmup-stable-decay (wsd) schedule, our theory shows the optimal convergence rate of $\\mathcal{O}(1/\\sqrt{T})$. We then use convexity to design a new adaptive Polyak learning rate schedule for schedule-free. We prove an optimal anytime last-iterate convergence for our new Polyak schedule, and show that it performs well compared to a number of baselines on a black-box model distillation task.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07787",
        "abs_url": "https://arxiv.org/abs/2511.07787",
        "pdf_url": "https://arxiv.org/pdf/2511.07787",
        "title": "Physical Consistency of Aurora's Encoder: A Quantitative Study",
        "authors": [
            "Benjamin Richards",
            "Pushpa Kumar Balan"
        ],
        "comments": "Accepted for poster presentation at the AICC: Workshop on AI for Climate and Conservation at EurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "The high accuracy of large-scale weather forecasting models like Aurora is often accompanied by a lack of transparency, as their internal representations remain largely opaque. This \"black box\" nature hinders their adoption in high-stakes operational settings. In this work, we probe the physical consistency of Aurora's encoder by investigating whether its latent representations align with known physical and meteorological concepts. Using a large-scale dataset of embeddings, we train linear classifiers to identify three distinct concepts: the fundamental land-sea boundary, high-impact extreme temperature events, and atmospheric instability. Our findings provide quantitative evidence that Aurora learns physically consistent features, while also highlighting its limitations in capturing the rarest events. This work underscores the critical need for interpretability methods to validate and build trust in the next generation of Al-driven weather models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07809",
        "abs_url": "https://arxiv.org/abs/2511.07809",
        "pdf_url": "https://arxiv.org/pdf/2511.07809",
        "title": "Analyzing Political Text at Scale with Online Tensor LDA",
        "authors": [
            "Sara Kangaslahti",
            "Danny Ebanks",
            "Jean Kossaifi",
            "Anqi Liu",
            "R. Michael Alvarez",
            "Animashree Anandkumar"
        ],
        "comments": "64 pages, 11 figures",
        "subjects": "Machine Learning (cs.LG); Social and Information Networks (cs.SI)",
        "abstract": "This paper proposes a topic modeling method that scales linearly to billions of documents. We make three core contributions: i) we present a topic modeling method, Tensor Latent Dirichlet Allocation (TLDA), that has identifiable and recoverable parameter guarantees and sample complexity guarantees for large data; ii) we show that this method is computationally and memory efficient (achieving speeds over 3-4x those of prior parallelized Latent Dirichlet Allocation (LDA) methods), and that it scales linearly to text datasets with over a billion documents; iii) we provide an open-source, GPU-based implementation, of this method. This scaling enables previously prohibitive analyses, and we perform two real-world, large-scale new studies of interest to political scientists: we provide the first thorough analysis of the evolution of the #MeToo movement through the lens of over two years of Twitter conversation and a detailed study of social media conversations about election fraud in the 2020 presidential election. Thus this method provides social scientists with the ability to study very large corpora at scale and to answer important theoretically-relevant questions about salient issues in near real-time.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07824",
        "abs_url": "https://arxiv.org/abs/2511.07824",
        "pdf_url": "https://arxiv.org/pdf/2511.07824",
        "title": "Multi-Objective Bilevel Learning",
        "authors": [
            "Zhiyao Zhang",
            "Zhuqing Liu",
            "Xin Zhang",
            "Wen-Yen Chen",
            "Jiyan Yang",
            "Jia Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As machine learning (ML) applications grow increasingly complex in recent years, modern ML frameworks often need to address multiple potentially conflicting objectives with coupled decision variables across different layers. This creates a compelling need for multi-objective bilevel learning (MOBL). So far, however, the field of MOBL remains in its infancy and many important problems remain under-explored. This motivates us to fill this gap and systematically investigate the theoretical and algorithmic foundation of MOBL. Specifically, we consider MOBL problems with multiple conflicting objectives guided by preferences at the upper-level subproblem, where part of the inputs depend on the optimal solution of the lower-level subproblem. Our goal is to develop efficient MOBL optimization algorithms to (1) identify a preference-guided Pareto-stationary solution with low oracle complexity; and (2) enable systematic Pareto front exploration. To this end, we propose a unifying algorithmic framework called weighted-Chebyshev multi-hyper-gradient-descent (WC-MHGD) for both deterministic and stochastic settings with finite-time Pareto-stationarity convergence rate guarantees, which not only implies low oracle complexity but also induces systematic Pareto front exploration. We further conduct extensive experiments to confirm our theoretical results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07843",
        "abs_url": "https://arxiv.org/abs/2511.07843",
        "pdf_url": "https://arxiv.org/pdf/2511.07843",
        "title": "DP-AdamW: Investigating Decoupled Weight Decay and Bias Correction in Private Deep Learning",
        "authors": [
            "Jay Chooi",
            "Kevin Cong",
            "Russell Li",
            "Lillian Sun"
        ],
        "comments": "19 pages, 5 appendices; presented at ICML 2025 DIG-BUGS Workshop",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As deep learning methods increasingly utilize sensitive data on a widespread scale, differential privacy (DP) offers formal guarantees to protect against information leakage during model training. A significant challenge remains in implementing DP optimizers that retain strong performance while preserving privacy. Recent advances introduced ever more efficient optimizers, with AdamW being a popular choice for training deep learning models because of strong empirical performance. We study \\emph{DP-AdamW} and introduce \\emph{DP-AdamW-BC}, a differentially private variant of the AdamW optimizer with DP bias correction for the second moment estimator. We start by showing theoretical results for privacy and convergence guarantees of DP-AdamW and DP-AdamW-BC. Then, we empirically analyze the behavior of both optimizers across multiple privacy budgets ($\\epsilon = 1, 3, 7$). We find that DP-AdamW outperforms existing state-of-the-art differentially private optimizers like DP-SGD, DP-Adam, and DP-AdamBC, scoring over 15\\% higher on text classification, up to 5\\% higher on image classification, and consistently 1\\% higher on graph node classification. Moreover, we empirically show that incorporating bias correction in DP-AdamW (DP-AdamW-BC) consistently decreases accuracy, in contrast to the improvement of DP-AdamBC improvement over DP-Adam.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07878",
        "abs_url": "https://arxiv.org/abs/2511.07878",
        "pdf_url": "https://arxiv.org/pdf/2511.07878",
        "title": "Algorithm-Relative Trajectory Valuation in Policy Gradient Control",
        "authors": [
            "Shihao Li",
            "Jiachen Li",
            "Jiamin Xu",
            "Christopher Martin",
            "Wei Li",
            "Dongmei Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "We study how trajectory value depends on the learning algorithm in policy-gradient control. Using Trajectory Shapley in an uncertain LQR, we find a negative correlation between Persistence of Excitation (PE) and marginal value under vanilla REINFORCE ($r\\approx-0.38$). We prove a variance-mediated mechanism: (i) for fixed energy, higher PE yields lower gradient variance; (ii) near saddles, higher variance increases escape probability, raising marginal contribution. When stabilized (state whitening or Fisher preconditioning), this variance channel is neutralized and information content dominates, flipping the correlation positive ($r\\approx+0.29$). Hence, trajectory value is algorithm-relative. Experiments validate the mechanism and show decision-aligned scores (Leave-One-Out) complement Shapley for pruning, while Shapley identifies toxic subsets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07892",
        "abs_url": "https://arxiv.org/abs/2511.07892",
        "pdf_url": "https://arxiv.org/pdf/2511.07892",
        "title": "A Generalized Spectral Framework to Expain Neural Scaling and Compression Dynamics",
        "authors": [
            "Yizhou Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Empirical scaling laws describe how test loss and other performance metrics depend on model size, dataset size, and compute. While such laws are consistent within specific regimes, apparently distinct scaling behaviors have been reported for related settings such as model compression. Motivated by recent progress in spectral analyses of neural representations, this paper develops a \\emph{generalized spectral framework} that unifies learning dynamics and compression phenomena under a common functional ansatz. We generalize the spectral evolution function from the linear kernel form $g(\\lambda t)=\\lambda t$ to an asymptotically polynomial function $g(\\lambda,t;\\beta)$, characterized by an effective spectral--temporal elasticity $\\rho(\\beta)$. This framework recovers existing lazy and feature-learning theories as special cases and yields an invariant relation between learning and compression",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07904",
        "abs_url": "https://arxiv.org/abs/2511.07904",
        "pdf_url": "https://arxiv.org/pdf/2511.07904",
        "title": "Test-driven Reinforcement Learning",
        "authors": [
            "Zhao Yu",
            "Xiuping Wu",
            "Liangjun Ke"
        ],
        "comments": "AAAI 2026 oral",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Reinforcement learning (RL) has been recognized as a powerful tool for robot control tasks. RL typically employs reward functions to define task objectives and guide agent learning. However, since the reward function serves the dual purpose of defining the optimal goal and guiding learning, it is challenging to design the reward function manually, which often results in a suboptimal task representation. To tackle the reward design challenge in RL, inspired by the satisficing theory, we propose a Test-driven Reinforcement Learning (TdRL) framework. In the TdRL framework, multiple test functions are used to represent the task objective rather than a single reward function. Test functions can be categorized as pass-fail tests and indicative tests, each dedicated to defining the optimal objective and guiding the learning process, respectively, thereby making defining tasks easier. Building upon such a task definition, we first prove that if a trajectory return function assigns higher returns to trajectories closer to the optimal trajectory set, maximum entropy policy optimization based on this return function will yield a policy that is closer to the optimal policy set. Then, we introduce a lexicographic heuristic approach to compare the relative distance relationship between trajectories and the optimal trajectory set for learning the trajectory return function. Furthermore, we develop an algorithm implementation of TdRL. Experimental results on the DeepMind Control Suite benchmark demonstrate that TdRL matches or outperforms handcrafted reward methods in policy training, with greater design simplicity and inherent support for multi-objective optimization. We argue that TdRL offers a novel perspective for representing task objectives, which could be helpful in addressing the reward design challenges in RL applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07908",
        "abs_url": "https://arxiv.org/abs/2511.07908",
        "pdf_url": "https://arxiv.org/pdf/2511.07908",
        "title": "CellARC: Measuring Intelligence with Cellular Automata",
        "authors": [
            "Miroslav Lžičař"
        ],
        "comments": "22 pages, 11 figures. Working draft. Dataset and leaderboard available at this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce CellARC, a synthetic benchmark for abstraction and reasoning built from multicolor 1D cellular automata (CA). Each episode has five support pairs and one query serialized in 256 tokens, enabling rapid iteration with small models while exposing a controllable task space with explicit knobs for alphabet size k, radius r, rule family, Langton's lambda, query coverage, and cell entropy. We release 95k training episodes plus two 1k test splits (interpolation/extrapolation) and evaluate symbolic, recurrent, convolutional, transformer, recursive, and LLM baselines. CellARC decouples generalization from anthropomorphic priors, supports unlimited difficulty-controlled sampling, and enables reproducible studies of how quickly models infer new rules under tight budgets. Our strongest small-model baseline (a 10M-parameter vanilla transformer) outperforms recent recursive models (TRM, HRM), reaching 58.0%/32.4% per-token accuracy on the interpolation/extrapolation splits, while a large closed model (GPT-5 High) attains 62.3%/48.1% on subsets of 100 test tasks. An ensemble that chooses per episode between the Transformer and the best symbolic baseline reaches 65.4%/35.5%, highlighting neuro-symbolic complementarity. Leaderboard: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07911",
        "abs_url": "https://arxiv.org/abs/2511.07911",
        "pdf_url": "https://arxiv.org/pdf/2511.07911",
        "title": "Rectified Noise: A Generative Model Using Positive-incentive Noise",
        "authors": [
            "Zhenyu Gu",
            "Yanchen Xu",
            "Sida Huang",
            "Yubin Guo",
            "Hongyuan Zhang"
        ],
        "comments": "Accepted by AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Rectified Flow (RF) has been widely used as an effective generative model. Although RF is primarily based on probability flow Ordinary Differential Equations (ODE), recent studies have shown that injecting noise through reverse-time Stochastic Differential Equations (SDE) for sampling can achieve superior generative performance. Inspired by Positive-incentive Noise ($\\pi$-noise), we propose an innovative generative algorithm to train $\\pi$-noise generators, namely Rectified Noise ($\\Delta$RN), which improves the generative performance by injecting $\\pi$-noise into the velocity field of pre-trained RF models. After introducing the Rectified Noise pipeline, pre-trained RF models can be efficiently transformed into $\\pi$-noise generators. We validate Rectified Noise by conducting extensive experiments across various model architectures on different datasets. Notably, we find that: (1) RF models using Rectified Noise reduce FID from \\textbf{10.16 to 9.05} on ImageNet-1k. (2) The models of $\\pi$-noise generators achieve improved performance with only \\textbf{0.39\\%} additional training parameters.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07919",
        "abs_url": "https://arxiv.org/abs/2511.07919",
        "pdf_url": "https://arxiv.org/pdf/2511.07919",
        "title": "Feedback Descent: Open-Ended Text Optimization via Pairwise Comparison",
        "authors": [
            "Yoonho Lee",
            "Joseph Boen",
            "Chelsea Finn"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce \\textit{Feedback Descent}, a framework that optimizes text artifacts -- prompts, code, and molecules -- through structured textual feedback, rather than relying solely on scalar rewards. By preserving detailed critiques instead of compressing them to binary preferences, Feedback Descent widens the information bottleneck in preference learning, enabling directed optimization in text space rather than weight space. We show that in-context learning can transform structured feedback into gradient-like directional information, enabling targeted edits. Unlike prior approaches that collapse judgments into single bits, our evaluators pair each comparison with textual feedback, which functions as high-bandwidth supervision. The iteration loop is done purely at inference time, without modifying any model weights, and is task-agnostic. We evaluate Feedback Descent on three diverse domains and find that it outperforms state-of-the-art prompt optimization (GEPA), reinforcement learning methods (GRPO, REINVENT), and even specialized graph-based molecular optimizers. In the DOCKSTRING molecule discovery benchmark, Feedback Descent identifies novel drug-like molecules surpassing the $99.9$th percentile of a database with more than $260{,}000$ compounds across six protein targets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07922",
        "abs_url": "https://arxiv.org/abs/2511.07922",
        "pdf_url": "https://arxiv.org/pdf/2511.07922",
        "title": "SERL: Self-Examining Reinforcement Learning on Open-Domain",
        "authors": [
            "Weixuan Ou",
            "Yanzhao Zheng",
            "Shuoshuo Sun",
            "Wei Zhang",
            "Baohua Dong",
            "Hangcheng Zhu",
            "Ruohui Huang",
            "Gang Yu",
            "Pengwei Yan",
            "Yifan Qiao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reinforcement Learning (RL) has been shown to improve the capabilities of large language models (LLMs). However, applying RL to open-domain tasks faces two key challenges: (1) the inherent subjectivity of these tasks prevents the verifiable rewards as required by Reinforcement Learning with Verifiable Rewards (RLVR); (2) Reinforcement Learning from Human Feedback (RLHF) relies on external reward mechanisms. To overcome these limitations, we propose Self-Examining Reinforcement Learning (SERL), a novel self-improving framework where the LLM serves as both Actor and Judge. SERL introduces two synergistic reward mechanisms without any external signals. On the one hand, to improve the Actor's capability, we derive rewards from Copeland-style pairwise comparison judgments across a group of generated responses. On the other hand, a self-consistency reward that encourages coherent judgments is proposed to improve the Judge's reliability. This process refines the Judge's capability, which in turn provides a more robust reward for Actor. Experiments show that our method outperforms existing self-improvement training methods. SERL improves the LC win rate of Qwen3-8B on AlpacaEval 2 from 52.37% to 59.90%. To the best of our knowledge, our method achieves state-of-the-art performance among self-improving approaches. Furthermore, it achieves a performance comparable to significantly larger models like Qwen3-32B, demonstrating superior effectiveness and robustness on open-domain tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07938",
        "abs_url": "https://arxiv.org/abs/2511.07938",
        "pdf_url": "https://arxiv.org/pdf/2511.07938",
        "title": "Predict-then-Optimize Method for Seaport Power-Logistics Scheduling: Generalization across Varying Tasks Stream",
        "authors": [
            "Chuanqing Pu",
            "Feilong Fan",
            "Nengling Tai",
            "Yan Xu",
            "Wentao Huang",
            "Honglin Wen"
        ],
        "comments": "Preprint to IEEE Transactions on Smart Grid",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Power-logistics scheduling in modern seaports typically follow a predict-then-optimize pipeline. To enhance decision quality, decision-focused learning has been proposed to align forecasting and optimization via end-to-end training. However, most formulations assume a fixed task configuration in downstream optimization, and thus generalize poorly to evolving task structures induced by varying seaport vessel arrivals. We address this gap with a decision-focused continual learning framework that adapts online to a stream of scheduling tasks. Specifically, we introduce Fisher information based regularization to enhance cross-task generalization by preserving parameters critical to prior tasks. A differentiable convex surrogate is also developed to stabilize gradient backpropagation. The proposed approach enables learning a decision-aligned forecasting model for new scheduling tasks while retaining generalization on earlier tasks. Experiments calibrated to the Jurong Port demonstrate superior decision performance and generalization over existing methods with reduced computational cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07970",
        "abs_url": "https://arxiv.org/abs/2511.07970",
        "pdf_url": "https://arxiv.org/pdf/2511.07970",
        "title": "Continual Unlearning for Text-to-Image Diffusion Models: A Regularization Perspective",
        "authors": [
            "Justin Lee",
            "Zheda Mai",
            "Jinsu Yoo",
            "Chongyu Fan",
            "Cheng Zhang",
            "Wei-Lun Chao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine unlearning--the ability to remove designated concepts from a pre-trained model--has advanced rapidly, particularly for text-to-image diffusion models. However, existing methods typically assume that unlearning requests arrive all at once, whereas in practice they often arrive sequentially. We present the first systematic study of continual unlearning in text-to-image diffusion models and show that popular unlearning methods suffer from rapid utility collapse: after only a few requests, models forget retained knowledge and generate degraded images. We trace this failure to cumulative parameter drift from the pre-training weights and argue that regularization is crucial to addressing it. To this end, we study a suite of add-on regularizers that (1) mitigate drift and (2) remain compatible with existing unlearning methods. Beyond generic regularizers, we show that semantic awareness is essential for preserving concepts close to the unlearning target, and propose a gradient-projection method that constrains parameter drift orthogonal to their subspace. This substantially improves continual unlearning performance and is complementary to other regularizers for further gains. Taken together, our study establishes continual unlearning as a fundamental challenge in text-to-image generation and provides insights, baselines, and open directions for advancing safe and accountable generative AI.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07971",
        "abs_url": "https://arxiv.org/abs/2511.07971",
        "pdf_url": "https://arxiv.org/pdf/2511.07971",
        "title": "Low-Rank Curvature for Zeroth-Order Optimization in LLM Fine-Tuning",
        "authors": [
            "Hyunseok Seung",
            "Jaewoo Lee",
            "Hyunsuk Ko"
        ],
        "comments": "Accepted to the AAAI Conference on Artificial Intelligence (AAAI-2026)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce LOREN, a curvature-aware zeroth-order (ZO) optimization method for fine-tuning large language models (LLMs). Existing ZO methods, which estimate gradients via finite differences using random perturbations, often suffer from high variance and suboptimal search directions. Our approach addresses these challenges by: (i) reformulating the problem of gradient preconditioning as that of adaptively estimating an anisotropic perturbation distribution for gradient estimation, (ii) capturing curvature through a low-rank block diagonal preconditioner using the framework of natural evolution strategies, and (iii) applying a REINFORCE leave-one-out (RLOO) gradient estimator to reduce variance. Experiments on standard LLM benchmarks show that our method outperforms state-of-the-art ZO methods by achieving higher accuracy and faster convergence, while cutting peak memory usage by up to 27.3% compared with MeZO-Adam.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08028",
        "abs_url": "https://arxiv.org/abs/2511.08028",
        "pdf_url": "https://arxiv.org/pdf/2511.08028",
        "title": "Generalizable Insights for Graph Transformers in Theory and Practice",
        "authors": [
            "Timo Stoll",
            "Luis Müller",
            "Christopher Morris"
        ],
        "comments": "Accepted at NeurIPS 2025 as spotlight",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph Transformers (GTs) have shown strong empirical performance, yet current architectures vary widely in their use of attention mechanisms, positional embeddings (PEs), and expressivity. Existing expressivity results are often tied to specific design choices and lack comprehensive empirical validation on large-scale data. This leaves a gap between theory and practice, preventing generalizable insights that exceed particular application domains. Here, we propose the Generalized-Distance Transformer (GDT), a GT architecture using standard attention that incorporates many advancements for GTs from recent years, and develop a fine-grained understanding of the GDT's representation power in terms of attention and PEs. Through extensive experiments, we identify design choices that consistently perform well across various applications, tasks, and model scales, demonstrating strong performance in a few-shot transfer setting without fine-tuning. Our evaluation covers over eight million graphs with roughly 270M tokens across diverse domains, including image-based object detection, molecular property prediction, code summarization, and out-of-distribution algorithmic reasoning. We distill our theoretical and practical findings into several generalizable insights about effective GT design, training, and inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08035",
        "abs_url": "https://arxiv.org/abs/2511.08035",
        "pdf_url": "https://arxiv.org/pdf/2511.08035",
        "title": "From Sequential to Recursive: Enhancing Decision-Focused Learning with Bidirectional Feedback",
        "authors": [
            "Xinyu Wang",
            "Jinxiao Du",
            "Yiyang Peng",
            "Wei Ma"
        ],
        "comments": "16 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Decision-focused learning (DFL) has emerged as a powerful end-to-end alternative to conventional predict-then-optimize (PTO) pipelines by directly optimizing predictive models through downstream decision losses. Existing DFL frameworks are limited by their strictly sequential structure, referred to as sequential DFL (S-DFL). However, S-DFL fails to capture the bidirectional feedback between prediction and optimization in complex interaction scenarios. In view of this, we first time propose recursive decision-focused learning (R-DFL), a novel framework that introduces bidirectional feedback between downstream optimization and upstream prediction. We further extend two distinct differentiation methods: explicit unrolling via automatic differentiation and implicit differentiation based on fixed-point methods, to facilitate efficient gradient propagation in R-DFL. We rigorously prove that both methods achieve comparable gradient accuracy, with the implicit method offering superior computational efficiency. Extensive experiments on both synthetic and real-world datasets, including the newsvendor problem and the bipartite matching problem, demonstrate that R-DFL not only substantially enhances the final decision quality over sequential baselines but also exhibits robust adaptability across diverse scenarios in closed-loop decision-making problems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08043",
        "abs_url": "https://arxiv.org/abs/2511.08043",
        "pdf_url": "https://arxiv.org/pdf/2511.08043",
        "title": "DynaAct: Large Language Model Reasoning with Dynamic Action Spaces",
        "authors": [
            "Xueliang Zhao",
            "Wei Wu",
            "Jian Guan",
            "Qintong Li",
            "Lingpeng Kong"
        ],
        "comments": "Accepted to NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "In modern sequential decision-making systems, the construction of an optimal candidate action space is critical to efficient inference. However, existing approaches either rely on manually defined action spaces that lack scalability or utilize unstructured spaces that render exhaustive search computationally prohibitive. In this paper, we propose a novel framework named \\textsc{DynaAct} for automatically constructing a compact action space to enhance sequential reasoning in complex problem-solving scenarios. Our method first estimates a proxy for the complete action space by extracting general sketches observed in a corpus covering diverse complex reasoning problems using large language models. We then formulate a submodular function that jointly evaluates candidate actions based on their utility to the current state and their diversity, and employ a greedy algorithm to select an optimal candidate set. Extensive experiments on six diverse standard benchmarks demonstrate that our approach significantly improves overall performance, while maintaining efficient inference without introducing substantial latency. The implementation is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08073",
        "abs_url": "https://arxiv.org/abs/2511.08073",
        "pdf_url": "https://arxiv.org/pdf/2511.08073",
        "title": "Online Linear Regression with Paid Stochastic Features",
        "authors": [
            "Nadav Merlis",
            "Kyoungseok Jang",
            "Nicolò Cesa-Bianchi"
        ],
        "comments": "Accepted to AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study an online linear regression setting in which the observed feature vectors are corrupted by noise and the learner can pay to reduce the noise level. In practice, this may happen for several reasons: for example, because features can be measured more accurately using more expensive equipment, or because data providers can be incentivized to release less private features. Assuming feature vectors are drawn i.i.d. from a fixed but unknown distribution, we measure the learner's regret against the linear predictor minimizing a notion of loss that combines the prediction error and payment. When the mapping between payments and noise covariance is known, we prove that the rate $\\sqrt{T}$ is optimal for regret if logarithmic factors are ignored. When the noise covariance is unknown, we show that the optimal regret rate becomes of order $T^{2/3}$ (ignoring log factors). Our analysis leverages matrix martingale concentration, showing that the empirical loss uniformly converges to the expected one for all payments and linear predictors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08077",
        "abs_url": "https://arxiv.org/abs/2511.08077",
        "pdf_url": "https://arxiv.org/pdf/2511.08077",
        "title": "An Integrated Fusion Framework for Ensemble Learning Leveraging Gradient Boosting and Fuzzy Rule-Based Models",
        "authors": [
            "Jinbo Li",
            "Peng Liu",
            "Long Chen",
            "Witold Pedrycz",
            "Weiping Ding"
        ],
        "comments": "15 pages, 6 figures. IEEE Transactions on Artificial Intelligence (2024)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "The integration of different learning paradigms has long been a focus of machine learning research, aimed at overcoming the inherent limitations of individual methods. Fuzzy rule-based models excel in interpretability and have seen widespread application across diverse fields. However, they face challenges such as complex design specifications and scalability issues with large datasets. The fusion of different techniques and strategies, particularly Gradient Boosting, with Fuzzy Rule-Based Models offers a robust solution to these challenges. This paper proposes an Integrated Fusion Framework that merges the strengths of both paradigms to enhance model performance and interpretability. At each iteration, a Fuzzy Rule-Based Model is constructed and controlled by a dynamic factor to optimize its contribution to the overall ensemble. This control factor serves multiple purposes: it prevents model dominance, encourages diversity, acts as a regularization parameter, and provides a mechanism for dynamic tuning based on model performance, thus mitigating the risk of overfitting. Additionally, the framework incorporates a sample-based correction mechanism that allows for adaptive adjustments based on feedback from a validation set. Experimental results substantiate the efficacy of the presented gradient boosting framework for fuzzy rule-based models, demonstrating performance enhancement, especially in terms of mitigating overfitting and complexity typically associated with many rules. By leveraging an optimal factor to govern the contribution of each model, the framework improves performance, maintains interpretability, and simplifies the maintenance and update of the models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08083",
        "abs_url": "https://arxiv.org/abs/2511.08083",
        "pdf_url": "https://arxiv.org/pdf/2511.08083",
        "title": "HipKittens: Fast and Furious AMD Kernels",
        "authors": [
            "William Hu",
            "Drew Wadsworth",
            "Sean Siddens",
            "Stanley Winata",
            "Daniel Y. Fu",
            "Ryann Swann",
            "Muhammad Osama",
            "Christopher Ré",
            "Simran Arora"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "AMD GPUs offer state-of-the-art compute and memory bandwidth; however, peak performance AMD kernels are written in raw assembly. To address the difficulty of mapping AI algorithms to hardware, recent work proposes C++ embedded and PyTorch-inspired domain-specific languages like ThunderKittens (TK) to simplify high performance AI kernel development on NVIDIA hardware. We explore the extent to which such primitives -- for explicit tile-based programming with optimized memory accesses and fine-grained asynchronous execution across workers -- are NVIDIA-specific or general. We provide the first detailed study of the programming primitives that lead to performant AMD AI kernels, and we encapsulate these insights in the HipKittens (HK) programming framework. We find that tile-based abstractions used in prior DSLs generalize to AMD GPUs, however we need to rethink the algorithms that instantiate these abstractions for AMD. We validate the HK primitives across CDNA3 and CDNA4 AMD platforms. In evaluations, HK kernels compete with AMD's hand-optimized assembly kernels for GEMMs and attention, and consistently outperform compiler baselines. Moreover, assembly is difficult to scale to the breadth of AI workloads; reflecting this, in some settings HK outperforms all available kernel baselines by $1.2-2.4\\times$ (e.g., $d=64$ attention, GQA backwards, memory-bound kernels). These findings help pave the way for a single, tile-based software layer for high-performance AI kernels that translates across GPU vendors. HipKittens is released at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08094",
        "abs_url": "https://arxiv.org/abs/2511.08094",
        "pdf_url": "https://arxiv.org/pdf/2511.08094",
        "title": "Stuart-Landau Oscillatory Graph Neural Network",
        "authors": [
            "Kaicheng Zhang",
            "David N. Reynolds",
            "Piero Deidda",
            "Francesco Tudisco"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Oscillatory Graph Neural Networks (OGNNs) are an emerging class of physics-inspired architectures designed to mitigate oversmoothing and vanishing gradient problems in deep GNNs. In this work, we introduce the Complex-Valued Stuart-Landau Graph Neural Network (SLGNN), a novel architecture grounded in Stuart-Landau oscillator dynamics. Stuart-Landau oscillators are canonical models of limit-cycle behavior near Hopf bifurcations, which are fundamental to synchronization theory and are widely used in e.g. neuroscience for mesoscopic brain modeling. Unlike harmonic oscillators and phase-only Kuramoto models, Stuart-Landau oscillators retain both amplitude and phase dynamics, enabling rich phenomena such as amplitude regulation and multistable synchronization. The proposed SLGNN generalizes existing phase-centric Kuramoto-based OGNNs by allowing node feature amplitudes to evolve dynamically according to Stuart-Landau dynamics, with explicit tunable hyperparameters (such as the Hopf-parameter and the coupling strength) providing additional control over the interplay between feature amplitudes and network structure. We conduct extensive experiments across node classification, graph classification, and graph regression tasks, demonstrating that SLGNN outperforms existing OGNNs and establishes a novel, expressive, and theoretically grounded framework for deep oscillatory architectures on graphs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08136",
        "abs_url": "https://arxiv.org/abs/2511.08136",
        "pdf_url": "https://arxiv.org/pdf/2511.08136",
        "title": "SafeMIL: Learning Offline Safe Imitation Policy from Non-Preferred Trajectories",
        "authors": [
            "Returaj Burnwal",
            "Nirav Pravinbhai Bhatt",
            "Balaraman Ravindran"
        ],
        "comments": "18 pages, AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Machine Learning (stat.ML)",
        "abstract": "In this work, we study the problem of offline safe imitation learning (IL). In many real-world settings, online interactions can be risky, and accurately specifying the reward and the safety cost information at each timestep can be difficult. However, it is often feasible to collect trajectories reflecting undesirable or risky behavior, implicitly conveying the behavior the agent should avoid. We refer to these trajectories as non-preferred trajectories. Unlike standard IL, which aims to mimic demonstrations, our agent must also learn to avoid risky behavior using non-preferred trajectories. In this paper, we propose a novel approach, SafeMIL, to learn a parameterized cost that predicts if the state-action pair is risky via \\textit{Multiple Instance Learning}. The learned cost is then used to avoid non-preferred behaviors, resulting in a policy that prioritizes safety. We empirically demonstrate that our approach can learn a safer policy that satisfies cost constraints without degrading the reward performance, thereby outperforming several baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08142",
        "abs_url": "https://arxiv.org/abs/2511.08142",
        "pdf_url": "https://arxiv.org/pdf/2511.08142",
        "title": "BIPPO: Budget-Aware Independent PPO for Energy-Efficient Federated Learning Services",
        "authors": [
            "Anna Lackinger",
            "Andrea Morichetta",
            "Pantelis A. Frangoudis",
            "Schahram Dustdar"
        ],
        "comments": "This work has been submitted to the IEEE for possible publication",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC); Multiagent Systems (cs.MA)",
        "abstract": "Federated Learning (FL) is a promising machine learning solution in large-scale IoT systems, guaranteeing load distribution and privacy. However, FL does not natively consider infrastructure efficiency, a critical concern for systems operating in resource-constrained environments. Several Reinforcement Learning (RL) based solutions offer improved client selection for FL; however, they do not consider infrastructure challenges, such as resource limitations and device churn. Furthermore, the training of RL methods is often not designed for practical application, as these approaches frequently do not consider generalizability and are not optimized for energy efficiency. To fill this gap, we propose BIPPO (Budget-aware Independent Proximal Policy Optimization), which is an energy-efficient multi-agent RL solution that improves performance. We evaluate BIPPO on two image classification tasks run in a highly budget-constrained setting, with FL clients training on non-IID data, a challenging context for vanilla FL. The improved sampler of BIPPO enables it to increase the mean accuracy compared to non-RL mechanisms, traditional PPO, and IPPO. In addition, BIPPO only consumes a negligible proportion of the budget, which stays consistent even if the number of clients increases. Overall, BIPPO delivers a performant, stable, scalable, and sustainable solution for client selection in IoT-FL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08185",
        "abs_url": "https://arxiv.org/abs/2511.08185",
        "pdf_url": "https://arxiv.org/pdf/2511.08185",
        "title": "Improving Long-Range Interactions in Graph Neural Simulators via Hamiltonian Dynamics",
        "authors": [
            "Tai Hoang",
            "Alessandro Trenta",
            "Alessio Gravina",
            "Niklas Freymuth",
            "Philipp Becker",
            "Davide Bacciu",
            "Gerhard Neumann"
        ],
        "comments": "31 pages, including the appendix",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Learning to simulate complex physical systems from data has emerged as a promising way to overcome the limitations of traditional numerical solvers, which often require prohibitive computational costs for high-fidelity solutions. Recent Graph Neural Simulators (GNSs) accelerate simulations by learning dynamics on graph-structured data, yet often struggle to capture long-range interactions and suffer from error accumulation under autoregressive rollouts. To address these challenges, we propose Information-preserving Graph Neural Simulators (IGNS), a graph-based neural simulator built on the principles of Hamiltonian dynamics. This structure guarantees preservation of information across the graph, while extending to port-Hamiltonian systems allows the model to capture a broader class of dynamics, including non-conservative effects. IGNS further incorporates a warmup phase to initialize global context, geometric encoding to handle irregular meshes, and a multi-step training objective to reduce rollout error. To evaluate these properties systematically, we introduce new benchmarks that target long-range dependencies and challenging external forcing scenarios. Across all tasks, IGNS consistently outperforms state-of-the-art GNSs, achieving higher accuracy and stability under challenging and complex dynamical systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08229",
        "abs_url": "https://arxiv.org/abs/2511.08229",
        "pdf_url": "https://arxiv.org/pdf/2511.08229",
        "title": "Towards Non-Stationary Time Series Forecasting with Temporal Stabilization and Frequency Differencing",
        "authors": [
            "Junkai Lu",
            "Peng Chen",
            "Chenjuan Guo",
            "Yang Shu",
            "Meng Wang",
            "Bin Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series forecasting is critical for decision-making across dynamic domains such as energy, finance, transportation, and cloud computing. However, real-world time series often exhibit non-stationarity, including temporal distribution shifts and spectral variability, which pose significant challenges for long-term time series forecasting. In this paper, we propose DTAF, a dual-branch framework that addresses non-stationarity in both the temporal and frequency domains. For the temporal domain, the Temporal Stabilizing Fusion (TFS) module employs a non-stationary mix of experts (MOE) filter to disentangle and suppress temporal non-stationary patterns while preserving long-term dependencies. For the frequency domain, the Frequency Wave Modeling (FWM) module applies frequency differencing to dynamically highlight components with significant spectral shifts. By fusing the complementary outputs of TFS and FWM, DTAF generates robust forecasts that adapt to both temporal and frequency domain non-stationarity. Extensive experiments on real-world benchmarks demonstrate that DTAF outperforms state-of-the-art baselines, yielding significant improvements in forecasting accuracy under non-stationary conditions. All codes are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08241",
        "abs_url": "https://arxiv.org/abs/2511.08241",
        "pdf_url": "https://arxiv.org/pdf/2511.08241",
        "title": "PrefPoE: Advantage-Guided Preference Fusion for Learning Where to Explore",
        "authors": [
            "Zhihao Lin",
            "Lin Wu",
            "Zhen Tian",
            "Jianglin Lan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Exploration in reinforcement learning remains a critical challenge, as naive entropy maximization often results in high variance and inefficient policy updates. We introduce \\textbf{PrefPoE}, a novel \\textit{Preference-Product-of-Experts} framework that performs intelligent, advantage-guided exploration via the first principled application of product-of-experts (PoE) fusion for single-task exploration-exploitation balancing. By training a preference network to concentrate probability mass on high-advantage actions and fusing it with the main policy through PoE, PrefPoE creates a \\textbf{soft trust region} that stabilizes policy updates while maintaining targeted exploration. Across diverse control tasks spanning both continuous and discrete action spaces, PrefPoE demonstrates consistent improvements: +321\\% on HalfCheetah-v4 (1276~$\\rightarrow$~5375), +69\\% on Ant-v4, +276\\% on LunarLander-v2, with consistently enhanced training stability and sample efficiency. Unlike standard PPO, which suffers from entropy collapse, PrefPoE sustains adaptive exploration through its unique dynamics, thereby preventing premature convergence and enabling superior performance. Our results establish that learning \\textit{where to explore} through advantage-guided preferences is as crucial as learning how to act, offering a general framework for enhancing policy gradient methods across the full spectrum of reinforcement learning domains. Code and pretrained models are available in supplementary materials.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08243",
        "abs_url": "https://arxiv.org/abs/2511.08243",
        "pdf_url": "https://arxiv.org/pdf/2511.08243",
        "title": "A Unified Geometric Field Theory Framework for Transformers: From Manifold Embeddings to Kernel Modulation",
        "authors": [
            "Xianshuai Shi",
            "Jianfeng Zhu",
            "Leibo Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The Transformer architecture has achieved tremendous success in natural language processing, computer vision, and scientific computing through its self-attention mechanism. However, its core components-positional encoding and attention mechanisms-have lacked a unified physical or mathematical interpretation. This paper proposes a structural theoretical framework that integrates positional encoding, kernel integral operators, and attention mechanisms for in-depth theoretical investigation. We map discrete positions (such as text token indices and image pixel coordinates) to spatial functions on continuous manifolds, enabling a field-theoretic interpretation of Transformer layers as kernel-modulated operators acting over embedded manifolds.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08260",
        "abs_url": "https://arxiv.org/abs/2511.08260",
        "pdf_url": "https://arxiv.org/pdf/2511.08260",
        "title": "Data-Driven Discovery of Feature Groups in Clinical Time Series",
        "authors": [
            "Fedor Sergeev",
            "Manuel Burger",
            "Polina Leshetkina",
            "Vincent Fortuin",
            "Gunnar Rätsch",
            "Rita Kuznetsova"
        ],
        "comments": "Machine Learning for Health (ML4H) 2025 in Proceedings of Machine Learning Research 297",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Clinical time series data are critical for patient monitoring and predictive modeling. These time series are typically multivariate and often comprise hundreds of heterogeneous features from different data sources. The grouping of features based on similarity and relevance to the prediction task has been shown to enhance the performance of deep learning architectures. However, defining these groups a priori using only semantic knowledge is challenging, even for domain experts. To address this, we propose a novel method that learns feature groups by clustering weights of feature-wise embedding layers. This approach seamlessly integrates into standard supervised training and discovers the groups that directly improve downstream performance on clinically relevant tasks. We demonstrate that our method outperforms static clustering approaches on synthetic data and achieves performance comparable to expert-defined groups on real-world medical data. Moreover, the learned feature groups are clinically interpretable, enabling data-driven discovery of task-relevant relationships between variables.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08281",
        "abs_url": "https://arxiv.org/abs/2511.08281",
        "pdf_url": "https://arxiv.org/pdf/2511.08281",
        "title": "Rethinking Explanation Evaluation under the Retraining Scheme",
        "authors": [
            "Yi Cai",
            "Thibaud Ardoin",
            "Mayank Gulati",
            "Gerhard Wunder"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Feature attribution has gained prominence as a tool for explaining model decisions, yet evaluating explanation quality remains challenging due to the absence of ground-truth explanations. To circumvent this, explanation-guided input manipulation has emerged as an indirect evaluation strategy, measuring explanation effectiveness through the impact of input modifications on model outcomes during inference. Despite the widespread use, a major concern with inference-based schemes is the distribution shift caused by such manipulations, which undermines the reliability of their assessments. The retraining-based scheme ROAR overcomes this issue by adapting the model to the altered data distribution. However, its evaluation results often contradict the theoretical foundations of widely accepted explainers. This work investigates this misalignment between empirical observations and theoretical expectations. In particular, we identify the sign issue as a key factor responsible for residual information that ultimately distorts retraining-based evaluation. Based on the analysis, we show that a straightforward reframing of the evaluation process can effectively resolve the identified issue. Building on the existing framework, we further propose novel variants that jointly structure a comprehensive perspective on explanation evaluation. These variants largely improve evaluation efficiency over the standard retraining protocol, thereby enhancing practical applicability for explainer selection and benchmarking. Following our proposed schemes, empirical results across various data scales provide deeper insights into the performance of carefully selected explainers, revealing open challenges and future directions in explainability research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08305",
        "abs_url": "https://arxiv.org/abs/2511.08305",
        "pdf_url": "https://arxiv.org/pdf/2511.08305",
        "title": "Test-time Diverse Reasoning by Riemannian Activation Steering",
        "authors": [
            "Ly Tran Ho Khanh",
            "Dongxuan Zhu",
            "Man-Chung Yue",
            "Viet Anh Nguyen"
        ],
        "comments": "19 pages, 6 figures. Accepted for publication at AAAI 2026 (40th AAAI Conference on Artificial Intelligence)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Best-of-$N$ reasoning improves the accuracy of language models in solving complex tasks by sampling multiple candidate solutions and then selecting the best one based on some criteria. A critical bottleneck for this strategy is the output diversity limit, which occurs when the model generates similar outputs despite stochastic sampling, and hence recites the same error. To address this lack of variance in reasoning paths, we propose a novel unsupervised activation steering strategy that simultaneously optimizes the steering vectors for multiple reasoning trajectories at test time. At any synchronization anchor along the batch generation process, we find the steering vectors that maximize the total volume spanned by all possible intervened activation subsets. We demonstrate that these steering vectors can be determined by solving a Riemannian optimization problem over the product of spheres with a log-determinant objective function. We then use a Riemannian block-coordinate descent algorithm with a well-tuned learning rate to obtain a stationary point of the problem, and we apply these steering vectors until the generation process reaches the subsequent synchronization anchor. Empirical evaluations on popular mathematical benchmarks demonstrate that our test-time Riemannian activation steering strategy outperforms vanilla sampling techniques in terms of generative diversity and solution accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08331",
        "abs_url": "https://arxiv.org/abs/2511.08331",
        "pdf_url": "https://arxiv.org/pdf/2511.08331",
        "title": "Adversarial Bias: Data Poisoning Attacks on Fairness",
        "authors": [
            "Eunice Chan",
            "Hanghang Tong"
        ],
        "comments": "15 pages, 9 figures, shortened version in BigData 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "With the growing adoption of AI and machine learning systems in real-world applications, ensuring their fairness has become increasingly critical. The majority of the work in algorithmic fairness focus on assessing and improving the fairness of machine learning systems. There is relatively little research on fairness vulnerability, i.e., how an AI system's fairness can be intentionally compromised. In this work, we first provide a theoretical analysis demonstrating that a simple adversarial poisoning strategy is sufficient to induce maximally unfair behavior in naive Bayes classifiers. Our key idea is to strategically inject a small fraction of carefully crafted adversarial data points into the training set, biasing the model's decision boundary to disproportionately affect a protected group while preserving generalizable performance. To illustrate the practical effectiveness of our method, we conduct experiments across several benchmark datasets and models. We find that our attack significantly outperforms existing methods in degrading fairness metrics across multiple models and datasets, often achieving substantially higher levels of unfairness with a comparable or only slightly worse impact on accuracy. Notably, our method proves effective on a wide range of models, in contrast to prior work, demonstrating a robust and potent approach to compromising the fairness of machine learning systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08340",
        "abs_url": "https://arxiv.org/abs/2511.08340",
        "pdf_url": "https://arxiv.org/pdf/2511.08340",
        "title": "HN-MVTS: HyperNetwork-based Multivariate Time Series Forecasting",
        "authors": [
            "Andrey Savchenko",
            "Oleg Kachan"
        ],
        "comments": "AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Accurate forecasting of multivariate time series data remains a formidable challenge, particularly due to the growing complexity of temporal dependencies in real-world scenarios. While neural network-based models have achieved notable success in this domain, complex channel-dependent models often suffer from performance degradation compared to channel-independent models that do not consider the relationship between components but provide high robustness due to small capacity. In this work, we propose HN-MVTS, a novel architecture that integrates a hypernetwork-based generative prior with an arbitrary neural network forecasting model. The input of this hypernetwork is a learnable embedding matrix of time series components. To restrict the number of new parameters, the hypernetwork learns to generate the weights of the last layer of the target forecasting networks, serving as a data-adaptive regularizer that improves generalization and long-range predictive accuracy. The hypernetwork is used only during the training, so it does not increase the inference time compared to the base forecasting model. Extensive experiments on eight benchmark datasets demonstrate that application of HN-MVTS to the state-of-the-art models (DLinear, PatchTST, TSMixer, etc.) typically improves their performance. Our findings suggest that hypernetwork-driven parameterization offers a promising direction for enhancing existing forecasting techniques in complex scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08361",
        "abs_url": "https://arxiv.org/abs/2511.08361",
        "pdf_url": "https://arxiv.org/pdf/2511.08361",
        "title": "From Confusion to Clarity: ProtoScore - A Framework for Evaluating Prototype-Based XAI",
        "authors": [
            "Helena Monke",
            "Benjamin Sae-Chew",
            "Benjamin Fresz",
            "Marco F. Huber"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The complexity and opacity of neural networks (NNs) pose significant challenges, particularly in high-stakes fields such as healthcare, finance, and law, where understanding decision-making processes is crucial. To address these issues, the field of explainable artificial intelligence (XAI) has developed various methods aimed at clarifying AI decision-making, thereby facilitating appropriate trust and validating the fairness of outcomes. Among these methods, prototype-based explanations offer a promising approach that uses representative examples to elucidate model behavior. However, a critical gap exists regarding standardized benchmarks to objectively compare prototype-based XAI methods, especially in the context of time series data. This lack of reliable benchmarks results in subjective evaluations, hindering progress in the field. We aim to establish a robust framework, ProtoScore, for assessing prototype-based XAI methods across different data types with a focus on time series data, facilitating fair and comprehensive evaluations. By integrating the Co-12 properties of Nauta et al., this framework allows for effectively comparing prototype methods against each other and against other XAI methods, ultimately assisting practitioners in selecting appropriate explanation methods while minimizing the costs associated with user studies. All code is publicly available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08371",
        "abs_url": "https://arxiv.org/abs/2511.08371",
        "pdf_url": "https://arxiv.org/pdf/2511.08371",
        "title": "Multi-objective Hyperparameter Optimization in the Age of Deep Learning",
        "authors": [
            "Soham Basu",
            "Frank Hutter",
            "Danny Stoll"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "While Deep Learning (DL) experts often have prior knowledge about which hyperparameter settings yield strong performance, only few Hyperparameter Optimization (HPO) algorithms can leverage such prior knowledge and none incorporate priors over multiple objectives. As DL practitioners often need to optimize not just one but many objectives, this is a blind spot in the algorithmic landscape of HPO. To address this shortcoming, we introduce PriMO, the first HPO algorithm that can integrate multi-objective user beliefs. We show PriMO achieves state-of-the-art performance across 8 DL benchmarks in the multi-objective and single-objective setting, clearly positioning itself as the new go-to HPO algorithm for DL practitioners.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08396",
        "abs_url": "https://arxiv.org/abs/2511.08396",
        "pdf_url": "https://arxiv.org/pdf/2511.08396",
        "title": "EMAformer: Enhancing Transformer through Embedding Armor for Time Series Forecasting",
        "authors": [
            "Zhiwei Zhang",
            "Xinyi Du",
            "Xuanchi Guo",
            "Weihao Wang",
            "Wenjuan Han"
        ],
        "comments": "14 pages, 9 figures, 6 tables, accepted by AAAI2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multivariate time series forecasting is crucial across a wide range of domains. While presenting notable progress for the Transformer architecture, iTransformer still lags behind the latest MLP-based models. We attribute this performance gap to unstable inter-channel relationships. To bridge this gap, we propose EMAformer, a simple yet effective model that enhances the Transformer with an auxiliary embedding suite, akin to armor that reinforces its ability. By introducing three key inductive biases, i.e., \\textit{global stability}, \\textit{phase sensitivity}, and \\textit{cross-axis specificity}, EMAformer unlocks the further potential of the Transformer architecture, achieving state-of-the-art performance on 12 real-world benchmarks and reducing forecasting errors by an average of 2.73\\% in MSE and 5.15\\% in MAE. This significantly advances the practical applicability of Transformer-based approaches for multivariate time series forecasting. The code is available on this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08412",
        "abs_url": "https://arxiv.org/abs/2511.08412",
        "pdf_url": "https://arxiv.org/pdf/2511.08412",
        "title": "ARAC: Adaptive Regularized Multi-Agent Soft Actor-Critic in Graph-Structured Adversarial Games",
        "authors": [
            "Ruochuan Shi",
            "Runyu Lu",
            "Yuanheng Zhu",
            "Dongbin Zhao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In graph-structured multi-agent reinforcement learning (MARL) adversarial tasks such as pursuit and confrontation, agents must coordinate under highly dynamic interactions, where sparse rewards hinder efficient policy learning. We propose Adaptive Regularized Multi-Agent Soft Actor-Critic (ARAC), which integrates an attention-based graph neural network (GNN) for modeling agent dependencies with an adaptive divergence regularization mechanism. The GNN enables expressive representation of spatial relations and state features in graph environments. Divergence regularization can serve as policy guidance to alleviate the sparse reward problem, but it may lead to suboptimal convergence when the reference policy itself is imperfect. The adaptive divergence regularization mechanism enables the framework to exploit reference policies for efficient exploration in the early stages, while gradually reducing reliance on them as training progresses to avoid inheriting their limitations. Experiments in pursuit and confrontation scenarios demonstrate that ARAC achieves faster convergence, higher final success rates, and stronger scalability across varying numbers of agents compared with MARL baselines, highlighting its effectiveness in complex graph-structured environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08418",
        "abs_url": "https://arxiv.org/abs/2511.08418",
        "pdf_url": "https://arxiv.org/pdf/2511.08418",
        "title": "Physics-Informed Neural Operators for Cardiac Electrophysiology",
        "authors": [
            "Hannah Lydon",
            "Milad Kazemi",
            "Martin Bishop",
            "Nicola Paoletti"
        ],
        "comments": "All code used in this work, including experimental results, can be found at this https URL This work was submitted for review at the 2026 L4DC conference",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurately simulating systems governed by PDEs, such as voltage fields in cardiac electrophysiology (EP) modelling, remains a significant modelling challenge. Traditional numerical solvers are computationally expensive and sensitive to discretisation, while canonical deep learning methods are data-hungry and struggle with chaotic dynamics and long-term predictions. Physics-Informed Neural Networks (PINNs) mitigate some of these issues by incorporating physical constraints in the learning process, yet they remain limited by mesh resolution and long-term predictive stability. In this work, we propose a Physics-Informed Neural Operator (PINO) approach to solve PDE problems in cardiac EP. Unlike PINNs, PINO models learn mappings between function spaces, allowing them to generalise to multiple mesh resolutions and initial conditions. Our results show that PINO models can accurately reproduce cardiac EP dynamics over extended time horizons and across multiple propagation scenarios, including zero-shot evaluations on scenarios unseen during training. Additionally, our PINO models maintain high predictive quality in long roll-outs (where predictions are recursively fed back as inputs), and can scale their predictive resolution by up to 10x the training resolution. These advantages come with a significant reduction in simulation time compared to numerical PDE solvers, highlighting the potential of PINO-based approaches for efficient and scalable cardiac EP simulations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08425",
        "abs_url": "https://arxiv.org/abs/2511.08425",
        "pdf_url": "https://arxiv.org/pdf/2511.08425",
        "title": "HardFlow: Hard-Constrained Sampling for Flow-Matching Models via Trajectory Optimization",
        "authors": [
            "Zeyang Li",
            "Kaveh Alim",
            "Navid Azizan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Diffusion and flow-matching have emerged as powerful methodologies for generative modeling, with remarkable success in capturing complex data distributions and enabling flexible guidance at inference time. Many downstream applications, however, demand enforcing hard constraints on generated samples (for example, robot trajectories must avoid obstacles), a requirement that goes beyond simple guidance. Prevailing projection-based approaches constrain the entire sampling path to the constraint manifold, which is overly restrictive and degrades sample quality. In this paper, we introduce a novel framework that reformulates hard-constrained sampling as a trajectory optimization problem. Our key insight is to leverage numerical optimal control to steer the sampling trajectory so that constraints are satisfied precisely at the terminal time. By exploiting the underlying structure of flow-matching models and adopting techniques from model predictive control, we transform this otherwise complex constrained optimization problem into a tractable surrogate that can be solved efficiently and effectively. Furthermore, this trajectory optimization perspective offers significant flexibility beyond mere constraint satisfaction, allowing for the inclusion of integral costs to minimize distribution shift and terminal objectives to further enhance sample quality, all within a unified framework. We provide a control-theoretic analysis of our method, establishing bounds on the approximation error between our tractable surrogate and the ideal formulation. Extensive experiments across diverse domains, including robotics (planning), partial differential equations (boundary control), and vision (text-guided image editing), demonstrate that our algorithm, which we name $\\textit{HardFlow}$, substantially outperforms existing methods in both constraint satisfaction and sample quality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08427",
        "abs_url": "https://arxiv.org/abs/2511.08427",
        "pdf_url": "https://arxiv.org/pdf/2511.08427",
        "title": "An update to PYRO-NN: A Python Library for Differentiable CT Operators",
        "authors": [
            "Linda-Sophie Schneider",
            "Yipeng Sun",
            "Chengze Ye",
            "Markus Michen",
            "Andreas Maier"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep learning has brought significant advancements to X-ray Computed Tomography (CT) reconstruction, offering solutions to challenges arising from modern imaging technologies. These developments benefit from methods that combine classical reconstruction techniques with data-driven approaches. Differentiable operators play a key role in this integration by enabling end-to-end optimization and the incorporation of physical modeling within neural networks. In this work, we present an updated version of PYRO-NN, a Python-based library for differentiable CT reconstruction. The updated framework extends compatibility to PyTorch and introduces native CUDA kernel support for efficient projection and back-projection operations across parallel, fan, and cone-beam geometries. Additionally, it includes tools for simulating imaging artifacts, modeling arbitrary acquisition trajectories, and creating flexible, end-to-end trainable pipelines through a high-level Python API. Code is available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08440",
        "abs_url": "https://arxiv.org/abs/2511.08440",
        "pdf_url": "https://arxiv.org/pdf/2511.08440",
        "title": "Coherence Mechanisms for Provable Self-Improvement",
        "authors": [
            "Mehryar Mohri",
            "Jon Schneider",
            "Yifan Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Self-improvement is a critical capability for large language models and other intelligent systems, enabling them to refine their behavior and internal consistency without external supervision. Despite its importance, prior approaches largely rely on empirical heuristics and lack formal guarantees. In this paper, we propose a principled framework for self-improvement based on the concept of \\emph{coherence}, which requires that a model's outputs remain consistent under task-preserving transformations of the input. We formalize this concept using projection-based mechanisms that update a baseline model to be coherent while remaining as close as possible to its original behavior. We provide rigorous theoretical guarantees that these mechanisms achieve \\emph{monotonic improvement}, measured by a reduction in expected Bregman divergence. Our analysis is comprehensive, covering both \\emph{direct} and \\emph{two-step} projection methods, and robustly extends these guarantees to non-realizable settings, empirical (finite-sample) distributions, and relaxed coherence constraints. Furthermore, we establish a general \\emph{characterization theorem}, showing that any mechanism with similar provable improvement guarantees must inherently conform to a coherence-based structure. This culminates in rigidity results under the demand for universal improvement, establishing coherence as a fundamental and, in a formal sense, necessary principle for provable self-improvement.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08444",
        "abs_url": "https://arxiv.org/abs/2511.08444",
        "pdf_url": "https://arxiv.org/pdf/2511.08444",
        "title": "One Model for All: Universal Pre-training for EEG based Emotion Recognition across Heterogeneous Datasets and Paradigms",
        "authors": [
            "Xiang Li",
            "You Li",
            "Yazhou Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "EEG-based emotion recognition is hampered by profound dataset heterogeneity (channel/subject variability), hindering generalizable models. Existing approaches struggle to transfer knowledge effectively. We propose 'One Model for All', a universal pre-training framework for EEG analysis across disparate datasets. Our paradigm decouples learning into two stages: (1) Univariate pre-training via self-supervised contrastive learning on individual channels, enabled by a Unified Channel Schema (UCS) that leverages the channel union (e.g., SEED-62ch, DEAP-32ch); (2) Multivariate fine-tuning with a novel 'ART' (Adaptive Resampling Transformer) and 'GAT' (Graph Attention Network) architecture to capture complex spatio-temporal dependencies. Experiments show universal pre-training is an essential stabilizer, preventing collapse on SEED (vs. scratch) and yielding substantial gains on DEAP (+7.65%) and DREAMER (+3.55%). Our framework achieves new SOTA performance on all within-subject benchmarks: SEED (99.27%), DEAP (93.69%), and DREAMER (93.93%). We also show SOTA cross-dataset transfer, achieving 94.08% (intersection) and 93.05% (UCS) on the unseen DREAMER dataset, with the former surpassing the within-domain pre-training benchmark. Ablation studies validate our architecture: the GAT module is critical, yielding a +22.19% gain over GCN on the high-noise DEAP dataset, and its removal causes a catastrophic -16.44% performance drop. This work paves the way for more universal, scalable, and effective pre-trained models for diverse EEG analysis tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08470",
        "abs_url": "https://arxiv.org/abs/2511.08470",
        "pdf_url": "https://arxiv.org/pdf/2511.08470",
        "title": "Binary Split Categorical feature with Mean Absolute Error Criteria in CART",
        "authors": [
            "Peng Yu",
            "Yike Chen",
            "Chao Xu",
            "Albert Bifet",
            "Jesse Read"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "In the context of the Classification and Regression Trees (CART) algorithm, the efficient splitting of categorical features using standard criteria like GINI and Entropy is well-established. However, using the Mean Absolute Error (MAE) criterion for categorical features has traditionally relied on various numerical encoding methods. This paper demonstrates that unsupervised numerical encoding methods are not viable for the MAE criteria. Furthermore, we present a novel and efficient splitting algorithm that addresses the challenges of handling categorical features with the MAE criterion. Our findings underscore the limitations of existing approaches and offer a promising solution to enhance the handling of categorical data in CART algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08513",
        "abs_url": "https://arxiv.org/abs/2511.08513",
        "pdf_url": "https://arxiv.org/pdf/2511.08513",
        "title": "Clustering Guided Residual Neural Networks for Multi-Tx Localization in Molecular Communications",
        "authors": [
            "Ali Sonmez",
            "Erencem Ozbey",
            "Efe Feyzi Mantaroglu",
            "H. Birkan Yilmaz"
        ],
        "comments": "5 pages, 4 figures, 3 tables",
        "subjects": "Machine Learning (cs.LG); Emerging Technologies (cs.ET)",
        "abstract": "Transmitter localization in Molecular Communication via Diffusion is a critical topic with many applications. However, accurate localization of multiple transmitters is a challenging problem due to the stochastic nature of diffusion and overlapping molecule distributions at the receiver surface. To address these issues, we introduce clustering-based centroid correction methods that enhance robustness against density variations, and outliers. In addition, we propose two clusteringguided Residual Neural Networks, namely AngleNN for direction refinement and SizeNN for cluster size estimation. Experimental results show that both approaches provide significant improvements with reducing localization error between 69% (2-Tx) and 43% (4-Tx) compared to the K-means.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08552",
        "abs_url": "https://arxiv.org/abs/2511.08552",
        "pdf_url": "https://arxiv.org/pdf/2511.08552",
        "title": "FMMI: Flow Matching Mutual Information Estimation",
        "authors": [
            "Ivan Butakov",
            "Alexander Semenenko",
            "Alexey Frolov",
            "Ivan Oseledets"
        ],
        "comments": "11 pages",
        "subjects": "Machine Learning (cs.LG); Information Theory (cs.IT)",
        "abstract": "We introduce a novel Mutual Information (MI) estimator that fundamentally reframes the discriminative approach. Instead of training a classifier to discriminate between joint and marginal distributions, we learn a normalizing flow that transforms one into the other. This technique produces a computationally efficient and precise MI estimate that scales well to high dimensions and across a wide range of ground-truth MI values.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08570",
        "abs_url": "https://arxiv.org/abs/2511.08570",
        "pdf_url": "https://arxiv.org/pdf/2511.08570",
        "title": "Automatic Grid Updates for Kolmogorov-Arnold Networks using Layer Histograms",
        "authors": [
            "Jamison Moody",
            "James Usevitch"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Kolmogorov-Arnold Networks (KANs) are a class of neural networks that have received increased attention in recent literature. In contrast to MLPs, KANs leverage parameterized, trainable activation functions and offer several benefits including improved interpretability and higher accuracy on learning symbolic equations. However, the original KAN architecture requires adjustments to the domain discretization of the network (called the \"domain grid\") during training, creating extra overhead for the user in the training process. Typical KAN layers are not designed with the ability to autonomously update their domains in a data-driven manner informed by the changing output ranges of previous layers. As an added benefit, this histogram algorithm may also be applied towards detecting out-of-distribution (OOD) inputs in a variety of settings. We demonstrate that AdaptKAN exceeds or matches the performance of prior KAN architectures and MLPs on four different tasks: learning scientific equations from the Feynman dataset, image classification from frozen features, learning a control Lyapunov function, and detecting OOD inputs on the OpenOOD v1.5 benchmark.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07428",
        "abs_url": "https://arxiv.org/abs/2511.07428",
        "pdf_url": "https://arxiv.org/pdf/2511.07428",
        "title": "Resource Allocation in Hybrid Radio-Optical IoT Networks using GNN with Multi-task Learning",
        "authors": [
            "Aymen Hamrouni",
            "Sofie Pollin",
            "Hazem Sallouha"
        ],
        "comments": "20 pages, 17 figures, 3 tables",
        "subjects": "Networking and Internet Architecture (cs.NI); Machine Learning (cs.LG)",
        "abstract": "This paper addresses the problem of dual-technology scheduling in hybrid Internet of Things (IoT) networks that integrate Optical Wireless Communication (OWC) alongside Radio Frequency (RF). We begin by formulating a Mixed-Integer Nonlinear Programming (MINLP) model that jointly considers throughput maximization and delay minimization between access points and IoT nodes under energy and link availability constraints. However, given the intractability of solving such NP-hard problems at scale and the impractical assumption of full channel observability, we propose the Dual-Graph Embedding with Transformer (DGET) framework, a supervised multi-task learning architecture combining a two-stage Graph Neural Networks (GNNs) with a Transformer-based encoder. The first stage employs a transductive GNN that encodes the known graph topology and initial node and link states. The second stage introduces an inductive GNN for temporal refinement, which learns to generalize these embeddings to the evolved states of the same network, capturing changes in energy and queue dynamics over time, by aligning them with ground-truth scheduling decisions through a consistency loss. These enriched embeddings are then processed by a classifier for the communication links with a Transformer encoder that captures cross-link dependencies through multi-head self-attention via classification loss. Simulation results show that hybrid RF-OWC networks outperform standalone RF systems by handling higher traffic loads more efficiently and reducing the Age of Information (AoI) by up to 20%, all while maintaining comparable energy consumption. The proposed DGET framework, compared to traditional optimization-based methods, achieves near-optimal scheduling with over 90% classification accuracy, reduces computational complexity, and demonstrates higher robustness under partial channel observability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07434",
        "abs_url": "https://arxiv.org/abs/2511.07434",
        "pdf_url": "https://arxiv.org/pdf/2511.07434",
        "title": "RL-Exec: Impact-Aware Reinforcement Learning for Opportunistic Optimal Liquidation, Outperforms TWAP and a Book-Liquidity VWAP on BTC-USD Replays",
        "authors": [
            "Enzo Duflot",
            "Stanislas Robineau"
        ],
        "comments": "8 pages main text, 3 appendix pages, 10 figures",
        "subjects": "Statistical Finance (q-fin.ST); Machine Learning (cs.LG); Trading and Market Microstructure (q-fin.TR)",
        "abstract": "We study opportunistic optimal liquidation over fixed deadlines on BTC-USD limit-order books (LOB). We present RL-Exec, a PPO agent trained on historical replays augmented with endogenous transient impact (resilience), partial fills, maker/taker fees, and latency. The policy observes depth-20 LOB features plus microstructure indicators and acts under a sell-only inventory constraint to reach a residual target. Evaluation follows a strict time split (train: Jan-2020; test: Feb-2020) and a per-day protocol: for each test day we run ten independent start times and aggregate to a single daily score, avoiding pseudo-replication. We compare the agent to (i) TWAP and (ii) a VWAP-like baseline allocating using opposite-side order-book liquidity (top-20 levels), both executed on identical timestamps and costs. Statistical inference uses one-sided Wilcoxon signed-rank tests on daily RL-baseline differences with Benjamini-Hochberg FDR correction and bootstrap confidence intervals. On the Feb-2020 test set, RL-Exec significantly outperforms both baselines and the gap increases with the execution horizon (+2-3 bps at 30 min, +7-8 bps at 60 min, +23 bps at 120 min). Code: this http URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07475",
        "abs_url": "https://arxiv.org/abs/2511.07475",
        "pdf_url": "https://arxiv.org/pdf/2511.07475",
        "title": "From Hubs to Deserts: Urban Cultural Accessibility Patterns with Explainable AI",
        "authors": [
            "Protik Bose Pranto",
            "Minhazul Islam",
            "Ripon Kumar Saha",
            "Abimelec Mercado Rivera",
            "Namig Abbasov"
        ],
        "comments": "",
        "subjects": "Computers and Society (cs.CY); Machine Learning (cs.LG)",
        "abstract": "Cultural infrastructures, such as libraries, museums, theaters, and galleries, support learning, civic life, health, and local economies, yet access is uneven across cities. We present a novel, scalable, and open-data framework to measure spatial equity in cultural access. We map cultural infrastructures and compute a metric called Cultural Infrastructure Accessibility Score (CIAS) using exponential distance decay at fine spatial resolution, then aggregate the score per capita and integrate socio-demographic indicators. Interpretable tree-ensemble models with SHapley Additive exPlanation (SHAP) are used to explain associations between accessibility, income, density, and tract-level racial/ethnic composition. Results show a pronounced core-periphery gradient, where non-library cultural infrastructures cluster near urban cores, while libraries track density and provide broader coverage. Non-library accessibility is modestly higher in higher-income tracts, and library accessibility is slightly higher in denser, lower-income areas.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07496",
        "abs_url": "https://arxiv.org/abs/2511.07496",
        "pdf_url": "https://arxiv.org/pdf/2511.07496",
        "title": "Laplacian Score Sharpening for Mitigating Hallucination in Diffusion Models",
        "authors": [
            "Barath Chandran.C",
            "Srinivas Anumasa",
            "Dianbo Liu"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Diffusion models, though successful, are known to suffer from hallucinations that create incoherent or unrealistic samples. Recent works have attributed this to the phenomenon of mode interpolation and score smoothening, but they lack a method to prevent their generation during sampling. In this paper, we propose a post-hoc adjustment to the score function during inference that leverages the Laplacian (or sharpness) of the score to reduce mode interpolation hallucination in unconditional diffusion models across 1D, 2D, and high-dimensional image data. We derive an efficient Laplacian approximation for higher dimensions using a finite-difference variant of the Hutchinson trace estimator. We show that this correction significantly reduces the rate of hallucinated samples across toy 1D/2D distributions and a high- dimensional image dataset. Furthermore, our analysis explores the relationship between the Laplacian and uncertainty in the score.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07504",
        "abs_url": "https://arxiv.org/abs/2511.07504",
        "pdf_url": "https://arxiv.org/pdf/2511.07504",
        "title": "Tractable Instances of Bilinear Maximization: Implementing LinUCB on Ellipsoids",
        "authors": [
            "Raymond Zhang",
            "Hédi Hadiji",
            "Richard Combes"
        ],
        "comments": "27 pages, 8 figures, 4 algos",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We consider the maximization of $x^\\top \\theta$ over $(x,\\theta) \\in \\mathcal{X} \\times \\Theta$, with $\\mathcal{X} \\subset \\mathbb{R}^d$ convex and $\\Theta \\subset \\mathbb{R}^d$ an ellipsoid. This problem is fundamental in linear bandits, as the learner must solve it at every time step using optimistic algorithms. We first show that for some sets $\\mathcal{X}$ e.g. $\\ell_p$ balls with $p>2$, no efficient algorithms exist unless $\\mathcal{P} = \\mathcal{NP}$. We then provide two novel algorithms solving this problem efficiently when $\\mathcal{X}$ is a centered ellipsoid. Our findings provide the first known method to implement optimistic algorithms for linear bandits in high dimensions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07564",
        "abs_url": "https://arxiv.org/abs/2511.07564",
        "pdf_url": "https://arxiv.org/pdf/2511.07564",
        "title": "Shocks Under Control: Taming Transonic Compressible Flow over an RAE2822 Airfoil with Deep Reinforcement Learning",
        "authors": [
            "Trishit Mondal",
            "Ricardo Vinuesa",
            "Ameya D. Jagtap"
        ],
        "comments": "23 pages, 18 figures",
        "subjects": "Fluid Dynamics (physics.flu-dyn); Machine Learning (cs.LG)",
        "abstract": "Active flow control of compressible transonic shock-boundary layer interactions over a two-dimensional RAE2822 airfoil at Re = 50,000 is investigated using deep reinforcement learning (DRL). The flow field exhibits highly unsteady dynamics, including complex shock-boundary layer interactions, shock oscillations, and the generation of Kutta waves from the trailing edge. A high-fidelity CFD solver, employing a fifth-order spectral discontinuous Galerkin scheme in space and a strong-stability-preserving Runge-Kutta (5,4) method in time, together with adaptive mesh refinement capability, is used to obtain the accurate flow field. Synthetic jet actuation is employed to manipulate these unsteady flow features, while the DRL agent autonomously discovers effective control strategies through direct interaction with high-fidelity compressible flow simulations. The trained controllers effectively mitigate shock-induced separation, suppress unsteady oscillations, and manipulate aerodynamic forces under transonic conditions. In the first set of experiments, aimed at both drag reduction and lift enhancement, the DRL-based control reduces the average drag coefficient by 13.78% and increases lift by 131.18%, thereby improving the lift-to-drag ratio by 121.52%, which underscores its potential for managing complex flow dynamics. In the second set, targeting drag reduction while maintaining lift, the DRL-based control achieves a 25.62% reduction in drag and a substantial 196.30% increase in lift, accompanied by markedly diminished oscillations. In this case, the lift-to-drag ratio improves by 220.26%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07604",
        "abs_url": "https://arxiv.org/abs/2511.07604",
        "pdf_url": "https://arxiv.org/pdf/2511.07604",
        "title": "Infinite-Dimensional Operator/Block Kaczmarz Algorithms: Regret Bounds and $λ$-Effectiveness",
        "authors": [
            "Halyun Jeong",
            "Palle E.T. Jorgensen",
            "Hyun-Kyoung Kwon",
            "Myung-Sin Song"
        ],
        "comments": "Submitted to a journal",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Functional Analysis (math.FA)",
        "abstract": "We present a variety of projection-based linear regression algorithms with a focus on modern machine-learning models and their algorithmic performance. We study the role of the relaxation parameter in generalized Kaczmarz algorithms and establish a priori regret bounds with explicit $\\lambda$-dependence to quantify how much an algorithm's performance deviates from its optimal performance. A detailed analysis of relaxation parameter is also provided. Applications include: explicit regret bounds for the framework of Kaczmarz algorithm models, non-orthogonal Fourier expansions, and the use of regret estimates in modern machine learning models, including for noisy data, i.e., regret bounds for the noisy Kaczmarz algorithms. Motivated by machine-learning practice, our wider framework treats bounded operators (on infinite-dimensional Hilbert spaces), with updates realized as (block) Kaczmarz algorithms, leading to new and versatile results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07671",
        "abs_url": "https://arxiv.org/abs/2511.07671",
        "pdf_url": "https://arxiv.org/pdf/2511.07671",
        "title": "Robust Experimental Design via Generalised Bayesian Inference",
        "authors": [
            "Yasir Zubayr Barlas",
            "Sabina J. Sloman",
            "Samuel Kaski"
        ],
        "comments": "12 main pages, 43 pages in total",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Bayesian optimal experimental design is a principled framework for conducting experiments that leverages Bayesian inference to quantify how much information one can expect to gain from selecting a certain design. However, accurate Bayesian inference relies on the assumption that one's statistical model of the data-generating process is correctly specified. If this assumption is violated, Bayesian methods can lead to poor inference and estimates of information gain. Generalised Bayesian (or Gibbs) inference is a more robust probabilistic inference framework that replaces the likelihood in the Bayesian update by a suitable loss function. In this work, we present Generalised Bayesian Optimal Experimental Design (GBOED), an extension of Gibbs inference to the experimental design setting which achieves robustness in both design and inference. Using an extended information-theoretic framework, we derive a new acquisition function, the Gibbs expected information gain (Gibbs EIG). Our empirical results demonstrate that GBOED enhances robustness to outliers and incorrect assumptions about the outcome noise distribution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07686",
        "abs_url": "https://arxiv.org/abs/2511.07686",
        "pdf_url": "https://arxiv.org/pdf/2511.07686",
        "title": "Kolmogorov-Arnold Chemical Reaction Neural Networks for learning pressure-dependent kinetic rate laws",
        "authors": [
            "Benjamin C. Koenig",
            "Sili Deng"
        ],
        "comments": "5 pages, 4 figures",
        "subjects": "Chemical Physics (physics.chem-ph); Machine Learning (cs.LG)",
        "abstract": "Chemical Reaction Neural Networks (CRNNs) have emerged as an interpretable machine learning framework for discovering reaction kinetics directly from data, while strictly adhering to the Arrhenius and mass action laws. However, standard CRNNs cannot represent pressure-dependent rate behavior, which is critical in many combustion and chemical systems and typically requires empirical formulations such as Troe or PLOG. Here, we develop Kolmogorov-Arnold Chemical Reaction Neural Networks (KA-CRNNs) that generalize CRNNs by modeling each kinetic parameter as a learnable function of system pressure using Kolmogorov-Arnold activations. This structure maintains full interpretability and physical consistency while enabling assumption-free inference of pressure effects directly from data. A proof-of-concept study on the CH3 recombination reaction demonstrates that KA-CRNNs accurately reproduce pressure-dependent kinetics across a range of temperatures and pressures, outperforming conventional interpolative models. The framework establishes a foundation for data-driven discovery of extended kinetic behaviors in complex reacting systems, advancing interpretable and physics-consistent approaches for chemical model inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07699",
        "abs_url": "https://arxiv.org/abs/2511.07699",
        "pdf_url": "https://arxiv.org/pdf/2511.07699",
        "title": "Misaligned by Design: Incentive Failures in Machine Learning",
        "authors": [
            "David Autor",
            "Andrew Caplin",
            "Daniel Martin",
            "Philip Marx"
        ],
        "comments": "",
        "subjects": "General Economics (econ.GN); Machine Learning (cs.LG)",
        "abstract": "The cost of error in many high-stakes settings is asymmetric: misdiagnosing pneumonia when absent is an inconvenience, but failing to detect it when present can be life-threatening. Because of this, artificial intelligence (AI) models used to assist such decisions are frequently trained with asymmetric loss functions that incorporate human decision-makers' trade-offs between false positives and false negatives. In two focal applications, we show that this standard alignment practice can backfire. In both cases, it would be better to train the machine learning model with a loss function that ignores the human's objective and then adjust predictions ex post according to that objective. We rationalize this result using an economic model of incentive design with endogenous information acquisition. The key insight from our theoretical framework is that machine classifiers perform not one but two incentivized tasks: choosing how to classify and learning how to classify. We show that while the adjustments engineers use correctly incentivize choosing, they can simultaneously reduce the incentives to learn. Our formal treatment of the problem reveals that methods embraced for their intuitive appeal can in fact misalign human and machine objectives in predictable ways.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07737",
        "abs_url": "https://arxiv.org/abs/2511.07737",
        "pdf_url": "https://arxiv.org/pdf/2511.07737",
        "title": "TurboSAT: Gradient-Guided Boolean Satisfiability Accelerated on GPU-CPU Hybrid System",
        "authors": [
            "Steve Dai",
            "Cunxi Yu",
            "Kalyan Krishnamani",
            "Brucek Khailany"
        ],
        "comments": "7 pages, 5 equations, 5 figures, 1 table",
        "subjects": "Logic in Computer Science (cs.LO); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Mathematical Software (cs.MS)",
        "abstract": "While accelerated computing has transformed many domains of computing, its impact on logical reasoning, specifically Boolean satisfiability (SAT), remains limited. State-of-the-art SAT solvers rely heavily on inherently sequential conflict-driven search algorithms that offer powerful heuristics but limit the amount of parallelism that could otherwise enable significantly more scalable SAT solving. Inspired by neural network training, we formulate the SAT problem as a binarized matrix-matrix multiplication layer that could be optimized using a differentiable objective function. Enabled by this encoding, we combine the strengths of parallel differentiable optimization and sequential search to accelerate SAT on a hybrid GPU-CPU system. In this system, the GPUs leverage parallel differentiable solving to rapidly evaluate SAT clauses and use gradients to stochastically explore the solution space and optimize variable assignments. Promising partial assignments generated by the GPUs are post-processed on many CPU threads which exploit conflict-driven sequential search to further traverse the solution subspaces and identify complete assignments. Prototyping the hybrid solver on an NVIDIA DGX GB200 node, our solver achieves runtime speedups up to over 200x when compared to a state-of-the-art CPU-based solver on public satisfiable benchmark problems from the SAT Competition.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07772",
        "abs_url": "https://arxiv.org/abs/2511.07772",
        "pdf_url": "https://arxiv.org/pdf/2511.07772",
        "title": "SALT: Steering Activations towards Leakage-free Thinking in Chain of Thought",
        "authors": [
            "Shourya Batra",
            "Pierce Tillman",
            "Samarth Gaggar",
            "Shashank Kesineni",
            "Kevin Zhu",
            "Sunishchal Dev",
            "Ashwinee Panda",
            "Vasu Sharma",
            "Maheep Chaudhary"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "As Large Language Models (LLMs) evolve into personal assistants with access to sensitive user data, they face a critical privacy challenge: while prior work has addressed output-level privacy, recent findings reveal that LLMs often leak private information through their internal reasoning processes, violating contextual privacy expectations. These leaky thoughts occur when models inadvertently expose sensitive details in their reasoning traces, even when final outputs appear safe. The challenge lies in preventing such leakage without compromising the model's reasoning capabilities, requiring a delicate balance between privacy and utility. We introduce Steering Activations towards Leakage-free Thinking (SALT), a lightweight test-time intervention that mitigates privacy leakage in model's Chain of Thought (CoT) by injecting targeted steering vectors into hidden state. We identify the high-leakage layers responsible for this behavior. Through experiments across multiple LLMs, we demonstrate that SALT achieves reductions including $18.2\\%$ reduction in CPL on QwQ-32B, $17.9\\%$ reduction in CPL on Llama-3.1-8B, and $31.2\\%$ reduction in CPL on Deepseek in contextual privacy leakage dataset AirGapAgent-R while maintaining comparable task performance and utility. Our work establishes SALT as a practical approach for test-time privacy protection in reasoning-capable language models, offering a path toward safer deployment of LLM-based personal agents.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07776",
        "abs_url": "https://arxiv.org/abs/2511.07776",
        "pdf_url": "https://arxiv.org/pdf/2511.07776",
        "title": "Streaming Tensor Program: A streaming abstraction for dynamic parallelism",
        "authors": [
            "Gina Sohn",
            "Genghan Zhang",
            "Konstantin Hossfeld",
            "Jungwoo Kim",
            "Nathan Sobotka",
            "Nathan Zhang",
            "Olivia Hsu",
            "Kunle Olukotun"
        ],
        "comments": "",
        "subjects": "Programming Languages (cs.PL); Hardware Architecture (cs.AR); Machine Learning (cs.LG)",
        "abstract": "Dynamic behaviors are becoming prevalent in many tensor applications. In machine learning, for example, the input tensors are dynamically shaped or ragged, and data-dependent control flow is widely used in many models. However, the limited expressiveness of prior programming abstractions for spatial dataflow accelerators forces the dynamic behaviors to be implemented statically or lacks the visibility for performance-critical decisions. To address these challenges, we present the Streaming Tensor Program (STeP), a new streaming abstraction that enables dynamic tensor workloads to run efficiently on spatial dataflow accelerators. STeP introduces flexible routing operators, an explicit memory hierarchy, and symbolic shape semantics that expose dynamic data rates and tensor dimensions. These capabilities unlock new optimizations-dynamic tiling, dynamic parallelization, and configuration time-multiplexing-that adapt to dynamic behaviors while preserving dataflow efficiency. Using a cycle-approximate simulator on representative LLM layers with real-world traces, dynamic tiling reduces on-chip memory requirement by 2.18x, dynamic parallelization improves latency by 1.5x, and configuration time-multiplexing improves compute utilization by 2.57x over implementations available in prior abstractions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07807",
        "abs_url": "https://arxiv.org/abs/2511.07807",
        "pdf_url": "https://arxiv.org/pdf/2511.07807",
        "title": "PRISM: Privacy-preserving Inference System with Homomorphic Encryption and Modular Activation",
        "authors": [
            "Zeinab Elkhatib",
            "Ali Sekmen",
            "Kamrul Hasan"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "With the rapid advancements in machine learning, models have become increasingly capable of learning and making predictions in various industries. However, deploying these models in critical infrastructures presents a major challenge, as concerns about data privacy prevent unrestricted data sharing. Homomor- phic encryption (HE) offers a solution by enabling computations on encrypted data, but it remains incompatible with machine learning models like convolutional neural networks (CNNs), due to their reliance on non-linear activation functions. To bridge this gap, this work proposes an optimized framework that replaces standard non-linear functions with homomorphically compatible approximations, ensuring secure computations while minimizing computational overhead. The proposed approach restructures the CNN architecture and introduces an efficient activation function approximation method to mitigate the performance trade-offs in- troduced by encryption. Experiments on CIFAR-10 achieve 94.4% accuracy with 2.42 s per single encrypted sample and 24,000 s per 10,000 encrypted samples, using a degree-4 polynomial and Softplus activation under CKKS, balancing accuracy and privacy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07831",
        "abs_url": "https://arxiv.org/abs/2511.07831",
        "pdf_url": "https://arxiv.org/pdf/2511.07831",
        "title": "Distributionally Robust Online Markov Game with Linear Function Approximation",
        "authors": [
            "Zewu Zheng",
            "Yuanyuan Lin"
        ],
        "comments": "To be published in the Proceedings of AAAI 2026",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "The sim-to-real gap, where agents trained in a simulator face significant performance degradation during testing, is a fundamental challenge in reinforcement learning. Extansive works adopt the framework of distributionally robust RL, to learn a policy that acts robustly under worst case environment shift. Within this framework, our objective is to devise algorithms that are sample efficient with interactive data collection and large state spaces. By assuming d-rectangularity of environment dynamic shift, we identify a fundamental hardness result for learning in online Markov game, and address it by adopting minimum value assumption. Then, a novel least square value iteration type algorithm, DR-CCE-LSI, with exploration bonus devised specifically for multiple agents, is proposed to find an \\episilon-approximate robust Coarse Correlated Equilibrium(CCE). To obtain sample efficient learning, we find that: when the feature mapping function satisfies certain properties, our algorithm, DR-CCE-LSI, is able to achieve \\epsilon-approximate CCE with a regret bound of O{dHmin{H,1/min{\\sigma_i}}\\sqrt{K}}, where K is the number of interacting episodes, H is the horizon length, d is the feature dimension, and \\simga_i represents the uncertainty level of player i. Our work introduces the first sample-efficient algorithm for this setting, matches the best result so far in single agent setting, and achieves minimax optimalsample complexity in terms of the feature dimension d. Meanwhile, we also conduct simulation study to validate the efficacy of our algorithm in learning a robust equilibrium.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07836",
        "abs_url": "https://arxiv.org/abs/2511.07836",
        "pdf_url": "https://arxiv.org/pdf/2511.07836",
        "title": "Hyperellipsoid Density Sampling: Exploitative Sequences to Accelerate High-Dimensional Optimization",
        "authors": [
            "Julian Soltes"
        ],
        "comments": "for Python implementation, see this https URL",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "The curse of dimensionality presents a pervasive challenge in optimization problems, with exponential expansion of the search space rapidly causing traditional algorithms to become inefficient or infeasible. An adaptive sampling strategy is presented to accelerate optimization in this domain as an alternative to uniform quasi-Monte Carlo (QMC) methods. This method, referred to as Hyperellipsoid Density Sampling (HDS), generates its sequences by defining multiple hyperellipsoids throughout the search space. HDS uses three types of unsupervised learning algorithms to circumvent high-dimensional geometric calculations, producing an intelligent, non-uniform sample sequence that exploits statistically promising regions of the parameter space and improves final solution quality in high-dimensional optimization problems. A key feature of the method is optional Gaussian weights, which may be provided to influence the sample distribution towards known locations of interest. This capability makes HDS versatile for applications beyond optimization, providing a focused, denser sample distribution where models need to concentrate their efforts on specific, non-uniform regions of the parameter space. The method was evaluated against Sobol, a standard QMC method, using differential evolution (DE) on the 29 CEC2017 benchmark test functions. The results show statistically significant improvements in solution geometric mean error (p < 0.05), with average performance gains ranging from 3% in 30D to 37% in 10D. This paper demonstrates the efficacy of HDS as a robust alternative to QMC sampling for high-dimensional optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07869",
        "abs_url": "https://arxiv.org/abs/2511.07869",
        "pdf_url": "https://arxiv.org/pdf/2511.07869",
        "title": "Parallel Sampling via Autospeculation",
        "authors": [
            "Nima Anari",
            "Carlo Baronio",
            "CJ Chen",
            "Alireza Haqi",
            "Frederic Koehler",
            "Anqi Li",
            "Thuy-Duong Vuong"
        ],
        "comments": "",
        "subjects": "Data Structures and Algorithms (cs.DS); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG); Probability (math.PR)",
        "abstract": "We present parallel algorithms to accelerate sampling via counting in two settings: any-order autoregressive models and denoising diffusion models. An any-order autoregressive model accesses a target distribution $\\mu$ on $[q]^n$ through an oracle that provides conditional marginals, while a denoising diffusion model accesses a target distribution $\\mu$ on $\\mathbb{R}^n$ through an oracle that provides conditional means under Gaussian noise. Standard sequential sampling algorithms require $\\widetilde{O}(n)$ time to produce a sample from $\\mu$ in either setting. We show that, by issuing oracle calls in parallel, the expected sampling time can be reduced to $\\widetilde{O}(n^{1/2})$. This improves the previous $\\widetilde{O}(n^{2/3})$ bound for any-order autoregressive models and yields the first parallel speedup for diffusion models in the high-accuracy regime, under the relatively mild assumption that the support of $\\mu$ is bounded. We introduce a novel technique to obtain our results: speculative rejection sampling. This technique leverages an auxiliary ``speculative'' distribution~$\\nu$ that approximates~$\\mu$ to accelerate sampling. Our technique is inspired by the well-studied ``speculative decoding'' techniques popular in large language models, but differs in key ways. Firstly, we use ``autospeculation,'' namely we build the speculation $\\nu$ out of the same oracle that defines~$\\mu$. In contrast, speculative decoding typically requires a separate, faster, but potentially less accurate ``draft'' model $\\nu$. Secondly, the key differentiating factor in our technique is that we make and accept speculations at a ``sequence'' level rather than at the level of single (or a few) steps. This last fact is key to unlocking our parallel runtime of $\\widetilde{O}(n^{1/2})$.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07883",
        "abs_url": "https://arxiv.org/abs/2511.07883",
        "pdf_url": "https://arxiv.org/pdf/2511.07883",
        "title": "SpikCommander: A High-performance Spiking Transformer with Multi-view Learning for Efficient Speech Command Recognition",
        "authors": [
            "Jiaqi Wang",
            "Liutao Yu",
            "Xiongri Shen",
            "Sihang Guo",
            "Chenlin Zhou",
            "Leilei Zhao",
            "Yi Zhong",
            "Zhengyu Ma",
            "Zhiguo Zhang"
        ],
        "comments": "Accepted by The Fortieth AAAI Conference on Artificial Intelligence (AAAI 2026)",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG)",
        "abstract": "Spiking neural networks (SNNs) offer a promising path toward energy-efficient speech command recognition (SCR) by leveraging their event-driven processing paradigm. However, existing SNN-based SCR methods often struggle to capture rich temporal dependencies and contextual information from speech due to limited temporal modeling and binary spike-based representations. To address these challenges, we first introduce the multi-view spiking temporal-aware self-attention (MSTASA) module, which combines effective spiking temporal-aware attention with a multi-view learning framework to model complementary temporal dependencies in speech commands. Building on MSTASA, we further propose SpikCommander, a fully spike-driven transformer architecture that integrates MSTASA with a spiking contextual refinement channel MLP (SCR-MLP) to jointly enhance temporal context modeling and channel-wise feature integration. We evaluate our method on three benchmark datasets: the Spiking Heidelberg Dataset (SHD), the Spiking Speech Commands (SSC), and the Google Speech Commands V2 (GSC). Extensive experiments demonstrate that SpikCommander consistently outperforms state-of-the-art (SOTA) SNN approaches with fewer parameters under comparable time steps, highlighting its effectiveness and efficiency for robust speech command recognition.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07897",
        "abs_url": "https://arxiv.org/abs/2511.07897",
        "pdf_url": "https://arxiv.org/pdf/2511.07897",
        "title": "Data Descriptions from Large Language Models with Influence Estimation",
        "authors": [
            "Chaeri Kim",
            "Jaeyeon Bae",
            "Taehwan Kim"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Deep learning models have been successful in many areas but understanding their behaviors still remains a black-box. Most prior explainable AI (XAI) approaches have focused on interpreting and explaining how models make predictions. In contrast, we would like to understand how data can be explained with deep learning model training and propose a novel approach to understand the data via one of the most common media - language - so that humans can easily understand. Our approach proposes a pipeline to generate textual descriptions that can explain the data with large language models by incorporating external knowledge bases. However, generated data descriptions may still include irrelevant information, so we introduce to exploit influence estimation to choose the most informative textual descriptions, along with the CLIP score. Furthermore, based on the phenomenon of cross-modal transferability, we propose a novel benchmark task named cross-modal transfer classification to examine the effectiveness of our textual descriptions. In the experiment of zero-shot setting, we show that our textual descriptions are more effective than other baseline descriptions, and furthermore, we successfully boost the performance of the model trained only on images across all nine image classification datasets. These results are further supported by evaluation using GPT-4o. Through our approach, we may gain insights into the inherent interpretability of the decision-making process of the model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07947",
        "abs_url": "https://arxiv.org/abs/2511.07947",
        "pdf_url": "https://arxiv.org/pdf/2511.07947",
        "title": "Class-feature Watermark: A Resilient Black-box Watermark Against Model Extraction Attacks",
        "authors": [
            "Yaxin Xiao",
            "Qingqing Ye",
            "Zi Liang",
            "Haoyang Li",
            "RongHua Li",
            "Huadi Zheng",
            "Haibo Hu"
        ],
        "comments": "Accepted by AAAI'26",
        "subjects": "Cryptography and Security (cs.CR); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Machine learning models constitute valuable intellectual property, yet remain vulnerable to model extraction attacks (MEA), where adversaries replicate their functionality through black-box queries. Model watermarking counters MEAs by embedding forensic markers for ownership verification. Current black-box watermarks prioritize MEA survival through representation entanglement, yet inadequately explore resilience against sequential MEAs and removal attacks. Our study reveals that this risk is underestimated because existing removal methods are weakened by entanglement. To address this gap, we propose Watermark Removal attacK (WRK), which circumvents entanglement constraints by exploiting decision boundaries shaped by prevailing sample-level watermark artifacts. WRK effectively reduces watermark success rates by at least 88.79% across existing watermarking benchmarks. For robust protection, we propose Class-Feature Watermarks (CFW), which improve resilience by leveraging class-level artifacts. CFW constructs a synthetic class using out-of-domain samples, eliminating vulnerable decision boundaries between original domain samples and their artifact-modified counterparts (watermark samples). CFW concurrently optimizes both MEA transferability and post-MEA stability. Experiments across multiple domains show that CFW consistently outperforms prior methods in resilience, maintaining a watermark success rate of at least 70.15% in extracted models even under the combined MEA and WRK distortion, while preserving the utility of protected models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07955",
        "abs_url": "https://arxiv.org/abs/2511.07955",
        "pdf_url": "https://arxiv.org/pdf/2511.07955",
        "title": "Speech Emotion Recognition with Phonation Excitation Information and Articulatory Kinematics",
        "authors": [
            "Ziqian Zhang",
            "Min Huang",
            "Zhongzhe Xiao"
        ],
        "comments": "",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG)",
        "abstract": "Speech emotion recognition (SER) has advanced significantly for the sake of deep-learning methods, while textual information further enhances its performance. However, few studies have focused on the physiological information during speech production, which also encompasses speaker traits, including emotional states. To bridge this gap, we conducted a series of experiments to investigate the potential of the phonation excitation information and articulatory kinematics for SER. Due to the scarcity of training data for this purpose, we introduce a portrayed emotional dataset, STEM-E2VA, which includes audio and physiological data such as electroglottography (EGG) and electromagnetic articulography (EMA). EGG and EMA provide information of phonation excitation and articulatory kinematics, respectively. Additionally, we performed emotion recognition using estimated physiological data derived through inversion methods from speech, instead of collected EGG and EMA, to explore the feasibility of applying such physiological information in real-world SER. Experimental results confirm the effectiveness of incorporating physiological information about speech production for SER and demonstrate its potential for practical use in real-world scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.07997",
        "abs_url": "https://arxiv.org/abs/2511.07997",
        "pdf_url": "https://arxiv.org/pdf/2511.07997",
        "title": "PrAda-GAN: A Private Adaptive Generative Adversarial Network with Bayes Network Structure",
        "authors": [
            "Ke Jia",
            "Yuheng Ma",
            "Yang Li",
            "Feifei Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Cryptography and Security (cs.CR); Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "We revisit the problem of generating synthetic data under differential privacy. To address the core limitations of marginal-based methods, we propose the Private Adaptive Generative Adversarial Network with Bayes Network Structure (PrAda-GAN), which integrates the strengths of both GAN-based and marginal-based approaches. Our method adopts a sequential generator architecture to capture complex dependencies among variables, while adaptively regularizing the learned structure to promote sparsity in the underlying Bayes network. Theoretically, we establish diminishing bounds on the parameter distance, variable selection error, and Wasserstein distance. Our analysis shows that leveraging dependency sparsity leads to significant improvements in convergence rates. Empirically, experiments on both synthetic and real-world datasets demonstrate that PrAda-GAN outperforms existing tabular data synthesis methods in terms of the privacy-utility trade-off.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08130",
        "abs_url": "https://arxiv.org/abs/2511.08130",
        "pdf_url": "https://arxiv.org/pdf/2511.08130",
        "title": "Foam Segmentation in Wastewater Treatment Plants: A Federated Learning Approach with Segment Anything Model 2",
        "authors": [
            "Mehmet Batuhan Duman",
            "Alejandro Carnero",
            "Cristian Martín",
            "Daniel Garrido",
            "Manuel Díaz"
        ],
        "comments": "36 pages, 14 figures, 3 tables, 4 algorithms. This work is part of the Zerovision project. Code available at: this https URL",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "Foam formation in Wastewater Treatment Plants (WTPs) is a major challenge that can reduce treatment efficiency and increase costs. The ability to automatically examine changes in real-time with respect to the percentage of foam can be of great benefit to the plant. However, large amounts of labeled data are required to train standard Machine Learning (ML) models. The development of these systems is slow due to the scarcity and heterogeneity of labeled data. Additionally, the development is often hindered by the fact that different WTPs do not share their data due to privacy concerns. This paper proposes a new framework to address these challenges by combining Federated Learning (FL) with the state-of-the-art base model for image segmentation, Segment Anything Model 2 (SAM2). The FL paradigm enables collaborative model training across multiple WTPs without centralizing sensitive operational data, thereby ensuring privacy. The framework accelerates training convergence and improves segmentation performance even with limited local datasets by leveraging SAM2's strong pre-trained weights for initialization. The methodology involves fine-tuning SAM2 on distributed clients (edge nodes) using the Flower framework, where a central Fog server orchestrates the process by aggregating model weights without accessing private data. The model was trained and validated using various data collections, including real-world images captured at a WTPs in Granada, Spain, a synthetically generated foam dataset, and images from publicly available datasets to improve generalization. This research offers a practical, scalable, and privacy-aware solution for automatic foam tracking in WTPs. The findings highlight the significant potential of integrating large-scale foundational models into FL systems to solve real-world industrial challenges characterized by distributed and sensitive data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08154",
        "abs_url": "https://arxiv.org/abs/2511.08154",
        "pdf_url": "https://arxiv.org/pdf/2511.08154",
        "title": "Good flavor search in $SU(5)$: a machine learning approach",
        "authors": [
            "Fayez Abu-Ajamieh",
            "Shinsuke Kawai",
            "Nobuchika Okada"
        ],
        "comments": "14 pages, 9 figures",
        "subjects": "High Energy Physics - Phenomenology (hep-ph); Machine Learning (cs.LG); High Energy Physics - Theory (hep-th)",
        "abstract": "We revisit the fermion mass problem of the $SU(5)$ grand unified theory using machine learning techniques. The original $SU(5)$ model proposed by Georgi and Glashow is incompatible with the observed fermion mass spectrum. Two remedies are known to resolve this discrepancy, one is through introducing a new interaction via a 45-dimensional field, and the other via a 24-dimensional field. We investigate which modification is more natural, defining naturalness as proximity to the original Georgi-Glashow $SU(5)$ model. Our analysis shows that, in both supersymmetric and non-supersymmetric scenarios, the model incorporating the interaction with the 24-dimensional field is more natural under this criterion. We then generalise these models by introducing a continuous parameter $y$, which takes the value 3 for the 45-dimensional field and 1.5 for the 24-dimensional field. Numerical optimisation reveals that $y \\approx 0.8$ yields the closest match to the original $SU(5)$ model, indicating that this value corresponds to the most natural model according to our definition.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08198",
        "abs_url": "https://arxiv.org/abs/2511.08198",
        "pdf_url": "https://arxiv.org/pdf/2511.08198",
        "title": "Proof Minimization in Neural Network Verification",
        "authors": [
            "Omri Isac",
            "Idan Refaeli",
            "Haoze Wu",
            "Clark Barrett",
            "Guy Katz"
        ],
        "comments": "This is a preprint version of the paper that appears at VMCAI 2026",
        "subjects": "Logic in Computer Science (cs.LO); Machine Learning (cs.LG)",
        "abstract": "The widespread adoption of deep neural networks (DNNs) requires efficient techniques for verifying their safety. DNN verifiers are complex tools, which might contain bugs that could compromise their soundness and undermine the reliability of the verification process. This concern can be mitigated using proofs: artifacts that are checkable by an external and reliable proof checker, and which attest to the correctness of the verification process. However, such proofs tend to be extremely large, limiting their use in many scenarios. In this work, we address this problem by minimizing proofs of unsatisfiability produced by DNN verifiers. We present algorithms that remove facts which were learned during the verification process, but which are unnecessary for the proof itself. Conceptually, our method analyzes the dependencies among facts used to deduce UNSAT, and removes facts that did not contribute. We then further minimize the proof by eliminating remaining unnecessary dependencies, using two alternative procedures. We implemented our algorithms on top of a proof producing DNN verifier, and evaluated them across several benchmarks. Our results show that our best-performing algorithm reduces proof size by 37%-82% and proof checking time by 30%-88%, while introducing a runtime overhead of 7%-20% to the verification process itself.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08205",
        "abs_url": "https://arxiv.org/abs/2511.08205",
        "pdf_url": "https://arxiv.org/pdf/2511.08205",
        "title": "From Classical to Hybrid: A Practical Framework for Quantum-Enhanced Learning",
        "authors": [
            "Silvie Illésová",
            "Tomáš Bezděk",
            "Vojtěch Novák",
            "Ivan Zelinka",
            "Stefano Cacciatore",
            "Martin Beseda"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "This work addresses the challenge of enabling practitioners without quantum expertise to transition from classical to hybrid quantum-classical machine learning workflows. We propose a three-stage framework: starting with a classical self-training model, then introducing a minimal hybrid quantum variant, and finally applying diagnostic feedback via QMetric to refine the hybrid architecture. In experiments on the Iris dataset, the refined hybrid model improved accuracy from 0.31 in the classical approach to 0.87 in the quantum approach. These results suggest that even modest quantum components, when guided by proper diagnostics, can enhance class separation and representation capacity in hybrid learning, offering a practical pathway for classical machine learning practitioners to leverage quantum-enhanced methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08215",
        "abs_url": "https://arxiv.org/abs/2511.08215",
        "pdf_url": "https://arxiv.org/pdf/2511.08215",
        "title": "Evaluating Gemini LLM in Food Image-Based Recipe and Nutrition Description with EfficientNet-B4 Visual Backbone",
        "authors": [
            "Rizal Khoirul Anam"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "The proliferation of digital food applications necessitates robust methods for automated nutritional analysis and culinary guidance. This paper presents a comprehensive comparative evaluation of a decoupled, multimodal pipeline for food recognition. We evaluate a system integrating a specialized visual backbone (EfficientNet-B4) with a powerful generative large language model (Google's Gemini LLM). The core objective is to evaluate the trade-offs between visual classification accuracy, model efficiency, and the quality of generative output (nutritional data and recipes). We benchmark this pipeline against alternative vision backbones (VGG-16, ResNet-50, YOLOv8) and a lightweight LLM (Gemma). We introduce a formalization for \"Semantic Error Propagation\" (SEP) to analyze how classification inaccuracies from the visual module cascade into the generative output. Our analysis is grounded in a new Custom Chinese Food Dataset (CCFD) developed to address cultural bias in public datasets. Experimental results demonstrate that while EfficientNet-B4 (89.0\\% Top-1 Acc.) provides the best balance of accuracy and efficiency, and Gemini (9.2/10 Factual Accuracy) provides superior generative quality, the system's overall utility is fundamentally bottlenecked by the visual front-end's perceptive accuracy. We conduct a detailed per-class analysis, identifying high semantic similarity as the most critical failure mode.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08219",
        "abs_url": "https://arxiv.org/abs/2511.08219",
        "pdf_url": "https://arxiv.org/pdf/2511.08219",
        "title": "Emulating Radiative Transfer in Astrophysical Environments",
        "authors": [
            "Rune Rost",
            "Lorenzo Branca",
            "Tobias Buck"
        ],
        "comments": "Accepted at the Differentiable Systems and Scientific Machine Learning workshop at EurIPS, 2025",
        "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Astrophysics of Galaxies (astro-ph.GA); Machine Learning (cs.LG)",
        "abstract": "Radiative transfer is a fundamental process in astrophysics, essential for both interpreting observations and modeling thermal and dynamical feedback in simulations via ionizing radiation and photon pressure. However, numerically solving the underlying radiative transfer equation is computationally intensive due to the complex interaction of light with matter and the disparity between the speed of light and the typical gas velocities in astrophysical environments, making it particularly expensive to include the effects of on-the-fly radiation in hydrodynamic simulations. This motivates the development of surrogate models that can significantly accelerate radiative transfer calculations while preserving high accuracy. We present a surrogate model based on a Fourier Neural Operator architecture combined with U-Nets. Our model approximates three-dimensional, monochromatic radiative transfer in time-dependent regimes, in absorption-emission approximation, achieving speedups of more than 2 orders of magnitude while maintaining an average relative error below 3%, demonstrating our approach's potential to be integrated into state-of-the-art hydrodynamic simulations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08223",
        "abs_url": "https://arxiv.org/abs/2511.08223",
        "pdf_url": "https://arxiv.org/pdf/2511.08223",
        "title": "A Fast and Accurate Approach for Covariance Matrix Construction",
        "authors": [
            "Felix Reichel"
        ],
        "comments": "12 pages, 7 figures",
        "subjects": "Computation (stat.CO); Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "Reichel (2025) defined the Bariance as $\\mathrm{Bariance}(x)=\\frac{1}{n(n-1)}\\sum_{i<j}(x_i-x_j)^2$, which admits an $O(n)$ reformulation using scalar sums. We extend this to the covariance matrix by showing that $\\mathrm{Cov}(X)=\\frac{1}{n-1}\\!\\left(X^\\top X-\\frac{1}{n}\\,s\\,s^\\top\\right)$ with $s=X^\\top \\mathbf{1}_n$ is algebraically identical to the pairwise-difference form yet avoids explicit centering. Computation reduces to a single $p\\times p$ outer matrix product and one subtraction. Empirical benchmarks in Python show clear runtime gains over this http URL in non-BLAS-tuned settings. Faster Gram routines such as RXTX (Rybin et. al) for $XX^\\top$ further reduce total cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08245",
        "abs_url": "https://arxiv.org/abs/2511.08245",
        "pdf_url": "https://arxiv.org/pdf/2511.08245",
        "title": "Prompt Tuning for Natural Language to SQL with Embedding Fine-Tuning and RAG",
        "authors": [
            "Jisoo Jang",
            "Tien-Cuong Bui",
            "Yunjun Choi",
            "Wen-Syan Li"
        ],
        "comments": "Presented at the Workshop on Robust ML in Open Environments (PAKDD 2024)",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "This paper introduces an Error Correction through Prompt Tuning for NL-to-SQL, leveraging the latest advancements in generative pre-training-based LLMs and RAG. Our work addresses the crucial need for efficient and accurate translation of natural language queries into SQL expressions in various settings with the growing use of natural language interfaces. We explore the evolution of NLIDBs from early rule-based systems to advanced neural network-driven approaches. Drawing inspiration from the medical diagnostic process, we propose a novel framework integrating an error correction mechanism that diagnoses error types, identifies their causes, provides fixing instructions, and applies these corrections to SQL queries. This approach is further enriched by embedding fine-tuning and RAG, which harnesses external knowledge bases for improved accuracy and transparency. Through comprehensive experiments, we demonstrate that our framework achieves a significant 12 percent accuracy improvement over existing baselines, highlighting its potential to revolutionize data access and handling in contemporary data-driven environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08261",
        "abs_url": "https://arxiv.org/abs/2511.08261",
        "pdf_url": "https://arxiv.org/pdf/2511.08261",
        "title": "Uncertainty Calibration of Multi-Label Bird Sound Classifiers",
        "authors": [
            "Raphael Schwinger",
            "Ben McEwen",
            "Vincent S. Kather",
            "René Heinrich",
            "Lukas Rauch",
            "Sven Tomforde"
        ],
        "comments": "Under review at ICAART 2026",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG)",
        "abstract": "Passive acoustic monitoring enables large-scale biodiversity assessment, but reliable classification of bioacoustic sounds requires not only high accuracy but also well-calibrated uncertainty estimates to ground decision-making. In bioacoustics, calibration is challenged by overlapping vocalisations, long-tailed species distributions, and distribution shifts between training and deployment data. The calibration of multi-label deep learning classifiers within the domain of bioacoustics has not yet been assessed. We systematically benchmark the calibration of four state-of-the-art multi-label bird sound classifiers on the BirdSet benchmark, evaluating both global, per-dataset and per-class calibration using threshold-free calibration metrics (ECE, MCS) alongside discrimination metrics (cmAP). Model calibration varies significantly across datasets and classes. While Perch v2 and ConvNeXt$_{BS}$ show better global calibration, results vary between datasets. Both models indicate consistent underconfidence, while AudioProtoPNet and BirdMAE are mostly overconfident. Surprisingly, calibration seems to be better for less frequent classes. Using simple post hoc calibration methods we demonstrate a straightforward way to improve calibration. A small labelled calibration set is sufficient to significantly improve calibration with Platt scaling, while global calibration parameters suffer from dataset variability. Our findings highlight the importance of evaluating and improving uncertainty calibration in bioacoustic classifiers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08277",
        "abs_url": "https://arxiv.org/abs/2511.08277",
        "pdf_url": "https://arxiv.org/pdf/2511.08277",
        "title": "X-IONet: Cross-Platform Inertial Odometry Network with Dual-Stage Attention",
        "authors": [
            "Dehan Shen",
            "Changhao Chen"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Learning-based inertial odometry has achieved remarkable progress in pedestrian navigation. However, extending these methods to quadruped robots remains challenging due to their distinct and highly dynamic motion patterns. Models that perform well on pedestrian data often experience severe degradation when deployed on legged platforms. To tackle this challenge, we introduce X-IONet, a cross-platform inertial odometry framework that operates solely using a single Inertial Measurement Unit (IMU). X-IONet incorporates a rule-based expert selection module to classify motion platforms and route IMU sequences to platform-specific expert networks. The displacement prediction network features a dual-stage attention architecture that jointly models long-range temporal dependencies and inter-axis correlations, enabling accurate motion representation. It outputs both displacement and associated uncertainty, which are further fused through an Extended Kalman Filter (EKF) for robust state estimation. Extensive experiments on public pedestrian datasets and a self-collected quadruped robot dataset demonstrate that X-IONet achieves state-of-the-art performance, reducing Absolute Trajectory Error (ATE) by 14.3% and Relative Trajectory Error (RTE) by 11.4% on pedestrian data, and by 52.8% and 41.3% on quadruped robot data. These results highlight the effectiveness of X-IONet in advancing accurate and robust inertial navigation across both human and legged robot platforms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08303",
        "abs_url": "https://arxiv.org/abs/2511.08303",
        "pdf_url": "https://arxiv.org/pdf/2511.08303",
        "title": "Semi-Supervised Treatment Effect Estimation with Unlabeled Covariates via Generalized Riesz Regression",
        "authors": [
            "Masahiro Kato"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Econometrics (econ.EM); Statistics Theory (math.ST); Methodology (stat.ME)",
        "abstract": "This study investigates treatment effect estimation in the semi-supervised setting, where we can use not only the standard triple of covariates, treatment indicator, and outcome, but also unlabeled auxiliary covariates. For this problem, we develop efficiency bounds and efficient estimators whose asymptotic variance aligns with the efficiency bound. In the analysis, we introduce two different data-generating processes: the one-sample setting and the two-sample setting. The one-sample setting considers the case where we can observe treatment indicators and outcomes for a part of the dataset, which is also called the censoring setting. In contrast, the two-sample setting considers two independent datasets with labeled and unlabeled data, which is also called the case-control setting or the stratified setting. In both settings, we find that by incorporating auxiliary covariates, we can lower the efficiency bound and obtain an estimator with an asymptotic variance smaller than that without such auxiliary covariates.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08307",
        "abs_url": "https://arxiv.org/abs/2511.08307",
        "pdf_url": "https://arxiv.org/pdf/2511.08307",
        "title": "Concentration bounds on response-based vector embeddings of black-box generative models",
        "authors": [
            "Aranyak Acharyya",
            "Joshua Agterberg",
            "Youngser Park",
            "Carey E. Priebe"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Generative models, such as large language models or text-to-image diffusion models, can generate relevant responses to user-given queries. Response-based vector embeddings of generative models facilitate statistical analysis and inference on a given collection of black-box generative models. The Data Kernel Perspective Space embedding is one particular method of obtaining response-based vector embeddings for a given set of generative models, already discussed in the literature. In this paper, under appropriate regularity conditions, we establish high probability concentration bounds on the sample vector embeddings for a given set of generative models, obtained through the method of Data Kernel Perspective Space embedding. Our results tell us the required number of sample responses needed in order to approximate the population-level vector embeddings with a desired level of accuracy. The algebraic tools used to establish our results can be used further for establishing concentration bounds on Classical Multidimensional Scaling embeddings in general, when the dissimilarities are observed with noise.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08315",
        "abs_url": "https://arxiv.org/abs/2511.08315",
        "pdf_url": "https://arxiv.org/pdf/2511.08315",
        "title": "BDD2Seq: Enabling Scalable Reversible-Circuit Synthesis via Graph-to-Sequence Learning",
        "authors": [
            "Mingkai Miao",
            "Jianheng Tang",
            "Guangyu Hu",
            "Hongce Zhang"
        ],
        "comments": "",
        "subjects": "Hardware Architecture (cs.AR); Machine Learning (cs.LG)",
        "abstract": "Binary Decision Diagrams (BDDs) are instrumental in many electronic design automation (EDA) tasks thanks to their compact representation of Boolean functions. In BDD-based reversible-circuit synthesis, which is critical for quantum computing, the chosen variable ordering governs the number of BDD nodes and thus the key metrics of resource consumption, such as Quantum Cost. Because finding an optimal variable ordering for BDDs is an NP-complete problem, existing heuristics often degrade as circuit complexity grows. We introduce BDD2Seq, a graph-to-sequence framework that couples a Graph Neural Network encoder with a Pointer-Network decoder and Diverse Beam Search to predict high-quality orderings. By treating the circuit netlist as a graph, BDD2Seq learns structural dependencies that conventional heuristics overlooked, yielding smaller BDDs and faster synthesis. Extensive experiments on three public benchmarks show that BDD2Seq achieves around 1.4 times lower Quantum Cost and 3.7 times faster synthesis than modern heuristic algorithms. To the best of our knowledge, this is the first work to tackle the variable-ordering problem in BDD-based reversible-circuit synthesis with a graph-based generative model and diversity-promoting decoding.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08325",
        "abs_url": "https://arxiv.org/abs/2511.08325",
        "pdf_url": "https://arxiv.org/pdf/2511.08325",
        "title": "AgentPRM: Process Reward Models for LLM Agents via Step-Wise Promise and Progress",
        "authors": [
            "Zhiheng Xi",
            "Chenyang Liao",
            "Guanyu Li",
            "Yajie Yang",
            "Wenxiang Chen",
            "Zhihao Zhang",
            "Binghai Wang",
            "Senjie Jin",
            "Yuhao Zhou",
            "Jian Guan",
            "Wei Wu",
            "Tao Ji",
            "Tao Gui",
            "Qi Zhang",
            "Xuanjing Huang"
        ],
        "comments": "Preprint",
        "subjects": "Computation and Language (cs.CL); Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Despite rapid development, large language models (LLMs) still encounter challenges in multi-turn decision-making tasks (i.e., agent tasks) like web shopping and browser navigation, which require making a sequence of intelligent decisions based on environmental feedback. Previous work for LLM agents typically relies on elaborate prompt engineering or fine-tuning with expert trajectories to improve performance. In this work, we take a different perspective: we explore constructing process reward models (PRMs) to evaluate each decision and guide the agent's decision-making process. Unlike LLM reasoning, where each step is scored based on correctness, actions in agent tasks do not have a clear-cut correctness. Instead, they should be evaluated based on their proximity to the goal and the progress they have made. Building on this insight, we propose a re-defined PRM for agent tasks, named AgentPRM, to capture both the interdependence between sequential decisions and their contribution to the final goal. This enables better progress tracking and exploration-exploitation balance. To scalably obtain labeled data for training AgentPRM, we employ a Temporal Difference-based (TD-based) estimation method combined with Generalized Advantage Estimation (GAE), which proves more sample-efficient than prior methods. Extensive experiments across different agentic tasks show that AgentPRM is over $8\\times$ more compute-efficient than baselines, and it demonstrates robust improvement when scaling up test-time compute. Moreover, we perform detailed analyses to show how our method works and offer more insights, e.g., applying AgentPRM to the reinforcement learning of LLM agents.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08345",
        "abs_url": "https://arxiv.org/abs/2511.08345",
        "pdf_url": "https://arxiv.org/pdf/2511.08345",
        "title": "Revisiting Network Traffic Analysis: Compatible network flows for ML models",
        "authors": [
            "João Vitorino",
            "Daniela Pinto",
            "Eva Maia",
            "Ivone Amorim",
            "Isabel Praça"
        ],
        "comments": "16 pages, 12 tables, 1 figure, FPS 2025 conference",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "To ensure that Machine Learning (ML) models can perform a robust detection and classification of cyberattacks, it is essential to train them with high-quality datasets with relevant features. However, it can be difficult to accurately represent the complex traffic patterns of an attack, especially in Internet-of-Things (IoT) networks. This paper studies the impact that seemingly similar features created by different network traffic flow exporters can have on the generalization and robustness of ML models. In addition to the original CSV files of the Bot-IoT, IoT-23, and CICIoT23 datasets, the raw network packets of their PCAP files were analysed with the HERA tool, generating new labelled flows and extracting consistent features for new CSV versions. To assess the usefulness of these new flows for intrusion detection, they were compared with the original versions and were used to fine-tune multiple models. Overall, the results indicate that directly analysing and preprocessing PCAP files, instead of just using the commonly available CSV files, enables the computation of more relevant features to train bagging and gradient boosting decision tree ensembles. It is important to continue improving feature extraction and feature selection processes to make different datasets more compatible and enable a trustworthy evaluation and comparison of the ML models used in cybersecurity solutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08350",
        "abs_url": "https://arxiv.org/abs/2511.08350",
        "pdf_url": "https://arxiv.org/pdf/2511.08350",
        "title": "Revealing the Hidden Third Dimension of Point Defects in Two-Dimensional MXenes",
        "authors": [
            "Grace Guinan",
            "Michelle A. Smeaton",
            "Brian C. Wyatt",
            "Steven Goldy",
            "Hilary Egan",
            "Andrew Glaws",
            "Garritt J. Tucker",
            "Babak Anasori",
            "Steven R. Spurgeon"
        ],
        "comments": "38 pages, 13 figures",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG)",
        "abstract": "Point defects govern many important functional properties of two-dimensional (2D) materials. However, resolving the three-dimensional (3D) arrangement of these defects in multi-layer 2D materials remains a fundamental challenge, hindering rational defect engineering. Here, we overcome this limitation using an artificial intelligence-guided electron microscopy workflow to map the 3D topology and clustering of atomic vacancies in Ti$_3$C$_2$T$_X$ MXene. Our approach reconstructs the 3D coordinates of vacancies across hundreds of thousands of lattice sites, generating robust statistical insight into their distribution that can be correlated with specific synthesis pathways. This large-scale data enables us to classify a hierarchy of defect structures--from isolated vacancies to nanopores--revealing their preferred formation and interaction mechanisms, as corroborated by molecular dynamics simulations. This work provides a generalizable framework for understanding and ultimately controlling point defects across large volumes, paving the way for the rational design of defect-engineered functional 2D materials.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08362",
        "abs_url": "https://arxiv.org/abs/2511.08362",
        "pdf_url": "https://arxiv.org/pdf/2511.08362",
        "title": "An Information-Minimal Geometry for Qubit-Efficient Optimization",
        "authors": [
            "Gordon Ma",
            "Dimitris G. Angelakis"
        ],
        "comments": "39 pages, 9 figures",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "Qubit-efficient optimization seeks to represent an $N$-variable combinatorial problem within a Hilbert space smaller than $2^N$, using only as much quantum structure as the objective itself requires. Quadratic unconstrained binary optimization (QUBO) problems, for example, depend only on pairwise information -- expectations and correlations between binary variables -- yet standard quantum circuits explore exponentially large state spaces. We recast qubit-efficient optimization as a geometry problem: the minimal representation should match the $O(N^2)$ structure of quadratic objectives. The key insight is that the local-consistency problem -- ensuring that pairwise marginals correspond to a realizable global distribution -- coincides exactly with the Sherali-Adams level-2 polytope $\\mathrm{SA}(2)$, the tightest convex relaxation expressible at the two-body level. Previous qubit-efficient approaches enforced this consistency only implicitly. Here we make it explicit: (a) anchoring learning to the $\\mathrm{SA}(2)$ geometry, (b) projecting via a differentiable iterative-proportional-fitting (IPF) step, and (c) decoding through a maximum-entropy Gibbs sampler. This yields a logarithmic-width pipeline ($2\\lceil\\log_2 N\\rceil + 2$ qubits) that is classically simulable yet achieves strong empirical performance. On Gset Max-Cut instances (N=800--2000), depth-2--3 circuits reach near-optimal ratios ($r^* \\approx 0.99$), surpassing direct $\\mathrm{SA}(2)$ baselines. The framework resolves the local-consistency gap by giving it a concrete convex geometry and a minimal differentiable projection, establishing a clean polyhedral baseline. Extending beyond $\\mathrm{SA}(2)$ naturally leads to spectrahedral geometries, where curvature encodes global coherence and genuine quantum structure becomes necessary.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08394",
        "abs_url": "https://arxiv.org/abs/2511.08394",
        "pdf_url": "https://arxiv.org/pdf/2511.08394",
        "title": "Interaction Dynamics as a Reward Signal for LLMs",
        "authors": [
            "Sian Gooding",
            "Edward Grefenstette"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Human-Computer Interaction (cs.HC); Machine Learning (cs.LG)",
        "abstract": "The alignment of Large Language Models (LLMs) for multi-turn conversations typically relies on reward signals derived from the content of the text. This approach, however, overlooks a rich, complementary source of signal: the dynamics of the interaction itself. This paper introduces TRACE (Trajectory-based Reward for Agent Collaboration Estimation), a novel reward signal derived from the geometric properties of a dialogue's embedding trajectory--a concept we term 'conversational geometry'. Our central finding is that a reward model trained only on these structural signals achieves a pairwise accuracy (68.20%) comparable to a powerful LLM baseline that analyzes the full transcript (70.04%). Furthermore, a hybrid model combining interaction dynamics with textual analysis achieves the highest performance (80.17%), demonstrating their complementary nature. This work provides strong evidence that for interactive settings, how an agent communicates is as powerful a predictor of success as what it says, offering a new, privacy-preserving framework that not only aligns agents but also serves as a diagnostic tool for understanding the distinct interaction patterns that drive successful collaboration.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08401",
        "abs_url": "https://arxiv.org/abs/2511.08401",
        "pdf_url": "https://arxiv.org/pdf/2511.08401",
        "title": "Source-Optimal Training is Transfer-Suboptimal",
        "authors": [
            "C. Evans Hedges"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "We prove a fundamental misalignment in transfer learning: the source regularization that minimizes source risk almost never coincides with the regularization maximizing transfer benefit. Through sharp phase boundaries for L2-SP ridge regression, we characterize the transfer-optimal source penalty $\\tau_0^*$ and show it diverges predictably from task-optimal values, requiring stronger regularization in high-SNR regimes and weaker regularization in low-SNR regimes. Additionally, in isotropic settings the decision to transfer is remarkably independent of target sample size and noise, depending only on task alignment and source characteristics. CIFAR-10 and MNIST experiments confirm this counterintuitive pattern persists in non-linear networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08416",
        "abs_url": "https://arxiv.org/abs/2511.08416",
        "pdf_url": "https://arxiv.org/pdf/2511.08416",
        "title": "Generative AI Meets 6G and Beyond: Diffusion Models for Semantic Communications",
        "authors": [
            "Hai-Long Qin",
            "Jincheng Dai",
            "Guo Lu",
            "Shuo Shao",
            "Sixian Wang",
            "Tongda Xu",
            "Wenjun Zhang",
            "Ping Zhang",
            "Khaled B. Letaief"
        ],
        "comments": "Under review, GitHub repository: this https URL",
        "subjects": "Signal Processing (eess.SP); Information Theory (cs.IT); Machine Learning (cs.LG); Multimedia (cs.MM)",
        "abstract": "Semantic communications mark a paradigm shift from bit-accurate transmission toward meaning-centric communication, essential as wireless systems approach theoretical capacity limits. The emergence of generative AI has catalyzed generative semantic communications, where receivers reconstruct content from minimal semantic cues by leveraging learned priors. Among generative approaches, diffusion models stand out for their superior generation quality, stable training dynamics, and rigorous theoretical foundations. However, the field currently lacks systematic guidance connecting diffusion techniques to communication system design, forcing researchers to navigate disparate literatures. This article provides the first comprehensive tutorial on diffusion models for generative semantic communications. We present score-based diffusion foundations and systematically review three technical pillars: conditional diffusion for controllable generation, efficient diffusion for accelerated inference, and generalized diffusion for cross-domain adaptation. In addition, we introduce an inverse problem perspective that reformulates semantic decoding as posterior inference, bridging semantic communications with computational imaging. Through analysis of human-centric, machine-centric, and agent-centric scenarios, we illustrate how diffusion models enable extreme compression while maintaining semantic fidelity and robustness. By bridging generative AI innovations with communication system design, this article aims to establish diffusion models as foundational components of next-generation wireless networks and beyond.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08419",
        "abs_url": "https://arxiv.org/abs/2511.08419",
        "pdf_url": "https://arxiv.org/pdf/2511.08419",
        "title": "Probabilistic Safety Guarantee for Stochastic Control Systems Using Average Reward MDPs",
        "authors": [
            "Saber Omidi",
            "Marek Petrik",
            "Se Young Yoon",
            "Momotaz Begum"
        ],
        "comments": "Submitted to the Learning for Dynamics & Control (L4DC) 2026 conference",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG); Robotics (cs.RO); Optimization and Control (math.OC)",
        "abstract": "Safety in stochastic control systems, which are subject to random noise with a known probability distribution, aims to compute policies that satisfy predefined operational constraints with high confidence throughout the uncertain evolution of the state variables. The unpredictable evolution of state variables poses a significant challenge for meeting predefined constraints using various control methods. To address this, we present a new algorithm that computes safe policies to determine the safety level across a finite state set. This algorithm reduces the safety objective to the standard average reward Markov Decision Process (MDP) objective. This reduction enables us to use standard techniques, such as linear programs, to compute and analyze safe policies. We validate the proposed method numerically on the Double Integrator and the Inverted Pendulum systems. Results indicate that the average-reward MDPs solution is more comprehensive, converges faster, and offers higher quality compared to the minimum discounted-reward solution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08424",
        "abs_url": "https://arxiv.org/abs/2511.08424",
        "pdf_url": "https://arxiv.org/pdf/2511.08424",
        "title": "Identification of Empirical Constitutive Models for Age-Hardenable Aluminium Alloy and High-Chromium Martensitic Steel Using Symbolic Regression",
        "authors": [
            "Evgeniya Kabliman",
            "Gabriel Kronberger"
        ],
        "comments": "Accepted for publication in Special Issue on Symbolic Regression of the Philosphical Transactions of the Royal Society - Part A",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG)",
        "abstract": "Process-structure-property relationships are fundamental in materials science and engineering and are key to the development of new and improved materials. Symbolic regression serves as a powerful tool for uncovering mathematical models that describe these relationships. It can automatically generate equations to predict material behaviour under specific manufacturing conditions and optimize performance characteristics such as strength and elasticity. The present work illustrates how symbolic regression can derive constitutive models that describe the behaviour of various metallic alloys during plastic deformation. Constitutive modelling is a mathematical framework for understanding the relationship between stress and strain in materials under different loading conditions. In this study, two materials (age-hardenable aluminium alloy and high-chromium martensitic steel) and two different testing methods (compression and tension) are considered to obtain the required stress-strain data. The results highlight the benefits of using symbolic regression while also discussing potential challenges.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08438",
        "abs_url": "https://arxiv.org/abs/2511.08438",
        "pdf_url": "https://arxiv.org/pdf/2511.08438",
        "title": "Galactification: painting galaxies onto dark matter only simulations using a transformer-based model",
        "authors": [
            "Shivam Pandey",
            "Christopher C. Lovell",
            "Chirag Modi",
            "Benjamin D. Wandelt"
        ],
        "comments": "8 pages, 4 figures. , accepted at Machine Learning and the Physical Sciences Workshop at NeurIPS 2025",
        "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)",
        "abstract": "Connecting the formation and evolution of galaxies to the large-scale structure is crucial for interpreting cosmological observations. While hydrodynamical simulations accurately model the correlated properties of galaxies, they are computationally prohibitive to run over volumes that match modern surveys. We address this by developing a framework to rapidly generate mock galaxy catalogs conditioned on inexpensive dark-matter-only simulations. We present a multi-modal, transformer-based model that takes 3D dark matter density and velocity fields as input, and outputs a corresponding point cloud of galaxies with their physical properties. We demonstrate that our trained model faithfully reproduces a variety of galaxy summary statistics and correctly captures their variation with changes in the underlying cosmological and astrophysical parameters, making it the first accelerated forward model to capture all the relevant galaxy properties, their full spatial distribution, and their conditional dependencies in hydrosimulations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08491",
        "abs_url": "https://arxiv.org/abs/2511.08491",
        "pdf_url": "https://arxiv.org/pdf/2511.08491",
        "title": "Toward Autonomous and Efficient Cybersecurity: A Multi-Objective AutoML-based Intrusion Detection System",
        "authors": [
            "Li Yang",
            "Abdallah Shami"
        ],
        "comments": "Accepted and To Appear in IEEE Transactions on Machine Learning in Communications and Networking (TMLCN); Code is available at Github link: this https URL",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "With increasingly sophisticated cybersecurity threats and rising demand for network automation, autonomous cybersecurity mechanisms are becoming critical for securing modern networks. The rapid expansion of Internet of Things (IoT) systems amplifies these challenges, as resource-constrained IoT devices demand scalable and efficient security solutions. In this work, an innovative Intrusion Detection System (IDS) utilizing Automated Machine Learning (AutoML) and Multi-Objective Optimization (MOO) is proposed for autonomous and optimized cyber-attack detection in modern networking environments. The proposed IDS framework integrates two primary innovative techniques: Optimized Importance and Percentage-based Automated Feature Selection (OIP-AutoFS) and Optimized Performance, Confidence, and Efficiency-based Combined Algorithm Selection and Hyperparameter Optimization (OPCE-CASH). These components optimize feature selection and model learning processes to strike a balance between intrusion detection effectiveness and computational efficiency. This work presents the first IDS framework that integrates all four AutoML stages and employs multi-objective optimization to jointly optimize detection effectiveness, efficiency, and confidence for deployment in resource-constrained systems. Experimental evaluations over two benchmark cybersecurity datasets demonstrate that the proposed MOO-AutoML IDS outperforms state-of-the-art IDSs, establishing a new benchmark for autonomous, efficient, and optimized security for networks. Designed to support IoT and edge environments with resource constraints, the proposed framework is applicable to a variety of autonomous cybersecurity applications across diverse networked environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 113,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08505",
        "abs_url": "https://arxiv.org/abs/2511.08505",
        "pdf_url": "https://arxiv.org/pdf/2511.08505",
        "title": "Structured RAG for Answering Aggregative Questions",
        "authors": [
            "Omri Koshorek",
            "Niv Granot",
            "Aviv Alloni",
            "Shahar Admati",
            "Roee Hendel",
            "Ido Weiss",
            "Alan Arazi",
            "Shay-Nitzan Cohen",
            "Yonatan Belinkov"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Retrieval-Augmented Generation (RAG) has become the dominant approach for answering questions over large corpora. However, current datasets and methods are highly focused on cases where only a small part of the corpus (usually a few paragraphs) is relevant per query, and fail to capture the rich world of aggregative queries. These require gathering information from a large set of documents and reasoning over them. To address this gap, we propose S-RAG, an approach specifically designed for such queries. At ingestion time, S-RAG constructs a structured representation of the corpus; at inference time, it translates natural-language queries into formal queries over said representation. To validate our approach and promote further research in this area, we introduce two new datasets of aggregative queries: HOTELS and WORLD CUP. Experiments with S-RAG on the newly introduced datasets, as well as on a public benchmark, demonstrate that it substantially outperforms both common RAG systems and long-context LLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 114,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08573",
        "abs_url": "https://arxiv.org/abs/2511.08573",
        "pdf_url": "https://arxiv.org/pdf/2511.08573",
        "title": "SENCA-st: Integrating Spatial Transcriptomics and Histopathology with Cross Attention Shared Encoder for Region Identification in Cancer Pathology",
        "authors": [
            "Shanaka Liyanaarachchi",
            "Chathurya Wijethunga",
            "Shihab Aaquil Ahamed",
            "Akthas Absar",
            "Ranga Rodrigo"
        ],
        "comments": "Accepted at WACV 2026",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Spatial transcriptomics is an emerging field that enables the identification of functional regions based on the spatial distribution of gene expression. Integrating this functional information present in transcriptomic data with structural data from histopathology images is an active research area with applications in identifying tumor substructures associated with cancer drug resistance. Current histopathology-spatial-transcriptomic region segmentation methods suffer due to either making spatial transcriptomics prominent by using histopathology features just to assist processing spatial transcriptomics data or using vanilla contrastive learning that make histopathology images prominent due to only promoting common features losing functional information. In both extremes, the model gets either lost in the noise of spatial transcriptomics or overly smoothed, losing essential information. Thus, we propose our novel architecture SENCA-st (Shared Encoder with Neighborhood Cross Attention) that preserves the features of both modalities. More importantly, it emphasizes regions that are structurally similar in histopathology but functionally different on spatial transcriptomics using cross-attention. We demonstrate the superior performance of our model that surpasses state-of-the-art methods in detecting tumor heterogeneity and tumor micro-environment regions, a clinically crucial aspect.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 115,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08577",
        "abs_url": "https://arxiv.org/abs/2511.08577",
        "pdf_url": "https://arxiv.org/pdf/2511.08577",
        "title": "Think-at-Hard: Selective Latent Iterations to Improve Reasoning Language Models",
        "authors": [
            "Tianyu Fu",
            "Yichen You",
            "Zekai Chen",
            "Guohao Dai",
            "Huazhong Yang",
            "Yu Wang"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Performance (cs.PF)",
        "abstract": "Improving reasoning capabilities of Large Language Models (LLMs), especially under parameter constraints, is crucial for real-world applications. Prior work proposes recurrent transformers, which allocate a fixed number of extra iterations per token to improve generation quality. After the first, standard forward pass, instead of verbalization, last-layer hidden states are fed back as inputs for additional iterations to refine token predictions. Yet we identify a latent overthinking phenomenon: easy token predictions that are already correct after the first pass are sometimes revised into errors in additional iterations. To address this, we propose Think-at-Hard (TaH), a dynamic latent thinking method that iterates deeper only at hard tokens. It employs a lightweight neural decider to trigger latent iterations only at tokens that are likely incorrect after the standard forward pass. During latent iterations, Low-Rank Adaptation (LoRA) modules shift the LLM objective from general next-token prediction to focused hard-token refinement. We further introduce a duo-causal attention mechanism that extends attention from the token sequence dimension to an additional iteration depth dimension. This enables cross-iteration information flow while maintaining full sequential parallelism. Experiments show that TaH boosts LLM reasoning performance across five challenging benchmarks while maintaining the same parameter count. Compared with baselines that iterate twice for all output tokens, TaH delivers 8.1-11.3% accuracy gains while exempting 94% of tokens from the second iteration. Against strong single-iteration Qwen3 models finetuned with the same data, it also delivers 4.0-5.0% accuracy gains. When allowing less than 3% additional parameters from LoRA and the iteration decider, the gains increase to 8.5-12.6% and 5.3-5.4%, respectively. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 116,
        "date": "2025-11-12",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-12?abs=True",
        "arxiv_id": "2511.08583",
        "abs_url": "https://arxiv.org/abs/2511.08583",
        "pdf_url": "https://arxiv.org/pdf/2511.08583",
        "title": "SeFA-Policy: Fast and Accurate Visuomotor Policy Learning with Selective Flow Alignment",
        "authors": [
            "Rong Xue",
            "Jiageng Mao",
            "Mingtong Zhang",
            "Yue Wang"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Developing efficient and accurate visuomotor policies poses a central challenge in robotic imitation learning. While recent rectified flow approaches have advanced visuomotor policy learning, they suffer from a key limitation: After iterative distillation, generated actions may deviate from the ground-truth actions corresponding to the current visual observation, leading to accumulated error as the reflow process repeats and unstable task execution. We present Selective Flow Alignment (SeFA), an efficient and accurate visuomotor policy learning framework. SeFA resolves this challenge by a selective flow alignment strategy, which leverages expert demonstrations to selectively correct generated actions and restore consistency with observations, while preserving multimodality. This design introduces a consistency correction mechanism that ensures generated actions remain observation-aligned without sacrificing the efficiency of one-step flow inference. Extensive experiments across both simulated and real-world manipulation tasks show that SeFA Policy surpasses state-of-the-art diffusion-based and flow-based policies, achieving superior accuracy and robustness while reducing inference latency by over 98%. By unifying rectified flow efficiency with observation-consistent action generation, SeFA provides a scalable and dependable solution for real-time visuomotor policy learning. Code is available on this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]