[
    {
        "order": 1,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16715",
        "abs_url": "https://arxiv.org/abs/2511.16715",
        "pdf_url": "https://arxiv.org/pdf/2511.16715",
        "title": "DDTime: Dataset Distillation with Spectral Alignment and Information Bottleneck for Time-Series Forecasting",
        "authors": [
            "Yuqi Li",
            "Kuiye Ding",
            "Chuanguang Yang",
            "Hao Wang",
            "Haoxuan Wang",
            "Huiran Duan",
            "Junming Liu",
            "Yingli Tian"
        ],
        "comments": "36 pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Time-series forecasting is fundamental across many domains, yet training accurate models often requires large-scale datasets and substantial computational resources. Dataset distillation offers a promising alternative by synthesizing compact datasets that preserve the learning behavior of full data. However, extending dataset distillation to time-series forecasting is non-trivial due to two fundamental challenges: this http URL bias from strong autocorrelation, which leads to distorted value-term alignment between teacher and student models; and this http URL diversity among synthetic samples, arising from the absence of explicit categorical priors to regularize trajectory variety. In this work, we propose DDTime, a lightweight and plug-in distillation framework built upon first-order condensation decomposition. To tackle Challenge 1, it revisits value-term alignment through temporal statistics and introduces a frequency-domain alignment mechanism to mitigate autocorrelation-induced bias, ensuring spectral consistency and temporal fidelity. To address Challenge 2, we further design an inter-sample regularization inspired by the information bottleneck principle, which enhances diversity and maximizes information density across synthetic trajectories. The combined objective is theoretically compatible with a wide range of condensation paradigms and supports stable first-order optimization. Extensive experiments on 20 benchmark datasets and diverse forecasting architectures demonstrate that DDTime consistently outperforms existing distillation methods, achieving about 30% relative accuracy gains while introducing about 2.49% computational overhead. All code and distilled datasets will be released.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16767",
        "abs_url": "https://arxiv.org/abs/2511.16767",
        "pdf_url": "https://arxiv.org/pdf/2511.16767",
        "title": "When Structure Doesn't Help: LLMs Do Not Read Text-Attributed Graphs as Effectively as We Expected",
        "authors": [
            "Haotian Xu",
            "Yuning You",
            "Tengfei Ma"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graphs provide a unified representation of semantic content and relational structure, making them a natural fit for domains such as molecular modeling, citation networks, and social graphs. Meanwhile, large language models (LLMs) have excelled at understanding natural language and integrating cross-modal signals, sparking interest in their potential for graph reasoning. Recent work has explored this by either designing template-based graph templates or using graph neural networks (GNNs) to encode structural information. In this study, we investigate how different strategies for encoding graph structure affect LLM performance on text-attributed graphs. Surprisingly, our systematic experiments reveal that: (i) LLMs leveraging only node textual descriptions already achieve strong performance across tasks; and (ii) most structural encoding strategies offer marginal or even negative gains. We show that explicit structural priors are often unnecessary and, in some cases, counterproductive when powerful language models are involved. This represents a significant departure from traditional graph learning paradigms and highlights the need to rethink how structure should be represented and utilized in the LLM era. Our study is to systematically challenge the foundational assumption that structure is inherently beneficial for LLM-based graph reasoning, opening the door to new, semantics-driven approaches for graph learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16778",
        "abs_url": "https://arxiv.org/abs/2511.16778",
        "pdf_url": "https://arxiv.org/pdf/2511.16778",
        "title": "GCL-OT: Graph Contrastive Learning with Optimal Transport for Heterophilic Text-Attributed Graphs",
        "authors": [
            "Yating Ren",
            "Yikun Ban",
            "Huobin Tan"
        ],
        "comments": "AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recently, structure-text contrastive learning has shown promising performance on text-attributed graphs by leveraging the complementary strengths of graph neural networks and language models. However, existing methods typically rely on homophily assumptions in similarity estimation and hard optimization objectives, which limit their applicability to heterophilic graphs. Although existing methods can mitigate heterophily through structural adjustments or neighbor aggregation, they usually treat textual embeddings as static targets, leading to suboptimal alignment. In this work, we identify the multi-granular heterophily in text-attributed graphs, including complete heterophily, partial heterophily, and latent homophily, which makes structure-text alignment particularly challenging due to mixed, noisy, and missing semantic correlations. To achieve flexible and bidirectional alignment, we propose GCL-OT, a novel graph contrastive learning framework with optimal transport, equipped with tailored mechanisms for each type of heterophily. Specifically, for partial heterophily, we design a RealSoftMax-based similarity estimator to emphasize key neighbor-word interactions while easing background noise. For complete heterophily, we introduce a prompt-based filter that adaptively excludes irrelevant noise during optimal transport alignment. Furthermore, we incorporate OT-guided soft supervision to uncover potential neighbors with similar semantics, enhancing the learning of latent homophily. Theoretical analysis shows that GCL-OT can improve the mutual information bound and Bayes error guarantees. Extensive experiments on nine benchmarks show that GCL-OT consistently outperforms state-of-the-art methods, verifying its effectiveness and robustness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16795",
        "abs_url": "https://arxiv.org/abs/2511.16795",
        "pdf_url": "https://arxiv.org/pdf/2511.16795",
        "title": "A Vector Symbolic Approach to Multiple Instance Learning",
        "authors": [
            "Ehsan Ahmed Dhrubo",
            "Mohammad Mahmudul Alam",
            "Edward Raff",
            "Tim Oates",
            "James Holt"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multiple Instance Learning (MIL) tasks impose a strict logical constraint: a bag is labeled positive if and only if at least one instance within it is positive. While this iff constraint aligns with many real-world applications, recent work has shown that most deep learning-based MIL approaches violate it, leading to inflated performance metrics and poor generalization. We propose a novel MIL framework based on Vector Symbolic Architectures (VSAs), which provide a differentiable mechanism for performing symbolic operations in high-dimensional space. Our method encodes the MIL assumption directly into the model's structure by representing instances and concepts as nearly orthogonal high-dimensional vectors and using algebraic operations to enforce the iff constraint during classification. To bridge the gap between raw data and VSA representations, we design a learned encoder that transforms input instances into VSA-compatible vectors while preserving key distributional properties. Our approach, which includes a VSA-driven MaxNetwork classifier, achieves state-of-the-art results for a valid MIL model on standard MIL benchmarks and medical imaging datasets, outperforming existing methods while maintaining strict adherence to the MIL formulation. This work offers a principled, interpretable, and effective alternative to existing MIL approaches that rely on learned heuristics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16822",
        "abs_url": "https://arxiv.org/abs/2511.16822",
        "pdf_url": "https://arxiv.org/pdf/2511.16822",
        "title": "A Robust Federated Learning Approach for Combating Attacks Against IoT Systems Under non-IID Challenges",
        "authors": [
            "Eyad Gad",
            "Zubair Md Fadlullah",
            "Mostafa M. Fouda"
        ],
        "comments": "6 pages, conference paper; presented at the 2024 International Conference on Smart Applications, Communications and Networking (SmartNets 2024), Harrisonburg, VA, USA, May 28, 2024",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Cryptography and Security (cs.CR)",
        "abstract": "In the context of the growing proliferation of user devices and the concurrent surge in data volumes, the complexities arising from the substantial increase in data have posed formidable challenges to conventional machine learning model training. Particularly, this is evident within resource-constrained and security-sensitive environments such as those encountered in networks associated with the Internet of Things (IoT). Federated Learning has emerged as a promising remedy to these challenges by decentralizing model training to edge devices or parties, effectively addressing privacy concerns and resource limitations. Nevertheless, the presence of statistical heterogeneity in non-Independently and Identically Distributed (non-IID) data across different parties poses a significant hurdle to the effectiveness of FL. Many FL approaches have been proposed to enhance learning effectiveness under statistical heterogeneity. However, prior studies have uncovered a gap in the existing research landscape, particularly in the absence of a comprehensive comparison between federated methods addressing statistical heterogeneity in detecting IoT attacks. In this research endeavor, we delve into the exploration of FL algorithms, specifically FedAvg, FedProx, and Scaffold, under different data distributions. Our focus is on achieving a comprehensive understanding of and addressing the challenges posed by statistical heterogeneity. In this study, We classify large-scale IoT attacks by utilizing the CICIoT2023 dataset. Through meticulous analysis and experimentation, our objective is to illuminate the performance nuances of these FL methods, providing valuable insights for researchers and practitioners in the domain.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16828",
        "abs_url": "https://arxiv.org/abs/2511.16828",
        "pdf_url": "https://arxiv.org/pdf/2511.16828",
        "title": "ManifoldFormer: Geometric Deep Learning for Neural Dynamics on Riemannian Manifolds",
        "authors": [
            "Yihang Fu",
            "Lifang He",
            "Qingyu Chen"
        ],
        "comments": "5 pages, under review by ICASSP",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Existing EEG foundation models mainly treat neural signals as generic time series in Euclidean space, ignoring the intrinsic geometric structure of neural dynamics that constrains brain activity to low-dimensional manifolds. This fundamental mismatch between model assumptions and neural geometry limits representation quality and cross-subject generalization. ManifoldFormer addresses this limitation through a novel geometric deep learning framework that explicitly learns neural manifold representations. The architecture integrates three key innovations: a Riemannian VAE for manifold embedding that preserves geometric structure, a geometric Transformer with geodesic-aware attention mechanisms operating directly on neural manifolds, and a dynamics predictor leveraging neural ODEs for manifold-constrained temporal evolution. Extensive evaluation across four public datasets demonstrates substantial improvements over state-of-the-art methods, with 4.6-4.8% higher accuracy and 6.2-10.2% higher Cohen's Kappa, while maintaining robust cross-subject generalization. The geometric approach reveals meaningful neural patterns consistent with neurophysiological principles, establishing geometric constraints as essential for effective EEG foundation models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16845",
        "abs_url": "https://arxiv.org/abs/2511.16845",
        "pdf_url": "https://arxiv.org/pdf/2511.16845",
        "title": "Provably Minimum-Length Conformal Prediction Sets for Ordinal Classification",
        "authors": [
            "Zijian Zhang",
            "Xinyu Chen",
            "Yuanjie Shi",
            "Liyuan Lillian Ma",
            "Zifan Xu",
            "Yan Yan"
        ],
        "comments": "Submitted to AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Ordinal classification has been widely applied in many high-stakes applications, e.g., medical imaging and diagnosis, where reliable uncertainty quantification (UQ) is essential for decision making. Conformal prediction (CP) is a general UQ framework that provides statistically valid guarantees, which is especially useful in practice. However, prior ordinal CP methods mainly focus on heuristic algorithms or restrictively require the underlying model to predict a unimodal distribution over ordinal labels. Consequently, they provide limited insight into coverage-efficiency trade-offs, or a model-agnostic and distribution-free nature favored by CP methods. To this end, we fill this gap by propose an ordinal-CP method that is model-agnostic and provides instance-level optimal prediction intervals. Specifically, we formulate conformal ordinal classification as a minimum-length covering problem at the instance level. To solve this problem, we develop a sliding-window algorithm that is optimal on each calibration data, with only a linear time complexity in K, the number of label candidates. The local optimality per instance further also improves predictive efficiency in expectation. Moreover, we propose a length-regularized variant that shrinks prediction set size while preserving coverage. Experiments on four benchmark datasets from diverse domains are conducted to demonstrate the significantly improved predictive efficiency of the proposed methods over baselines (by 15% decrease on average over four datasets).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16849",
        "abs_url": "https://arxiv.org/abs/2511.16849",
        "pdf_url": "https://arxiv.org/pdf/2511.16849",
        "title": "Better audio representations are more brain-like: linking model-brain alignment with performance in downstream auditory tasks",
        "authors": [
            "Leonardo Pepino",
            "Pablo Riera",
            "Juan Kamienkowski",
            "Luciana Ferrer"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Sound (cs.SD)",
        "abstract": "Artificial neural networks (ANNs) are increasingly powerful models of brain computation, yet it remains unclear whether improving their task performance also makes their internal representations more similar to brain signals. To address this question in the auditory domain, we quantified the alignment between the internal representations of 36 different audio models and brain activity from two independent fMRI datasets. Using voxel-wise and component-wise regression, and representation similarity analysis (RSA), we found that recent self-supervised audio models with strong performance in diverse downstream tasks are better predictors of auditory cortex activity than older and more specialized models. To assess the quality of the audio representations, we evaluated these models in 6 auditory tasks from the HEAREval benchmark, spanning music, speech, and environmental sounds. This revealed strong positive Pearson correlations ($r>0.7$) between a model's overall task performance and its alignment with brain representations. Finally, we analyzed the evolution of the similarity between audio and brain representations during the pretraining of EnCodecMAE. We discovered that brain similarity increases progressively and emerges early during pretraining, despite the model not being explicitly optimized for this objective. This suggests that brain-like representations can be an emergent byproduct of learning to reconstruct missing information from naturalistic audio data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16856",
        "abs_url": "https://arxiv.org/abs/2511.16856",
        "pdf_url": "https://arxiv.org/pdf/2511.16856",
        "title": "The use of vocal biomarkers in the detection of Parkinson's disease: a robust statistical performance comparison of classic machine learning models",
        "authors": [
            "Katia Pires Nascimento do Sacramento",
            "Elliot Q. C. Garcia",
            "Nicéias Silva Vilela",
            "Vinicius P. Sacramento",
            "Tiago A. E. Ferreira"
        ],
        "comments": "18 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Parkinson's disease (PD) is a progressive neurodegenerative disorder that, in addition to directly impairing functional mobility, is frequently associated with vocal impairments such as hypophonia and dysarthria, which typically manifest in the early stages. The use of vocal biomarkers to support the early diagnosis of PD presents a non-invasive, low-cost, and accessible alternative in clinical settings. Thus, the objective of this cross-sectional study was to consistently evaluate the effectiveness of a Deep Neural Network (DNN) in distinguishing individuals with Parkinson's disease from healthy controls, in comparison with traditional Machine Learning (ML) methods, using vocal biomarkers. Two publicly available voice datasets were used. Mel-frequency cepstral coefficients (MFCCs) were extracted from the samples, and model robustness was assessed using a validation strategy with 1000 independent random executions. Performance was evaluated using classification statistics. Since normality assumptions were not satisfied, non-parametric tests (Kruskal-Wallis and Bonferroni post-hoc tests) were applied to verify whether the tested classification models were similar or different in the classification of PD. With an average accuracy of $98.65\\%$ and $92.11\\%$ on the Italian Voice dataset and Parkinson's Telemonitoring dataset, respectively, the DNN demonstrated superior performance and efficiency compared to traditional ML models, while also achieving competitive results when benchmarked against relevant studies. Overall, this study confirms the efficiency of DNNs and emphasizes their potential to provide greater accuracy and reliability for the early detection of neurodegenerative diseases using voice-based biomarkers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16871",
        "abs_url": "https://arxiv.org/abs/2511.16871",
        "pdf_url": "https://arxiv.org/pdf/2511.16871",
        "title": "Topologic Attention Networks: Attending to Direct and Indirect Neighbors through Gaussian Belief Propagation",
        "authors": [
            "Marshall Rosenhoover",
            "Huaming Zhang"
        ],
        "comments": "15 pages, 13 Figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph Neural Networks rely on local message passing, which limits their ability to model long-range dependencies in graphs. Existing approaches extend this range through continuous-time dynamics or dense self-attention, but both suffer from high computational cost and limited scalability. We propose Topologic Attention Networks, a new framework that applies topologic attention, a probabilistic mechanism that learns how information should flow through both direct and indirect connections in a graph. Unlike conventional attention that depends on explicit pairwise interactions, topologic attention emerges from the learned information propagation of the graph, enabling unified reasoning over local and global relationships. This method achieves provides state-of-the-art performance across all measured baseline models. Our implementation is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16883",
        "abs_url": "https://arxiv.org/abs/2511.16883",
        "pdf_url": "https://arxiv.org/pdf/2511.16883",
        "title": "PersonalizedRouter: Personalized LLM Routing via Graph-based User Preference Modeling",
        "authors": [
            "Zhongjie Dai",
            "Tao Feng",
            "Jiaxuan You"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The growing number of Large Language Models (LLMs) with diverse capabilities and response styles provides users with a wider range of choices, which presents challenges in selecting appropriate LLMs, as user preferences vary in terms of performance, cost, and response style. Current LLM selection methods typically optimize for a single fixed objective, such as performance, cost, or a trade-off between them, and fail to learn individual user preferences from interaction data. To address these limitations, we propose PersonalizedRouter, a graph-based framework that models diverse user profiles and performs personalized LLM selection by leveraging interaction data that includes task context, queries, candidate LLMs, and user decisions. To capture contextual information between user queries and optimal LLMs, PersonalizedRouter converts the interaction data into a heterogeneous graph, where the relationships between different types of nodes are represented by edges. To evaluate adaptability across users, we design two strategies: the multi-cost-efficiency simulation strategy and the LLM-as-a-Judge strategy. In addition, we construct PersonaRoute-Bench, a large-scale benchmark with 1,000 simulated users and 10 LLMs. Experimental results show that PersonalizedRouter significantly outperforms existing LLM selection methods and surpasses the strongest methods by a large margin of 15.38% and 9.83% under two simulation strategies. On the PersonaRoute-Bench with 1,000 users, it further surpasses the best methods by 16.19% and 59.69% while maintaining higher efficiency. Moreover, PersonalizedRouter demonstrates strong few-shot generalization, achieving 64.81% and 85.80% of the fully trained model's performance when adapting to new users and new LLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16905",
        "abs_url": "https://arxiv.org/abs/2511.16905",
        "pdf_url": "https://arxiv.org/pdf/2511.16905",
        "title": "Predicting Talent Breakout Rate using Twitter and TV data",
        "authors": [
            "Bilguun Batsaikhan",
            "Hiroyuki Fukuda"
        ],
        "comments": "4 pages. Presented at the 34th Annual Conference of the Japanese Society for Artificial Intelligence (JSAI 2020), paper ID 1K3-ES-2-02",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Early detection of rising talents is of paramount importance in the field of advertising. In this paper, we define a concept of talent breakout and propose a method to detect Japanese talents before their rise to stardom. The main focus of the study is to determine the effectiveness of combining Twitter and TV data on predicting time-dependent changes in social data. Although traditional time-series models are known to be robust in many applications, the success of neural network models in various fields (e.g.\\ Natural Language Processing, Computer Vision, Reinforcement Learning) continues to spark an interest in the time-series community to apply new techniques in practice. Therefore, in order to find the best modeling approach, we have experimented with traditional, neural network and ensemble learning methods. We observe that ensemble learning methods outperform traditional and neural network models based on standard regression metrics. However, by utilizing the concept of talent breakout, we are able to assess the true forecasting ability of the models, where neural networks outperform traditional and ensemble learning methods in terms of precision and recall.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16923",
        "abs_url": "https://arxiv.org/abs/2511.16923",
        "pdf_url": "https://arxiv.org/pdf/2511.16923",
        "title": "A Hybrid Computational Intelligence Framework for scRNA-seq Imputation: Integrating scRecover and Random Forests",
        "authors": [
            "Ali Anaissi",
            "Deshao Liu",
            "Yuanzhe Jia",
            "Weidong Huang",
            "Widad Alyassine",
            "Junaid Akram"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Genomics (q-bio.GN)",
        "abstract": "Single-cell RNA sequencing (scRNA-seq) enables transcriptomic profiling at cellular resolution but suffers from pervasive dropout events that obscure biological signals. We present SCR-MF, a modular two-stage workflow that combines principled dropout detection using scRecover with robust non-parametric imputation via missForest. Across public and simulated datasets, SCR-MF achieves robust and interpretable performance comparable to or exceeding existing imputation methods in most cases, while preserving biological fidelity and transparency. Runtime analysis demonstrates that SCR-MF provides a competitive balance between accuracy and computational efficiency, making it suitable for mid-scale single-cell datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16929",
        "abs_url": "https://arxiv.org/abs/2511.16929",
        "pdf_url": "https://arxiv.org/pdf/2511.16929",
        "title": "CroTad: A Contrastive Reinforcement Learning Framework for Online Trajectory Anomaly Detection",
        "authors": [
            "Rui Xue",
            "Dan He",
            "Fengmei Jin",
            "Chen Zhang",
            "Xiaofang Zhou"
        ],
        "comments": "18 pages, 4 figures, will be submitted to VLDBJ",
        "subjects": "Machine Learning (cs.LG); Databases (cs.DB)",
        "abstract": "Detecting trajectory anomalies is a vital task in modern Intelligent Transportation Systems (ITS), enabling the identification of unsafe, inefficient, or irregular travel behaviours. While deep learning has emerged as the dominant approach, several key challenges remain unresolved. First, sub-trajectory anomaly detection, capable of pinpointing the precise segments where anomalies occur, remains underexplored compared to whole-trajectory analysis. Second, many existing methods depend on carefully tuned thresholds, limiting their adaptability in real-world applications. Moreover, the irregular sampling of trajectory data and the presence of noise in training sets further degrade model performance, making it difficult to learn reliable representations of normal routes. To address these challenges, we propose a contrastive reinforcement learning framework for online trajectory anomaly detection, CroTad. Our method is threshold-free and robust to noisy, irregularly sampled data. By incorporating contrastive learning, CroTad learns to extract diverse normal travel patterns for different itineraries and effectively distinguish anomalous behaviours at both sub-trajectory and point levels. The detection module leverages deep reinforcement learning to perform online, real-time anomaly scoring, enabling timely and fine-grained identification of abnormal segments. Extensive experiments on two real-world datasets demonstrate the effectiveness and robustness of our framework across various evaluation scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16933",
        "abs_url": "https://arxiv.org/abs/2511.16933",
        "pdf_url": "https://arxiv.org/pdf/2511.16933",
        "title": "A novel approach to classification of ECG arrhythmia types with latent ODEs",
        "authors": [
            "Angelina Yan",
            "Matt L. Sampson",
            "Peter Melchior"
        ],
        "comments": "Accepted into NeurIPS 2025 Learning from Time Series for Health workshop",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "12-lead ECGs with high sampling frequency are the clinical gold standard for arrhythmia detection, but their short-term, spot-check nature often misses intermittent events. Wearable ECGs enable long-term monitoring but suffer from irregular, lower sampling frequencies due to battery constraints, making morphology analysis challenging. We present an end-to-end classification pipeline to address these issues. We train a latent ODE to model continuous ECG waveforms and create robust feature vectors from high-frequency single-channel signals. We construct three latent vectors per waveform via downsampling the initial 360 Hz ECG to 90 Hz and 45 Hz. We then use a gradient boosted tree to classify these vectors and test robustness across frequencies. Performance shows minimal degradation, with macro-averaged AUC-ROC values of 0.984, 0.978, and 0.976 at 360 Hz, 90 Hz, and 45 Hz, respectively, suggesting a way to sidestep the trade-off between signal fidelity and battery life. This enables smaller wearables, promoting long-term monitoring of cardiac health.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16972",
        "abs_url": "https://arxiv.org/abs/2511.16972",
        "pdf_url": "https://arxiv.org/pdf/2511.16972",
        "title": "ToC: Tree-of-Claims Search with Multi-Agent Language Models",
        "authors": [
            "Shuyang Yu",
            "Jianan Liang",
            "Hui Hu"
        ],
        "comments": "Accepted by AAAI 2026 (Oral)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Optimizing patent claims is a critical yet challenging task, demanding careful balance between maximizing novelty and preserving legal scope. Manual claim drafting is labor-intensive, costly, and inherently inconsistent, while conventional Large Language Models (LLMs) often lack the structured, iterative reasoning essential for precise claim refinement. To address these challenges, we introduce Tree of Claims (ToC), an innovative framework that redefines claim editing as a guided search problem. ToC synergistically integrates Monte Carlo Tree Search (MCTS) with a collaborative multi-agent system, comprising an LLM-based EditorAgent that proposes contextually grounded edits, and an ExaminerAgent that mimics patent examiner critiques through structured, chain-of-thought analyses of novelty and prior art disclosure. Driven by a carefully designed multi-objective reward function, ToC jointly optimizes novelty, scope retention, and semantic coherence. Experimental evaluation on a benchmark of 1145 claims demonstrates that ToC significantly outperforms standard LLMs in zero-shot and few-shot scenarios, achieving an average composite score improvement of 8\\%, and up to 9\\% in certain cases. Extensive experiments, including detailed ablation studies, validate ToC's efficacy in generating superior, legally robust claim revisions. Overall, ToC establishes a transparent, controllable, and interpretable methodology that effectively bridges advanced LLM reasoning capabilities with strategic MCTS planning for structured patent claim this http URL source code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16976",
        "abs_url": "https://arxiv.org/abs/2511.16976",
        "pdf_url": "https://arxiv.org/pdf/2511.16976",
        "title": "Gradient flow for deep equilibrium single-index models",
        "authors": [
            "Sanjit Dandapanthula",
            "Aaditya Ramdas"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Statistics Theory (math.ST); Machine Learning (stat.ML)",
        "abstract": "Deep equilibrium models (DEQs) have recently emerged as a powerful paradigm for training infinitely deep weight-tied neural networks that achieve state of the art performance across many modern machine learning tasks. Despite their practical success, theoretically understanding the gradient descent dynamics for training DEQs remains an area of active research. In this work, we rigorously study the gradient descent dynamics for DEQs in the simple setting of linear models and single-index models, filling several gaps in the literature. We prove a conservation law for linear DEQs which implies that the parameters remain trapped on spheres during training and use this property to show that gradient flow remains well-conditioned for all time. We then prove linear convergence of gradient descent to a global minimizer for linear DEQs and deep equilibrium single-index models under appropriate initialization and with a sufficiently small step size. Finally, we validate our theoretical findings through experiments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16992",
        "abs_url": "https://arxiv.org/abs/2511.16992",
        "pdf_url": "https://arxiv.org/pdf/2511.16992",
        "title": "FIRM: Federated In-client Regularized Multi-objective Alignment for Large Language Models",
        "authors": [
            "Fatemeh",
            "Nourzad",
            "Amirhossein Roknilamouki",
            "Eylem Ekici",
            "Ness B. Shroff"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Aligning Large Language Models (LLMs) with human values often involves balancing multiple, conflicting objectives such as helpfulness and harmlessness. Training these models is computationally intensive, and centralizing the process raises significant data privacy concerns. Federated Learning (FL) offers a compelling alternative, but existing Federated Multi-Objective Optimization (FMOO) methods face severe communication bottlenecks as their reliance on transmitting multiple gradients to a server is unscalable for large models. We introduce FIRM (Federated In-client Regularized Multi-objective alignment), a novel algorithm that achieves both client disagreement drift mitigation and communication efficiency. In FIRM, each client locally solves a regularized multi-objective optimization problem. By directly mitigating client disagreement drift through in-client regularization, our method eliminates the need for the multi-gradient transmissions common in prior works. Consequently, clients need only to transmit a single set of adapted parameters, maintaining high communication efficiency. We prove that our algorithm converges to Pareto-stationary points and, to our knowledge, provide the first finite-time convergence guarantees for this federated multi-objective alignment setting. Empirically, we show that FIRM leads to smoother training dynamics, reduced client disagreement drift, and improved reward trade-offs compared to baselines. We further propose a method to incorporate a preference over the objectives and report empirical Pareto plots, demonstrating that FIRM can smoothly adapt trade-offs between objectives in response to specified preferences.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17008",
        "abs_url": "https://arxiv.org/abs/2511.17008",
        "pdf_url": "https://arxiv.org/pdf/2511.17008",
        "title": "Mask the Redundancy: Evolving Masking Representation Learning for Multivariate Time-Series Clustering",
        "authors": [
            "Zexi Tan",
            "Xiaopeng Luo",
            "Yunlin Liu",
            "Yiqun Zhang"
        ],
        "comments": "Accepted to AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multivariate Time-Series (MTS) clustering discovers intrinsic grouping patterns of temporal data samples. Although time-series provide rich discriminative information, they also contain substantial redundancy, such as steady-state machine operation records and zero-output periods of solar power generation. Such redundancy diminishes the attention given to discriminative timestamps in representation learning, thus leading to performance bottlenecks in MTS clustering. Masking has been widely adopted to enhance the MTS representation, where temporal reconstruction tasks are designed to capture critical information from MTS. However, most existing masking strategies appear to be standalone preprocessing steps, isolated from the learning process, which hinders dynamic adaptation to the importance of clustering-critical timestamps. Accordingly, this paper proposes the Evolving-masked MTS Clustering (EMTC) method, with its model architecture composed of Importance-aware Variate-wise Masking (IVM) and Multi-Endogenous Views (MEV) representation learning modules. IVM adaptively guides the model in learning more discriminative representations for clustering, while the MEV-based reconstruction and contrastive learning pathways enhance the generalization. That is, the MEV reconstruction facilitates multi-perspective complementary to prevent the masking from premature convergence, and the clustering-guided contrastive learning facilitates the joint optimization of representation and clustering. Extensive experiments on 15 real benchmark datasets demonstrate the superiority of EMTC in comparison with eight SOTA methods, where the EMTC achieves an average improvement of 4.85% over the strongest baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17040",
        "abs_url": "https://arxiv.org/abs/2511.17040",
        "pdf_url": "https://arxiv.org/pdf/2511.17040",
        "title": "Step-E: A Differentiable Data Cleaning Framework for Robust Learning with Noisy Labels",
        "authors": [
            "Wenzhang Du"
        ],
        "comments": "12 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Training data collected in the wild often contain noisy labels and outliers that substantially degrade the performance and reliability of deep neural networks. While data cleaning is commonly applied as a separate preprocessing stage, such two-stage pipelines neither fully exploit feedback from the downstream model nor adapt to unknown noise patterns. We propose Step-E, a simple framework that integrates sample selection and model learning into a single optimization process. At each epoch, Step-E ranks samples by loss and gradually increases the fraction of high-loss examples that are excluded from gradient updates after a brief warm-up stage, yielding an online curriculum that focuses on easy and consistent examples and eventually ignores persistent outliers. On CIFAR-100N, Step-E improves the test accuracy of a ResNet-18 model from 43.3% (+/- 0.7%) to 50.4% (+/- 0.9%), clearly outperforming loss truncation, self-paced learning, and one-shot filtering while approaching the clean-label oracle at 60.5% (+/- 0.2%). On CIFAR-10N (aggre), Step-E also improves over the noisy baseline (85.3% vs. 83.9%) and nearly matches the clean-label oracle (85.9%), with only moderate training-time overhead.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17078",
        "abs_url": "https://arxiv.org/abs/2511.17078",
        "pdf_url": "https://arxiv.org/pdf/2511.17078",
        "title": "Hash Collisions in Molecular Fingerprints: Effects on Property Prediction and Bayesian Optimization",
        "authors": [
            "Walter Virany",
            "Austin Tripp"
        ],
        "comments": "NeurIPS 2025 AI4Science workshop. Code: this https URL Openreview: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Molecular fingerprinting methods use hash functions to create fixed-length vector representations of molecules. However, hash collisions cause distinct substructures to be represented with the same feature, leading to overestimates in molecular similarity calculations. We investigate whether using exact fingerprints improves accuracy compared to standard compressed fingerprints in molecular property prediction and Bayesian optimization where the underlying predictive model is a Gaussian process. We find that using exact fingerprints yields a small yet consistent improvement in predictive accuracy on five molecular property prediction benchmarks from the DOCKSTRING dataset. However, these gains did not translate to significant improvements in Bayesian optimization performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17100",
        "abs_url": "https://arxiv.org/abs/2511.17100",
        "pdf_url": "https://arxiv.org/pdf/2511.17100",
        "title": "Geometric-Disentangelment Unlearning",
        "authors": [
            "Duo Zhou",
            "Yuji Zhang",
            "Tianxin Wei",
            "Ruizhong Qiu",
            "Ke Yang",
            "Xiao Lin",
            "Cheng Qian",
            "Jingrui He",
            "Hanghang Tong",
            "Heng Ji",
            "Huan Zhang"
        ],
        "comments": "27 Pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Machine unlearning, the removal of a training subset's influence from a deployed model, is critical for privacy preservation and model reliability, yet gradient ascent on forget samples often harms retained knowledge. Existing approaches face a persistent tradeoff between effective forgetting and preservation on the retain set. While previous methods provide useful heuristics, they often lack a formal analysis on how exactly forgetting updates harm retained knowledge, and whether the side effects can be removed with theoretical guarantees. To explore a theoretically sound and simple solution, we start from the first principle on how performance on the retain set is actually affected: a first-order analysis of the local change of the retain loss under small parameter updates during model training. We start from a crisp equivalence: the retain loss is unchanged to first order iff the update direction is orthogonal to the subspace spanned by retain gradients (\"retain-invariant\"). This identifies the entangled component as the tangential part of forget update within the retain-gradient subspace, and characterizes disentanglement as orthogonality. Guided by this, we propose the Geometric-disentanglement Unlearning (GU) that decomposes any candidate forget gradient update into tangential and normal components to retain space and executes only the normal component. Under a standard trust-region budget, the projected direction aligned with the raw forget gradient is optimal among all first-order retain-invariant moves, and we also derive the optimal projected direction for joint forget-retain updating objectives. Our method is plug-and-play and can be attached to existing gradient-based unlearning procedures to mitigate side effects. GU achieves consistent improvement on various methods across three benchmarks TOFU, MUSE, and WMDP.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17134",
        "abs_url": "https://arxiv.org/abs/2511.17134",
        "pdf_url": "https://arxiv.org/pdf/2511.17134",
        "title": "Four decades of circumpolar super-resolved satellite land surface temperature data",
        "authors": [
            "Sonia Dupuis",
            "Nando Metzger",
            "Konrad Schindler",
            "Frank Göttsche",
            "Stefan Wunderle"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Land surface temperature (LST) is an essential climate variable (ECV) crucial for understanding land-atmosphere energy exchange and monitoring climate change, especially in the rapidly warming Arctic. Long-term satellite-based LST records, such as those derived from the Advanced Very High Resolution Radiometer (AVHRR), are essential for detecting climate trends. However, the coarse spatial resolution of AVHRR's global area coverage (GAC) data limit their utility for analyzing fine-scale permafrost dynamics and other surface processes in the Arctic. This paper presents a new 42 years pan-Arctic LST dataset, downscaled from AVHRR GAC to 1 km with a super-resolution algorithm based on a deep anisotropic diffusion model. The model is trained on MODIS LST data, using coarsened inputs and native-resolution outputs, guided by high-resolution land cover, digital elevation, and vegetation height maps. The resulting dataset provides twice-daily, 1 km LST observations for the entire pan-Arctic region over four decades. This enhanced dataset enables improved modelling of permafrost, reconstruction of near-surface air temperature, and assessment of surface mass balance of the Greenland Ice Sheet. Additionally, it supports climate monitoring efforts in the pre-MODIS era and offers a framework adaptable to future satellite missions for thermal infrared observation and climate data record continuity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17200",
        "abs_url": "https://arxiv.org/abs/2511.17200",
        "pdf_url": "https://arxiv.org/pdf/2511.17200",
        "title": "Reconstruction of Surface EMG Signal using IMU data for Upper Limb Actions",
        "authors": [
            "Shubhranil Basak",
            "Mada Hemanth",
            "Madhav Rao"
        ],
        "comments": "5 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Surface Electromyography (sEMG) provides vital insights into muscle function, but it can be noisy and challenging to acquire. Inertial Measurement Units (IMUs) provide a robust and wearable alternative to motion capture systems. This paper investigates the synthesis of normalized sEMG signals from 6-axis IMU data using a deep learning approach. We collected simultaneous sEMG and IMU data sampled at 1~KHz for various arm movements. A Sliding-Window-Wave-Net model, based on dilated causal convolutions, was trained to map the IMU data to the sEMG signal. The results show that the model successfully predicts the timing and general shape of muscle activations. Although peak amplitudes were often underestimated, the high temporal fidelity demonstrates the feasibility of using this method for muscle intent detection in applications such as prosthetics and rehabilitation biofeedback.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17219",
        "abs_url": "https://arxiv.org/abs/2511.17219",
        "pdf_url": "https://arxiv.org/pdf/2511.17219",
        "title": "DelTriC: A Novel Clustering Method with Accurate Outlier",
        "authors": [
            "Tomas Javurek",
            "Michal Gregor",
            "Sebastian Kula",
            "Marian Simko"
        ],
        "comments": "10 pages, submitted to AISTATS",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The paper introduces DelTriC (Delaunay Triangulation Clustering), a clustering algorithm which integrates PCA/UMAP-based projection, Delaunay triangulation, and a novel back-projection mechanism to form clusters in the original high-dimensional space. DelTriC decouples neighborhood construction from decision-making by first triangulating in a low-dimensional proxy to index local adjacency, and then back-projecting to the original space to perform robust edge pruning, merging, and anomaly detection. DelTriC can outperform traditional methods such as k-means, DBSCAN, and HDBSCAN in many scenarios; it is both scalable and accurate, and it also significantly improves outlier detection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17229",
        "abs_url": "https://arxiv.org/abs/2511.17229",
        "pdf_url": "https://arxiv.org/pdf/2511.17229",
        "title": "Generating transition states of chemical reactions via distance-geometry-based flow matching",
        "authors": [
            "Yufei Luo",
            "Xiang Gu",
            "Jian Sun"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Chemical Physics (physics.chem-ph)",
        "abstract": "Transition states (TSs) are crucial for understanding reaction mechanisms, yet their exploration is limited by the complexity of experimental and computational approaches. Here we propose TS-DFM, a flow matching framework that predicts TSs from reactants and products. By operating in molecular distance geometry space, TS-DFM explicitly captures the dynamic changes of interatomic distances in chemical reactions. A network structure named TSDVNet is designed to learn the velocity field for generating TS geometries accurately. On the benchmark dataset Transition1X, TS-DFM outperforms the previous state-of-the-art method React-OT by 30\\% in structural accuracy. These predicted TSs provide high-quality initial structures, accelerating the convergence of CI-NEB optimization. Additionally, TS-DFM can identify alternative reaction paths. In our experiments, even a more favorable TS with lower energy barrier is discovered. Further tests on RGD1 dataset confirm its strong generalization ability on unseen molecules and reaction types, highlighting its potential for facilitating reaction exploration.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17249",
        "abs_url": "https://arxiv.org/abs/2511.17249",
        "pdf_url": "https://arxiv.org/pdf/2511.17249",
        "title": "FlexiFlow: decomposable flow matching for generation of flexible molecular ensemble",
        "authors": [
            "Riccardo Tedoldi",
            "Ola Engkvist",
            "Patrick Bryant",
            "Hossein Azizpour",
            "Jon Paul Janet",
            "Alessandro Tibo"
        ],
        "comments": "Preprint. Code to be released upon full publication",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Sampling useful three-dimensional molecular structures along with their most favorable conformations is a key challenge in drug discovery. Current state-of-the-art 3D de-novo design flow matching or diffusion-based models are limited to generating a single conformation. However, the conformational landscape of a molecule determines its observable properties and how tightly it is able to bind to a given protein target. By generating a representative set of low-energy conformers, we can more directly assess these properties and potentially improve the ability to generate molecules with desired thermodynamic observables. Towards this aim, we propose FlexiFlow, a novel architecture that extends flow-matching models, allowing for the joint sampling of molecules along with multiple conformations while preserving both equivariance and permutation invariance. We demonstrate the effectiveness of our approach on the QM9 and GEOM Drugs datasets, achieving state-of-the-art results in molecular generation tasks. Our results show that FlexiFlow can generate valid, unstrained, unique, and novel molecules with high fidelity to the training data distribution, while also capturing the conformational diversity of molecules. Moreover, we show that our model can generate conformational ensembles that provide similar coverage to state-of-the-art physics-based methods at a fraction of the inference time. Finally, FlexiFlow can be successfully transferred to the protein-conditioned ligand generation task, even when the dataset contains only static pockets without accompanying conformations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17258",
        "abs_url": "https://arxiv.org/abs/2511.17258",
        "pdf_url": "https://arxiv.org/pdf/2511.17258",
        "title": "Enforcing governing equation constraints in neural PDE solvers via training-free projections",
        "authors": [
            "Omer Rochman",
            "Gilles Louppe"
        ],
        "comments": "Machine Learning and the Physical Sciences, Neurips 2025, San Diego",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Neural PDE solvers used for scientific simulation often violate governing equation constraints. While linear constraints can be projected cheaply, many constraints are nonlinear, complicating projection onto the feasible set. Dynamical PDEs are especially difficult because constraints induce long-range dependencies in time. In this work, we evaluate two training-free, post hoc projections of approximate solutions: a nonlinear optimization-based projection, and a local linearization-based projection using Jacobian-vector and vector-Jacobian products. We analyze constraints across representative PDEs and find that both projections substantially reduce violations and improve accuracy over physics-informed baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17275",
        "abs_url": "https://arxiv.org/abs/2511.17275",
        "pdf_url": "https://arxiv.org/pdf/2511.17275",
        "title": "Automobile demand forecasting: Spatiotemporal and hierarchical modeling, life cycle dynamics, and user-generated online information",
        "authors": [
            "Tom Nahrendorf",
            "Stefan Minner",
            "Helfried Binder",
            "Richard Zinck"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "Premium automotive manufacturers face increasingly complex forecasting challenges due to high product variety, sparse variant-level data, and volatile market dynamics. This study addresses monthly automobile demand forecasting across a multi-product, multi-market, and multi-level hierarchy using data from a German premium manufacturer. The methodology combines point and probabilistic forecasts across strategic and operational planning levels, leveraging ensembles of LightGBM models with pooled training sets, quantile regression, and a mixed-integer linear programming reconciliation approach. Results highlight that spatiotemporal dependencies, as well as rounding bias, significantly affect forecast accuracy, underscoring the importance of integer forecasts for operational feasibility. Shapley analysis shows that short-term demand is reactive, shaped by life cycle maturity, autoregressive momentum, and operational signals, whereas medium-term demand reflects anticipatory drivers such as online engagement, planning targets, and competitive indicators, with online behavioral data considerably improving accuracy at disaggregated levels.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17298",
        "abs_url": "https://arxiv.org/abs/2511.17298",
        "pdf_url": "https://arxiv.org/pdf/2511.17298",
        "title": "SAVeD: Semantic Aware Version Discovery",
        "authors": [
            "Artem Frenk",
            "Roee Shraga"
        ],
        "comments": "11 pages, 6 figures",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Our work introduces SAVeD (Semantically Aware Version Detection), a contrastive learning-based framework for identifying versions of structured datasets without relying on metadata, labels, or integration-based assumptions. SAVeD addresses a common challenge in data science of repeated labor due to a difficulty of similar work or transformations on datasets. SAVeD employs a modified SimCLR pipeline, generating augmented table views through random transformations (e.g., row deletion, encoding perturbations). These views are embedded via a custom transformer encoder and contrasted in latent space to optimize semantic similarity. Our model learns to minimize distances between augmented views of the same dataset and maximize those between unrelated tables. We evaluate performance using validation accuracy and separation, defined respectively as the proportion of correctly classified version/non-version pairs on a hold-out set, and the difference between average similarities of versioned and non-versioned tables (defined by a benchmark, and not provided to the model). Our experiments span five canonical datasets from the Semantic Versioning in Databases Benchmark, and demonstrate substantial gains post-training. SAVeD achieves significantly higher accuracy on completely unseen tables in, and a significant boost in separation scores, confirming its capability to distinguish semantically altered versions. Compared to untrained baselines and prior state-of-the-art dataset-discovery methods like Starmie, our custom encoder achieves competitive or superior results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17312",
        "abs_url": "https://arxiv.org/abs/2511.17312",
        "pdf_url": "https://arxiv.org/pdf/2511.17312",
        "title": "Self-supervised denoising of raw tomography detector data for improved image reconstruction",
        "authors": [
            "Israt Jahan Tulin",
            "Sebastian Starke",
            "Dominic Windisch",
            "André Bieberle",
            "Peter Steinbach"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Ultrafast electron beam X-ray computed tomography produces noisy data due to short measurement times, causing reconstruction artifacts and limiting overall image quality. To counteract these issues, two self-supervised deep learning methods for denoising of raw detector data were investigated and compared against a non-learning based denoising method. We found that the application of the deep-learning-based methods was able to enhance signal-to-noise ratios in the detector data and also led to consistent improvements of the reconstructed images, outperforming the non-learning based method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17339",
        "abs_url": "https://arxiv.org/abs/2511.17339",
        "pdf_url": "https://arxiv.org/pdf/2511.17339",
        "title": "ReBaPL: Repulsive Bayesian Prompt Learning",
        "authors": [
            "Yassir Bendou",
            "Omar Ezzahir",
            "Eduardo Fernandes Montesuma",
            "Gabriel Mahuas",
            "Victoria Shevchenko",
            "Mike Gartrell"
        ],
        "comments": "Under review",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Prompt learning has emerged as an effective technique for fine-tuning large-scale foundation models for downstream tasks. However, conventional prompt tuning methods are prone to overfitting and can struggle with out-of-distribution generalization. To address these limitations, Bayesian prompt learning has been proposed, which frames prompt optimization as a Bayesian inference problem to enhance robustness. This paper introduces Repulsive Bayesian Prompt Learning (ReBaPL), a novel method for Bayesian prompt learning, designed to efficiently explore the complex and often multimodal posterior landscape of prompts. Our method integrates a cyclical step-size schedule with a stochastic gradient Hamiltonian Monte Carlo (SGHMC) algorithm, enabling alternating phases of exploration to discover new modes, and exploitation to refine existing modes. Furthermore, we introduce a repulsive force derived from a potential function over probability metrics (including Maximum Mean Discrepancy and Wasserstein distance) computed on the distributions of representations produced by different prompts. This representation-space repulsion diversifies exploration and prevents premature collapse to a single mode. Our approach allows for a more comprehensive characterization of the prompt posterior distribution, leading to improved generalization. In contrast to prior Bayesian prompt learning methods, our method provides a modular plug-and-play Bayesian extension of any existing prompt learning method based on maximum likelihood estimation. We demonstrate the efficacy of ReBaPL on several benchmark datasets, showing superior performance over state-of-the-art methods for prompt learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17351",
        "abs_url": "https://arxiv.org/abs/2511.17351",
        "pdf_url": "https://arxiv.org/pdf/2511.17351",
        "title": "Convergence and stability of Q-learning in Hierarchical Reinforcement Learning",
        "authors": [
            "Massimiliano Manenti",
            "Andrea Iannelli"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Optimization and Control (math.OC)",
        "abstract": "Hierarchical Reinforcement Learning promises, among other benefits, to efficiently capture and utilize the temporal structure of a decision-making problem and to enhance continual learning capabilities, but theoretical guarantees lag behind practice. In this paper, we propose a Feudal Q-learning scheme and investigate under which conditions its coupled updates converge and are stable. By leveraging the theory of Stochastic Approximation and the ODE method, we present a theorem stating the convergence and stability properties of Feudal Q-learning. This provides a principled convergence and stability analysis tailored to Feudal RL. Moreover, we show that the updates converge to a point that can be interpreted as an equilibrium of a suitably defined game, opening the door to game-theoretic approaches to Hierarchical RL. Lastly, experiments based on the Feudal Q-learning algorithm support the outcomes anticipated by theory.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17367",
        "abs_url": "https://arxiv.org/abs/2511.17367",
        "pdf_url": "https://arxiv.org/pdf/2511.17367",
        "title": "R2PS: Worst-Case Robust Real-Time Pursuit Strategies under Partial Observability",
        "authors": [
            "Runyu Lu",
            "Ruochuan Shi",
            "Yuanheng Zhu",
            "Dongbin Zhao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Computing worst-case robust strategies in pursuit-evasion games (PEGs) is time-consuming, especially when real-world factors like partial observability are considered. While important for general security purposes, real-time applicable pursuit strategies for graph-based PEGs are currently missing when the pursuers only have imperfect information about the evader's position. Although state-of-the-art reinforcement learning (RL) methods like Equilibrium Policy Generalization (EPG) and Grasper provide guidelines for learning graph neural network (GNN) policies robust to different game dynamics, they are restricted to the scenario of perfect information and do not take into account the possible case where the evader can predict the pursuers' actions. This paper introduces the first approach to worst-case robust real-time pursuit strategies (R2PS) under partial observability. We first prove that a traditional dynamic programming (DP) algorithm for solving Markov PEGs maintains optimality under the asynchronous moves by the evader. Then, we propose a belief preservation mechanism about the evader's possible positions, extending the DP pursuit strategies to a partially observable setting. Finally, we embed the belief preservation into the state-of-the-art EPG framework to finish our R2PS learning scheme, which leads to a real-time pursuer policy through cross-graph reinforcement learning against the asynchronous-move DP evasion strategies. After reinforcement learning, our policy achieves robust zero-shot generalization to unseen real-world graph structures and consistently outperforms the policy directly trained on the test graphs by the existing game RL approach.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17378",
        "abs_url": "https://arxiv.org/abs/2511.17378",
        "pdf_url": "https://arxiv.org/pdf/2511.17378",
        "title": "A Unified Stability Analysis of SAM vs SGD: Role of Data Coherence and Emergence of Simplicity Bias",
        "authors": [
            "Wei-Kai Chang",
            "Rajiv Khanna"
        ],
        "comments": "Neurips 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Understanding the dynamics of optimization in deep learning is increasingly important as models scale. While stochastic gradient descent (SGD) and its variants reliably find solutions that generalize well, the mechanisms driving this generalization remain unclear. Notably, these algorithms often prefer flatter or simpler minima, particularly in overparameterized settings. Prior work has linked flatness to generalization, and methods like Sharpness-Aware Minimization (SAM) explicitly encourage flatness, but a unified theory connecting data structure, optimization dynamics, and the nature of learned solutions is still lacking. In this work, we develop a linear stability framework that analyzes the behavior of SGD, random perturbations, and SAM, particularly in two layer ReLU networks. Central to our analysis is a coherence measure that quantifies how gradient curvature aligns across data points, revealing why certain minima are stable and favored during training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17399",
        "abs_url": "https://arxiv.org/abs/2511.17399",
        "pdf_url": "https://arxiv.org/pdf/2511.17399",
        "title": "Stable Coresets via Posterior Sampling: Aligning Induced and Full Loss Landscapes",
        "authors": [
            "Wei-Kai Chang",
            "Rajiv Khanna"
        ],
        "comments": "neurips 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As deep learning models continue to scale, the growing computational demands have amplified the need for effective coreset selection techniques. Coreset selection aims to accelerate training by identifying small, representative subsets of data that approximate the performance of the full dataset. Among various approaches, gradient based methods stand out due to their strong theoretical underpinnings and practical benefits, particularly under limited data budgets. However, these methods face challenges such as naive stochastic gradient descent (SGD) acting as a surprisingly strong baseline and the breakdown of representativeness due to loss curvature mismatches over time. In this work, we propose a novel framework that addresses these limitations. First, we establish a connection between posterior sampling and loss landscapes, enabling robust coreset selection even in high data corruption scenarios. Second, we introduce a smoothed loss function based on posterior sampling onto the model weights, enhancing stability and generalization while maintaining computational efficiency. We also present a novel convergence analysis for our sampling-based coreset selection method. Finally, through extensive experiments, we demonstrate how our approach achieves faster training and enhanced generalization across diverse datasets than the current state of the art.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17426",
        "abs_url": "https://arxiv.org/abs/2511.17426",
        "pdf_url": "https://arxiv.org/pdf/2511.17426",
        "title": "Self-Supervised Learning by Curvature Alignment",
        "authors": [
            "Benyamin Ghojogh",
            "M.Hadi Sepanj",
            "Paul Fieguth"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (stat.ML)",
        "abstract": "Self-supervised learning (SSL) has recently advanced through non-contrastive methods that couple an invariance term with variance, covariance, or redundancy-reduction penalties. While such objectives shape first- and second-order statistics of the representation, they largely ignore the local geometry of the underlying data manifold. In this paper, we introduce CurvSSL, a curvature-regularized self-supervised learning framework, and its RKHS extension, kernel CurvSSL. Our approach retains a standard two-view encoder-projector architecture with a Barlow Twins-style redundancy-reduction loss on projected features, but augments it with a curvature-based regularizer. Each embedding is treated as a vertex whose $k$ nearest neighbors define a discrete curvature score via cosine interactions on the unit hypersphere; in the kernel variant, curvature is computed from a normalized local Gram matrix in an RKHS. These scores are aligned and decorrelated across augmentations by a Barlow-style loss on a curvature-derived matrix, encouraging both view invariance and consistency of local manifold bending. Experiments on MNIST and CIFAR-10 datasets with a ResNet-18 backbone show that curvature-regularized SSL yields competitive or improved linear evaluation performance compared to Barlow Twins and VICReg. Our results indicate that explicitly shaping local geometry is a simple and effective complement to purely statistical SSL regularizers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17427",
        "abs_url": "https://arxiv.org/abs/2511.17427",
        "pdf_url": "https://arxiv.org/pdf/2511.17427",
        "title": "Towards fully differentiable neural ocean model with Veros",
        "authors": [
            "Etienne Meunier",
            "Said Ouala",
            "Hugo Frezat",
            "Julien Le Sommer",
            "Ronan Fablet"
        ],
        "comments": "Accepted to Differentiable Systems and Scientific Machine Learning (workshop, EurIPS 2025)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present a differentiable extension of the VEROS ocean model, enabling automatic differentiation through its dynamical core. We describe the key modifications required to make the model fully compatible with JAX autodifferentiation framework and evaluate the numerical consistency of the resulting implementation. Two illustrative applications are then demonstrated: (i) the correction of an initial ocean state through gradient-based optimization, and (ii) the calibration of unknown physical parameters directly from model observations. These examples highlight how differentiable programming can facilitate end-to-end learning and parameter tuning in ocean modeling. Our implementation is available online.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17435",
        "abs_url": "https://arxiv.org/abs/2511.17435",
        "pdf_url": "https://arxiv.org/pdf/2511.17435",
        "title": "Multi-Agent Pointer Transformer: Seq-to-Seq Reinforcement Learning for Multi-Vehicle Dynamic Pickup-Delivery Problems",
        "authors": [
            "Zengyu Zou",
            "Jingyuan Wang",
            "Yixuan Huang",
            "Junjie Wu"
        ],
        "comments": "15 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper addresses the cooperative Multi-Vehicle Dynamic Pickup and Delivery Problem with Stochastic Requests (MVDPDPSR) and proposes an end-to-end centralized decision-making framework based on sequence-to-sequence, named Multi-Agent Pointer Transformer (MAPT). MVDPDPSR is an extension of the vehicle routing problem and a spatio-temporal system optimization problem, widely applied in scenarios such as on-demand delivery. Classical operations research methods face bottlenecks in computational complexity and time efficiency when handling large-scale dynamic problems. Although existing reinforcement learning methods have achieved some progress, they still encounter several challenges: 1) Independent decoding across multiple vehicles fails to model joint action distributions; 2) The feature extraction network struggles to capture inter-entity relationships; 3) The joint action space is exponentially large. To address these issues, we designed the MAPT framework, which employs a Transformer Encoder to extract entity representations, combines a Transformer Decoder with a Pointer Network to generate joint action sequences in an AutoRegressive manner, and introduces a Relation-Aware Attention module to capture inter-entity relationships. Additionally, we guide the model's decision-making using informative priors to facilitate effective exploration. Experiments on 8 datasets demonstrate that MAPT significantly outperforms existing baseline methods in terms of performance and exhibits substantial computational time advantages compared to classical operations research methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17446",
        "abs_url": "https://arxiv.org/abs/2511.17446",
        "pdf_url": "https://arxiv.org/pdf/2511.17446",
        "title": "Unmasking Airborne Threats: Guided-Transformers for Portable Aerosol Mass Spectrometry",
        "authors": [
            "Kyle M. Regan",
            "Michael McLoughlin",
            "Wayne A. Bryden",
            "Gonzalo R. Arce"
        ],
        "comments": "13 pages, 9 figures. Preprint. Submitted to Computers in Biology and Medicine",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Matrix Assisted Laser Desorption/Ionization Mass Spectrometry (MALDI-MS) is a cornerstone in biomolecular analysis, offering precise identification of pathogens through unique mass spectral signatures. Yet, its reliance on labor-intensive sample preparation and multi-shot spectral averaging restricts its use to laboratory settings, rendering it impractical for real-time environmental monitoring. These limitations are especially pronounced in emerging aerosol MALDI-MS systems, where autonomous sampling generates noisy spectra for unknown aerosol analytes, requiring single-shot detection for effective analysis. Addressing these challenges, we propose the Mass Spectral Dictionary-Guided Transformer (MS-DGFormer): a data-driven framework that redefines spectral analysis by directly processing raw, minimally prepared mass spectral data. MS-DGFormer leverages a transformer architecture, designed to capture the long-range dependencies inherent in these time-series spectra. To enhance feature extraction, we introduce a novel dictionary encoder that integrates denoised spectral information derived from Singular Value Decomposition (SVD), enabling the model to discern critical biomolecular patterns from single-shot spectra with robust performance. This innovation provides a system to achieve superior pathogen identification from aerosol samples, facilitating autonomous, real-time analysis in field conditions. By eliminating the need for extensive preprocessing, our method unlocks the potential for portable, deployable MALDI-MS platforms, revolutionizing environmental pathogen detection and rapid response to biological threats.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17467",
        "abs_url": "https://arxiv.org/abs/2511.17467",
        "pdf_url": "https://arxiv.org/pdf/2511.17467",
        "title": "PersonaAgent with GraphRAG: Community-Aware Knowledge Graphs for Personalized LLM",
        "authors": [
            "Siqi Liang",
            "Yudi Zhang",
            "Yue Guo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We propose a novel framework for persona-based language model system, motivated by the need for personalized AI agents that adapt to individual user preferences. In our approach, the agent embodies the user's \"persona\" (e.g. user profile or taste) and is powered by a large language model (LLM). To enable the agent to leverage rich contextual information, we introduce a Knowledge-Graph-enhanced Retrieval-Augmented Generation (Graph RAG) mechanism that constructs an LLM-derived graph index of relevant documents and summarizes communities of related information. Our framework generates personalized prompts by combining: (1) a summary of the user's historical behaviors and preferences extracted from the knowledge graph, and (2) relevant global interaction patterns identified through graph-based community detection. This dynamic prompt engineering approach allows the agent to maintain consistent persona-aligned behaviors while benefiting from collective knowledge. On the LaMP benchmark, our method improves news categorization F1 by 11.1%, movie tagging F1 by 56.1%, and reduces product rating MAE by 10.4% over prior methods. Our code is available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17489",
        "abs_url": "https://arxiv.org/abs/2511.17489",
        "pdf_url": "https://arxiv.org/pdf/2511.17489",
        "title": "Harnessing Data from Clustered LQR Systems: Personalized and Collaborative Policy Optimization",
        "authors": [
            "Vinay Kanakeri",
            "Shivam Bajaj",
            "Ashwin Verma",
            "Vijay Gupta",
            "Aritra Mitra"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Optimization and Control (math.OC)",
        "abstract": "It is known that reinforcement learning (RL) is data-hungry. To improve sample-efficiency of RL, it has been proposed that the learning algorithm utilize data from 'approximately similar' processes. However, since the process models are unknown, identifying which other processes are similar poses a challenge. In this work, we study this problem in the context of the benchmark Linear Quadratic Regulator (LQR) setting. Specifically, we consider a setting with multiple agents, each corresponding to a copy of a linear process to be controlled. The agents' local processes can be partitioned into clusters based on similarities in dynamics and tasks. Combining ideas from sequential elimination and zeroth-order policy optimization, we propose a new algorithm that performs simultaneous clustering and learning to output a personalized policy (controller) for each cluster. Under a suitable notion of cluster separation that captures differences in closed-loop performance across systems, we prove that our approach guarantees correct clustering with high probability. Furthermore, we show that the sub-optimality gap of the policy learned for each cluster scales inversely with the size of the cluster, with no additional bias, unlike in prior works on collaborative learning-based control. Our work is the first to reveal how clustering can be used in data-driven control to learn personalized policies that enjoy statistical gains from collaboration but do not suffer sub-optimality due to inclusion of data from dissimilar processes. From a distributed implementation perspective, our method is attractive as it incurs only a mild logarithmic communication overhead.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16741",
        "abs_url": "https://arxiv.org/abs/2511.16741",
        "pdf_url": "https://arxiv.org/pdf/2511.16741",
        "title": "Fermions and Supersymmetry in Neural Network Field Theories",
        "authors": [
            "Samuel Frank",
            "James Halverson",
            "Anindita Maiti",
            "Fabian Ruehle"
        ],
        "comments": "34 pages + appendices",
        "subjects": "High Energy Physics - Theory (hep-th); Machine Learning (cs.LG)",
        "abstract": "We introduce fermionic neural network field theories via Grassmann-valued neural networks. Free theories are obtained by a generalization of the Central Limit Theorem to Grassmann variables. This enables the realization of the free Dirac spinor at infinite width and a four fermion interaction at finite width. Yukawa couplings are introduced by breaking the statistical independence of the output weights for the fermionic and bosonic fields. A large class of interacting supersymmetric quantum mechanics and field theory models are introduced by super-affine transformations on the input that realize a superspace formalism.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16792",
        "abs_url": "https://arxiv.org/abs/2511.16792",
        "pdf_url": "https://arxiv.org/pdf/2511.16792",
        "title": "Membership Inference Attacks Beyond Overfitting",
        "authors": [
            "Mona Khalil",
            "Alberto Blanco-Justicia",
            "Najeeb Jebreel",
            "Josep Domingo-Ferrer"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Membership inference attacks (MIAs) against machine learning (ML) models aim to determine whether a given data point was part of the model training data. These attacks may pose significant privacy risks to individuals whose sensitive data were used for training, which motivates the use of defenses such as differential privacy, often at the cost of high accuracy losses. MIAs exploit the differences in the behavior of a model when making predictions on samples it has seen during training (members) versus those it has not seen (non-members). Several studies have pointed out that model overfitting is the major factor contributing to these differences in behavior and, consequently, to the success of MIAs. However, the literature also shows that even non-overfitted ML models can leak information about a small subset of their training data. In this paper, we investigate the root causes of membership inference vulnerabilities beyond traditional overfitting concerns and suggest targeted defenses. We empirically analyze the characteristics of the training data samples vulnerable to MIAs in models that are not overfitted (and hence able to generalize). Our findings reveal that these samples are often outliers within their classes (e.g., noisy or hard to classify). We then propose potential defensive strategies to protect these vulnerable samples and enhance the privacy-preserving capabilities of ML models. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16796",
        "abs_url": "https://arxiv.org/abs/2511.16796",
        "pdf_url": "https://arxiv.org/pdf/2511.16796",
        "title": "Efficient Penalty-Based Bilevel Methods: Improved Analysis, Novel Updates, and Flatness Condition",
        "authors": [
            "Liuyuan Jiang",
            "Quan Xiao",
            "Lisha Chen",
            "Tianyi Chen"
        ],
        "comments": "arXiv admin note: text overlap with arXiv:2507.20400",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Penalty-based methods have become popular for solving bilevel optimization (BLO) problems, thanks to their effective first-order nature. However, they often require inner-loop iterations to solve the lower-level (LL) problem and small outer-loop step sizes to handle the increased smoothness induced by large penalty terms, leading to suboptimal complexity. This work considers the general BLO problems with coupled constraints (CCs) and leverages a novel penalty reformulation that decouples the upper- and lower-level variables. This yields an improved analysis of the smoothness constant, enabling larger step sizes and reduced iteration complexity for Penalty-Based Gradient Descent algorithms in ALTernating fashion (ALT-PBGD). Building on the insight of reduced smoothness, we propose PBGD-Free, a novel fully single-loop algorithm that avoids inner loops for the uncoupled constraint BLO. For BLO with CCs, PBGD-Free employs an efficient inner-loop with substantially reduced iteration complexity. Furthermore, we propose a novel curvature condition describing the \"flatness\" of the upper-level objective with respect to the LL variable. This condition relaxes the traditional upper-level Lipschitz requirement, enables smaller penalty constant choices, and results in a negligible penalty gradient term during upper-level variable updates. We provide rigorous convergence analysis and validate the method's efficacy through hyperparameter optimization for support vector machines and fine-tuning of large language models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16815",
        "abs_url": "https://arxiv.org/abs/2511.16815",
        "pdf_url": "https://arxiv.org/pdf/2511.16815",
        "title": "BITS for GAPS: Bayesian Information-Theoretic Sampling for hierarchical GAussian Process Surrogates",
        "authors": [
            "Kyla D. Jones",
            "Alexander W. Dowling"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We introduce the Bayesian Information-Theoretic Sampling for hierarchical GAussian Process Surrogates (BITS for GAPS) framework to emulate latent components in hybrid physical systems. BITS for GAPS supports serial hybrid modeling, where known physics governs part of the system and residual dynamics are represented as a latent function inferred from data. A Gaussian process prior is placed over the latent function, with hierarchical priors on its hyperparameters to encode physically meaningful structure in the predictive posterior. To guide data acquisition, we derive entropy-based acquisition functions that quantify expected information gain from candidate input locations, identifying samples most informative for training the surrogate. Specifically, we obtain a closed-form expression for the differential entropy of the predictive posterior and establish a tractable lower bound for efficient evaluation. These derivations approximate the predictive posterior as a finite, uniformly weighted mixture of Gaussian processes. We demonstrate the framework's utility by modeling activity coefficients in vapor-liquid equilibrium systems, embedding the surrogate into extended Raoult's law for distillation design. Numerical results show that entropy-guided sampling improves sample efficiency by targeting regions of high uncertainty and potential information gain. This accelerates surrogate convergence, enhances predictive accuracy in non-ideal regimes, and preserves physical consistency. Overall, BITS for GAPS provides an efficient, interpretable, and uncertainty-aware framework for hybrid modeling of complex physical systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16858",
        "abs_url": "https://arxiv.org/abs/2511.16858",
        "pdf_url": "https://arxiv.org/pdf/2511.16858",
        "title": "Is the Cure Still Worse Than the Disease? Test Overfitting by LLMs in Automated Program Repair",
        "authors": [
            "Toufique Ahmed",
            "Jatin Ganhotra",
            "Avraham Shinnar",
            "Martin Hirzel"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Automated program repair has been shown to be susceptible to generating repaired code that passes on seen tests but fails on a hold-out set of hidden tests. This problem, dubbed test overfitting, has been identified and studied before the rise of large language models. We experimentally study how much test overfitting is still a problem today, using repository-level SWE-bench tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16886",
        "abs_url": "https://arxiv.org/abs/2511.16886",
        "pdf_url": "https://arxiv.org/pdf/2511.16886",
        "title": "Deep Improvement Supervision",
        "authors": [
            "Arip Asadulaev",
            "Rayan Banerjee",
            "Fakhri Karray",
            "Martin Takac"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Recently, it was shown that small, looped architectures, such as Tiny Recursive Models (TRMs), can outperform Large Language Models (LLMs) on complex reasoning tasks, including the Abstraction and Reasoning Corpus (ARC). In this work, we investigate a core question: how can we further improve the efficiency of these methods with minimal changes? To address this, we frame the latent reasoning of TRMs as a form of classifier-free guidance and implicit policy improvement algorithm. Building on these insights, we propose a novel training scheme that provides a target for each loop during training. We demonstrate that our approach significantly enhances training efficiency. Our method reduces the total number of forward passes by 18x and eliminates halting mechanisms, while maintaining quality comparable to standard TRMs. Notably, we achieve 24% accuracy on ARC-1 with only 0.8M parameters, outperforming most LLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.16965",
        "abs_url": "https://arxiv.org/abs/2511.16965",
        "pdf_url": "https://arxiv.org/pdf/2511.16965",
        "title": "Real-Time Cooked Food Image Synthesis and Visual Cooking Progress Monitoring on Edge Devices",
        "authors": [
            "Jigyasa Gupta",
            "Soumya Goyal",
            "Anil Kumar",
            "Ishan Jindal"
        ],
        "comments": "13 pages, 11 figures",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Synthesizing realistic cooked food images from raw inputs on edge devices is a challenging generative task, requiring models to capture complex changes in texture, color and structure during cooking. Existing image-to-image generation methods often produce unrealistic results or are too resource-intensive for edge deployment. We introduce the first oven-based cooking-progression dataset with chef-annotated doneness levels and propose an edge-efficient recipe and cooking state guided generator that synthesizes realistic food images conditioned on raw food image. This formulation enables user-preferred visual targets rather than fixed presets. To ensure temporal consistency and culinary plausibility, we introduce a domain-specific \\textit{Culinary Image Similarity (CIS)} metric, which serves both as a training loss and a progress-monitoring signal. Our model outperforms existing baselines with significant reductions in FID scores (30\\% improvement on our dataset; 60\\% on public datasets)",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17007",
        "abs_url": "https://arxiv.org/abs/2511.17007",
        "pdf_url": "https://arxiv.org/pdf/2511.17007",
        "title": "Generative MIMO Beam Map Construction for Location Recovery and Beam Tracking",
        "authors": [
            "Wangqian Chen",
            "Junting Chen",
            "Shuguang Cui"
        ],
        "comments": "",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Machine learning (ML) has greatly advanced data-driven channel modeling and resource optimization in wireless communication systems. However, most existing ML-based methods rely on large, accurately labeled datasets with location information, which are often difficult and costly to obtain. This paper proposes a generative framework to recover location labels directly from sequences of sparse channel state information (CSI) measurements, without explicit location labels for radio map construction. Instead of directly storing raw CSI, we learn a compact low-dimensional radio map embedding and leverage a generative model to reconstruct the high-dimensional CSI. Specifically, to address the uncertainty of sparse CSI, a dual-scale feature extraction scheme is designed to enhance feature representation by jointly exploiting correlations from angular space and across neighboring samples. We develop a hybrid recurrent-convolutional encoder to learn mobility patterns, which combines a truncation strategy and multi-scale convolutions in the recurrent neural network (RNN) to ensure feature robustness against short-term fluctuations. Unlike conventional Gaussian priors in latent space, we embed a learnable radio map to capture the location information by encoding high-level positional features from CSI measurements. Finally, a diffusion-based generative decoder reconstructs the full CSI with high fidelity by conditioning on the positional features in the radio map. Numerical experiments demonstrate that the proposed model can improve localization accuracy by over 30% and achieve a 20% capacity gain in non-line-of-sight (NLOS) scenarios compared with model-based Kalman filter approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17080",
        "abs_url": "https://arxiv.org/abs/2511.17080",
        "pdf_url": "https://arxiv.org/pdf/2511.17080",
        "title": "An Efficient Computational Framework for Discrete Fuzzy Numbers Based on Total Orders",
        "authors": [
            "Arnau Mir",
            "Alejandro Mus",
            "Juan Vicente Riera"
        ],
        "comments": "19 pages, 2 figures. Submitted to Computational and Applied Mathematics (Springer)",
        "subjects": "Logic in Computer Science (cs.LO); Computation and Language (cs.CL); Discrete Mathematics (cs.DM); Machine Learning (cs.LG)",
        "abstract": "Discrete fuzzy numbers, and in particular those defined over a finite chain $L_n = \\{0, \\ldots, n\\}$, have been effectively employed to represent linguistic information within the framework of fuzzy systems. Research on total (admissible) orderings of such types of fuzzy subsets, and specifically those belonging to the set $\\mathcal{D}_1^{L_n\\rightarrow Y_m}$ consisting of discrete fuzzy numbers $A$ whose support is a closed subinterval of the finite chain $L_n = \\{0, 1, \\ldots, n\\}$ and whose membership values $A(x)$, for $x \\in L_n$, belong to the set $Y_m = \\{ 0 = y_1 < y_2 < \\cdots < y_{m-1} < y_m = 1 \\}$, has facilitated the development of new methods for constructing logical connectives, based on a bijective function, called $\\textit{pos function}$, that determines the position of each $A \\in \\mathcal{D}_1^{L_n\\rightarrow Y_m}$. For this reason, in this work we revisit the problem by introducing algorithms that exploit the combinatorial structure of total (admissible) orders to compute the $\\textit{pos}$ function and its inverse with exactness. The proposed approach achieves a complexity of $\\mathcal{O}(n^{2} m \\log n)$, which is quadratic in the size of the underlying chain ($n$) and linear in the number of membership levels ($m$). The key point is that the dominant factor is $m$, ensuring scalability with respect to the granularity of membership values. The results demonstrate that this formulation substantially reduces computational cost and enables the efficient implementation of algebraic operations -- such as aggregation and implication -- on the set of discrete fuzzy numbers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17112",
        "abs_url": "https://arxiv.org/abs/2511.17112",
        "pdf_url": "https://arxiv.org/pdf/2511.17112",
        "title": "Dissecting Quantum Reinforcement Learning: A Systematic Evaluation of Key Components",
        "authors": [
            "Javier Lazaro",
            "Juan-Ignacio Vazquez",
            "Pablo Garcia-Bringas"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "Parameterised quantum circuit (PQC) based Quantum Reinforcement Learning (QRL) has emerged as a promising paradigm at the intersection of quantum computing and reinforcement learning (RL). By design, PQCs create hybrid quantum-classical models, but their practical applicability remains uncertain due to training instabilities, barren plateaus (BPs), and the difficulty of isolating the contribution of individual pipeline components. In this work, we dissect PQC based QRL architectures through a systematic experimental evaluation of three aspects recurrently identified as critical: (i) data embedding strategies, with Data Reuploading (DR) as an advanced approach; (ii) ansatz design, particularly the role of entanglement; and (iii) post-processing blocks after quantum measurement, with a focus on the underexplored Output Reuse (OR) technique. Using a unified PPO-CartPole framework, we perform controlled comparisons between hybrid and classical agents under identical conditions. Our results show that OR, though purely classical, exhibits distinct behaviour in hybrid pipelines, that DR improves trainability and stability, and that stronger entanglement can degrade optimisation, offsetting classical gains. Together, these findings provide controlled empirical evidence of the interplay between quantum and classical contributions, and establish a reproducible framework for systematic benchmarking and component-wise analysis in QRL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17123",
        "abs_url": "https://arxiv.org/abs/2511.17123",
        "pdf_url": "https://arxiv.org/pdf/2511.17123",
        "title": "Layer-wise Weight Selection for Power-Efficient Neural Network Acceleration",
        "authors": [
            "Jiaxun Fang",
            "Li Zhang",
            "Shaoyi Huang"
        ],
        "comments": "",
        "subjects": "Hardware Architecture (cs.AR); Machine Learning (cs.LG)",
        "abstract": "Systolic array accelerators execute CNNs with energy dominated by the switching activity of multiply accumulate (MAC) units. Although prior work exploits weight dependent MAC power for compression, existing methods often use global activation models, coarse energy proxies, or layer-agnostic policies, which limits their effectiveness on real hardware. We propose an energy aware, layer-wise compression framework that explicitly leverages MAC and layer level energy characteristics. First, we build a layer-aware MAC energy model that combines per-layer activation statistics with an MSB-Hamming distance grouping of 22-bit partial sum transitions, and integrate it with a tile-level systolic mapping to estimate convolution-layer energy. On top of this model, we introduce an energy accuracy co-optimized weight selection algorithm within quantization aware training and an energy-prioritized layer-wise schedule that compresses high energy layers more aggressively under a global accuracy constraint. Experiments on different CNN models demonstrate up to 58.6\\% energy reduction with 2-3\\% accuracy drop, outperforming a state-of-the-art power-aware baseline.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17165",
        "abs_url": "https://arxiv.org/abs/2511.17165",
        "pdf_url": "https://arxiv.org/pdf/2511.17165",
        "title": "MIR: Efficient Exploration in Episodic Multi-Agent Reinforcement Learning via Mutual Intrinsic Reward",
        "authors": [
            "Kesheng Chen",
            "Wenjian Luo",
            "Bang Zhang",
            "Zeping Yin",
            "Zipeng Ye"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Episodic rewards present a significant challenge in reinforcement learning. While intrinsic reward methods have demonstrated effectiveness in single-agent rein-forcement learning scenarios, their application to multi-agent reinforcement learn-ing (MARL) remains problematic. The primary difficulties stem from two fac-tors: (1) the exponential sparsity of joint action trajectories that lead to rewards as the exploration space expands, and (2) existing methods often fail to account for joint actions that can influence team states. To address these challenges, this paper introduces Mutual Intrinsic Reward (MIR), a simple yet effective enhancement strategy for MARL with extremely sparse rewards like episodic rewards. MIR incentivizes individual agents to explore actions that affect their teammates, and when combined with original strategies, effectively stimulates team exploration and improves algorithm performance. For comprehensive experimental valida-tion, we extend the representative single-agent MiniGrid environment to create MiniGrid-MA, a series of MARL environments with sparse rewards. Our evalu-ation compares the proposed method against state-of-the-art approaches in the MiniGrid-MA setting, with experimental results demonstrating superior perfor-mance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17176",
        "abs_url": "https://arxiv.org/abs/2511.17176",
        "pdf_url": "https://arxiv.org/pdf/2511.17176",
        "title": "On the Predictive Skill of Artificial Intelligence-based Weather Models for Extreme Events using Uncertainty Quantification",
        "authors": [
            "Rodrigo Almeida",
            "Noelia Otero",
            "Miguel-Ángel Fernández-Torres",
            "Jackie Ma"
        ],
        "comments": "24 pages, 12 figures",
        "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph); Machine Learning (cs.LG)",
        "abstract": "Accurate prediction of extreme weather events remains a major challenge for artificial intelligence based weather prediction systems. While deterministic models such as FuXi, GraphCast, and SFNO have achieved competitive forecast skill relative to numerical weather prediction, their ability to represent uncertainty and capture extremes is still limited. This study investigates how state of the art deterministic artificial intelligence based models respond to initial-condition perturbations and evaluates the resulting ensembles in forecasting extremes. Using three perturbation strategies (Gaussian noise, Hemispheric Centered Bred Vectors, and Huge Ensembles), we generate 50 member ensembles for two major events in August 2022: the Pakistan floods and the China heatwave. Ensemble skill is assessed against ERA5 and compared with IFS ENS and the probabilistic AIFSENS model using deterministic and probabilistic metrics. Results show that flow dependent perturbations produce the most realistic ensemble spread and highest probabilistic skill, narrowing but not closing the performance gap with numerical weather prediction ensembles. Across variables, artificial intelligence based weather models capture temperature extremes more effectively than precipitation. These findings demonstrate that input perturbations can extend deterministic models toward probabilistic forecasting, paving the way for approaches that combine flow dependent perturbations with generative or latent-space uncertainty modeling for reliable artificial intelligence-driven early warning systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17220",
        "abs_url": "https://arxiv.org/abs/2511.17220",
        "pdf_url": "https://arxiv.org/pdf/2511.17220",
        "title": "Parrot: Persuasion and Agreement Robustness Rating of Output Truth -- A Sycophancy Robustness Benchmark for LLMs",
        "authors": [
            "Yusuf Çelebi",
            "Mahmoud El Hussieni",
            "Özay Ezerceli"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG)",
        "abstract": "This study presents PARROT (Persuasion and Agreement Robustness Rating of Output Truth), a robustness focused framework designed to measure the degradation in accuracy that occurs under social pressure exerted on users through authority and persuasion in large language models (LLMs) the phenomenon of sycophancy (excessive conformity). PARROT (i) isolates causal effects by comparing the neutral version of the same question with an authoritatively false version using a double-blind evaluation, (ii) quantifies confidence shifts toward the correct and imposed false responses using log-likelihood-based calibration tracking, and (iii) systematically classifies failure modes (e.g., robust correct, sycophantic agreement, reinforced error, stubborn error, self-correction, etc.) using an eight-state behavioral taxonomy. We evaluated 22 models using 1,302 MMLU-style multiple-choice questions across 13 domains and domain-specific authority templates. Findings show marked heterogeneity: advanced models (e.g., GPT-5, GPT-4.1, Claude Sonnet 4.5) exhibit low \"follow rates\" ($\\leq 11\\%$, GPT-5: 4\\%) and minimal accuracy loss, while older/smaller models show severe epistemic collapse (GPT-4: 80\\%, Qwen 2.5-1.5B: 94\\%). The danger is not limited to response changes; weak models reduce confidence in the correct response while increasing confidence in the imposed incorrect response. While international law and global knowledge at the domain level exhibit high fragility, elementary mathematics is relatively resilient. Consequently, we argue that the goal of \"resistance to overfitting pressure\" should be addressed as a primary objective alongside accuracy, harm avoidance, and privacy for safe deployment in the real world.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17228",
        "abs_url": "https://arxiv.org/abs/2511.17228",
        "pdf_url": "https://arxiv.org/pdf/2511.17228",
        "title": "Intrinsic preservation of plasticity in continual quantum learning",
        "authors": [
            "Yu-Qin Chen",
            "Shi-Xin Zhang"
        ],
        "comments": "11 pages, 5 figures and supplementary information",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "Artificial intelligence in dynamic, real-world environments requires the capacity for continual learning. However, standard deep learning suffers from a fundamental issue: loss of plasticity, in which networks gradually lose their ability to learn from new data. Here we show that quantum learning models naturally overcome this limitation, preserving plasticity over long timescales. We demonstrate this advantage systematically across a broad spectrum of tasks from multiple learning paradigms, including supervised learning and reinforcement learning, and diverse data modalities, from classical high-dimensional images to quantum-native datasets. Although classical models exhibit performance degradation correlated with unbounded weight and gradient growth, quantum neural networks maintain consistent learning capabilities regardless of the data or task. We identify the origin of the advantage as the intrinsic physical constraints of quantum models. Unlike classical networks where unbounded weight growth leads to landscape ruggedness or saturation, the unitary constraints confine the optimization to a compact manifold. Our results suggest that the utility of quantum computing in machine learning extends beyond potential speedups, offering a robust pathway for building adaptive artificial intelligence and lifelong learners.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17240",
        "abs_url": "https://arxiv.org/abs/2511.17240",
        "pdf_url": "https://arxiv.org/pdf/2511.17240",
        "title": "Fast Decoding for Non-Adaptive Learning of Erdős--Rényi Random Graphs",
        "authors": [
            "Hoang Ta",
            "Jonathan Scarlett"
        ],
        "comments": "",
        "subjects": "Information Theory (cs.IT); Discrete Mathematics (cs.DM); Machine Learning (cs.LG); Probability (math.PR)",
        "abstract": "We study the problem of learning an unknown graph via group queries on node subsets, where each query reports whether at least one edge is present among the queried nodes. In general, learning arbitrary graphs with \\(n\\) nodes and \\(k\\) edges is hard in the non-adaptive setting, requiring \\(\\Omega\\big(\\min\\{k^2\\log n,\\,n^2\\}\\big)\\) tests even when a small error probability is allowed. We focus on learning Erdős--Rényi (ER) graphs \\(G\\sim\\ER(n,q)\\) in the non-adaptive setting, where the expected number of edges is \\(\\bar{k}=q\\binom{n}{2}\\), and we aim to design an efficient testing--decoding scheme achieving asymptotically vanishing error probability. Prior work (Li--Fresacher--Scarlett, NeurIPS 2019) presents a testing--decoding scheme that attains an order-optimal number of tests \\(O(\\bar{k}\\log n)\\) but incurs \\(\\Omega(n^2)\\) decoding time, whereas their proposed sublinear-time algorithm incurs an extra \\((\\log \\bar{k})(\\log n)\\) factor in the number of tests. We extend the binary splitting approach, recently developed for non-adaptive group testing, to the ER graph learning setting, and prove that the edge set can be recovered with high probability using \\(O(\\bar{k}\\log n)\\) tests while attaining decoding time \\(O(\\bar{k}^{1+\\delta}\\log n)\\) for any fixed \\(\\delta>0\\).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17293",
        "abs_url": "https://arxiv.org/abs/2511.17293",
        "pdf_url": "https://arxiv.org/pdf/2511.17293",
        "title": "A First Full Physics Benchmark for Highly Granular Calorimeter Surrogates",
        "authors": [
            "Thorsten Buss",
            "Henry Day-Hall",
            "Frank Gaede",
            "Gregor Kasieczka",
            "Katja Krüger",
            "Anatolii Korol",
            "Thomas Madlener",
            "Peter McKeown"
        ],
        "comments": "26 pages, 15 figures",
        "subjects": "High Energy Physics - Experiment (hep-ex); Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "The physics programs of current and future collider experiments necessitate the development of surrogate simulators for calorimeter showers. While much progress has been made in the development of generative models for this task, they have typically been evaluated in simplified scenarios and for single particles. This is particularly true for the challenging task of highly granular calorimeter simulation. For the first time, this work studies the use of highly granular generative calorimeter surrogates in a realistic simulation application. We introduce DDML, a generic library which enables the combination of generative calorimeter surrogates with realistic detectors implemented using the DD4hep toolkit. We compare two different generative models - one operating on a regular grid representation, and the other using a less common point cloud approach. In order to disentangle methodological details from model performance, we provide comparisons to idealized simulators which directly sample representations of different resolutions from the full simulation ground-truth. We then systematically evaluate model performance on post-reconstruction benchmarks for electromagnetic shower simulation. Beginning with a typical single particle study, we introduce a first multi-particle benchmark based on di-photon separations, before studying a first full-physics benchmark based on hadronic decays of the tau lepton. Our results indicate that models operating on a point cloud can achieve a favorable balance between speed and accuracy for highly granular calorimeter simulation compared to those which operate on a regular grid representation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17318",
        "abs_url": "https://arxiv.org/abs/2511.17318",
        "pdf_url": "https://arxiv.org/pdf/2511.17318",
        "title": "FORWARD: Dataset of a forwarder operating in rough terrain",
        "authors": [
            "Mikael Lundbäck",
            "Erik Wallin",
            "Carola Häggström",
            "Mattias Nyström",
            "Andreas Grönlund",
            "Mats Richardson",
            "Petrus Jönsson",
            "William Arnvik",
            "Lucas Hedström",
            "Arvid Fälldin",
            "Martin Servin"
        ],
        "comments": "25 pages, 22 figures",
        "subjects": "Robotics (cs.RO); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG); Applied Physics (physics.app-ph)",
        "abstract": "We present FORWARD, a high-resolution multimodal dataset of a cut-to-length forwarder operating in rough terrain on two harvest sites in the middle part of Sweden. The forwarder is a large Komatsu model equipped with a variety of sensors, including RTK-GNSS, 360-camera, operator vibration sensors, internal CAN-bus signal recording, and multiple IMUs. The data includes event time logs recorded in 5 Hz with e.g., driving speed, fuel consumption, vehicle position with centimeter accuracy, and crane use while the vehicle operates in forest areas laser-scanned with very high-resolution, $\\sim$1500 points per square meter. Production log files (StanForD standard) with time-stamped machine events, extensive video material, and terrain data in various formats are included as well. About 18 hours of regular wood extraction work during three days is annotated from 360-video material into individual work elements and included in the dataset. We also include scenario specifications of conducted experiments on forest roads and in terrain. Scenarios include repeatedly driving the same routes with and without steel tracks, different load weight, and different target driving speeds. The dataset is intended for developing models and algorithms for trafficability, perception, and autonomous control of forest machines using artificial intelligence, simulation, and experiments on physical testbeds. In part, we focus on forwarders traversing terrain, avoiding obstacles, and loading or unloading logs, with consideration for efficiency, fuel consumption, safety, and environmental impact. Other benefits of the open dataset include the ability to explore auto-generation and calibration of forestry machine simulators and automation scenario descriptions using the data recorded in the field.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17380",
        "abs_url": "https://arxiv.org/abs/2511.17380",
        "pdf_url": "https://arxiv.org/pdf/2511.17380",
        "title": "Non-Parametric Probabilistic Robustness: A Conservative Metric with Optimized Perturbation Distributions",
        "authors": [
            "Zheng Wang",
            "Yi Zhang",
            "Siddartha Khastgir",
            "Carsten Maple",
            "Xingyu Zhao"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Deep learning (DL) models, despite their remarkable success, remain vulnerable to small input perturbations that can cause erroneous outputs, motivating the recent proposal of probabilistic robustness (PR) as a complementary alternative to adversarial robustness (AR). However, existing PR formulations assume a fixed and known perturbation distribution, an unrealistic expectation in practice. To address this limitation, we propose non-parametric probabilistic robustness (NPPR), a more practical PR metric that does not rely on any predefined perturbation distribution. Following the non-parametric paradigm in statistical modeling, NPPR learns an optimized perturbation distribution directly from data, enabling conservative PR evaluation under distributional uncertainty. We further develop an NPPR estimator based on a Gaussian Mixture Model (GMM) with Multilayer Perceptron (MLP) heads and bicubic up-sampling, covering various input-dependent and input-independent perturbation scenarios. Theoretical analyses establish the relationships among AR, PR, and NPPR. Extensive experiments on CIFAR-10, CIFAR-100, and Tiny ImageNet across ResNet18/50, WideResNet50 and VGG16 validate NPPR as a more practical robustness metric, showing up to 40\\% more conservative (lower) PR estimates compared to assuming those common perturbation distributions used in state-of-the-arts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17388",
        "abs_url": "https://arxiv.org/abs/2511.17388",
        "pdf_url": "https://arxiv.org/pdf/2511.17388",
        "title": "Selective Rotary Position Embedding",
        "authors": [
            "Sajad Movahedi",
            "Timur Carstensen",
            "Arshia Afzal",
            "Frank Hutter",
            "Antonio Orvieto",
            "Volkan Cevher"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Position information is essential for language modeling. In softmax transformers, Rotary Position Embeddings (\\textit{RoPE}) encode positions through \\textit{fixed-angle} rotations, while in linear transformers, order is handled via input-dependent (selective) gating that decays past key-value associations. Selectivity has generally been shown to improve language-related tasks. Inspired by this, we introduce \\textit{Selective RoPE}, an \\textit{input-dependent} rotary embedding mechanism, that generalizes \\textit{RoPE}, and enables rotation in \\textit{arbitrary angles} for both linear and softmax transformers. We show that softmax attention already performs a hidden form of these rotations on query-key pairs, uncovering an implicit positional structure. We further show that in state-space models and gated linear transformers, the real part manages forgetting while the imaginary part encodes positions through rotations. We validate our method by equipping gated transformers with \\textit{Selective RoPE}, demonstrating that its input-dependent rotations improve performance in language modeling and on difficult sequence tasks like copying, state tracking, and retrieval.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17411",
        "abs_url": "https://arxiv.org/abs/2511.17411",
        "pdf_url": "https://arxiv.org/pdf/2511.17411",
        "title": "SPEAR-1: Scaling Beyond Robot Demonstrations via 3D Understanding",
        "authors": [
            "Nikolay Nikolov",
            "Giuliano Albanese",
            "Sombit Dey",
            "Aleksandar Yanev",
            "Luc Van Gool",
            "Jan-Nico Zaech",
            "Danda Pani Paudel"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Robotic Foundation Models (RFMs) hold great promise as generalist, end-to-end systems for robot control. Yet their ability to generalize across new environments, tasks, and embodiments remains limited. We argue that a major bottleneck lies in their foundations: most RFMs are built by fine-tuning internet-pretrained Vision-Language Models (VLMs). However, these VLMs are trained on 2D image-language tasks and lack the 3D spatial reasoning inherently required for embodied control in the 3D world. Bridging this gap directly with large-scale robotic data is costly and difficult to scale. Instead, we propose to enrich easy-to-collect non-robotic image data with 3D annotations and enhance a pretrained VLM with 3D understanding capabilities. Following this strategy, we train SPEAR-VLM, a 3D-aware VLM that infers object coordinates in 3D space from a single 2D image. Building on SPEAR-VLM, we introduce our main contribution, $~\\textbf{SPEAR-1}$: a robotic foundation model that integrates grounded 3D perception with language-instructed embodied control. Trained on $\\sim$45M frames from 24 Open X-Embodiment datasets, SPEAR-1 outperforms or matches state-of-the-art models such as $\\pi_0$-FAST and $\\pi_{0.5}$, while it uses 20$\\times$ fewer robot demonstrations. This carefully-engineered training strategy unlocks new VLM capabilities and as a consequence boosts the reliability of embodied control beyond what is achievable with only robotic data. We make our model weights and 3D-annotated datasets publicly available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17417",
        "abs_url": "https://arxiv.org/abs/2511.17417",
        "pdf_url": "https://arxiv.org/pdf/2511.17417",
        "title": "CREST: Improving Interpretability and Effectiveness of Troubleshooting at Ericsson through Criterion-Specific Trouble Report Retrieval",
        "authors": [
            "Soroush Javdan",
            "Pragash Krishnamoorthy",
            "Olga Baysal"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "The rapid evolution of the telecommunication industry necessitates efficient troubleshooting processes to maintain network reliability, software maintainability, and service quality. Trouble Reports (TRs), which document issues in Ericsson's production system, play a critical role in facilitating the timely resolution of software faults. However, the complexity and volume of TR data, along with the presence of diverse criteria that reflect different aspects of each fault, present challenges for retrieval systems. Building on prior work at Ericsson, which utilized a two-stage workflow, comprising Initial Retrieval (IR) and Re-Ranking (RR) stages, this study investigates different TR observation criteria and their impact on the performance of retrieval models. We propose \\textbf{CREST} (\\textbf{C}riteria-specific \\textbf{R}etrieval via \\textbf{E}nsemble of \\textbf{S}pecialized \\textbf{T}R models), a criterion-driven retrieval approach that leverages specialized models for different TR fields to improve both effectiveness and interpretability, thereby enabling quicker fault resolution and supporting software maintenance. CREST utilizes specialized models trained on specific TR criteria and aggregates their outputs to capture diverse and complementary signals. This approach leads to enhanced retrieval accuracy, better calibration of predicted scores, and improved interpretability by providing relevance scores for each criterion, helping users understand why specific TRs were retrieved. Using a subset of Ericsson's internal TRs, this research demonstrates that criterion-specific models significantly outperform a single model approach across key evaluation metrics. This highlights the importance of all targeted criteria used in this study for optimizing the performance of retrieval systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17436",
        "abs_url": "https://arxiv.org/abs/2511.17436",
        "pdf_url": "https://arxiv.org/pdf/2511.17436",
        "title": "A Framework for Adaptive Stabilisation of Nonlinear Stochastic Systems",
        "authors": [
            "Seth Siriya",
            "Jingge Zhu",
            "Dragan Nešić",
            "Ye Pu"
        ],
        "comments": "22 pages, 1 figure",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "We consider the adaptive control problem for discrete-time, nonlinear stochastic systems with linearly parameterised uncertainty. Assuming access to a parameterised family of controllers that can stabilise the system in a bounded set within an informative region of the state space when the parameter is well-chosen, we propose a certainty equivalence learning-based adaptive control strategy, and subsequently derive stability bounds on the closed-loop system that hold for some probabilities. We then show that if the entire state space is informative, and the family of controllers is globally stabilising with appropriately chosen parameters, high probability stability guarantees can be derived.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-11-24",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-24?abs=True",
        "arxiv_id": "2511.17475",
        "abs_url": "https://arxiv.org/abs/2511.17475",
        "pdf_url": "https://arxiv.org/pdf/2511.17475",
        "title": "Addressing A Posteriori Performance Degradation in Neural Network Subgrid Stress Models",
        "authors": [
            "Andy Wu",
            "Sanjiva K. Lele"
        ],
        "comments": "",
        "subjects": "Fluid Dynamics (physics.flu-dyn); Machine Learning (cs.LG)",
        "abstract": "Neural network subgrid stress models often have a priori performance that is far better than the a posteriori performance, leading to neural network models that look very promising a priori completely failing in a posteriori Large Eddy Simulations (LES). This performance gap can be decreased by combining two different methods, training data augmentation and reducing input complexity to the neural network. Augmenting the training data with two different filters before training the neural networks has no performance degradation a priori as compared to a neural network trained with one filter. A posteriori, neural networks trained with two different filters are far more robust across two different LES codes with different numerical schemes. In addition, by ablating away the higher order terms input into the neural network, the a priori versus a posteriori performance changes become less apparent. When combined, neural networks that use both training data augmentation and a less complex set of inputs have a posteriori performance far more reflective of their a priori evaluation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]