[
    {
        "order": 1,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09559",
        "abs_url": "https://arxiv.org/abs/2511.09559",
        "pdf_url": "https://arxiv.org/pdf/2511.09559",
        "title": "Probability-Biased Attention over Directed Bipartite Graphs for Long-Tail ICD Coding",
        "authors": [
            "Tianlei Chen",
            "Yuxiao Chen",
            "Yang Li",
            "Feifei Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Automated International Classification of Diseases (ICD) coding aims to assign multiple disease codes to clinical documents, constituting a crucial multi-label text classification task in healthcare informatics. However, the task is challenging due to its large label space (10,000 to 20,000 codes) and long-tail distribution, where a few codes dominate while many rare codes lack sufficient training data. To address this, we propose a learning method that models fine-grained co-occurrence relationships among codes. Specifically, we construct a Directed Bipartite Graph Encoder with disjoint sets of common and rare code nodes. To facilitate a one-way information flow, edges are directed exclusively from common to rare codes. The nature of these connections is defined by a probability-based bias, which is derived from the conditional probability of a common code co-occurring given the presence of a rare code. This bias is then injected into the encoder's attention module, a process we term Co-occurrence Encoding. This structure empowers the graph encoder to enrich rare code representations by aggregating latent comorbidity information reflected in the statistical co-occurrence of their common counterparts. To ensure high-quality input to the graph, we utilize a large language model (LLM) to generate comprehensive descriptions for codes, enriching initial embeddings with clinical context and comorbidity information, serving as external knowledge for the statistical co-occurrence relationships in the code system. Experiments on three automated ICD coding benchmark datasets demonstrate that our method achieves state-of-the-art performance with particularly notable improvements in Macro-F1, which is the key metric for long-tail classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09567",
        "abs_url": "https://arxiv.org/abs/2511.09567",
        "pdf_url": "https://arxiv.org/pdf/2511.09567",
        "title": "Let the Experts Speak: Improving Survival Prediction & Calibration via Mixture-of-Experts Heads",
        "authors": [
            "Todd Morrill",
            "Aahlad Puli",
            "Murad Megjhani",
            "Soojin Park",
            "Richard Zemel"
        ],
        "comments": "Accepted as a proceedings paper at the 2025 Machine Learning for Health Symposium and as a workshop paper at the Learning from Time Series for Health workshop at NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep mixture-of-experts models have attracted a lot of attention for survival analysis problems, particularly for their ability to cluster similar patients together. In practice, grouping often comes at the expense of key metrics such calibration error and predictive accuracy. This is due to the restrictive inductive bias that mixture-of-experts imposes, that predictions for individual patients must look like predictions for the group they're assigned to. Might we be able to discover patient group structure, where it exists, while improving calibration and predictive accuracy? In this work, we introduce several discrete-time deep mixture-of-experts (MoE) based architectures for survival analysis problems, one of which achieves all desiderata: clustering, calibration, and predictive accuracy. We show that a key differentiator between this array of MoEs is how expressive their experts are. We find that more expressive experts that tailor predictions per patient outperform experts that rely on fixed group prototypes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09569",
        "abs_url": "https://arxiv.org/abs/2511.09569",
        "pdf_url": "https://arxiv.org/pdf/2511.09569",
        "title": "Filtering Jump Markov Systems with Partially Known Dynamics: A Model-Based Deep Learning Approach",
        "authors": [
            "George Stamatelis",
            "George C. Alexandropoulos"
        ],
        "comments": "Submitted to an IEEE transactions journal, copyright may be transfered upon acceptance",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "This paper presents the Jump Markov Filtering Network (JMFNet), a novel model-based deep learning framework for real-time state-state estimation in jump Markov systems with unknown noise statistics and mode transition dynamics. A hybrid architecture comprising two Recurrent Neural Networks (RNNs) is proposed: one for mode prediction and another for filtering that is based on a mode-augmented version of the recently presented KalmanNet architecture. The proposed RNNs are trained jointly using an alternating least squares strategy that enables mutual adaptation without supervision of the latent modes. Extensive numerical experiments on linear and nonlinear systems, including target tracking, pendulum angle tracking, Lorenz attractor dynamics, and a real-life dataset demonstrate that the proposed JMFNet framework outperforms classical model-based filters (e.g., interacting multiple models and particle filters) as well as model-free deep learning baselines, particularly in non-stationary and high-noise regimes. It is also showcased that JMFNet achieves a small yet meaningful improvement over the KalmanNet framework, which becomes much more pronounced in complicated systems or long trajectories. Finally, the method's performance is empirically validated to be consistent and reliable, exhibiting low sensitivity to initial conditions, hyperparameter selection, as well as to incorrect model knowledge",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09573",
        "abs_url": "https://arxiv.org/abs/2511.09573",
        "pdf_url": "https://arxiv.org/pdf/2511.09573",
        "title": "Group Averaging for Physics Applications: Accuracy Improvements at Zero Training Cost",
        "authors": [
            "Valentino F. Foit",
            "David W. Hogg",
            "Soledad Villar"
        ],
        "comments": "10 pages, 2 figures, 1 table, Machine Learning and the Physical Sciences Workshop, NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Many machine learning tasks in the natural sciences are precisely equivariant to particular symmetries. Nonetheless, equivariant methods are often not employed, perhaps because training is perceived to be challenging, or the symmetry is expected to be learned, or equivariant implementations are seen as hard to build. Group averaging is an available technique for these situations. It happens at test time; it can make any trained model precisely equivariant at a (often small) cost proportional to the size of the group; it places no requirements on model structure or training. It is known that, under mild conditions, the group-averaged model will have a provably better prediction accuracy than the original model. Here we show that an inexpensive group averaging can improve accuracy in practice. We take well-established benchmark machine learning models of differential equations in which certain symmetries ought to be obeyed. At evaluation time, we average the models over a small group of symmetries. Our experiments show that this procedure always decreases the average evaluation loss, with improvements of up to 37\\% in terms of the VRMSE. The averaging produces visually better predictions for continuous dynamics. This short paper shows that, under certain common circumstances, there are no disadvantages to imposing exact symmetries; the ML4PS community should consider group averaging as a cheap and simple way to improve model accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09586",
        "abs_url": "https://arxiv.org/abs/2511.09586",
        "pdf_url": "https://arxiv.org/pdf/2511.09586",
        "title": "Scaling Environments for LLM Agents in the Era of Learning from Interaction: A Survey",
        "authors": [
            "Yuchen Huang",
            "Sijia Li",
            "Minghao Liu",
            "Wei Liu",
            "Shijue Huang",
            "Zhiyuan Fan",
            "Hou Pong Chan",
            "Yi R. Fung"
        ],
        "comments": "20 pages, 4 figures, SEA Workshop @ NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "LLM-based agents can autonomously accomplish complex tasks across various domains. However, to further cultivate capabilities such as adaptive behavior and long-term decision-making, training on static datasets built from human-level knowledge is insufficient. These datasets are costly to construct and lack both dynamism and realism. A growing consensus is that agents should instead interact directly with environments and learn from experience through reinforcement learning. We formalize this iterative process as the Generation-Execution-Feedback (GEF) loop, where environments generate tasks to challenge agents, return observations in response to agents' actions during task execution, and provide evaluative feedback on rollouts for subsequent learning. Under this paradigm, environments function as indispensable producers of experiential data, highlighting the need to scale them toward greater complexity, realism, and interactivity. In this survey, we systematically review representative methods for environment scaling from a pioneering environment-centric perspective and organize them along the stages of the GEF loop, namely task generation, task execution, and feedback. We further analyze benchmarks, implementation strategies, and applications, consolidating fragmented advances and outlining future research directions for agent intelligence.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09593",
        "abs_url": "https://arxiv.org/abs/2511.09593",
        "pdf_url": "https://arxiv.org/pdf/2511.09593",
        "title": "DynamicRTL: RTL Representation Learning for Dynamic Circuit Behavior",
        "authors": [
            "Ruiyang Ma",
            "Yunhao Zhou",
            "Yipeng Wang",
            "Yi Liu",
            "Zhengyuan Shi",
            "Ziyang Zheng",
            "Kexin Chen",
            "Zhiqiang He",
            "Lingwei Yan",
            "Gang Chen",
            "Qiang Xu",
            "Guojie Luo"
        ],
        "comments": "Accepted by AAAI'2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "There is a growing body of work on using Graph Neural Networks (GNNs) to learn representations of circuits, focusing primarily on their static characteristics. However, these models fail to capture circuit runtime behavior, which is crucial for tasks like circuit verification and optimization. To address this limitation, we introduce DR-GNN (DynamicRTL-GNN), a novel approach that learns RTL circuit representations by incorporating both static structures and multi-cycle execution behaviors. DR-GNN leverages an operator-level Control Data Flow Graph (CDFG) to represent Register Transfer Level (RTL) circuits, enabling the model to capture dynamic dependencies and runtime execution. To train and evaluate DR-GNN, we build the first comprehensive dynamic circuit dataset, comprising over 6,300 Verilog designs and 63,000 simulation traces. Our results demonstrate that DR-GNN outperforms existing models in branch hit prediction and toggle rate prediction. Furthermore, its learned representations transfer effectively to related dynamic circuit tasks, achieving strong performance in power estimation and assertion prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09596",
        "abs_url": "https://arxiv.org/abs/2511.09596",
        "pdf_url": "https://arxiv.org/pdf/2511.09596",
        "title": "Making Every Head Count: Sparse Attention Without the Speed-Performance Trade-off",
        "authors": [
            "Mingkuan Zhao",
            "Wentao Hu",
            "Jiayin Wang",
            "Xin Lai",
            "Tianchen Huang",
            "Yuheng Min",
            "Rui Yan",
            "Xiaoyan Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The design of Large Language Models (LLMs) has long been hampered by a fundamental conflict within their core attention mechanism: its remarkable expressivity is built upon a computational complexity of $O(H \\cdot N^2)$ that grows quadratically with the context size ($N$) and linearly with the number of heads ($H$). This standard implementation harbors significant computational redundancy, as all heads independently compute attention over the same sequence space. Existing sparse methods, meanwhile, often trade information integrity for computational efficiency. To resolve this efficiency-performance trade-off, we propose SPAttention, whose core contribution is the introduction of a new paradigm we term Principled Structural Sparsity. SPAttention does not merely drop connections but instead reorganizes the computational task by partitioning the total attention workload into balanced, non-overlapping distance bands, assigning each head a unique segment. This approach transforms the multi-head attention mechanism from $H$ independent $O(N^2)$ computations into a single, collaborative $O(N^2)$ computation, fundamentally reducing complexity by a factor of $H$. The structured inductive bias compels functional specialization among heads, enabling a more efficient allocation of computational resources from redundant modeling to distinct dependencies across the entire sequence span. Extensive empirical validation on the OLMoE-1B-7B and 0.25B-1.75B model series demonstrates that while delivering an approximately two-fold increase in training throughput, its performance is on par with standard dense attention, even surpassing it on select key metrics, while consistently outperforming representative sparse attention methods including Longformer, Reformer, and BigBird across all evaluation metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09598",
        "abs_url": "https://arxiv.org/abs/2511.09598",
        "pdf_url": "https://arxiv.org/pdf/2511.09598",
        "title": "Parametric Expensive Multi-Objective Optimization via Generative Solution Modeling",
        "authors": [
            "Tingyang Wei",
            "Jiao Liu",
            "Abhishek Gupta",
            "Chin Chun Ooi",
            "Puay Siew Tan",
            "Yew-Soon Ong"
        ],
        "comments": "Preprint",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Many real-world applications require solving families of expensive multi-objective optimization problems~(EMOPs) under varying operational conditions. This gives rise to parametric expensive multi-objective optimization problems (P-EMOPs) where each task parameter defines a distinct optimization instance. Current multi-objective Bayesian optimization methods have been widely used for finding finite sets of Pareto optimal solutions for individual tasks. However, P-EMOPs present a fundamental challenge: the continuous task parameter space can contain infinite distinct problems, each requiring separate expensive evaluations. This demands learning an inverse model that can directly predict optimized solutions for any task-preference query without expensive re-evaluation. This paper introduces the first parametric multi-objective Bayesian optimizer that learns this inverse model by alternating between (1) acquisition-driven search leveraging inter-task synergies and (2) generative solution sampling via conditional generative models. This approach enables efficient optimization across related tasks and finally achieves direct solution prediction for unseen parameterized EMOPs without additional expensive evaluations. We theoretically justify the faster convergence by leveraging inter-task synergies through task-aware Gaussian processes. Meanwhile, empirical studies in synthetic and real-world benchmarks further verify the effectiveness of our alternating framework.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09665",
        "abs_url": "https://arxiv.org/abs/2511.09665",
        "pdf_url": "https://arxiv.org/pdf/2511.09665",
        "title": "Generalization Can Emerge in Tabular Foundation Models From a Single Table",
        "authors": [
            "Junwei Ma",
            "Nour Shaheen",
            "Alex Labach",
            "Amine Mhedhbi",
            "Frank Hutter",
            "Anthony L. Caterini",
            "Valentin Thomas"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep tabular modelling increasingly relies on in-context learning where, during inference, a model receives a set of $(x,y)$ pairs as context and predicts labels for new inputs without weight updates. We challenge the prevailing view that broad generalization here requires pre-training on large synthetic corpora (e.g., TabPFN priors) or a large collection of real data (e.g., TabDPT training datasets), discovering that a relatively small amount of data suffices for generalization. We find that simple self-supervised pre-training on just a \\emph{single} real table can produce surprisingly strong transfer across heterogeneous benchmarks. By systematically pre-training and evaluating on many diverse datasets, we analyze what aspects of the data are most important for building a Tabular Foundation Model (TFM) generalizing across domains. We then connect this to the pre-training procedure shared by most TFMs and show that the number and quality of \\emph{tasks} one can construct from a dataset is key to downstream performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09672",
        "abs_url": "https://arxiv.org/abs/2511.09672",
        "pdf_url": "https://arxiv.org/pdf/2511.09672",
        "title": "GEM+: Scalable State-of-the-Art Private Synthetic Data with Generator Networks",
        "authors": [
            "Samuel Maddock",
            "Shripad Gade",
            "Graham Cormode",
            "Will Bullock"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "State-of-the-art differentially private synthetic tabular data has been defined by adaptive 'select-measure-generate' frameworks, exemplified by methods like AIM. These approaches iteratively measure low-order noisy marginals and fit graphical models to produce synthetic data, enabling systematic optimisation of data quality under privacy constraints. Graphical models, however, are inefficient for high-dimensional data because they require substantial memory and must be retrained from scratch whenever the graph structure changes, leading to significant computational overhead. Recent methods, like GEM, overcome these limitations by using generator neural networks for improved scalability. However, empirical comparisons have mostly focused on small datasets, limiting real-world applicability. In this work, we introduce GEM+, which integrates AIM's adaptive measurement framework with GEM's scalable generator network. Our experiments show that GEM+ outperforms AIM in both utility and scalability, delivering state-of-the-art results while efficiently handling datasets with over a hundred columns, where AIM fails due to memory and computational overheads.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09677",
        "abs_url": "https://arxiv.org/abs/2511.09677",
        "pdf_url": "https://arxiv.org/pdf/2511.09677",
        "title": "Boosted GFlowNets: Improving Exploration via Sequential Learning",
        "authors": [
            "Pedro Dall'Antonia",
            "Tiago da Silva",
            "Daniel Augusto de Souza",
            "César Lincoln C. Mattos",
            "Diego Mesquita"
        ],
        "comments": "11 pages, 3 figures (22 pages total including supplementary material)",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Generative Flow Networks (GFlowNets) are powerful samplers for compositional objects that, by design, sample proportionally to a given non-negative reward. Nonetheless, in practice, they often struggle to explore the reward landscape evenly: trajectories toward easy-to-reach regions dominate training, while hard-to-reach modes receive vanishing or uninformative gradients, leading to poor coverage of high-reward areas. We address this imbalance with Boosted GFlowNets, a method that sequentially trains an ensemble of GFlowNets, each optimizing a residual reward that compensates for the mass already captured by previous models. This residual principle reactivates learning signals in underexplored regions and, under mild assumptions, ensures a monotone non-degradation property: adding boosters cannot worsen the learned distribution and typically improves it. Empirically, Boosted GFlowNets achieve substantially better exploration and sample diversity on multimodal synthetic benchmarks and peptide design tasks, while preserving the stability and simplicity of standard trajectory-balance training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09693",
        "abs_url": "https://arxiv.org/abs/2511.09693",
        "pdf_url": "https://arxiv.org/pdf/2511.09693",
        "title": "ConstrainedSQL: Training LLMs for Text2SQL via Constrained Reinforcement Learning",
        "authors": [
            "Weiqin Chen",
            "Nhan Huu Pham",
            "Michael Robert Glass",
            "Long Hai Vu",
            "Gaetano Rossiello",
            "Dharmashankar Subramanian",
            "Santiago Paternain"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reinforcement learning (RL) has demonstrated significant promise in enhancing the reasoning capabilities of Text2SQL LLMs, especially with advanced algorithms such as GRPO and DAPO. However, the performance of these methods is highly sensitive to the design of reward functions. Inappropriate rewards can lead to reward hacking, where models exploit loopholes in the reward structure to achieve high scores without genuinely solving the task. This work considers a constrained RL framework for Text2SQL that incorporates natural and interpretable reward and constraint signals, while dynamically balancing trade-offs among them during the training. We establish the theoretical guarantees of our constrained RL framework and our numerical experiments on the well-known Text2SQL datasets substantiate the improvement of our approach over the state-of-the-art RL-trained LLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09708",
        "abs_url": "https://arxiv.org/abs/2511.09708",
        "pdf_url": "https://arxiv.org/pdf/2511.09708",
        "title": "Efficient Hyperdimensional Computing with Modular Composite Representations",
        "authors": [
            "Marco Angioli",
            "Christopher J. Kymn",
            "Antonello Rosato",
            "Amy Loutfi",
            "Mauro Olivieri",
            "Denis Kleyko"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The modular composite representation (MCR) is a computing model that represents information with high-dimensional integer vectors using modular arithmetic. Originally proposed as a generalization of the binary spatter code model, it aims to provide higher representational power while remaining a lighter alternative to models requiring high-precision components. Despite this potential, MCR has received limited attention. Systematic analyses of its trade-offs and comparisons with other models are lacking, sustaining the perception that its added complexity outweighs the improved expressivity. In this work, we revisit MCR by presenting its first extensive evaluation, demonstrating that it achieves a unique balance of capacity, accuracy, and hardware efficiency. Experiments measuring capacity demonstrate that MCR outperforms binary and integer vectors while approaching complex-valued representations at a fraction of their memory footprint. Evaluation on 123 datasets confirms consistent accuracy gains and shows that MCR can match the performance of binary spatter codes using up to 4x less memory. We investigate the hardware realization of MCR by showing that it maps naturally to digital logic and by designing the first dedicated accelerator. Evaluations on basic operations and 7 selected datasets demonstrate a speedup of up to 3 orders of magnitude and significant energy reductions compared to software implementation. When matched for accuracy against binary spatter codes, MCR achieves on average 3.08x faster execution and 2.68x lower energy consumption. These findings demonstrate that, although MCR requires more sophisticated operations than binary spatter codes, its modular arithmetic and higher per-component precision enable lower dimensionality. When realized with dedicated hardware, this results in a faster, more energy-efficient, and high-precision alternative to existing models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09729",
        "abs_url": "https://arxiv.org/abs/2511.09729",
        "pdf_url": "https://arxiv.org/pdf/2511.09729",
        "title": "Generalizing PDE Emulation with Equation-Aware Neural Operators",
        "authors": [
            "Qian-Ze Zhu",
            "Paul Raccuglia",
            "Michael P. Brenner"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Solving partial differential equations (PDEs) can be prohibitively expensive using traditional numerical methods. Deep learning-based surrogate models typically specialize in a single PDE with fixed parameters. We present a framework for equation-aware emulation that generalizes to unseen PDEs, conditioning a neural model on a vector encoding representing the terms in a PDE and their coefficients. We present a baseline of four distinct modeling technqiues, trained on a family of 1D PDEs from the APEBench suite. Our approach achieves strong performance on parameter sets held out from the training distribution, with strong stability for rollout beyond the training window, and generalization to an entirely unseen PDE. This work was developed as part of a broader effort exploring AI systems that automate the creation of expert-level empirical software for scorable scientific tasks. The data and codebase are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09731",
        "abs_url": "https://arxiv.org/abs/2511.09731",
        "pdf_url": "https://arxiv.org/pdf/2511.09731",
        "title": "FlowCast: Advancing Precipitation Nowcasting with Conditional Flow Matching",
        "authors": [
            "Bernardo Perrone Ribeiro",
            "Jana Faganeli Pucer"
        ],
        "comments": "Under Review",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Radar-based precipitation nowcasting, the task of forecasting short-term precipitation fields from previous radar images, is a critical problem for flood risk management and decision-making. While deep learning has substantially advanced this field, two challenges remain fundamental: the uncertainty of atmospheric dynamics and the efficient modeling of high-dimensional data. Diffusion models have shown strong promise by producing sharp, reliable forecasts, but their iterative sampling process is computationally prohibitive for time-critical applications. We introduce FlowCast, the first model to apply Conditional Flow Matching (CFM) to precipitation nowcasting. Unlike diffusion, CFM learns a direct noise-to-data mapping, enabling rapid, high-fidelity sample generation with drastically fewer function evaluations. Our experiments demonstrate that FlowCast establishes a new state-of-the-art in predictive accuracy. A direct comparison further reveals the CFM objective is both more accurate and significantly more efficient than a diffusion objective on the same architecture, maintaining high performance with significantly fewer sampling steps. This work positions CFM as a powerful and practical alternative for high-dimensional spatiotemporal forecasting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09736",
        "abs_url": "https://arxiv.org/abs/2511.09736",
        "pdf_url": "https://arxiv.org/pdf/2511.09736",
        "title": "Data Heterogeneity and Forgotten Labels in Split Federated Learning",
        "authors": [
            "Joana Tirana",
            "Dimitra Tsigkari",
            "David Solans Noguero",
            "Nicolas Kourtellis"
        ],
        "comments": "A shorter version of this paper will appear in the proceedings of AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In Split Federated Learning (SFL), the clients collaboratively train a model with the help of a server by splitting the model into two parts. Part-1 is trained locally at each client and aggregated by the aggregator at the end of each round. Part-2 is trained at a server that sequentially processes the intermediate activations received from each client. We study the phenomenon of catastrophic forgetting (CF) in SFL in the presence of data heterogeneity. In detail, due to the nature of SFL, local updates of part-1 may drift away from global optima, while part-2 is sensitive to the processing sequence, similar to forgetting in continual learning (CL). Specifically, we observe that the trained model performs better in classes (labels) seen at the end of the sequence. We investigate this phenomenon with emphasis on key aspects of SFL, such as the processing order at the server and the cut layer. Based on our findings, we propose Hydra, a novel mitigation method inspired by multi-head neural networks and adapted for the SFL's setting. Extensive numerical evaluations show that Hydra outperforms baselines and methods from the literature.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09737",
        "abs_url": "https://arxiv.org/abs/2511.09737",
        "pdf_url": "https://arxiv.org/pdf/2511.09737",
        "title": "Out-of-Distribution Generalization with a SPARC: Racing 100 Unseen Vehicles with a Single Policy",
        "authors": [
            "Bram Grooten",
            "Patrick MacAlpine",
            "Kaushik Subramanian",
            "Peter Stone",
            "Peter R. Wurman"
        ],
        "comments": "Accepted as an oral at AAAI 2026. For code and videos, please see this https URL",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Generalization to unseen environments is a significant challenge in the field of robotics and control. In this work, we focus on contextual reinforcement learning, where agents act within environments with varying contexts, such as self-driving cars or quadrupedal robots that need to operate in different terrains or weather conditions than they were trained for. We tackle the critical task of generalizing to out-of-distribution (OOD) settings, without access to explicit context information at test time. Recent work has addressed this problem by training a context encoder and a history adaptation module in separate stages. While promising, this two-phase approach is cumbersome to implement and train. We simplify the methodology and introduce SPARC: single-phase adaptation for robust control. We test SPARC on varying contexts within the high-fidelity racing simulator Gran Turismo 7 and wind-perturbed MuJoCo environments, and find that it achieves reliable and robust OOD generalization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09741",
        "abs_url": "https://arxiv.org/abs/2511.09741",
        "pdf_url": "https://arxiv.org/pdf/2511.09741",
        "title": "TawPipe: Topology-Aware Weight Pipeline Parallelism for Accelerating Long-Context Large Models Training",
        "authors": [
            "Houming Wu",
            "Ling Chen"
        ],
        "comments": "Accepted by AAAI 2026, 9 pages, and 6 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Training large language models (LLMs) is fundamentally constrained by limited device memory and costly inter-device communication. Although pipeline parallelism alleviates memory pressure by partitioning models across devices, it incurs activation communication overhead that scales linearly with sequence length, limiting efficiency in long-context training. Recent weight-passing approaches (e.g., WeiPipe) mitigate this by transmitting model weights instead of activations, but suffer from redundant peer-to-peer (P2P) transfers and underutilized intra-node bandwidth. We propose TawPipe--topology-aware weight pipeline parallelism, which exploits hierarchical bandwidth in distributed clusters for improved communication efficiency. TawPipe: (i) groups devices based on topology to optimize intra-node collective and inter-node P2P communication; (ii) assigns each device a fixed shard of model weights and gradients, avoiding redundant transfers; and (iii) overlaps communication with computation to hide latency. Unlike global collective operations used in fully sharded data parallelism (FSDP), TawPipe confines most communication within node boundaries, significantly reducing cross-node traffic. Extensive experiments on up to 24 GPUs with LLaMA-style models show that TawPipe achieves superior throughput and scalability compared to state-of-the-art baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09763",
        "abs_url": "https://arxiv.org/abs/2511.09763",
        "pdf_url": "https://arxiv.org/pdf/2511.09763",
        "title": "Is nasty noise actually harder than malicious noise?",
        "authors": [
            "Guy Blanc",
            "Yizhi Huang",
            "Tal Malkin",
            "Rocco A. Servedio"
        ],
        "comments": "To appear in SODA 2026",
        "subjects": "Machine Learning (cs.LG); Computational Complexity (cs.CC); Data Structures and Algorithms (cs.DS)",
        "abstract": "We consider the relative abilities and limitations of computationally efficient algorithms for learning in the presence of noise, under two well-studied and challenging adversarial noise models for learning Boolean functions: malicious noise, in which an adversary can arbitrarily corrupt a random subset of examples given to the learner; and nasty noise, in which an adversary can arbitrarily corrupt an adversarially chosen subset of examples given to the learner. We consider both the distribution-independent and fixed-distribution settings. Our main results highlight a dramatic difference between these two settings: For distribution-independent learning, we prove a strong equivalence between the two noise models: If a class ${\\cal C}$ of functions is efficiently learnable in the presence of $\\eta$-rate malicious noise, then it is also efficiently learnable in the presence of $\\eta$-rate nasty noise. In sharp contrast, for the fixed-distribution setting we show an arbitrarily large separation: Under a standard cryptographic assumption, for any arbitrarily large value $r$ there exists a concept class for which there is a ratio of $r$ between the rate $\\eta_{malicious}$ of malicious noise that polynomial-time learning algorithms can tolerate, versus the rate $\\eta_{nasty}$ of nasty noise that such learning algorithms can tolerate. To offset the negative result for the fixed-distribution setting, we define a broad and natural class of algorithms, namely those that ignore contradictory examples (ICE). We show that for these algorithms, malicious noise and nasty noise are equivalent up to a factor of two in the noise rate: Any efficient ICE learner that succeeds with $\\eta$-rate malicious noise can be converted to an efficient learner that succeeds with $\\eta/2$-rate nasty noise. We further show that the above factor of two is necessary, again under a standard cryptographic assumption.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09773",
        "abs_url": "https://arxiv.org/abs/2511.09773",
        "pdf_url": "https://arxiv.org/pdf/2511.09773",
        "title": "NeuroLingua: A Language-Inspired Hierarchical Framework for Multimodal Sleep Stage Classification Using EEG and EOG",
        "authors": [
            "Mahdi Samaee",
            "Mehran Yazdi",
            "Daniel Massicotte"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Automated sleep stage classification from polysomnography remains limited by the lack of expressive temporal hierarchies, challenges in multimodal EEG and EOG fusion, and the limited interpretability of deep learning models. We propose NeuroLingua, a language-inspired framework that conceptualizes sleep as a structured physiological language. Each 30-second epoch is decomposed into overlapping 3-second subwindows (\"tokens\") using a CNN-based tokenizer, enabling hierarchical temporal modeling through dual-level Transformers: intra-segment encoding of local dependencies and inter-segment integration across seven consecutive epochs (3.5 minutes) for extended context. Modality-specific embeddings from EEG and EOG channels are fused via a Graph Convolutional Network, facilitating robust multimodal integration. NeuroLingua is evaluated on the Sleep-EDF Expanded and ISRUC-Sleep datasets, achieving state-of-the-art results on Sleep-EDF (85.3% accuracy, 0.800 macro F1, and 0.796 Cohen's kappa) and competitive performance on ISRUC (81.9% accuracy, 0.802 macro F1, and 0.755 kappa), matching or exceeding published baselines in overall and per-class metrics. The architecture's attention mechanisms enhance the detection of clinically relevant sleep microevents, providing a principled foundation for future interpretability, explainability, and causal inference in sleep research. By framing sleep as a compositional language, NeuroLingua unifies hierarchical sequence modeling and multimodal fusion, advancing automated sleep staging toward more transparent and clinically meaningful applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09780",
        "abs_url": "https://arxiv.org/abs/2511.09780",
        "pdf_url": "https://arxiv.org/pdf/2511.09780",
        "title": "Hail to the Thief: Exploring Attacks and Defenses in Decentralised GRPO",
        "authors": [
            "Nikolay Blagoev",
            "Oğuzhan Ersoy",
            "Lydia Yiyu Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Group Relative Policy Optimization (GRPO) has demonstrated great utilization in post-training of Large Language Models (LLMs). In GRPO, prompts are answered by the model and, through reinforcement learning, preferred completions are learnt. Owing to the small communication volume, GRPO is inherently suitable for decentralised training as the prompts can be concurrently answered by multiple nodes and then exchanged in the forms of strings. In this work, we present the first adversarial attack in decentralised GRPO. We demonstrate that malicious parties can poison such systems by injecting arbitrary malicious tokens in benign models in both out-of-context and in-context attacks. Using empirical examples of math and coding tasks, we show that adversarial attacks can easily poison the benign nodes, polluting their local LLM post-training, achieving attack success rates up to 100% in as few as 50 iterations. We propose two ways to defend against these attacks, depending on whether all users train the same model or different models. We show that these defenses can achieve stop rates of up to 100%, making the attack impossible.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09789",
        "abs_url": "https://arxiv.org/abs/2511.09789",
        "pdf_url": "https://arxiv.org/pdf/2511.09789",
        "title": "CaReTS: A Multi-Task Framework Unifying Classification and Regression for Time Series Forecasting",
        "authors": [
            "Fulong Yao",
            "Wanqing Zhao",
            "Chao Zheng",
            "Xiaofei Han"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent advances in deep forecasting models have achieved remarkable performance, yet most approaches still struggle to provide both accurate predictions and interpretable insights into temporal dynamics. This paper proposes CaReTS, a novel multi-task learning framework that combines classification and regression tasks for multi-step time series forecasting problems. The framework adopts a dual-stream architecture, where a classification branch learns the stepwise trend into the future, while a regression branch estimates the corresponding deviations from the latest observation of the target variable. The dual-stream design provides more interpretable predictions by disentangling macro-level trends from micro-level deviations in the target variable. To enable effective learning in output prediction, deviation estimation, and trend classification, we design a multi-task loss with uncertainty-aware weighting to adaptively balance the contribution of each task. Furthermore, four variants (CaReTS1--4) are instantiated under this framework to incorporate mainstream temporal modelling encoders, including convolutional neural networks (CNNs), long short-term memory networks (LSTMs), and Transformers. Experiments on real-world datasets demonstrate that CaReTS outperforms state-of-the-art (SOTA) algorithms in forecasting accuracy, while achieving higher trend classification performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09792",
        "abs_url": "https://arxiv.org/abs/2511.09792",
        "pdf_url": "https://arxiv.org/pdf/2511.09792",
        "title": "Beyond Monotonicity: Revisiting Factorization Principles in Multi-Agent Q-Learning",
        "authors": [
            "Tianmeng Hu",
            "Yongzheng Cui",
            "Rui Tang",
            "Biao Luo",
            "Ke Li"
        ],
        "comments": "Accepted at AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Value decomposition is a central approach in multi-agent reinforcement learning (MARL), enabling centralized training with decentralized execution by factorizing the global value function into local values. To ensure individual-global-max (IGM) consistency, existing methods either enforce monotonicity constraints, which limit expressive power, or adopt softer surrogates at the cost of algorithmic complexity. In this work, we present a dynamical systems analysis of non-monotonic value decomposition, modeling learning dynamics as continuous-time gradient flow. We prove that, under approximately greedy exploration, all zero-loss equilibria violating IGM consistency are unstable saddle points, while only IGM-consistent solutions are stable attractors of the learning dynamics. Extensive experiments on both synthetic matrix games and challenging MARL benchmarks demonstrate that unconstrained, non-monotonic factorization reliably recovers IGM-optimal solutions and consistently outperforms monotonic baselines. Additionally, we investigate the influence of temporal-difference targets and exploration strategies, providing actionable insights for the design of future value-based MARL algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09810",
        "abs_url": "https://arxiv.org/abs/2511.09810",
        "pdf_url": "https://arxiv.org/pdf/2511.09810",
        "title": "On the Convergence of Overparameterized Problems: Inherent Properties of the Compositional Structure of Neural Networks",
        "authors": [
            "Arthur Castello Branco de Oliveira",
            "Dhruv Jatkar",
            "Eduardo Sontag"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Systems and Control (eess.SY); Optimization and Control (math.OC)",
        "abstract": "This paper investigates how the compositional structure of neural networks shapes their optimization landscape and training dynamics. We analyze the gradient flow associated with overparameterized optimization problems, which can be interpreted as training a neural network with linear activations. Remarkably, we show that the global convergence properties can be derived for any cost function that is proper and real analytic. We then specialize the analysis to scalar-valued cost functions, where the geometry of the landscape can be fully characterized. In this setting, we demonstrate that key structural features -- such as the location and stability of saddle points -- are universal across all admissible costs, depending solely on the overparameterized representation rather than on problem-specific details. Moreover, we show that convergence can be arbitrarily accelerated depending on the initialization, as measured by an imbalance metric introduced in this work. Finally, we discuss how these insights may generalize to neural networks with sigmoidal activations, showing through a simple example which geometric and dynamical properties persist beyond the linear case.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09828",
        "abs_url": "https://arxiv.org/abs/2511.09828",
        "pdf_url": "https://arxiv.org/pdf/2511.09828",
        "title": "SMoFi: Step-wise Momentum Fusion for Split Federated Learning on Heterogeneous Data",
        "authors": [
            "Mingkun Yang",
            "Ran Zhu",
            "Qing Wang",
            "Jie Yang"
        ],
        "comments": "Paper accepted by AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Split Federated Learning is a system-efficient federated learning paradigm that leverages the rich computing resources at a central server to train model partitions. Data heterogeneity across silos, however, presents a major challenge undermining the convergence speed and accuracy of the global model. This paper introduces Step-wise Momentum Fusion (SMoFi), an effective and lightweight framework that counteracts gradient divergence arising from data heterogeneity by synchronizing the momentum buffers across server-side optimizers. To control gradient divergence over the training process, we design a staleness-aware alignment mechanism that imposes constraints on gradient updates of the server-side submodel at each optimization step. Extensive validations on multiple real-world datasets show that SMoFi consistently improves global model accuracy (up to 7.1%) and convergence speed (up to 10.25$\\times$). Furthermore, SMoFi has a greater impact with more clients involved and deeper learning models, making it particularly suitable for model training in resource-constrained contexts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09832",
        "abs_url": "https://arxiv.org/abs/2511.09832",
        "pdf_url": "https://arxiv.org/pdf/2511.09832",
        "title": "Learning Intersections of Halfspaces under Factorizable Distribution",
        "authors": [
            "Ilias Diakonikolas",
            "Mingchen Ma",
            "Lisheng Ren",
            "Christos Tzamos"
        ],
        "comments": "Appeared at COLT 2025",
        "subjects": "Machine Learning (cs.LG); Data Structures and Algorithms (cs.DS)",
        "abstract": "Learning intersections of halfspaces is a central problem in Computational Learning Theory. Even for just two halfspaces, it remains a major open question whether learning is possible in polynomial time with respect to the margin $\\gamma$ of the data points and their dimensionality $d$. The best-known algorithms run in quasi-polynomial time $d^{O(\\log(1/\\gamma))}$, and it has been shown that this complexity is unavoidable for any algorithm relying solely on correlational statistical queries (CSQ). In this work, we introduce a novel algorithm that provably circumvents the CSQ hardness barrier. Our approach applies to a broad class of distributions satisfying a natural, previously studied, factorizability assumption. Factorizable distributions lie between distribution-specific and distribution-free settings, and significantly extend previously known tractable cases. Under these distributions, we show that CSQ-based methods still require quasipolynomial time even for weakly learning, whereas our algorithm achieves $poly(d,1/\\gamma)$ time by leveraging more general statistical queries (SQ), establishing a strong separation between CSQ and SQ for this simple realizable PAC learning problem. Our result is grounded in a rigorous analysis utilizing a novel duality framework that characterizes the moment tensor structure induced by the marginal distributions. Building on these structural insights, we propose new, efficient learning algorithms. These algorithms combine a refined variant of Jennrich's Algorithm with PCA over random projections of the moment tensor, along with a gradient-descent-based non-convex optimization framework.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09833",
        "abs_url": "https://arxiv.org/abs/2511.09833",
        "pdf_url": "https://arxiv.org/pdf/2511.09833",
        "title": "ACT as Human: Multimodal Large Language Model Data Annotation with Critical Thinking",
        "authors": [
            "Lequan Lin",
            "Dai Shi",
            "Andi Han",
            "Feng Chen",
            "Qiuzheng Chen",
            "Jiawen Li",
            "Zhaoyang Li",
            "Jiyuan Li",
            "Zhenbang Sun",
            "Junbin Gao"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Supervised learning relies on high-quality labeled data, but obtaining such data through human annotation is both expensive and time-consuming. Recent work explores using large language models (LLMs) for annotation, but LLM-generated labels still fall short of human-level quality. To address this problem, we propose the Annotation with Critical Thinking (ACT) data pipeline, where LLMs serve not only as annotators but also as judges to critically identify potential errors. Human effort is then directed towards reviewing only the most \"suspicious\" cases, significantly improving the human annotation efficiency. Our major contributions are as follows: (1) ACT is applicable to a wide range of domains, including natural language processing (NLP), computer vision (CV), and multimodal understanding, by leveraging multimodal-LLMs (MLLMs). (2) Through empirical studies, we derive 7 insights on how to enhance annotation quality while efficiently reducing the human cost, and then translate these findings into user-friendly guidelines. (3) We theoretically analyze how to modify the loss function so that models trained on ACT data achieve similar performance to those trained on fully human-annotated data. Our experiments show that the performance gap can be reduced to less than 2% on most benchmark datasets while saving up to 90% of human costs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09844",
        "abs_url": "https://arxiv.org/abs/2511.09844",
        "pdf_url": "https://arxiv.org/pdf/2511.09844",
        "title": "Steering Pretrained Drafters during Speculative Decoding",
        "authors": [
            "Frédéric Berdoz",
            "Peer Rheinboldt",
            "Roger Wattenhofer"
        ],
        "comments": "Accepted at AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Performance (cs.PF)",
        "abstract": "Speculative decoding accelerates language model inference by separating generation into fast drafting and parallel verification. Its main limitation is drafter-verifier misalignment, which limits token acceptance and reduces overall effectiveness. While small drafting heads trained from scratch compensate with speed, they struggle when verification dominates latency or when inputs are out of distribution. In contrast, pretrained drafters, though slower, achieve higher acceptance rates thanks to stronger standalone generation capabilities, making them competitive when drafting latency is negligible relative to verification or communication overhead. In this work, we aim to improve the acceptance rates of pretrained drafters by introducing a lightweight dynamic alignment mechanism: a steering vector computed from the verifier's hidden states and injected into the pretrained drafter. Compared to existing offline alignment methods such as distillation, our approach boosts the number of accepted tokens by up to 35\\% under standard sampling and 22\\% under greedy sampling, all while incurring negligible computational overhead. Importantly, our approach can be retrofitted to existing architectures and pretrained models, enabling rapid adoption.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09853",
        "abs_url": "https://arxiv.org/abs/2511.09853",
        "pdf_url": "https://arxiv.org/pdf/2511.09853",
        "title": "ConSurv: Multimodal Continual Learning for Survival Analysis",
        "authors": [
            "Dianzhi Yu",
            "Conghao Xiong",
            "Yankai Chen",
            "Wenqian Cui",
            "Xinni Zhang",
            "Yifei Zhang",
            "Hao Chen",
            "Joseph J.Y. Sung",
            "Irwin King"
        ],
        "comments": "14 pages, 4 figures. This is the extended version of the paper accepted at AAAI 2026, which includes all technical appendices and additional experimental details",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Survival prediction of cancers is crucial for clinical practice, as it informs mortality risks and influences treatment plans. However, a static model trained on a single dataset fails to adapt to the dynamically evolving clinical environment and continuous data streams, limiting its practical utility. While continual learning (CL) offers a solution to learn dynamically from new datasets, existing CL methods primarily focus on unimodal inputs and suffer from severe catastrophic forgetting in survival prediction. In real-world scenarios, multimodal inputs often provide comprehensive and complementary information, such as whole slide images and genomics; and neglecting inter-modal correlations negatively impacts the performance. To address the two challenges of catastrophic forgetting and complex inter-modal interactions between gigapixel whole slide images and genomics, we propose ConSurv, the first multimodal continual learning (MMCL) method for survival analysis. ConSurv incorporates two key components: Multi-staged Mixture of Experts (MS-MoE) and Feature Constrained Replay (FCR). MS-MoE captures both task-shared and task-specific knowledge at different learning stages of the network, including two modality encoders and the modality fusion component, learning inter-modal relationships. FCR further enhances learned knowledge and mitigates forgetting by restricting feature deviation of previous data at different levels, including encoder-level features of two modalities and the fusion-level representations. Additionally, we introduce a new benchmark integrating four datasets, Multimodal Survival Analysis Incremental Learning (MSAIL), for comprehensive evaluation in the CL setting. Extensive experiments demonstrate that ConSurv outperforms competing methods across multiple metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09855",
        "abs_url": "https://arxiv.org/abs/2511.09855",
        "pdf_url": "https://arxiv.org/pdf/2511.09855",
        "title": "Unlearning Imperative: Securing Trustworthy and Responsible LLMs through Engineered Forgetting",
        "authors": [
            "James Jin Kang",
            "Dang Bui",
            "Thanh Pham",
            "Huo-Chong Ling"
        ],
        "comments": "14 pages, 4 figures, 4 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The growing use of large language models in sensitive domains has exposed a critical weakness: the inability to ensure that private information can be permanently forgotten. Yet these systems still lack reliable mechanisms to guarantee that sensitive information can be permanently removed once it has been used. Retraining from the beginning is prohibitively costly, and existing unlearning methods remain fragmented, difficult to verify, and often vulnerable to recovery. This paper surveys recent research on machine unlearning for LLMs and considers how far current approaches can address these challenges. We review methods for evaluating whether forgetting has occurred, the resilience of unlearned models against adversarial attacks, and mechanisms that can support user trust when model complexity or proprietary limits restrict transparency. Technical solutions such as differential privacy, homomorphic encryption, federated learning, and ephemeral memory are examined alongside institutional safeguards including auditing practices and regulatory frameworks. The review finds steady progress, but robust and verifiable unlearning is still unresolved. Efficient techniques that avoid costly retraining, stronger defenses against adversarial recovery, and governance structures that reinforce accountability are needed if LLMs are to be deployed safely in sensitive applications. By integrating technical and organizational perspectives, this study outlines a pathway toward AI systems that can be required to forget, while maintaining both privacy and public trust.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09864",
        "abs_url": "https://arxiv.org/abs/2511.09864",
        "pdf_url": "https://arxiv.org/pdf/2511.09864",
        "title": "Uncertainty-Guided Checkpoint Selection for Reinforcement Finetuning of Large Language Models",
        "authors": [
            "Manh Nguyen",
            "Dung Nguyen",
            "Dai Do",
            "Svetha Venkatesh",
            "Hung Le"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reinforcement learning (RL) finetuning is crucial to aligning large language models (LLMs), but the process is notoriously unstable and exhibits high variance across model checkpoints. In practice, selecting the best checkpoint is challenging: evaluating checkpoints on the validation set during training is computationally expensive and requires a good validation set, while relying on the final checkpoint provides no guarantee of good performance. We introduce an uncertainty-guided approach for checkpoint selection (UGCS) that avoids these pitfalls. Our method identifies hard question-answer pairs using per-sample uncertainty and ranks checkpoints by how well they handle these challenging cases. By averaging the rewards of the top-uncertain samples over a short training window, our method produces a stable and discriminative signal without additional forward passes or significant computation overhead. Experiments across three datasets and three LLMs demonstrate that it consistently identifies checkpoints with stronger generalization, outperforming traditional strategies such as relying on training or validation performance. These results highlight that models solving their hardest tasks with low uncertainty are the most reliable overall.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09889",
        "abs_url": "https://arxiv.org/abs/2511.09889",
        "pdf_url": "https://arxiv.org/pdf/2511.09889",
        "title": "A General Anchor-Based Framework for Scalable Fair Clustering",
        "authors": [
            "Shengfei Wei",
            "Suyuan Liu",
            "Jun Wang",
            "Ke Liang",
            "Miaomiao Li",
            "Lei Luo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Fair clustering is crucial for mitigating bias in unsupervised learning, yet existing algorithms often suffer from quadratic or super-quadratic computational complexity, rendering them impractical for large-scale datasets. To bridge this gap, we introduce the Anchor-based Fair Clustering Framework (AFCF), a novel, general, and plug-and-play framework that empowers arbitrary fair clustering algorithms with linear-time scalability. Our approach first selects a small but representative set of anchors using a novel fair sampling strategy. Then, any off-the-shelf fair clustering algorithm can be applied to this small anchor set. The core of our framework lies in a novel anchor graph construction module, where we formulate an optimization problem to propagate labels while preserving fairness. This is achieved through a carefully designed group-label joint constraint, which we prove theoretically ensures that the fairness of the final clustering on the entire dataset matches that of the anchor clustering. We solve this optimization efficiently using an ADMM-based algorithm. Extensive experiments on multiple large-scale benchmarks demonstrate that AFCF drastically accelerates state-of-the-art methods, which reduces computational time by orders of magnitude while maintaining strong clustering performance and fairness guarantees.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09895",
        "abs_url": "https://arxiv.org/abs/2511.09895",
        "pdf_url": "https://arxiv.org/pdf/2511.09895",
        "title": "Simulator and Experience Enhanced Diffusion Model for Comprehensive ECG Generation",
        "authors": [
            "Xiaoda Wang",
            "Kaiqiao Han",
            "Yuhao Xu",
            "Xiao Luo",
            "Yizhou Sun",
            "Wei Wang",
            "Carl Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Cardiovascular disease (CVD) is a leading cause of mortality worldwide. Electrocardiograms (ECGs) are the most widely used non-invasive tool for cardiac assessment, yet large, well-annotated ECG corpora are scarce due to cost, privacy, and workflow constraints. Generating ECGs can be beneficial for the mechanistic understanding of cardiac electrical activity, enable the construction of large, heterogeneous, and unbiased datasets, and facilitate privacy-preserving data sharing. Generating realistic ECG signals from clinical context is important yet underexplored. Recent work has leveraged diffusion models for text-to-ECG generation, but two challenges remain: (i) existing methods often overlook the physiological simulator knowledge of cardiac activity; and (ii) they ignore broader, experience-based clinical knowledge grounded in real-world practice. To address these gaps, we propose SE-Diff, a novel physiological simulator and experience enhanced diffusion model for comprehensive ECG generation. SE-Diff integrates a lightweight ordinary differential equation (ODE)-based ECG simulator into the diffusion process via a beat decoder and simulator-consistent constraints, injecting mechanistic priors that promote physiologically plausible waveforms. In parallel, we design an LLM-powered experience retrieval-augmented strategy to inject clinical knowledge, providing more guidance for ECG generation. Extensive experiments on real-world ECG datasets demonstrate that SE-Diff improves both signal fidelity and text-ECG semantic alignment over baselines, proving its superiority for text-to-ECG generation. We further show that the simulator-based and experience-based knowledge also benefit downstream ECG classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09901",
        "abs_url": "https://arxiv.org/abs/2511.09901",
        "pdf_url": "https://arxiv.org/pdf/2511.09901",
        "title": "Explore and Establish Synergistic Effects Between Weight Pruning and Coreset Selection in Neural Network Training",
        "authors": [
            "Weilin Wan",
            "Fan Yi",
            "Weizhong Zhang",
            "Quan Zhou",
            "Cheng Jin"
        ],
        "comments": "15 pages, 7 figures, aaai-2026 camera-ready version",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Modern deep neural networks rely heavily on massive model weights and training samples, incurring substantial computational costs. Weight pruning and coreset selection are two emerging paradigms proposed to improve computational efficiency. In this paper, we first explore the interplay between redundant weights and training samples through a transparent analysis: redundant samples, particularly noisy ones, cause model weights to become unnecessarily overtuned to fit them, complicating the identification of irrelevant weights during pruning; conversely, irrelevant weights tend to overfit noisy data, undermining coreset selection effectiveness. To further investigate and harness this interplay in deep learning, we develop a Simultaneous Weight and Sample Tailoring mechanism (SWaST) that alternately performs weight pruning and coreset selection to establish a synergistic effect in training. During this investigation, we observe that when simultaneously removing a large number of weights and samples, a phenomenon we term critical double-loss can occur, where important weights and their supportive samples are mistakenly eliminated at the same time, leading to model instability and nearly irreversible degradation that cannot be recovered in subsequent training. Unlike classic machine learning models, this issue can arise in deep learning due to the lack of theoretical guarantees on the correctness of weight pruning and coreset selection, which explains why these paradigms are often developed independently. We mitigate this by integrating a state preservation mechanism into SWaST, enabling stable joint optimization. Extensive experiments reveal a strong synergy between pruning and coreset selection across varying prune rates and coreset sizes, delivering accuracy boosts of up to 17.83% alongside 10% to 90% FLOPs reductions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09902",
        "abs_url": "https://arxiv.org/abs/2511.09902",
        "pdf_url": "https://arxiv.org/pdf/2511.09902",
        "title": "Incremental Generation is Necessity and Sufficient for Universality in Flow-Based Modelling",
        "authors": [
            "Hossein Rouhvarzi",
            "Anastasis Kratsios"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Classical Analysis and ODEs (math.CA); Dynamical Systems (math.DS); Numerical Analysis (math.NA); Machine Learning (stat.ML)",
        "abstract": "Incremental flow-based denoising models have reshaped generative modelling, but their empirical advantage still lacks a rigorous approximation-theoretic foundation. We show that incremental generation is necessary and sufficient for universal flow-based generation on the largest natural class of self-maps of $[0,1]^d$ compatible with denoising pipelines, namely the orientation-preserving homeomorphisms of $[0,1]^d$. All our guarantees are uniform on the underlying maps and hence imply approximation both samplewise and in distribution. Using a new topological-dynamical argument, we first prove an impossibility theorem: the class of all single-step autonomous flows, independently of the architecture, width, depth, or Lipschitz activation of the underlying neural network, is meagre and therefore not universal in the space of orientation-preserving homeomorphisms of $[0,1]^d$. By exploiting algebraic properties of autonomous flows, we conversely show that every orientation-preserving Lipschitz homeomorphism on $[0,1]^d$ can be approximated at rate $\\mathcal{O}(n^{-1/d})$ by a composition of at most $K_d$ such flows, where $K_d$ depends only on the dimension. Under additional smoothness assumptions, the approximation rate can be made dimension-free, and $K_d$ can be chosen uniformly over the class being approximated. Finally, by linearly lifting the domain into one higher dimension, we obtain structured universal approximation results for continuous functions and for probability measures on $[0,1]^d$, the latter realized as pushforwards of empirical measures with vanishing $1$-Wasserstein error.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09917",
        "abs_url": "https://arxiv.org/abs/2511.09917",
        "pdf_url": "https://arxiv.org/pdf/2511.09917",
        "title": "Towards Multiple Missing Values-resistant Unsupervised Graph Anomaly Detection",
        "authors": [
            "Jiazhen Chen",
            "Xiuqin Liang",
            "Sichao Fu",
            "Zheng Ma",
            "Weihua Ou"
        ],
        "comments": "Accepted by 40th AAAI Conference on Artificial Intelligence (AAAI 2026)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Unsupervised graph anomaly detection (GAD) has received increasing attention in recent years, which aims to identify data anomalous patterns utilizing only unlabeled node information from graph-structured data. However, prevailing unsupervised GAD methods typically presuppose complete node attributes and structure information, a condition hardly satisfied in real-world scenarios owing to privacy, collection errors or dynamic node arrivals. Existing standard imputation schemes risk \"repairing\" rare anomalous nodes so that they appear normal, thereby introducing imputation bias into the detection process. In addition, when both node attributes and edges are missing simultaneously, estimation errors in one view can contaminate the other, causing cross-view interference that further undermines the detection performance. To overcome these challenges, we propose M$^2$V-UGAD, a multiple missing values-resistant unsupervised GAD framework on incomplete graphs. Specifically, a dual-pathway encoder is first proposed to independently reconstruct missing node attributes and graph structure, thereby preventing errors in one view from propagating to the other. The two pathways are then fused and regularized in a joint latent space so that normals occupy a compact inner manifold while anomalies reside on an outer shell. Lastly, to mitigate imputation bias, we sample latent codes just outside the normal region and decode them into realistic node features and subgraphs, providing hard negative examples that sharpen the decision boundary. Experiments on seven public benchmarks demonstrate that M$^2$V-UGAD consistently outperforms existing unsupervised GAD methods across varying missing rates.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09923",
        "abs_url": "https://arxiv.org/abs/2511.09923",
        "pdf_url": "https://arxiv.org/pdf/2511.09923",
        "title": "Harnessing Bounded-Support Evolution Strategies for Policy Refinement",
        "authors": [
            "Ethan Hirschowitz",
            "Fabio Ramos"
        ],
        "comments": "10 pages, 6 figures, to be published in Australasian Conference on Robotics and Automation (ACRA 2025)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Robotics (cs.RO)",
        "abstract": "Improving competent robot policies with on-policy RL is often hampered by noisy, low-signal gradients. We revisit Evolution Strategies (ES) as a policy-gradient proxy and localize exploration with bounded, antithetic triangular perturbations, suitable for policy refinement. We propose Triangular-Distribution ES (TD-ES) which pairs bounded triangular noise with a centered-rank finite-difference estimator to deliver stable, parallelizable, gradient-free updates. In a two-stage pipeline -- PPO pretraining followed by TD-ES refinement -- this preserves early sample efficiency while enabling robust late-stage gains. Across a suite of robotic manipulation tasks, TD-ES raises success rates by 26.5% relative to PPO and greatly reduces variance, offering a simple, compute-light path to reliable refinement.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09947",
        "abs_url": "https://arxiv.org/abs/2511.09947",
        "pdf_url": "https://arxiv.org/pdf/2511.09947",
        "title": "EEGAgent: A Unified Framework for Automated EEG Analysis Using Large Language Models",
        "authors": [
            "Sha Zhao",
            "Mingyi Peng",
            "Haiteng Jiang",
            "Tao Li",
            "Shijian Li",
            "Gang Pan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Scalable and generalizable analysis of brain activity is essential for advancing both clinical diagnostics and cognitive research. Electroencephalography (EEG), a non-invasive modality with high temporal resolution, has been widely used for brain states analysis. However, most existing EEG models are usually tailored for individual specific tasks, limiting their utility in realistic scenarios where EEG analysis often involves multi-task and continuous reasoning. In this work, we introduce EEGAgent, a general-purpose framework that leverages large language models (LLMs) to schedule and plan multiple tools to automatically complete EEG-related tasks. EEGAgent is capable of performing the key functions: EEG basic information perception, spatiotemporal EEG exploration, EEG event detection, interaction with users, and EEG report generation. To realize these capabilities, we design a toolbox composed of different tools for EEG preprocessing, feature extraction, event detection, etc. These capabilities were evaluated on public datasets, and our EEGAgent can support flexible and interpretable EEG analysis, highlighting its potential for real-world clinical applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09953",
        "abs_url": "https://arxiv.org/abs/2511.09953",
        "pdf_url": "https://arxiv.org/pdf/2511.09953",
        "title": "Autonomous Concept Drift Threshold Determination",
        "authors": [
            "Pengqian Lu",
            "Jie Lu",
            "Anjin Liu",
            "En Yu",
            "Guangquan Zhang"
        ],
        "comments": "Accepted By AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Existing drift detection methods focus on designing sensitive test statistics. They treat the detection threshold as a fixed hyperparameter, set once to balance false alarms and late detections, and applied uniformly across all datasets and over time. However, maintaining model performance is the key objective from the perspective of machine learning, and we observe that model performance is highly sensitive to this threshold. This observation inspires us to investigate whether a dynamic threshold could be provably better. In this paper, we prove that a threshold that adapts over time can outperform any single fixed threshold. The main idea of the proof is that a dynamic strategy, constructed by combining the best threshold from each individual data segment, is guaranteed to outperform any single threshold that apply to all segments. Based on the theorem, we propose a Dynamic Threshold Determination algorithm. It enhances existing drift detection frameworks with a novel comparison phase to inform how the threshold should be adjusted. Extensive experiments on a wide range of synthetic and real-world datasets, including both image and tabular data, validate that our approach substantially enhances the performance of state-of-the-art drift detectors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09962",
        "abs_url": "https://arxiv.org/abs/2511.09962",
        "pdf_url": "https://arxiv.org/pdf/2511.09962",
        "title": "AI-Integrated Decision Support System for Real-Time Market Growth Forecasting and Multi-Source Content Diffusion Analytics",
        "authors": [
            "Ziqing Yin",
            "Xuanjing Chen",
            "Xi Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Multimedia (cs.MM)",
        "abstract": "The rapid proliferation of AI-generated content (AIGC) has reshaped the dynamics of digital marketing and online consumer behavior. However, predicting the diffusion trajectory and market impact of such content remains challenging due to data heterogeneity, non linear propagation mechanisms, and evolving consumer interactions. This study proposes an AI driven Decision Support System (DSS) that integrates multi source data including social media streams, marketing expenditure records, consumer engagement logs, and sentiment dynamics using a hybrid Graph Neural Network (GNN) and Temporal Transformer framework. The model jointly learns the content diffusion structure and temporal influence evolution through a dual channel architecture, while causal inference modules disentangle the effects of marketing stimuli on return on investment (ROI) and market visibility. Experiments on large scale real-world datasets collected from multiple online platforms such as Twitter, TikTok, and YouTube advertising show that our system outperforms existing baselines in all six metrics. The proposed DSS enhances marketing decisions by providing interpretable real-time insights into AIGC driven content dissemination and market growth patterns.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09979",
        "abs_url": "https://arxiv.org/abs/2511.09979",
        "pdf_url": "https://arxiv.org/pdf/2511.09979",
        "title": "Rediscovering the Lunar Equation of the Centre with AI Feynman via Embedded Physical Biases",
        "authors": [
            "Saumya Shah",
            "Zi-Yu Khoo",
            "Abel Yang",
            "Stéphane Bressan"
        ],
        "comments": "7 pages, 1 figure, 4 tables",
        "subjects": "Machine Learning (cs.LG); Instrumentation and Methods for Astrophysics (astro-ph.IM)",
        "abstract": "This work explores using the physics-inspired AI Feynman symbolic regression algorithm to automatically rediscover a fundamental equation in astronomy -- the Equation of the Centre. Through the introduction of observational and inductive biases corresponding to the physical nature of the system through data preprocessing and search space restriction, AI Feynman was successful in recovering the first-order analytical form of this equation from lunar ephemerides data. However, this manual approach highlights a key limitation in its reliance on expert-driven coordinate system selection. We therefore propose an automated preprocessing extension to find the canonical coordinate system. Results demonstrate that targeted domain knowledge embedding enables symbolic regression to rediscover physical laws, but also highlight further challenges in constraining symbolic regression to derive physics equations when leveraging domain knowledge through tailored biases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09989",
        "abs_url": "https://arxiv.org/abs/2511.09989",
        "pdf_url": "https://arxiv.org/pdf/2511.09989",
        "title": "Towards Robust Multimodal Learning in the Open World",
        "authors": [
            "Fushuo Huo"
        ],
        "comments": "Thesis",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The rapid evolution of machine learning has propelled neural networks to unprecedented success across diverse domains. In particular, multimodal learning has emerged as a transformative paradigm, leveraging complementary information from heterogeneous data streams (e.g., text, vision, audio) to advance contextual reasoning and intelligent decision-making. Despite these advancements, current neural network-based models often fall short in open-world environments characterized by inherent unpredictability, where unpredictable environmental composition dynamics, incomplete modality inputs, and spurious distributions relations critically undermine system reliability. While humans naturally adapt to such dynamic, ambiguous scenarios, artificial intelligence systems exhibit stark limitations in robustness, particularly when processing multimodal signals under real-world complexity. This study investigates the fundamental challenge of multimodal learning robustness in open-world settings, aiming to bridge the gap between controlled experimental performance and practical deployment requirements.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09996",
        "abs_url": "https://arxiv.org/abs/2511.09996",
        "pdf_url": "https://arxiv.org/pdf/2511.09996",
        "title": "A Novel Data-Dependent Learning Paradigm for Large Hypothesis Classes",
        "authors": [
            "Alireza F. Pour",
            "Shai Ben-David"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We address the general task of learning with a set of candidate models that is too large to have a uniform convergence of empirical estimates to true losses. While the common approach to such challenges is SRM (or regularization) based learning algorithms, we propose a novel learning paradigm that relies on stronger incorporation of empirical data and requires less algorithmic decisions to be based on prior assumptions. We analyze the generalization capabilities of our approach and demonstrate its merits in several common learning assumptions, including similarity of close points, clustering of the domain into highly label-homogeneous regions, Lipschitzness assumptions of the labeling rule, and contrastive learning assumptions. Our approach allows utilizing such assumptions without the need to know their true parameters a priori.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09998",
        "abs_url": "https://arxiv.org/abs/2511.09998",
        "pdf_url": "https://arxiv.org/pdf/2511.09998",
        "title": "DemoTuner: Efficient DBMS Knobs Tuning via LLM-Assisted Demonstration Reinforcement Learning",
        "authors": [
            "Hui Dou",
            "Lei Jin",
            "Yuxuan Zhou",
            "Jiang He",
            "Yiwen Zhang"
        ],
        "comments": "14 pages, 9 figures",
        "subjects": "Machine Learning (cs.LG); Databases (cs.DB)",
        "abstract": "The performance of modern DBMSs such as MySQL and PostgreSQL heavily depends on the configuration of performance-critical knobs. Manual tuning these knobs is laborious and inefficient due to the complex and high-dimensional nature of the configuration space. Among the automated tuning methods, reinforcement learning (RL)-based methods have recently sought to improve the DBMS knobs tuning process from several different perspectives. However, they still encounter challenges with slow convergence speed during offline training. In this paper, we mainly focus on how to leverage the valuable tuning hints contained in various textual documents such as DBMS manuals and web forums to improve the offline training of RL-based methods. To this end, we propose an efficient DBMS knobs tuning framework named DemoTuner via a novel LLM-assisted demonstration reinforcement learning method. Specifically, to comprehensively and accurately mine tuning hints from documents, we design a structured chain of thought prompt to employ LLMs to conduct a condition-aware tuning hints extraction task. To effectively integrate the mined tuning hints into RL agent training, we propose a hint-aware demonstration reinforcement learning algorithm HA-DDPGfD in DemoTuner. As far as we know, DemoTuner is the first work to introduce the demonstration reinforcement learning algorithm for DBMS knobs tuning. Experimental evaluations conducted on MySQL and PostgreSQL across various workloads demonstrate the significant advantages of DemoTuner in both performance improvement and online tuning cost reduction over three representative baselines including DB-BERT, GPTuner and CDBTune. Additionally, DemoTuner also exhibits superior adaptability to application scenarios with unknown workloads.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10018",
        "abs_url": "https://arxiv.org/abs/2511.10018",
        "pdf_url": "https://arxiv.org/pdf/2511.10018",
        "title": "Interaction as Interference: A Quantum-Inspired Aggregation Approach",
        "authors": [
            "Pilsung Kang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Classical approaches often treat interaction as engineered product terms or as emergent patterns in flexible models, offering little control over how synergy or antagonism arises. We take a quantum-inspired view: following the Born rule (probability as squared amplitude), \\emph{coherent} aggregation sums complex amplitudes before squaring, creating an interference cross-term, whereas an \\emph{incoherent} proxy sums squared magnitudes and removes it. In a minimal linear-amplitude model, this cross-term equals the standard potential-outcome interaction contrast \\(\\Delta_{\\mathrm{INT}}\\) in a \\(2\\times 2\\) factorial design, giving relative phase a direct, mechanism-level control over synergy versus antagonism. We instantiate this idea in a lightweight \\emph{Interference Kernel Classifier} (IKC) and introduce two diagnostics: \\emph{Coherent Gain} (log-likelihood gain of coherent over the incoherent proxy) and \\emph{Interference Information} (the induced Kullback-Leibler gap). A controlled phase sweep recovers the identity. On a high-interaction synthetic task (XOR), IKC outperforms strong baselines under paired, budget-matched comparisons; on real tabular data (\\emph{Adult} and \\emph{Bank Marketing}) it is competitive overall but typically trails the most capacity-rich baseline in paired differences. Holding learned parameters fixed, toggling aggregation from incoherent to coherent consistently improves negative log-likelihood, Brier score, and expected calibration error, with positive Coherent Gain on both datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10022",
        "abs_url": "https://arxiv.org/abs/2511.10022",
        "pdf_url": "https://arxiv.org/pdf/2511.10022",
        "title": "GraphSB: Boosting Imbalanced Node Classification on Graphs through Structural Balance",
        "authors": [
            "Chaofan Zhu",
            "Xiaobing Rui",
            "Zhixiao Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Social and Information Networks (cs.SI)",
        "abstract": "Imbalanced node classification is a critical challenge in graph learning, where most existing methods typically utilize Graph Neural Networks (GNNs) to learn node representations. These methods can be broadly categorized into the data-level and the algorithm-level. The former aims to synthesize minority-class nodes to mitigate quantity imbalance, while the latter tries to optimize the learning process to highlight minority classes. However, neither category addresses the inherently imbalanced graph structure, which is a fundamental factor that incurs majority-class dominance and minority-class assimilation in GNNs. Our theoretical analysis further supports this critical insight. Therefore, we propose GraphSB (Graph Structural Balance), a novel framework that incorporates Structural Balance as a key strategy to address the underlying imbalanced graph structure before node synthesis. Structural Balance performs a two-stage structure optimization: Structure Enhancement that adaptively builds similarity-based edges to strengthen connectivity of minority-class nodes, and Relation Diffusion that captures higher-order dependencies while amplifying signals from minority classes. Thus, GraphSB balances structural distribution before node synthesis, enabling more effective learning in GNNs. Extensive experiments demonstrate that GraphSB significantly outperforms the state-of-the-art methods. More importantly, the proposed Structural Balance can be seamlessly integrated into state-of-the-art methods as a simple plug-and-play module, increasing their accuracy by an average of 3.67\\%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10025",
        "abs_url": "https://arxiv.org/abs/2511.10025",
        "pdf_url": "https://arxiv.org/pdf/2511.10025",
        "title": "SVD-NO: Learning PDE Solution Operators with SVD Integral Kernels",
        "authors": [
            "Noam Koren",
            "Ralf J. J. Mackenbach",
            "Ruud J. G. van Sloun",
            "Kira Radinsky",
            "Daniel Freedman"
        ],
        "comments": "AAAI-26",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Neural operators have emerged as a promising paradigm for learning solution operators of partial differential equa- tions (PDEs) directly from data. Existing methods, such as those based on Fourier or graph techniques, make strong as- sumptions about the structure of the kernel integral opera- tor, assumptions which may limit expressivity. We present SVD-NO, a neural operator that explicitly parameterizes the kernel by its singular-value decomposition (SVD) and then carries out the integral directly in the low-rank basis. Two lightweight networks learn the left and right singular func- tions, a diagonal parameter matrix learns the singular values, and a Gram-matrix regularizer enforces orthonormality. As SVD-NO approximates the full kernel, it obtains a high de- gree of expressivity. Furthermore, due to its low-rank struc- ture the computational complexity of applying the operator remains reasonable, leading to a practical system. In exten- sive evaluations on five diverse benchmark equations, SVD- NO achieves a new state of the art. In particular, SVD-NO provides greater performance gains on PDEs whose solutions are highly spatially variable. The code of this work is publicly available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10054",
        "abs_url": "https://arxiv.org/abs/2511.10054",
        "pdf_url": "https://arxiv.org/pdf/2511.10054",
        "title": "BuddyMoE: Exploiting Expert Redundancy to Accelerate Memory-Constrained Mixture-of-Experts Inference",
        "authors": [
            "Yun Wang",
            "Lingyun Yang",
            "Senhao Yu",
            "Yixiao Wang",
            "Ruixing Li",
            "Zhixiang Wei",
            "James Yen",
            "Zhengwei Qi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Mixture-of-Experts (MoE) architectures scale language models by activating only a subset of specialized expert networks for each input token, thereby reducing the number of floating-point operations. However, the growing size of modern MoE models causes their full parameter sets to exceed GPU memory capacity; for example, Mixtral-8x7B has 45 billion parameters and requires 87 GB of memory even though only 14 billion parameters are used per token. Existing systems alleviate this limitation by offloading inactive experts to CPU memory, but transferring experts across the PCIe interconnect incurs significant latency (about 10 ms). Prefetching heuristics aim to hide this latency by predicting which experts are needed, but prefetch failures introduce significant stalls and amplify inference latency. In the event of a prefetch failure, prior work offers two primary solutions: either fetch the expert on demand, which incurs a long stall due to the PCIe bottleneck, or drop the expert from the computation, which significantly degrades model accuracy. The critical challenge, therefore, is to maintain both high inference speed and model accuracy when prefetching fails.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10056",
        "abs_url": "https://arxiv.org/abs/2511.10056",
        "pdf_url": "https://arxiv.org/pdf/2511.10056",
        "title": "From Static Structures to Ensembles: Studying and Harnessing Protein Structure Tokenization",
        "authors": [
            "Zijing Liu",
            "Bin Feng",
            "He Cao",
            "Yu Li"
        ],
        "comments": "NeurIPS 2025 AI for Science Workshop",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Protein structure tokenization converts 3D structures into discrete or vectorized representations, enabling the integration of structural and sequence data. Despite many recent works on structure tokenization, the properties of the underlying discrete representations are not well understood. In this work, we first demonstrate that the successful utilization of structural tokens in a language model for structure prediction depends on using rich, pre-trained sequence embeddings to bridge the semantic gap between the sequence and structural \"language\". The analysis of the structural vocabulary itself then reveals significant semantic redundancy, where multiple distinct tokens correspond to nearly identical local geometries, acting as \"structural synonyms\". This redundancy, rather than being a flaw, can be exploited with a simple \"synonym swap\" strategy to generate diverse conformational ensembles by perturbing a predicted structure with its structural synonyms. This computationally lightweight method accurately recapitulates protein flexibility, performing competitively with state-of-the-art models. Our study provides fundamental insights into the nature of discrete protein structure representations and introduces a powerful, near-instantaneous method for modeling protein dynamics. Source code is available in this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10062",
        "abs_url": "https://arxiv.org/abs/2511.10062",
        "pdf_url": "https://arxiv.org/pdf/2511.10062",
        "title": "FAQNAS: FLOPs-aware Hybrid Quantum Neural Architecture Search using Genetic Algorithm",
        "authors": [
            "Muhammad Kashif",
            "Shaf Khalid",
            "Alberto Marchisio",
            "Nouhaila Innan",
            "Muhammad Shafique"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Hybrid Quantum Neural Networks (HQNNs), which combine parameterized quantum circuits with classical neural layers, are emerging as promising models in the noisy intermediate-scale quantum (NISQ) era. While quantum circuits are not naturally measured in floating point operations (FLOPs), most HQNNs (in NISQ era) are still trained on classical simulators where FLOPs directly dictate runtime and scalability. Hence, FLOPs represent a practical and viable metric to measure the computational complexity of HQNNs. In this work, we introduce FAQNAS, a FLOPs-aware neural architecture search (NAS) framework that formulates HQNN design as a multi-objective optimization problem balancing accuracy and FLOPs. Unlike traditional approaches, FAQNAS explicitly incorporates FLOPs into the optimization objective, enabling the discovery of architectures that achieve strong performance while minimizing computational cost. Experiments on five benchmark datasets (MNIST, Digits, Wine, Breast Cancer, and Iris) show that quantum FLOPs dominate accuracy improvements, while classical FLOPs remain largely fixed. Pareto-optimal solutions reveal that competitive accuracy can often be achieved with significantly reduced computational cost compared to FLOPs-agnostic baselines. Our results establish FLOPs-awareness as a practical criterion for HQNN design in the NISQ era and as a scalable principle for future HQNN systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10072",
        "abs_url": "https://arxiv.org/abs/2511.10072",
        "pdf_url": "https://arxiv.org/pdf/2511.10072",
        "title": "Tree-Based Stochastic Optimization for Solving Large-Scale Urban Network Security Games",
        "authors": [
            "Shuxin Zhuang",
            "Linjian Meng",
            "Shuxin Li",
            "Minming Li",
            "Youzhi Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Urban Network Security Games (UNSGs), which model the strategic allocation of limited security resources on city road networks, are critical for urban safety. However, finding a Nash Equilibrium (NE) in large-scale UNSGs is challenging due to their massive and combinatorial action spaces. One common approach to addressing these games is the Policy-Space Response Oracle (PSRO) framework, which requires computing best responses (BR) at each iteration. However, precisely computing exact BRs is impractical in large-scale games, and employing reinforcement learning to approximate BRs inevitably introduces errors, which limits the overall effectiveness of the PSRO methods. Recent advancements in leveraging non-convex stochastic optimization to approximate an NE offer a promising alternative to the burdensome BR computation. However, utilizing existing stochastic optimization techniques with an unbiased loss function for UNSGs remains challenging because the action spaces are too vast to be effectively represented by neural networks. To address these issues, we introduce Tree-based Stochastic Optimization (TSO), a framework that bridges the gap between the stochastic optimization paradigm for NE-finding and the demands of UNSGs. Specifically, we employ the tree-based action representation that maps the whole action space onto a tree structure, addressing the challenge faced by neural networks in representing actions when the action space cannot be enumerated. We then incorporate this representation into the loss function and theoretically demonstrate its equivalence to the unbiased loss function. To further enhance the quality of the converged solution, we introduce a sample-and-prune mechanism that reduces the risk of being trapped in suboptimal local optima. Extensive experimental results indicate the superiority of TSO over other baseline algorithms in addressing the UNSGs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10089",
        "abs_url": "https://arxiv.org/abs/2511.10089",
        "pdf_url": "https://arxiv.org/pdf/2511.10089",
        "title": "T2IBias: Uncovering Societal Bias Encoded in the Latent Space of Text-to-Image Generative Models",
        "authors": [
            "Abu Sufian",
            "Cosimo Distante",
            "Marco Leo",
            "Hanan Salam"
        ],
        "comments": "This manuscript has been accepted for presentation in the First Interdisciplinary Workshop on Responsible AI for Value Creation. Dec 1, Copenhagen. The final version will be submitted for inclusion in a Springer LNCS Volume. (15 pages, 7 figures)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Text-to-image (T2I) generative models are largely used in AI-powered real-world applications and value creation. However, their strategic deployment raises critical concerns for responsible AI management, particularly regarding the reproduction and amplification of race- and gender-related stereotypes that can undermine organizational ethics. In this work, we investigate whether such societal biases are systematically encoded within the pretrained latent spaces of state-of-the-art T2I models. We conduct an empirical study across the five most popular open-source models, using ten neutral, profession-related prompts to generate 100 images per profession, resulting in a dataset of 5,000 images evaluated by diverse human assessors representing different races and genders. We demonstrate that all five models encode and amplify pronounced societal skew: caregiving and nursing roles are consistently feminized, while high-status professions such as corporate CEO, politician, doctor, and lawyer are overwhelmingly represented by males and mostly White individuals. We further identify model-specific patterns, such as QWEN-Image's near-exclusive focus on East Asian outputs, Kandinsky's dominance of White individuals, and SDXL's comparatively broader but still biased distributions. These results provide critical insights for AI project managers and practitioners, enabling them to select equitable AI models and customized prompts that generate images in alignment with the principles of responsible AI. We conclude by discussing the risks of these biases and proposing actionable strategies for bias mitigation in building responsible GenAI systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10130",
        "abs_url": "https://arxiv.org/abs/2511.10130",
        "pdf_url": "https://arxiv.org/pdf/2511.10130",
        "title": "RI-Loss: A Learnable Residual-Informed Loss for Time Series Forecasting",
        "authors": [
            "Jieting Wang",
            "Xiaolei Shang",
            "Feijiang Li",
            "Furong Peng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series forecasting relies on predicting future values from historical data, yet most state-of-the-art approaches-including transformer and multilayer perceptron-based models-optimize using Mean Squared Error (MSE), which has two fundamental weaknesses: its point-wise error computation fails to capture temporal relationships, and it does not account for inherent noise in the data. To overcome these limitations, we introduce the Residual-Informed Loss (RI-Loss), a novel objective function based on the Hilbert-Schmidt Independence Criterion (HSIC). RI-Loss explicitly models noise structure by enforcing dependence between the residual sequence and a random time series, enabling more robust, noise-aware representations. Theoretically, we derive the first non-asymptotic HSIC bound with explicit double-sample complexity terms, achieving optimal convergence rates through Bernstein-type concentration inequalities and Rademacher complexity analysis. This provides rigorous guarantees for RI-Loss optimization while precisely quantifying kernel space interactions. Empirically, experiments across eight real-world benchmarks and five leading forecasting models demonstrate improvements in predictive performance, validating the effectiveness of our approach. Code will be made publicly available to ensure reproducibility.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10165",
        "abs_url": "https://arxiv.org/abs/2511.10165",
        "pdf_url": "https://arxiv.org/pdf/2511.10165",
        "title": "EPO: Diverse and Realistic Protein Ensemble Generation via Energy Preference Optimization",
        "authors": [
            "Yuancheng Sun",
            "Yuxuan Ren",
            "Zhaoming Chen",
            "Xu Han",
            "Kang Liu",
            "Qiwei Ye"
        ],
        "comments": "Accepted as AAAI 2026 Poster",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Accurate exploration of protein conformational ensembles is essential for uncovering function but remains hard because molecular-dynamics (MD) simulations suffer from high computational costs and energy-barrier trapping. This paper presents Energy Preference Optimization (EPO), an online refinement algorithm that turns a pretrained protein ensemble generator into an energy-aware sampler without extra MD trajectories. Specifically, EPO leverages stochastic differential equation sampling to explore the conformational landscape and incorporates a novel energy-ranking mechanism based on list-wise preference optimization. Crucially, EPO introduces a practical upper bound to efficiently approximate the intractable probability of long sampling trajectories in continuous-time generative models, making it easily adaptable to existing pretrained generators. On Tetrapeptides, ATLAS, and Fast-Folding benchmarks, EPO successfully generates diverse and physically realistic ensembles, establishing a new state-of-the-art in nine evaluation metrics. These results demonstrate that energy-only preference signals can efficiently steer generative models toward thermodynamically consistent conformational ensembles, providing an alternative to long MD simulations and widening the applicability of learned potentials in structural biology and drug discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10187",
        "abs_url": "https://arxiv.org/abs/2511.10187",
        "pdf_url": "https://arxiv.org/pdf/2511.10187",
        "title": "Improved Offline Reinforcement Learning via Quantum Metric Encoding",
        "authors": [
            "Outongyi Lv",
            "Yewei Yuan",
            "Nana Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Quantum Physics (quant-ph)",
        "abstract": "Reinforcement learning (RL) with limited samples is common in real-world applications. However, offline RL performance under this constraint is often suboptimal. We consider an alternative approach to dealing with limited samples by introducing the Quantum Metric Encoder (QME). In this methodology, instead of applying the RL framework directly on the original states and rewards, we embed the states into a more compact and meaningful representation, where the structure of the encoding is inspired by quantum circuits. For classical data, QME is a classically simulable, trainable unitary embedding and thus serves as a quantum-inspired module, on a classical device. For quantum data in the form of quantum states, QME can be implemented directly on quantum hardware, allowing for training without measurement or re-encoding. We evaluated QME on three datasets, each limited to 100 samples. We use Soft-Actor-Critic (SAC) and Implicit-Q-Learning (IQL), two well-known RL algorithms, to demonstrate the effectiveness of our approach. From the experimental results, we find that training offline RL agents on QME-embedded states with decoded rewards yields significantly better performance than training on the original states and rewards. On average across the three datasets, for maximum reward performance, we achieve a 116.2% improvement for SAC and 117.6% for IQL. We further investigate the $\\Delta$-hyperbolicity of our framework, a geometric property of the state space known to be important for the RL training efficacy. The QME-embedded states exhibit low $\\Delta$-hyperbolicity, suggesting that the improvement after embedding arises from the modified geometry of the state space induced by QME. Thus, the low $\\Delta$-hyperbolicity and the corresponding effectiveness of QME could provide valuable information for developing efficient offline RL methods under limited-sample conditions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10190",
        "abs_url": "https://arxiv.org/abs/2511.10190",
        "pdf_url": "https://arxiv.org/pdf/2511.10190",
        "title": "Towards Leveraging Sequential Structure in Animal Vocalizations",
        "authors": [
            "Eklavya Sarkar",
            "Mathew Magimai.-Doss"
        ],
        "comments": "Accepted at NeurIPS workshop (AI for Non-Human Animal Communication)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Animal vocalizations contain sequential structures that carry important communicative information, yet most computational bioacoustics studies average the extracted frame-level features across the temporal axis, discarding the order of the sub-units within a vocalization. This paper investigates whether discrete acoustic token sequences, derived through vector quantization and gumbel-softmax vector quantization of extracted self-supervised speech model representations can effectively capture and leverage temporal information. To that end, pairwise distance analysis of token sequences generated from HuBERT embeddings shows that they can discriminate call-types and callers across four bioacoustics datasets. Sequence classification experiments using $k$-Nearest Neighbour with Levenshtein distance show that the vector-quantized token sequences yield reasonable call-type and caller classification performances, and hold promise as alternative feature representations towards leveraging sequential information in animal vocalizations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10200",
        "abs_url": "https://arxiv.org/abs/2511.10200",
        "pdf_url": "https://arxiv.org/pdf/2511.10200",
        "title": "Beyond MSE: Ordinal Cross-Entropy for Probabilistic Time Series Forecasting",
        "authors": [
            "Jieting Wang",
            "Huimei Shi",
            "Feijiang Li",
            "Xiaolei Shang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series forecasting is an important task that involves analyzing temporal dependencies and underlying patterns (such as trends, cyclicality, and seasonality) in historical data to predict future values or trends. Current deep learning-based forecasting models primarily employ Mean Squared Error (MSE) loss functions for regression modeling. Despite enabling direct value prediction, this method offers no uncertainty estimation and exhibits poor outlier robustness. To address these limitations, we propose OCE-TS, a novel ordinal classification approach for time series forecasting that replaces MSE with Ordinal Cross-Entropy (OCE) loss, preserving prediction order while quantifying uncertainty through probability output. Specifically, OCE-TS begins by discretizing observed values into ordered intervals and deriving their probabilities via a parametric distribution as supervision signals. Using a simple linear model, we then predict probability distributions for each timestep. The OCE loss is computed between the cumulative distributions of predicted and ground-truth probabilities, explicitly preserving ordinal relationships among forecasted values. Through theoretical analysis using influence functions, we establish that cross-entropy (CE) loss exhibits superior stability and outlier robustness compared to MSE loss. Empirically, we compared OCE-TS with five baseline models-Autoformer, DLinear, iTransformer, TimeXer, and TimeBridge-on seven public time series datasets. Using MSE and Mean Absolute Error (MAE) as evaluation metrics, the results demonstrate that OCE-TS consistently outperforms benchmark models. The code will be published.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10208",
        "abs_url": "https://arxiv.org/abs/2511.10208",
        "pdf_url": "https://arxiv.org/pdf/2511.10208",
        "title": "Fractional neural attention for efficient multiscale sequence processing",
        "authors": [
            "Cheng Kevin Qu",
            "Andrew Ly",
            "Pulin Gong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Dynamical Systems (math.DS); Probability (math.PR); Biological Physics (physics.bio-ph)",
        "abstract": "Attention mechanisms underpin the computational power of Transformer models, which have achieved remarkable success across diverse domains. Yet understanding and extending the principles underlying self-attention remains a key challenge for advancing artificial intelligence. Drawing inspiration from the multiscale dynamics of biological attention and from dynamical systems theory, we introduce Fractional Neural Attention (FNA), a principled, neuroscience-inspired framework for multiscale information processing. FNA models token interactions through Lévy diffusion governed by the fractional Laplacian, intrinsically realizing simultaneous short- and long-range dependencies across multiple scales. This mechanism yields greater expressivity and faster information mixing, advancing the foundational capacity of Transformers. Theoretically, we show that FNA's dynamics are governed by the fractional diffusion equation, and that the resulting attention networks exhibit larger spectral gaps and shorter path lengths -- mechanistic signatures of enhanced computational efficiency. Empirically, FNA achieves competitive text-classification performance even with a single layer and a single head; it also improves performance in image processing and neural machine translation. Finally, the diffusion map algorithm from geometric harmonics enables dimensionality reduction of FNA weights while preserving the intrinsic structure of embeddings and hidden states. Together, these results establish FNA as a principled mechanism connecting self-attention, stochastic dynamics, and geometry, providing an interpretable, biologically grounded foundation for powerful, neuroscience-inspired AI.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10213",
        "abs_url": "https://arxiv.org/abs/2511.10213",
        "pdf_url": "https://arxiv.org/pdf/2511.10213",
        "title": "Out-of-Context Misinformation Detection via Variational Domain-Invariant Learning with Test-Time Training",
        "authors": [
            "Xi Yang",
            "Han Zhang",
            "Zhijian Lin",
            "Yibiao Hu",
            "Hong Han"
        ],
        "comments": "accepted by the AAAI Conference on Artificial Intelligence (AAAI) 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Out-of-context misinformation (OOC) is a low-cost form of misinformation in news reports, which refers to place authentic images into out-of-context or fabricated image-text pairings. This problem has attracted significant attention from researchers in recent years. Current methods focus on assessing image-text consistency or generating explanations. However, these approaches assume that the training and test data are drawn from the same distribution. When encountering novel news domains, models tend to perform poorly due to the lack of prior knowledge. To address this challenge, we propose \\textbf{VDT} to enhance the domain adaptation capability for OOC misinformation detection by learning domain-invariant features and test-time training mechanisms. Domain-Invariant Variational Align module is employed to jointly encodes source and target domain data to learn a separable distributional space domain-invariant features. For preserving semantic integrity, we utilize domain consistency constraint module to reconstruct the source and target domain latent distribution. During testing phase, we adopt the test-time training strategy and confidence-variance filtering module to dynamically updating the VAE encoder and classifier, facilitating the model's adaptation to the target domain distribution. Extensive experiments conducted on the benchmark dataset NewsCLIPpings demonstrate that our method outperforms state-of-the-art baselines under most domain adaptation settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10227",
        "abs_url": "https://arxiv.org/abs/2511.10227",
        "pdf_url": "https://arxiv.org/pdf/2511.10227",
        "title": "FedCure: Mitigating Participation Bias in Semi-Asynchronous Federated Learning with Non-IID Data",
        "authors": [
            "Yue Chen",
            "Jianfeng Lu",
            "Shuqing Cao",
            "Wei Wang",
            "Gang Li",
            "Guanghui Wen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "While semi-asynchronous federated learning (SAFL) combines the efficiency of synchronous training with the flexibility of asynchronous updates, it inherently suffers from participation bias, which is further exacerbated by non-IID data distributions. More importantly, hierarchical architecture shifts participation from individual clients to client groups, thereby further intensifying this issue. Despite notable advancements in SAFL research, most existing works still focus on conventional cloud-end architectures while largely overlooking the critical impact of non-IID data on scheduling across the cloud-edge-client hierarchy. To tackle these challenges, we propose FedCure, an innovative semi-asynchronous Federated learning framework that leverages coalition construction and participation-aware scheduling to mitigate participation bias with non-IID data. Specifically, FedCure operates through three key rules: (1) a preference rule that optimizes coalition formation by maximizing collective benefits and establishing theoretically stable partitions to reduce non-IID-induced performance degradation; (2) a scheduling rule that integrates the virtual queue technique with Bayesian-estimated coalition dynamics, mitigating efficiency loss while ensuring mean rate stability; and (3) a resource allocation rule that enhances computational efficiency by optimizing client CPU frequencies based on estimated coalition dynamics while satisfying delay requirements. Comprehensive experiments on four real-world datasets demonstrate that FedCure improves accuracy by up to 5.1x compared with four state-of-the-art baselines, while significantly enhancing efficiency with the lowest coefficient of variation 0.0223 for per-round latency and maintaining long-term balance across diverse scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10251",
        "abs_url": "https://arxiv.org/abs/2511.10251",
        "pdf_url": "https://arxiv.org/pdf/2511.10251",
        "title": "Heuristic Transformer: Belief Augmented In-Context Reinforcement Learning",
        "authors": [
            "Oliver Dippel",
            "Alexei Lisitsa",
            "Bei Peng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Transformers have demonstrated exceptional in-context learning (ICL) capabilities, enabling applications across natural language processing, computer vision, and sequential decision-making. In reinforcement learning, ICL reframes learning as a supervised problem, facilitating task adaptation without parameter updates. Building on prior work leveraging transformers for sequential decision-making, we propose Heuristic Transformer (HT), an in-context reinforcement learning (ICRL) approach that augments the in-context dataset with a belief distribution over rewards to achieve better decision-making. Using a variational auto-encoder (VAE), a low-dimensional stochastic variable is learned to represent the posterior distribution over rewards, which is incorporated alongside an in-context dataset and query states as prompt to the transformer policy. We assess the performance of HT across the Darkroom, Miniworld, and MuJoCo environments, showing that it consistently surpasses comparable baselines in terms of both effectiveness and generalization. Our method presents a promising direction to bridge the gap between belief-based augmentations and transformer-based decision-making.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10255",
        "abs_url": "https://arxiv.org/abs/2511.10255",
        "pdf_url": "https://arxiv.org/pdf/2511.10255",
        "title": "Unitho: A Unified Multi-Task Framework for Computational Lithography",
        "authors": [
            "Qian Jin",
            "Yumeng Liu",
            "Yuqi Jiang",
            "Qi Sun",
            "Cheng Zhuo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reliable, generalizable data foundations are critical for enabling large-scale models in computational lithography. However, essential tasks-mask generation, rule violation detection, and layout optimization-are often handled in isolation, hindered by scarce datasets and limited modeling approaches. To address these challenges, we introduce Unitho, a unified multi-task large vision model built upon the Transformer architecture. Trained on a large-scale industrial lithography simulation dataset with hundreds of thousands of cases, Unitho supports end-to-end mask generation, lithography simulation, and rule violation detection. By enabling agile and high-fidelity lithography simulation, Unitho further facilitates the construction of robust data foundations for intelligent EDA. Experimental results validate its effectiveness and generalizability, with performance substantially surpassing academic baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10287",
        "abs_url": "https://arxiv.org/abs/2511.10287",
        "pdf_url": "https://arxiv.org/pdf/2511.10287",
        "title": "OutSafe-Bench: A Benchmark for Multimodal Offensive Content Detection in Large Language Models",
        "authors": [
            "Yuping Yan",
            "Yuhan Xie",
            "Yuanshuai Li",
            "Yingchao Yu",
            "Lingjuan Lyu",
            "Yaochu Jin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Since Multimodal Large Language Models (MLLMs) are increasingly being integrated into everyday tools and intelligent agents, growing concerns have arisen regarding their possible output of unsafe contents, ranging from toxic language and biased imagery to privacy violations and harmful misinformation. Current safety benchmarks remain highly limited in both modality coverage and performance evaluations, often neglecting the extensive landscape of content safety. In this work, we introduce OutSafe-Bench, the first most comprehensive content safety evaluation test suite designed for the multimodal era. OutSafe-Bench includes a large-scale dataset that spans four modalities, featuring over 18,000 bilingual (Chinese and English) text prompts, 4,500 images, 450 audio clips and 450 videos, all systematically annotated across nine critical content risk categories. In addition to the dataset, we introduce a Multidimensional Cross Risk Score (MCRS), a novel metric designed to model and assess overlapping and correlated content risks across different categories. To ensure fair and robust evaluation, we propose FairScore, an explainable automated multi-reviewer weighted aggregation framework. FairScore selects top-performing models as adaptive juries, thereby mitigating biases from single-model judgments and enhancing overall evaluation reliability. Our evaluation of nine state-of-the-art MLLMs reveals persistent and substantial safety vulnerabilities, underscoring the pressing need for robust safeguards in MLLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10320",
        "abs_url": "https://arxiv.org/abs/2511.10320",
        "pdf_url": "https://arxiv.org/pdf/2511.10320",
        "title": "PITE: Multi-Prototype Alignment for Individual Treatment Effect Estimation",
        "authors": [
            "Fuyuan Cao",
            "Jiaxuan Zhang",
            "Xiaoli Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Estimating Individual Treatment Effects (ITE) from observational data is challenging due to confounding bias. Most studies tackle this bias by balancing distributions globally, but ignore individual heterogeneity and fail to capture the local structure that represents the natural clustering among individuals, which ultimately compromises ITE estimation. While instance-level alignment methods consider heterogeneity, they similarly overlook the local structure information. To address these issues, we propose an end-to-end Multi-\\textbf{P}rototype alignment method for \\textbf{ITE} estimation (\\textbf{PITE}). PITE effectively captures local structure within groups and enforces cross-group alignment, thereby achieving robust ITE estimation. Specifically, we first define prototypes as cluster centroids based on similar individuals under the same treatment. To identify local similarity and the distribution consistency, we perform instance-to-prototype matching to assign individuals to the nearest prototype within groups, and design a multi-prototype alignment strategy to encourage the matched prototypes to be close across treatment arms in the latent space. PITE not only reduces distribution shift through fine-grained, prototype-level alignment, but also preserves the local structures of treated and control groups, which provides meaningful constraints for ITE estimation. Extensive evaluations on benchmark datasets demonstrate that PITE outperforms 13 state-of-the-art methods, achieving more accurate and robust ITE estimation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10333",
        "abs_url": "https://arxiv.org/abs/2511.10333",
        "pdf_url": "https://arxiv.org/pdf/2511.10333",
        "title": "EDGC: Entropy-driven Dynamic Gradient Compression for Efficient LLM Training",
        "authors": [
            "Qingao Yi",
            "Jiaang Duan",
            "Hanwen Hu",
            "Qin Hua",
            "Haiyan Zhao",
            "Shiyou Qian",
            "Dingyu Yang",
            "Jian Cao",
            "Jinghua Tang",
            "Yinghao Yu",
            "Chenzhi Liao",
            "Kangjin Wang",
            "Liping Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Performance (cs.PF)",
        "abstract": "Training large language models (LLMs) poses significant challenges regarding computational resources and memory capacity. Although distributed training techniques help mitigate these issues, they still suffer from considerable communication overhead. Existing approaches primarily rely on static gradient compression to enhance communication efficiency; however, these methods neglect the dynamic nature of evolving gradients during training, leading to performance degradation. Accelerating LLM training via compression without sacrificing performance remains a challenge. In this paper, we propose an entropy-driven dynamic gradient compression framework called EDGC. The core concept is to adjust the compression rate during LLM training based on the evolving trends of gradient entropy, taking into account both compression efficiency and error. EDGC consists of three key this http URL, it employs a down-sampling method to efficiently estimate gradient entropy, reducing computation overhead. Second, it establishes a theoretical model linking compression rate with gradient entropy, enabling more informed compression decisions. Lastly, a window-based adjustment mechanism dynamically adapts the compression rate across pipeline stages, improving communication efficiency and maintaining model performance. We implemented EDGC on a 32-NVIDIA-V100 cluster and a 64-NVIDIA-H100 cluster to train GPT2-2.5B and GPT2-12.1B, respectively. The results show that EDGC significantly reduces communication latency and training time by up to 46.45% and 16.13% while preserving LLM accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10344",
        "abs_url": "https://arxiv.org/abs/2511.10344",
        "pdf_url": "https://arxiv.org/pdf/2511.10344",
        "title": "Robust Decentralized Multi-armed Bandits: From Corruption-Resilience to Byzantine-Resilience",
        "authors": [
            "Zicheng Hu",
            "Yuchen Wang",
            "Cheng Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Decentralized cooperative multi-agent multi-armed bandits (DeCMA2B) considers how multiple agents collaborate in a decentralized multi-armed bandit setting. Though this problem has been extensively studied in previous work, most existing methods remain susceptible to various adversarial attacks. In this paper, we first study DeCMA2B with adversarial corruption, where an adversary can corrupt reward observations of all agents with a limited corruption budget. We propose a robust algorithm, called DeMABAR, which ensures that each agent's individual regret suffers only an additive term proportional to the corruption budget. Then we consider a more realistic scenario where the adversary can only attack a small number of agents. Our theoretical analysis shows that the DeMABAR algorithm can also almost completely eliminate the influence of adversarial attacks and is inherently robust in the Byzantine setting, where an unknown fraction of the agents can be Byzantine, i.e., may arbitrarily select arms and communicate wrong information. We also conduct numerical experiments to illustrate the robustness and effectiveness of the proposed method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10362",
        "abs_url": "https://arxiv.org/abs/2511.10362",
        "pdf_url": "https://arxiv.org/pdf/2511.10362",
        "title": "Gradient Flow Equations for Deep Linear Neural Networks: A Survey from a Network Perspective",
        "authors": [
            "Joel Wendin",
            "Claudio Altafini"
        ],
        "comments": "Manuscript accepted for publication in SIAM Review (SIREV)",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Dynamical Systems (math.DS)",
        "abstract": "The paper surveys recent progresses in understanding the dynamics and loss landscape of the gradient flow equations associated to deep linear neural networks, i.e., the gradient descent training dynamics (in the limit when the step size goes to 0) of deep neural networks missing the activation functions and subject to quadratic loss functions. When formulated in terms of the adjacency matrix of the neural network, as we do in the paper, these gradient flow equations form a class of converging matrix ODEs which is nilpotent, polynomial, isospectral, and with conservation laws. The loss landscape is described in detail. It is characterized by infinitely many global minima and saddle points, both strict and nonstrict, but lacks local minima and maxima. The loss function itself is a positive semidefinite Lyapunov function for the gradient flow, and its level sets are unbounded invariant sets of critical points, with critical values that correspond to the amount of singular values of the input-output data learnt by the gradient along a certain trajectory. The adjacency matrix representation we use in the paper allows to highlight the existence of a quotient space structure in which each critical value of the loss function is represented only once, while all other critical points with the same critical value belong to the fiber associated to the quotient space. It also allows to easily determine stable and unstable submanifolds at the saddle points, even when the Hessian fails to obtain them.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10366",
        "abs_url": "https://arxiv.org/abs/2511.10366",
        "pdf_url": "https://arxiv.org/pdf/2511.10366",
        "title": "Product distribution learning with imperfect advice",
        "authors": [
            "Arnab Bhattacharyya",
            "Davin Choo",
            "Philips George John",
            "Themis Gouleakis"
        ],
        "comments": "Full version (11 pages). To be published in NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Given i.i.d.~samples from an unknown distribution $P$, the goal of distribution learning is to recover the parameters of a distribution that is close to $P$. When $P$ belongs to the class of product distributions on the Boolean hypercube $\\{0,1\\}^d$, it is known that $\\Omega(d/\\varepsilon^2)$ samples are necessary to learn $P$ within total variation (TV) distance $\\varepsilon$. We revisit this problem when the learner is also given as advice the parameters of a product distribution $Q$. We show that there is an efficient algorithm to learn $P$ within TV distance $\\varepsilon$ that has sample complexity $\\tilde{O}(d^{1-\\eta}/\\varepsilon^2)$, if $\\|\\mathbf{p} - \\mathbf{q}\\|_1 < \\varepsilon d^{0.5 - \\Omega(\\eta)}$. Here, $\\mathbf{p}$ and $\\mathbf{q}$ are the mean vectors of $P$ and $Q$ respectively, and no bound on $\\|\\mathbf{p} - \\mathbf{q}\\|_1$ is known to the algorithm a priori.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10392",
        "abs_url": "https://arxiv.org/abs/2511.10392",
        "pdf_url": "https://arxiv.org/pdf/2511.10392",
        "title": "Enhancing Kernel Power K-means: Scalable and Robust Clustering with Random Fourier Features and Possibilistic Method",
        "authors": [
            "Yixi Chen",
            "Weixuan Liang",
            "Tianrui Liu",
            "Jun-Jie Huang",
            "Ao Li",
            "Xueling Zhu",
            "Xinwang Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Kernel power $k$-means (KPKM) leverages a family of means to mitigate local minima issues in kernel $k$-means. However, KPKM faces two key limitations: (1) the computational burden of the full kernel matrix restricts its use on extensive data, and (2) the lack of authentic centroid-sample assignment learning reduces its noise robustness. To overcome these challenges, we propose RFF-KPKM, introducing the first approximation theory for applying random Fourier features (RFF) to KPKM. RFF-KPKM employs RFF to generate efficient, low-dimensional feature maps, bypassing the need for the whole kernel matrix. Crucially, we are the first to establish strong theoretical guarantees for this combination: (1) an excess risk bound of $\\mathcal{O}(\\sqrt{k^3/n})$, (2) strong consistency with membership values, and (3) a $(1+\\varepsilon)$ relative error bound achievable using the RFF of dimension $\\mathrm{poly}(\\varepsilon^{-1}\\log k)$. Furthermore, to improve robustness and the ability to learn multiple kernels, we propose IP-RFF-MKPKM, an improved possibilistic RFF-based multiple kernel power $k$-means. IP-RFF-MKPKM ensures the scalability of MKPKM via RFF and refines cluster assignments by combining the merits of the possibilistic membership and fuzzy membership. Experiments on large-scale datasets demonstrate the superior efficiency and clustering accuracy of the proposed methods compared to the state-of-the-art alternatives.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10434",
        "abs_url": "https://arxiv.org/abs/2511.10434",
        "pdf_url": "https://arxiv.org/pdf/2511.10434",
        "title": "Unlocking Dynamic Inter-Client Spatial Dependencies: A Federated Spatio-Temporal Graph Learning Method for Traffic Flow Forecasting",
        "authors": [
            "Feng Wang",
            "Tianxiang Chen",
            "Shuyue Wei",
            "Qian Chu",
            "Yi Zhang",
            "Yifan Sun",
            "Zhiming Zheng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Spatio-temporal graphs are powerful tools for modeling complex dependencies in traffic time series. However, the distributed nature of real-world traffic data across multiple stakeholders poses significant challenges in modeling and reconstructing inter-client spatial dependencies while adhering to data locality constraints. Existing methods primarily address static dependencies, overlooking their dynamic nature and resulting in suboptimal performance. In response, we propose Federated Spatio-Temporal Graph with Dynamic Inter-Client Dependencies (FedSTGD), a framework designed to model and reconstruct dynamic inter-client spatial dependencies in federated learning. FedSTGD incorporates a federated nonlinear computation decomposition module to approximate complex graph operations. This is complemented by a graph node embedding augmentation module, which alleviates performance degradation arising from the decomposition. These modules are coordinated through a client-server collective learning protocol, which decomposes dynamic inter-client spatial dependency learning tasks into lightweight, parallelizable subtasks. Extensive experiments on four real-world datasets demonstrate that FedSTGD achieves superior performance over state-of-the-art baselines in terms of RMSE, MAE, and MAPE, approaching that of centralized baselines. Ablation studies confirm the contribution of each module in addressing dynamic inter-client spatial dependencies, while sensitivity analysis highlights the robustness of FedSTGD to variations in hyperparameters.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10435",
        "abs_url": "https://arxiv.org/abs/2511.10435",
        "pdf_url": "https://arxiv.org/pdf/2511.10435",
        "title": "Neuronal Fluctuations: Learning Rates vs Participating Neurons",
        "authors": [
            "Darsh Pareek",
            "Umesh Kumar",
            "Ruthu Rao",
            "Ravi Janjam"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep Neural Networks (DNNs) rely on inherent fluctuations in their internal parameters (weights and biases) to effectively navigate the complex optimization landscape and achieve robust performance. While these fluctuations are recognized as crucial for escaping local minima and improving generalization, their precise relationship with fundamental hyperparameters remains underexplored. A significant knowledge gap exists concerning how the learning rate, a critical parameter governing the training process, directly influences the dynamics of these neural fluctuations. This study systematically investigates the impact of varying learning rates on the magnitude and character of weight and bias fluctuations within a neural network. We trained a model using distinct learning rates and analyzed the corresponding parameter fluctuations in conjunction with the network's final accuracy. Our findings aim to establish a clear link between the learning rate's value, the resulting fluctuation patterns, and overall model performance. By doing so, we provide deeper insights into the optimization process, shedding light on how the learning rate mediates the crucial exploration-exploitation trade-off during training. This work contributes to a more nuanced understanding of hyperparameter tuning and the underlying mechanics of deep learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10475",
        "abs_url": "https://arxiv.org/abs/2511.10475",
        "pdf_url": "https://arxiv.org/pdf/2511.10475",
        "title": "Intrinsic Dimensionality as a Model-Free Measure of Class Imbalance",
        "authors": [
            "Çağrı Eser",
            "Zeynep Sonat Baltacı",
            "Emre Akbaş",
            "Sinan Kalkan"
        ],
        "comments": "45 pages, 11 figures",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "Imbalance in classification tasks is commonly quantified by the cardinalities of examples across classes. This, however, disregards the presence of redundant examples and inherent differences in the learning difficulties of classes. Alternatively, one can use complex measures such as training loss and uncertainty, which, however, depend on training a machine learning model. Our paper proposes using data Intrinsic Dimensionality (ID) as an easy-to-compute, model-free measure of imbalance that can be seamlessly incorporated into various imbalance mitigation methods. Our results across five different datasets with a diverse range of imbalance ratios show that ID consistently outperforms cardinality-based re-weighting and re-sampling techniques used in the literature. Moreover, we show that combining ID with cardinality can further improve performance. Code: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10481",
        "abs_url": "https://arxiv.org/abs/2511.10481",
        "pdf_url": "https://arxiv.org/pdf/2511.10481",
        "title": "Panda: Test-Time Adaptation with Negative Data Augmentation",
        "authors": [
            "Ruxi Deng",
            "Wenxuan Bao",
            "Tianxin Wei",
            "Jingrui He"
        ],
        "comments": "Accepted by AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Pretrained VLMs exhibit strong zero-shot classification capabilities, but their predictions degrade significantly under common image corruptions. To improve robustness, many test-time adaptation (TTA) methods adopt positive data augmentation (PDA), which generates multiple views of each test sample to reduce prediction variance. However, these methods suffer from two key limitations. First, it introduces considerable computational overhead due to the large number of augmentations required per image. Second, it fails to mitigate prediction bias, where the model tends to predict certain classes disproportionately under corruption, as PDA operates on corrupted inputs and typically does not remove the corruption itself. To address these challenges, we propose Panda, a novel TTA method based on negative data augmentation (NDA). Unlike positive augmentations that preserve object semantics, Panda generates negative augmentations by disrupting semantic content. It divides images into patches and randomly assembles them from a shared patch pool. These negatively augmented images retain corruption-specific features while discarding object-relevant signals. We then subtract the mean feature of these negative samples from the original image feature, effectively suppressing corruption-related components while preserving class-relevant information. This mitigates prediction bias under distribution shifts. Panda allows augmentation to be shared across samples within a batch, resulting in minimal computational overhead. Panda can be seamlessly integrated into existing test-time adaptation frameworks and substantially improve their robustness. Our experiments indicate that Panda delivers superior performance compared to PDA methods, and a wide range of TTA methods exhibit significantly enhanced performance when integrated with Panda. Our code is available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10494",
        "abs_url": "https://arxiv.org/abs/2511.10494",
        "pdf_url": "https://arxiv.org/pdf/2511.10494",
        "title": "Weak Relation Enforcement for Kinematic-Informed Long-Term Stock Prediction with Artificial Neural Networks",
        "authors": [
            "Stanislav Selitskiy"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose loss function week enforcement of the velocity relations between time-series points in the Kinematic-Informed artificial Neural Networks (KINN) for long-term stock prediction. Problems of the series volatility, Out-of-Distribution (OOD) test data, and outliers in training data are addressed by (Artificial Neural Networks) ANN's learning not only future points prediction but also by learning velocity relations between the points, such a way as avoiding unrealistic spurious predictions. The presented loss function penalizes not only errors between predictions and supervised label data, but also errors between the next point prediction and the previous point plus velocity prediction. The loss function is tested on the multiple popular and exotic AR ANN architectures, and around fifteen years of Dow Jones function demonstrated statistically meaningful improvement across the normalization-sensitive activation functions prone to spurious behaviour in the OOD data conditions. Results show that such architecture addresses the issue of the normalization in the auto-regressive models that break the data topology by weakly enforcing the data neighbourhood proximity (relation) preservation during the ANN transformation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10504",
        "abs_url": "https://arxiv.org/abs/2511.10504",
        "pdf_url": "https://arxiv.org/pdf/2511.10504",
        "title": "Holonorm",
        "authors": [
            "Daryl Noupa Yongueng",
            "Hamidou Tembine"
        ],
        "comments": "17 pages, 11 figures, 10 tables, 2 datasets. A stable geometric alternative to LayerNorm and Tanh normalization in deep neural networks",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Normalization is a key point in transformer training . In Dynamic Tanh (DyT), the author demonstrated that Tanh can be used as an alternative layer normalization (LN) and confirmed the effectiveness of the idea. But Tanh itself faces orthogonality, linearity and distortion problems. Due to that, his proposition cannot be reliable. So we propose a Holonorm (hn) which has residual connections and nonlinearity. Holonorm is suitable for replacing Tanh in the context of normalization. Although the HoloNorm expression could be similar to the softsign function in dimension one, softsign is a componentwise function which is not good for tensors and vectors of great dimension. Holonorm preserves the orthogonality, the direction, the invertibility of the signal. Holonorm is also a suitable metric, maps all vectors into the open unit ball. This prevents exploding activations and improves stability in deep Transformer models. In this work, we have meticulously examined the normalization in transformers and say that Holonorm, a generalized form of softsign function suited as a normalization function this http URL, defined between 0 and 1 hn serves as a percentage, and $1 - \\text{Holonorm}$ is its complement, making it better understandable in evaluating a model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10561",
        "abs_url": "https://arxiv.org/abs/2511.10561",
        "pdf_url": "https://arxiv.org/pdf/2511.10561",
        "title": "Maximizing Efficiency of Dataset Compression for Machine Learning Potentials With Information Theory",
        "authors": [
            "Benjamin Yu",
            "Vincenzo Lordi",
            "Daniel Schwalbe-Koda"
        ],
        "comments": "main text + SI; code at this https URL",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Machine learning interatomic potentials (MLIPs) balance high accuracy and lower costs compared to density functional theory calculations, but their performance often depends on the size and diversity of training datasets. Large datasets improve model accuracy and generalization but are computationally expensive to produce and train on, while smaller datasets risk discarding rare but important atomic environments and compromising MLIP accuracy/reliability. Here, we develop an information-theoretical framework to quantify the efficiency of dataset compression methods and propose an algorithm that maximizes this efficiency. By framing atomistic dataset compression as an instance of the minimum set cover (MSC) problem over atom-centered environments, our method identifies the smallest subset of structures that contains as much information as possible from the original dataset while pruning redundant information. The approach is extensively demonstrated on the GAP-20 and TM23 datasets, and validated on 64 varied datasets from the ColabFit repository. Across all cases, MSC consistently retains outliers, preserves dataset diversity, and reproduces the long-tail distributions of forces even at high compression rates, outperforming other subsampling methods. Furthermore, MLIPs trained on MSC-compressed datasets exhibit reduced error for out-of-distribution data even in low-data regimes. We explain these results using an outlier analysis and show that such quantitative conclusions could not be achieved with conventional dimensionality reduction methods. The algorithm is implemented in the open-source QUESTS package and can be used for several tasks in atomistic modeling, from data subsampling, outlier detection, and training improved MLIPs at a lower cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10562",
        "abs_url": "https://arxiv.org/abs/2511.10562",
        "pdf_url": "https://arxiv.org/pdf/2511.10562",
        "title": "Oya: Deep Learning for Accurate Global Precipitation Estimation",
        "authors": [
            "Emmanuel Asiedu Brempong",
            "Mohammed Alewi Hassen",
            "MohamedElfatih MohamedKhair",
            "Vusumuzi Dube",
            "Santiago Hincapie Potes",
            "Olivia Graham",
            "Amanie Brik",
            "Amy McGovern",
            "George Huffman",
            "Jason Hickey"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Atmospheric and Oceanic Physics (physics.ao-ph)",
        "abstract": "Accurate precipitation estimation is critical for hydrological applications, especially in the Global South where ground-based observation networks are sparse and forecasting skill is limited. Existing satellite-based precipitation products often rely on the longwave infrared channel alone or are calibrated with data that can introduce significant errors, particularly at sub-daily timescales. This study introduces Oya, a novel real-time precipitation retrieval algorithm utilizing the full spectrum of visible and infrared (VIS-IR) observations from geostationary (GEO) satellites. Oya employs a two-stage deep learning approach, combining two U-Net models: one for precipitation detection and another for quantitative precipitation estimation (QPE), to address the inherent data imbalance between rain and no-rain events. The models are trained using high-resolution GPM Combined Radar-Radiometer Algorithm (CORRA) v07 data as ground truth and pre-trained on IMERG-Final retrievals to enhance robustness and mitigate overfitting due to the limited temporal sampling of CORRA. By leveraging multiple GEO satellites, Oya achieves quasi-global coverage and demonstrates superior performance compared to existing competitive regional and global precipitation baselines, offering a promising pathway to improved precipitation monitoring and forecasting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10571",
        "abs_url": "https://arxiv.org/abs/2511.10571",
        "pdf_url": "https://arxiv.org/pdf/2511.10571",
        "title": "Belief Net: A Filter-Based Framework for Learning Hidden Markov Models from Observations",
        "authors": [
            "Reginald Zhiyan Chen",
            "Heng-Sheng Chang",
            "Prashant G. Mehta"
        ],
        "comments": "19 pages, 7 pages, submitted to conference: L4DC 2026",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Probability (math.PR)",
        "abstract": "Hidden Markov Models (HMMs) are fundamental for modeling sequential data, yet learning their parameters from observations remains challenging. Classical methods like the Baum-Welch (EM) algorithm are computationally intensive and prone to local optima, while modern spectral algorithms offer provable guarantees but may produce probability outputs outside valid ranges. This work introduces Belief Net, a novel framework that learns HMM parameters through gradient-based optimization by formulating the HMM's forward filter as a structured neural network. Unlike black-box Transformer models, Belief Net's learnable weights are explicitly the logits of the initial distribution, transition matrix, and emission matrix, ensuring full interpretability. The model processes observation sequences using a decoder-only architecture and is trained end-to-end with standard autoregressive next-observation prediction loss. On synthetic HMM data, Belief Net achieves superior convergence speed compared to Baum-Welch, successfully recovering parameters in both undercomplete and overcomplete settings where spectral methods fail. Comparisons with Transformer-based models are also presented on real-world language data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10575",
        "abs_url": "https://arxiv.org/abs/2511.10575",
        "pdf_url": "https://arxiv.org/pdf/2511.10575",
        "title": "Semi-Unified Sparse Dictionary Learning with Learnable Top-K LISTA and FISTA Encoders",
        "authors": [
            "Fengsheng Lin",
            "Shengyi Yan",
            "Trac Duy Tran"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present a semi-unified sparse dictionary learning framework that bridges the gap between classical sparse models and modern deep architectures. Specifically, the method integrates strict Top-$K$ LISTA and its convex FISTA-based variant (LISTAConv) into the discriminative LC-KSVD2 model, enabling co-evolution between the sparse encoder and the dictionary under supervised or unsupervised regimes. This unified design retains the interpretability of traditional sparse coding while benefiting from efficient, differentiable training. We further establish a PALM-style convergence analysis for the convex variant, ensuring theoretical stability under block alternation. Experimentally, our method achieves 95.6\\% on CIFAR-10, 86.3\\% on CIFAR-100, and 88.5\\% on TinyImageNet with faster convergence and lower memory cost ($<$4GB GPU). The results confirm that the proposed LC-KSVD2 + LISTA/LISTAConv pipeline offers an interpretable and computationally efficient alternative for modern deep architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10576",
        "abs_url": "https://arxiv.org/abs/2511.10576",
        "pdf_url": "https://arxiv.org/pdf/2511.10576",
        "title": "Tight Robustness Certification through the Convex Hull of $\\ell_0$ Attacks",
        "authors": [
            "Yuval Shapira",
            "Dana Drachsler-Cohen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Few-pixel attacks mislead a classifier by modifying a few pixels of an image. Their perturbation space is an $\\ell_0$-ball, which is not convex, unlike $\\ell_p$-balls for $p\\geq1$. However, existing local robustness verifiers typically scale by relying on linear bound propagation, which captures convex perturbation spaces. We show that the convex hull of an $\\ell_0$-ball is the intersection of its bounding box and an asymmetrically scaled $\\ell_1$-like polytope. The volumes of the convex hull and this polytope are nearly equal as the input dimension increases. We then show a linear bound propagation that precisely computes bounds over the convex hull and is significantly tighter than bound propagations over the bounding box or our $\\ell_1$-like polytope. This bound propagation scales the state-of-the-art $\\ell_0$ verifier on its most challenging robustness benchmarks by 1.24x-7.07x, with a geometric mean of 3.16.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10590",
        "abs_url": "https://arxiv.org/abs/2511.10590",
        "pdf_url": "https://arxiv.org/pdf/2511.10590",
        "title": "Pretrained Joint Predictions for Scalable Batch Bayesian Optimization of Molecular Designs",
        "authors": [
            "Miles Wang-Henderson",
            "Ben Kaufman",
            "Edward Williams",
            "Ryan Pederson",
            "Matteo Rossi",
            "Owen Howell",
            "Carl Underkoffler",
            "Narbe Mardirossian",
            "John Parkhill"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Batched synthesis and testing of molecular designs is the key bottleneck of drug development. There has been great interest in leveraging biomolecular foundation models as surrogates to accelerate this process. In this work, we show how to obtain scalable probabilistic surrogates of binding affinity for use in Batch Bayesian Optimization (Batch BO). This demands parallel acquisition functions that hedge between designs and the ability to rapidly sample from a joint predictive density to approximate them. Through the framework of Epistemic Neural Networks (ENNs), we obtain scalable joint predictive distributions of binding affinity on top of representations taken from large structure-informed models. Key to this work is an investigation into the importance of prior networks in ENNs and how to pretrain them on synthetic data to improve downstream performance in Batch BO. Their utility is demonstrated by rediscovering known potent EGFR inhibitors on a semi-synthetic benchmark in up to 5x fewer iterations, as well as potent inhibitors from a real-world small-molecule library in up to 10x fewer iterations, offering a promising solution for large-scale drug discovery applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10619",
        "abs_url": "https://arxiv.org/abs/2511.10619",
        "pdf_url": "https://arxiv.org/pdf/2511.10619",
        "title": "Algorithm Design and Stronger Guarantees for the Improving Multi-Armed Bandits Problem",
        "authors": [
            "Avrim Blum",
            "Marten Garicano",
            "Kavya Ravichandran",
            "Dravyansh Sharma"
        ],
        "comments": "25 pages",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "The improving multi-armed bandits problem is a formal model for allocating effort under uncertainty, motivated by scenarios such as investing research effort into new technologies, performing clinical trials, and hyperparameter selection from learning curves. Each pull of an arm provides reward that increases monotonically with diminishing returns. A growing line of work has designed algorithms for improving bandits, albeit with somewhat pessimistic worst-case guarantees. Indeed, strong lower bounds of $\\Omega(k)$ and $\\Omega(\\sqrt{k})$ multiplicative approximation factors are known for both deterministic and randomized algorithms (respectively) relative to the optimal arm, where $k$ is the number of bandit arms. In this work, we propose two new parameterized families of bandit algorithms and bound the sample complexity of learning the near-optimal algorithm from each family using offline data. The first family we define includes the optimal randomized algorithm from prior work. We show that an appropriately chosen algorithm from this family can achieve stronger guarantees, with optimal dependence on $k$, when the arm reward curves satisfy additional properties related to the strength of concavity. Our second family contains algorithms that both guarantee best-arm identification on well-behaved instances and revert to worst case guarantees on poorly-behaved instances. Taking a statistical learning perspective on the bandit rewards optimization problem, we achieve stronger data-dependent guarantees without the need for actually verifying whether the assumptions are satisfied.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09576",
        "abs_url": "https://arxiv.org/abs/2511.09576",
        "pdf_url": "https://arxiv.org/pdf/2511.09576",
        "title": "Prostate-VarBench: A Benchmark with Interpretable TabNet Framework for Prostate Cancer Variant Classification",
        "authors": [
            "Abraham Francisco Arellano Tavara",
            "Umesh Kumar",
            "Jathurshan Pradeepkumar",
            "Jimeng Sun"
        ],
        "comments": "",
        "subjects": "Quantitative Methods (q-bio.QM); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Variants of Uncertain Significance (VUS) limit the clinical utility of prostate cancer genomics by delaying diagnosis and therapy when evidence for pathogenicity or benignity is incomplete. Progress is further limited by inconsistent annotations across sources and the absence of a prostate-specific benchmark for fair comparison. We introduce Prostate-VarBench, a curated pipeline for creating prostate-specific benchmarks that integrates COSMIC (somatic cancer mutations), ClinVar (expert-curated clinical variants), and TCGA-PRAD (prostate tumor genomics from The Cancer Genome Atlas) into a harmonized dataset of 193,278 variants supporting patient- or gene-aware splits to prevent data leakage. To ensure data integrity, we corrected a Variant Effect Predictor (VEP) issue that merged multiple transcript records, introducing ambiguity in clinical significance fields. We then standardized 56 interpretable features across eight clinically relevant tiers, including population frequency, variant type, and clinical context. AlphaMissense pathogenicity scores were incorporated to enhance missense variant classification and reduce VUS uncertainty. Building on this resource, we trained an interpretable TabNet model to classify variant pathogenicity, whose step-wise sparse masks provide per-case rationales consistent with molecular tumor board review practices. On the held-out test set, the model achieved 89.9% accuracy with balanced class metrics, and the VEP correction yields an 6.5% absolute reduction in VUS.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09577",
        "abs_url": "https://arxiv.org/abs/2511.09577",
        "pdf_url": "https://arxiv.org/pdf/2511.09577",
        "title": "Siegel Neural Networks",
        "authors": [
            "Xuan Son Nguyen",
            "Aymeric Histace",
            "Nistor Grozavu"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Riemannian symmetric spaces (RSS) such as hyperbolic spaces and symmetric positive definite (SPD) manifolds have become popular spaces for representation learning. In this paper, we propose a novel approach for building discriminative neural networks on Siegel spaces, a family of RSS that is largely unexplored in machine learning tasks. For classification applications, one focus of recent works is the construction of multiclass logistic regression (MLR) and fully-connected (FC) layers for hyperbolic and SPD neural networks. Here we show how to build such layers for Siegel neural networks. Our approach relies on the quotient structure of those spaces and the notation of vector-valued distance on RSS. We demonstrate the relevance of our approach on two applications, i.e., radar clutter classification and node classification. Our results successfully demonstrate state-of-the-art performance across all datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09655",
        "abs_url": "https://arxiv.org/abs/2511.09655",
        "pdf_url": "https://arxiv.org/pdf/2511.09655",
        "title": "Analysis of the TAIGA-HiSCORE Data Using the Latent Space of Autoencoders",
        "authors": [
            "Yu.Yu. Dubenskaya",
            "S.P. Polyakov",
            "A.P. Kryukov",
            "A.P. Demichev",
            "E.O. Gres",
            "E.B. Postnikov",
            "A.Yu. Razumov",
            "P.A. Volchugov",
            "D.P. Zhurov"
        ],
        "comments": "16 pages, 7 figures, Proceedings of The 9th International Conference on Deep Learning in Computational Physics, July 2-4, 2025, Moscow, Russia",
        "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE); Machine Learning (cs.LG)",
        "abstract": "The aim of extensive air shower (EAS) analysis is to reconstruct the physical parameters of the primary particle that initiated the shower. The TAIGA experiment is a hybrid detector system that combines several imaging atmospheric Cherenkov telescopes (IACTs) and an array of non-imaging Cherenkov detectors (TAIGA-HiSCORE) for EAS detection. Because the signals recorded by different detector types differ in physical nature, the direct merging of data is unfeasible, which complicates multimodal analysis. Currently, to analyze data from the IACTs and TAIGA-HiSCORE, a set of auxiliary parameters specific to each detector type is calculated from the recorded signals. These parameters are chosen empirically, so there is no certainty that they retain all important information and are the best suited for the respective problems. We propose to use autoencoders (AE) for the analysis of TAIGA experimental data and replace the conventionally used auxiliary parameters with the parameters of the AE latent space. The advantage of the AE latent space parameters is that they preserve essential physics from experimental data without prior assumptions. This approach also holds potential for enabling seamless integration of heterogeneous IACT and HiSCORE data through a joint latent space. To reconstruct the parameters of the primary particle of the EAS from the latent space of the AE, a separate artificial neural network is used. In this paper, the proposed approach is used to reconstruct the energy of the EAS primary particles based on Monte Carlo simulation data for TAIGA-HiSCORE. The dependence of the energy determination accuracy on the dimensionality of the latent space is analyzed, and these results are also compared with the results obtained by the conventional technique. It is shown that when using the AE latent space, the energy of the primary particle is reconstructed with satisfactory accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09674",
        "abs_url": "https://arxiv.org/abs/2511.09674",
        "pdf_url": "https://arxiv.org/pdf/2511.09674",
        "title": "Lithological Controls on the Permeability of Geologic Faults: Surrogate Modeling and Sensitivity Analysis",
        "authors": [
            "Hannah Lu",
            "Lluıs Salo-Salgado",
            "Ruben Juanes"
        ],
        "comments": "",
        "subjects": "Geophysics (physics.geo-ph); Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "Fault zones exhibit complex and heterogeneous permeability structures influenced by stratigraphic, compositional, and structural factors, making them critical yet uncertain components in subsurface flow modeling. In this study, we investigate how lithological controls influence fault permeability using the PREDICT framework: a probabilistic workflow that couples stochastic fault geometry generation, physically constrained material placement, and flow-based upscaling. The flow-based upscaling step, however, is a very computationally expensive component of the workflow and presents a major bottleneck that makes global sensitivity analysis (GSA) intractable, as it requires millions of model evaluations. To overcome this challenge, we develop a neural network surrogate to emulate the flow-based upscaling step. This surrogate model dramatically reduces the computational cost while maintaining high accuracy, thereby making GSA feasible. The surrogate-model-enabled GSA reveals new insights into the effects of lithological controls on fault permeability. In addition to identifying dominant parameters and negligible ones, the analysis uncovers significant nonlinear interactions between parameters that cannot be captured by traditional local sensitivity methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09702",
        "abs_url": "https://arxiv.org/abs/2511.09702",
        "pdf_url": "https://arxiv.org/pdf/2511.09702",
        "title": "Classifying Phonotrauma Severity from Vocal Fold Images with Soft Ordinal Regression",
        "authors": [
            "Katie Matton",
            "Purvaja Balaji",
            "Hamzeh Ghasemzadeh",
            "Jameson C. Cooper",
            "Daryush D. Mehta",
            "Jarrad H. Van Stan",
            "Robert E. Hillman",
            "Rosalind Picard",
            "John Guttag",
            "S. Mazdak Abulnaga"
        ],
        "comments": "16 pages, 9 figures, 5 tables; ML4H 2025; Proceedings of Machine Learning Research 297, 2025",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Phonotrauma refers to vocal fold tissue damage resulting from exposure to forces during voicing. It occurs on a continuum from mild to severe, and treatment options can vary based on severity. Assessment of severity involves a clinician's expert judgment, which is costly and can vary widely in reliability. In this work, we present the first method for automatically classifying phonotrauma severity from vocal fold images. To account for the ordinal nature of the labels, we adopt a widely used ordinal regression framework. To account for label uncertainty, we propose a novel modification to ordinal regression loss functions that enables them to operate on soft labels reflecting annotator rating distributions. Our proposed soft ordinal regression method achieves predictive performance approaching that of clinical experts, while producing well-calibrated uncertainty estimates. By providing an automated tool for phonotrauma severity assessment, our work can enable large-scale studies of phonotrauma, ultimately leading to improved clinical understanding and patient care.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09722",
        "abs_url": "https://arxiv.org/abs/2511.09722",
        "pdf_url": "https://arxiv.org/pdf/2511.09722",
        "title": "Masked Mineral Modeling: Continent-Scale Mineral Prospecting via Geospatial Infilling",
        "authors": [
            "Sujay Nair",
            "Evan Coleman",
            "Sherrie Wang",
            "Elsa Olivetti"
        ],
        "comments": "7 pages, 6 figures, includes 23 pages of Supplementary Materials for paper accepted to AAAI2026",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "Minerals play a critical role in the advanced energy technologies necessary for decarbonization, but characterizing mineral deposits hidden underground remains costly and challenging. Inspired by recent progress in generative modeling, we develop a learning method which infers the locations of minerals by masking and infilling geospatial maps of resource availability. We demonstrate this technique using mineral data for the conterminous United States, and train performant models, with the best achieving Dice coefficients of $0.31 \\pm 0.01$ and recalls of $0.22 \\pm 0.02$ on test data at 1$\\times$1 mi$^2$ spatial resolution. One major advantage of our approach is that it can easily incorporate auxiliary data sources for prediction which may be more abundant than mineral data. We highlight the capabilities of our model by adding input layers derived from geophysical sources, along with a nation-wide ground survey of soils originally intended for agronomic purposes. We find that employing such auxiliary features can improve inference performance, while also enabling model evaluation in regions with no recorded minerals.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09725",
        "abs_url": "https://arxiv.org/abs/2511.09725",
        "pdf_url": "https://arxiv.org/pdf/2511.09725",
        "title": "The Data Fusion Labeler (dFL): Challenges and Solutions to Data Harmonization, Labeling, and Provenance in Fusion Energy",
        "authors": [
            "Craig Michoski",
            "Matthew Waller",
            "Brian Sammuli",
            "Zeyu Li",
            "Tapan Ganatma Nakkina",
            "Raffi Nazikian",
            "Sterling Smith",
            "David Orozco",
            "Dongyang Kuang",
            "Martin Foltin",
            "Erik Olofsson",
            "Mike Fredrickson",
            "Jerry Louis-Jeune",
            "David R. Hatch",
            "Todd A. Oliver",
            "Mitchell Clark",
            "Steph-Yves Louis"
        ],
        "comments": "",
        "subjects": "Plasma Physics (physics.plasm-ph); Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "Fusion energy research increasingly depends on the ability to integrate heterogeneous, multimodal datasets from high-resolution diagnostics, control systems, and multiscale simulations. The sheer volume and complexity of these datasets demand the development of new tools capable of systematically harmonizing and extracting knowledge across diverse modalities. The Data Fusion Labeler (dFL) is introduced as a unified workflow instrument that performs uncertainty-aware data harmonization, schema-compliant data fusion, and provenance-rich manual and automated labeling at scale. By embedding alignment, normalization, and labeling within a reproducible, operator-order-aware framework, dFL reduces time-to-analysis by greater than 50X (e.g., enabling >200 shots/hour to be consistently labeled rather than a handful per day), enhances label (and subsequently training) quality, and enables cross-device comparability. Case studies from DIII-D demonstrate its application to automated ELM detection and confinement regime classification, illustrating its potential as a core component of data-driven discovery, model validation, and real-time control in future burning plasma devices.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09727",
        "abs_url": "https://arxiv.org/abs/2511.09727",
        "pdf_url": "https://arxiv.org/pdf/2511.09727",
        "title": "Baby Sophia: A Developmental Approach to Self-Exploration through Self-Touch and Hand Regard",
        "authors": [
            "Stelios Zarifis",
            "Ioannis Chalkiadakis",
            "Artemis Chardouveli",
            "Vasiliki Moutzouri",
            "Aggelos Sotirchos",
            "Katerina Papadimitriou",
            "Panagiotis Filntisis",
            "Niki Efthymiou",
            "Petros Maragos",
            "Katerina Pastra"
        ],
        "comments": "5 pages, 3 tables",
        "subjects": "Robotics (cs.RO); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Inspired by infant development, we propose a Reinforcement Learning (RL) framework for autonomous self-exploration in a robotic agent, Baby Sophia, using the BabyBench simulation environment. The agent learns self-touch and hand regard behaviors through intrinsic rewards that mimic an infant's curiosity-driven exploration of its own body. For self-touch, high-dimensional tactile inputs are transformed into compact, meaningful representations, enabling efficient learning. The agent then discovers new tactile contacts through intrinsic rewards and curriculum learning that encourage broad body coverage, balance, and generalization. For hand regard, visual features of the hands, such as skin-color and shape, are learned through motor babbling. Then, intrinsic rewards encourage the agent to perform novel hand motions, and follow its hands with its gaze. A curriculum learning setup from single-hand to dual-hand training allows the agent to reach complex visual-motor coordination. The results of this work demonstrate that purely curiosity-based signals, with no external supervision, can drive coordinated multimodal learning, imitating an infant's progression from random motor babbling to purposeful behaviors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09734",
        "abs_url": "https://arxiv.org/abs/2511.09734",
        "pdf_url": "https://arxiv.org/pdf/2511.09734",
        "title": "A Fourier-Based Global Denoising Model for Smart Artifacts Removing of Microscopy Images",
        "authors": [
            "Huanhuan Zhao",
            "Connor Vernachio",
            "Laxmi Bhurtel",
            "Wooin Yang",
            "Ruben Millan-Solsona",
            "Spenser R. Brown",
            "Marti Checa",
            "Komal Sharma Agrawal",
            "Adam M. Guss",
            "Liam Collins",
            "Wonhee Ko",
            "Arpan Biswas"
        ],
        "comments": "21 pages, 9 figures",
        "subjects": "Image and Video Processing (eess.IV); Machine Learning (cs.LG)",
        "abstract": "Microscopy such as Scanning Tunneling Microscopy (STM), Atomic Force Microscopy (AFM) and Scanning Electron Microscopy (SEM) are essential tools in material imaging at micro- and nanoscale resolutions to extract physical knowledge and materials structure-property relationships. However, tuning microscopy controls (e.g. scanning speed, current setpoint, tip bias etc.) to obtain a high-quality of images is a non-trivial and time-consuming effort. On the other hand, with sub-standard images, the key features are not accurately discovered due to noise and artifacts, leading to erroneous analysis. Existing denoising models mostly build on generalizing the weak signals as noises while the strong signals are enhanced as key features, which is not always the case in microscopy images, thus can completely erase a significant amount of hidden physical information. To address these limitations, we propose a global denoising model (GDM) to smartly remove artifacts of microscopy images while preserving weaker but physically important features. The proposed model is developed based on 1) first designing a two-imaging input channel of non-pair and goal specific pre-processed images with user-defined trade-off information between two channels and 2) then integrating a loss function of pixel- and fast Fourier-transformed (FFT) based on training the U-net model. We compared the proposed GDM with the non-FFT denoising model over STM-generated images of Copper(Cu) and Silicon(Si) materials, AFM-generated Pantoea sp.YR343 bio-film images and SEM-generated plastic degradation images. We believe this proposed workflow can be extended to improve other microscopy image quality and will benefit the experimentalists with the proposed design flexibility to smartly tune via domain-experts preferences.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09738",
        "abs_url": "https://arxiv.org/abs/2511.09738",
        "pdf_url": "https://arxiv.org/pdf/2511.09738",
        "title": "Assessing the Applicability of Natural Language Processing to Traditional Social Science Methodology: A Case Study in Identifying Strategic Signaling Patterns in Presidential Directives",
        "authors": [
            "C. LeMay",
            "A. Lane",
            "J. Seales",
            "M. Winstead",
            "S. Baty"
        ],
        "comments": "24 pages",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Our research investigates how Natural Language Processing (NLP) can be used to extract main topics from a larger corpus of written data, as applied to the case of identifying signaling themes in Presidential Directives (PDs) from the Reagan through Clinton administrations. Analysts and NLP both identified relevant documents, demonstrating the potential utility of NLPs in research involving large written corpuses. However, we also identified discrepancies between NLP and human-labeled results that indicate a need for more research to assess the validity of NLP in this use case. The research was conducted in 2023, and the rapidly evolving landscape of AIML means existing tools have improved and new tools have been developed; this research displays the inherent capabilities of a potentially dated AI tool in emerging social science applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09765",
        "abs_url": "https://arxiv.org/abs/2511.09765",
        "pdf_url": "https://arxiv.org/pdf/2511.09765",
        "title": "Brian Intensify: An Adaptive Machine Learning Framework for Auditory EEG Stimulation and Cognitive Enhancement in FXS",
        "authors": [
            "Zag ElSayed",
            "Grace Westerkamp",
            "Jack Yanchen Liu",
            "Ernest Pedapati"
        ],
        "comments": "7 pages, 4 figures",
        "subjects": "Neurons and Cognition (q-bio.NC); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Neurodevelopmental disorders such as Fragile X Syndrome (FXS) and Autism Spectrum Disorder (ASD) are characterized by disrupted cortical oscillatory activity, particularly in the alpha and gamma frequency bands. These abnormalities are linked to deficits in attention, sensory processing, and cognitive function. In this work, we present an adaptive machine learning-based brain-computer interface (BCI) system designed to modulate neural oscillations through frequency-specific auditory stimulation to enhance cognitive readiness in individuals with FXS. EEG data were recorded from 38 participants using a 128-channel system under a stimulation paradigm consisting of a 30-second baseline (no stimulus) followed by 60-second auditory entrainment episodes at 7Hz, 9Hz, 11Hz, and 13Hz. A comprehensive analysis of power spectral features (Alpha, Gamma, Delta, Theta, Beta) and cross-frequency coupling metrics (Alpha-Gamma, Alpha-Beta, etc.) was conducted. The results identified Peak Alpha Power, Peak Gamma Power, and Alpha Power per second per channel as the most discriminative biomarkers. The 13Hz stimulation condition consistently elicited a significant increase in Alpha activity and suppression of Gamma activity, aligning with our optimization objective. A supervised machine learning framework was developed to predict EEG responses and dynamically adjust stimulation parameters, enabling real-time, subject-specific adaptation. This work establishes a novel EEG-driven optimization framework for cognitive neuromodulation, providing a foundational model for next-generation AI-integrated BCI systems aimed at personalized neurorehabilitation in FXS and related disorders.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09767",
        "abs_url": "https://arxiv.org/abs/2511.09767",
        "pdf_url": "https://arxiv.org/pdf/2511.09767",
        "title": "Modelos Empiricos de Pos-Dupla Selecao por LASSO: Discussoes para Estudos do Transporte Aereo",
        "authors": [
            "Alessandro V. M. Oliveira"
        ],
        "comments": "Article in Portuguese",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG); General Economics (econ.GN); Systems and Control (eess.SY); Applications (stat.AP)",
        "abstract": "This paper presents and discusses forms of estimation by regularized regression and model selection using the LASSO method - Least Absolute Shrinkage and Selection Operator. LASSO is recognized as one of the main supervised learning methods applied to high-dimensional econometrics, allowing work with large volumes of data and multiple correlated controls. Conceptual issues related to the consequences of high dimensionality in modern econometrics and the principle of sparsity, which underpins regularization procedures, are addressed. The study examines the main post-double selection and post-regularization models, including variations applied to instrumental variable models. A brief description of the lassopack routine package, its syntaxes, and examples of HD, HDS (High-Dimension Sparse), and IV-HDS models, with combinations involving fixed effects estimators, is also presented. Finally, the potential application of the approach in research focused on air transport is discussed, with emphasis on an empirical study on the operational efficiency of airlines and aircraft fuel consumption.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09769",
        "abs_url": "https://arxiv.org/abs/2511.09769",
        "pdf_url": "https://arxiv.org/pdf/2511.09769",
        "title": "Symmetry aware Reynolds Averaged Navier Stokes turbulence models with equivariant neural networks",
        "authors": [
            "Aaron Miller",
            "Sahil Kommalapati",
            "Robert Moser",
            "Petros Koumoutsakos"
        ],
        "comments": "",
        "subjects": "Fluid Dynamics (physics.flu-dyn); Machine Learning (cs.LG)",
        "abstract": "Accurate and generalizable Reynolds-averaged Navier-Stokes (RANS) models for turbulent flows rely on effective closures. We introduce tensor-based, symmetry aware closures using equivariant neural networks (ENNs) and present an algorithm for enforcing algebraic contraction relations among tensor components. The modeling approach builds on the structure tensor framework introduced by Kassinos and Reynolds to learn closures in the rapid distortion theory setting. Experiments show that ENNs can effectively learn relationships involving high-order tensors, meeting or exceeding the performance of existing models in tasks such as predicting the rapid pressure-strain correlation. Our results show that ENNs provide a physically consistent alternative to classical tensor basis models, enabling end-to-end learning of unclosed terms in RANS and fast exploration of model dependencies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09790",
        "abs_url": "https://arxiv.org/abs/2511.09790",
        "pdf_url": "https://arxiv.org/pdf/2511.09790",
        "title": "A Robust Task-Level Control Architecture for Learned Dynamical Systems",
        "authors": [
            "Eshika Pathak",
            "Ahmed Aboudonia",
            "Sandeep Banik",
            "Naira Hovakimyan"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Dynamical system (DS)-based learning from demonstration (LfD) is a powerful tool for generating motion plans in the operation (`task') space of robotic systems. However, the realization of the generated motion plans is often compromised by a ''task-execution mismatch'', where unmodeled dynamics, persistent disturbances, and system latency cause the robot's actual task-space state to diverge from the desired motion trajectory. We propose a novel task-level robust control architecture, L1-augmented Dynamical Systems (L1-DS), that explicitly handles the task-execution mismatch in tracking a nominal motion plan generated by any DS-based LfD scheme. Our framework augments any DS-based LfD model with a nominal stabilizing controller and an L1 adaptive controller. Furthermore, we introduce a windowed Dynamic Time Warping (DTW)-based target selector, which enables the nominal stabilizing controller to handle temporal misalignment for improved phase-consistent tracking. We demonstrate the efficacy of our architecture on the LASA and IROS handwriting datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09801",
        "abs_url": "https://arxiv.org/abs/2511.09801",
        "pdf_url": "https://arxiv.org/pdf/2511.09801",
        "title": "Generalized infinite dimensional Alpha-Procrustes based geometries",
        "authors": [
            "Salvish Goomanee",
            "Andi Han",
            "Pratik Jawanpuria",
            "Bamdev Mishra"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Functional Analysis (math.FA); Optimization and Control (math.OC)",
        "abstract": "This work extends the recently introduced Alpha-Procrustes family of Riemannian metrics for symmetric positive definite (SPD) matrices by incorporating generalized versions of the Bures-Wasserstein (GBW), Log-Euclidean, and Wasserstein distances. While the Alpha-Procrustes framework has unified many classical metrics in both finite- and infinite- dimensional settings, it previously lacked the structural components necessary to realize these generalized forms. We introduce a formalism based on unitized Hilbert-Schmidt operators and an extended Mahalanobis norm that allows the construction of robust, infinite-dimensional generalizations of GBW and Log-Hilbert-Schmidt distances. Our approach also incorporates a learnable regularization parameter that enhances geometric stability in high-dimensional comparisons. Preliminary experiments reproducing benchmarks from the literature demonstrate the improved performance of our generalized metrics, particularly in scenarios involving comparisons between datasets of varying dimension and scale. This work lays a theoretical and computational foundation for advancing robust geometric methods in machine learning, statistical inference, and functional data analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09873",
        "abs_url": "https://arxiv.org/abs/2511.09873",
        "pdf_url": "https://arxiv.org/pdf/2511.09873",
        "title": "HierRouter: Coordinated Routing of Specialized Large Language Models via Reinforcement Learning",
        "authors": [
            "Nikunj Gupta",
            "Bill Guo",
            "Rajgopal Kannan",
            "Viktor K. Prasanna"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) deliver state-of-the-art performance across many tasks but impose high computational and memory costs, limiting their deployment in resource-constrained or real-time settings. To address this, we propose HierRouter, a hierarchical routing approach that dynamically assembles inference pipelines from a pool of specialized, lightweight language models. Formulated as a finite-horizon Markov Decision Process (MDP), our approach trains a Proximal Policy Optimization (PPO)-based reinforcement learning agent to iteratively select which models to invoke at each stage of multi-hop inference. The agent conditions on the evolving context and accumulated cost to make context-aware routing decisions. Experiments with three open-source candidate LLMs across six benchmarks, including QA, code generation, and mathematical reasoning, show that HierRouter improves response quality by up to 2.4x compared to using individual models independently, while incurring only a minimal additional inference cost on average. These results highlight the promise of hierarchical routing for cost-efficient, high-performance LLM inference. All codes can be found here this https URL Nikunj-Gupta/hierouter.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09897",
        "abs_url": "https://arxiv.org/abs/2511.09897",
        "pdf_url": "https://arxiv.org/pdf/2511.09897",
        "title": "Theory and computation for structured variational inference",
        "authors": [
            "Shunan Sheng",
            "Bohan Wu",
            "Bennett Zhu",
            "Sinho Chewi",
            "Aram-Alexandre Pooladian"
        ],
        "comments": "78 pages, 2 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Structured variational inference constitutes a core methodology in modern statistical applications. Unlike mean-field variational inference, the approximate posterior is assumed to have interdependent structure. We consider the natural setting of star-structured variational inference, where a root variable impacts all the other ones. We prove the first results for existence, uniqueness, and self-consistency of the variational approximation. In turn, we derive quantitative approximation error bounds for the variational approximation to the posterior, extending prior work from the mean-field setting to the star-structured setting. We also develop a gradient-based algorithm with provable guarantees for computing the variational approximation using ideas from optimal transport theory. We explore the implications of our results for Gaussian measures and hierarchical Bayesian models, including generalized linear models with location family priors and spike-and-slab priors with one-dimensional debiasing. As a by-product of our analysis, we develop new stability results for star-separable transport maps which might be of independent interest.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09906",
        "abs_url": "https://arxiv.org/abs/2511.09906",
        "pdf_url": "https://arxiv.org/pdf/2511.09906",
        "title": "Beyond empirical models: Discovering new constitutive laws in solids with graph-based equation discovery",
        "authors": [
            "Hao Xu",
            "Yuntian Chen",
            "Dongxiao Zhang"
        ],
        "comments": "",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG); Applied Physics (physics.app-ph); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "Constitutive models are fundamental to solid mechanics and materials science, underpinning the quantitative description and prediction of material responses under diverse loading conditions. Traditional phenomenological models, which are derived through empirical fitting, often lack generalizability and rely heavily on expert intuition and predefined functional forms. In this work, we propose a graph-based equation discovery framework for the automated discovery of constitutive laws directly from multisource experimental data. This framework expresses equations as directed graphs, where nodes represent operators and variables, edges denote computational relations, and edge features encode parametric dependencies. This enables the generation and optimization of free-form symbolic expressions with undetermined material-specific parameters. Through the proposed framework, we have discovered new constitutive models for strain-rate effects in alloy steel materials and the deformation behavior of lithium metal. Compared with conventional empirical models, these new models exhibit compact analytical structures and achieve higher accuracy. The proposed graph-based equation discovery framework provides a generalizable and interpretable approach for data-driven scientific modelling, particularly in contexts where traditional empirical formulations are inadequate for representing complex physical phenomena.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.09925",
        "abs_url": "https://arxiv.org/abs/2511.09925",
        "pdf_url": "https://arxiv.org/pdf/2511.09925",
        "title": "Global Convergence of Four-Layer Matrix Factorization under Random Initialization",
        "authors": [
            "Minrui Luo",
            "Weihang Xu",
            "Xiang Gao",
            "Maryam Fazel",
            "Simon Shaolei Du"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Gradient descent dynamics on the deep matrix factorization problem is extensively studied as a simplified theoretical model for deep neural networks. Although the convergence theory for two-layer matrix factorization is well-established, no global convergence guarantee for general deep matrix factorization under random initialization has been established to date. To address this gap, we provide a polynomial-time global convergence guarantee for randomly initialized gradient descent on four-layer matrix factorization, given certain conditions on the target matrix and a standard balanced regularization term. Our analysis employs new techniques to show saddle-avoidance properties of gradient decent dynamics, and extends previous theories to characterize the change in eigenvalues of layer weights.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10010",
        "abs_url": "https://arxiv.org/abs/2511.10010",
        "pdf_url": "https://arxiv.org/pdf/2511.10010",
        "title": "The Role of Advanced Computer Architectures in Accelerating Artificial Intelligence Workloads",
        "authors": [
            "Shahid Amin",
            "Syed Pervez Hussnain Shah"
        ],
        "comments": "16 Pages, 2 Figures",
        "subjects": "Hardware Architecture (cs.AR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "The remarkable progress in Artificial Intelligence (AI) is foundation-ally linked to a concurrent revolution in computer architecture. As AI models, particularly Deep Neural Networks (DNNs), have grown in complexity, their massive computational demands have pushed traditional architectures to their limits. This paper provides a structured review of this co-evolution, analyzing the architectural landscape designed to accelerate modern AI workloads. We explore the dominant architectural paradigms Graphics Processing Units (GPUs), Appli-cation-Specific Integrated Circuits (ASICs), and Field-Programmable Gate Ar-rays (FPGAs) by breaking down their design philosophies, key features, and per-formance trade-offs. The core principles essential for performance and energy efficiency, including dataflow optimization, advanced memory hierarchies, spar-sity, and quantization, are analyzed. Furthermore, this paper looks ahead to emerging technologies such as Processing-in-Memory (PIM) and neuromorphic computing, which may redefine future computation. By synthesizing architec-tural principles with quantitative performance data from industry-standard benchmarks, this survey presents a comprehensive picture of the AI accelerator landscape. We conclude that AI and computer architecture are in a symbiotic relationship, where hardware-software co-design is no longer an optimization but a necessity for future progress in computing.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10030",
        "abs_url": "https://arxiv.org/abs/2511.10030",
        "pdf_url": "https://arxiv.org/pdf/2511.10030",
        "title": "Multi-agent In-context Coordination via Decentralized Memory Retrieval",
        "authors": [
            "Tao Jiang",
            "Zichuan Lin",
            "Lihe Li",
            "Yi-Chen Li",
            "Cong Guan",
            "Lei Yuan",
            "Zongzhang Zhang",
            "Yang Yu",
            "Deheng Ye"
        ],
        "comments": "",
        "subjects": "Multiagent Systems (cs.MA); Machine Learning (cs.LG)",
        "abstract": "Large transformer models, trained on diverse datasets, have demonstrated impressive few-shot performance on previously unseen tasks without requiring parameter updates. This capability has also been explored in Reinforcement Learning (RL), where agents interact with the environment to retrieve context and maximize cumulative rewards, showcasing strong adaptability in complex settings. However, in cooperative Multi-Agent Reinforcement Learning (MARL), where agents must coordinate toward a shared goal, decentralized policy deployment can lead to mismatches in task alignment and reward assignment, limiting the efficiency of policy adaptation. To address this challenge, we introduce Multi-agent In-context Coordination via Decentralized Memory Retrieval (MAICC), a novel approach designed to enhance coordination by fast adaptation. Our method involves training a centralized embedding model to capture fine-grained trajectory representations, followed by decentralized models that approximate the centralized one to obtain team-level task information. Based on the learned embeddings, relevant trajectories are retrieved as context, which, combined with the agents' current sub-trajectories, inform decision-making. During decentralized execution, we introduce a novel memory mechanism that effectively balances test-time online data with offline memory. Based on the constructed memory, we propose a hybrid utility score that incorporates both individual- and team-level returns, ensuring credit assignment across agents. Extensive experiments on cooperative MARL benchmarks, including Level-Based Foraging (LBF) and SMAC (v1/v2), show that MAICC enables faster adaptation to unseen tasks compared to existing methods. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10079",
        "abs_url": "https://arxiv.org/abs/2511.10079",
        "pdf_url": "https://arxiv.org/pdf/2511.10079",
        "title": "Physics-informed Machine Learning for Static Friction Modeling in Robotic Manipulators Based on Kolmogorov-Arnold Networks",
        "authors": [
            "Yizheng Wang",
            "Timon Rabczuk",
            "Yinghua Liu"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Friction modeling plays a crucial role in achieving high-precision motion control in robotic operating systems. Traditional static friction models (such as the Stribeck model) are widely used due to their simple forms; however, they typically require predefined functional assumptions, which poses significant challenges when dealing with unknown functional structures. To address this issue, this paper proposes a physics-inspired machine learning approach based on the Kolmogorov Arnold Network (KAN) for static friction modeling of robotic joints. The method integrates spline activation functions with a symbolic regression mechanism, enabling model simplification and physical expression extraction through pruning and attribute scoring, while maintaining both high prediction accuracy and interpretability. We first validate the method's capability to accurately identify key parameters under known functional models, and further demonstrate its robustness and generalization ability under conditions with unknown functional structures and noisy data. Experiments conducted on both synthetic data and real friction data collected from a six-degree-of-freedom industrial manipulator show that the proposed method achieves a coefficient of determination greater than 0.95 across various tasks and successfully extracts concise and physically meaningful friction expressions. This study provides a new perspective for interpretable and data-driven robotic friction modeling with promising engineering applicability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10087",
        "abs_url": "https://arxiv.org/abs/2511.10087",
        "pdf_url": "https://arxiv.org/pdf/2511.10087",
        "title": "Opinion: Towards Unified Expressive Policy Optimization for Robust Robot Learning",
        "authors": [
            "Haidong Huang",
            "Haiyue Zhu. Jiayu Song",
            "Xixin Zhao",
            "Yaohua Zhou",
            "Jiayi Zhang",
            "Yuze Zhai",
            "Xiaocong Li"
        ],
        "comments": "Accepted by NeurIPS 2025 Workshop on Embodied World Models for Decision Making",
        "subjects": "Robotics (cs.RO); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Offline-to-online reinforcement learning (O2O-RL) has emerged as a promising paradigm for safe and efficient robotic policy deployment but suffers from two fundamental challenges: limited coverage of multimodal behaviors and distributional shifts during online adaptation. We propose UEPO, a unified generative framework inspired by large language model pretraining and fine-tuning strategies. Our contributions are threefold: (1) a multi-seed dynamics-aware diffusion policy that efficiently captures diverse modalities without training multiple models; (2) a dynamic divergence regularization mechanism that enforces physically meaningful policy diversity; and (3) a diffusion-based data augmentation module that enhances dynamics model generalization. On the D4RL benchmark, UEPO achieves +5.9\\% absolute improvement over Uni-O4 on locomotion tasks and +12.4\\% on dexterous manipulation, demonstrating strong generalization and scalability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10120",
        "abs_url": "https://arxiv.org/abs/2511.10120",
        "pdf_url": "https://arxiv.org/pdf/2511.10120",
        "title": "Generalizing to Unseen Disaster Events: A Causal View",
        "authors": [
            "Philipp Seeberger",
            "Steffen Freisinger",
            "Tobias Bocklet",
            "Korbinian Riedhammer"
        ],
        "comments": "Accepted to Findings of AACL 2025",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Due to the rapid growth of social media platforms, these tools have become essential for monitoring information during ongoing disaster events. However, extracting valuable insights requires real-time processing of vast amounts of data. A major challenge in existing systems is their exposure to event-related biases, which negatively affects their ability to generalize to emerging events. While recent advancements in debiasing and causal learning offer promising solutions, they remain underexplored in the disaster event domain. In this work, we approach bias mitigation through a causal lens and propose a method to reduce event- and domain-related biases, enhancing generalization to future events. Our approach outperforms multiple baselines by up to +1.9% F1 and significantly improves a PLM-based classifier across three disaster classification tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10233",
        "abs_url": "https://arxiv.org/abs/2511.10233",
        "pdf_url": "https://arxiv.org/pdf/2511.10233",
        "title": "Bridging Synthetic and Real Routing Problems via LLM-Guided Instance Generation and Progressive Adaptation",
        "authors": [
            "Jianghan Zhu",
            "Yaoxin Wu",
            "Zhuoyi Lin",
            "Zhengyuan Zhang",
            "Haiyan Yin",
            "Zhiguang Cao",
            "Senthilnath Jayavelu",
            "Xiaoli Li"
        ],
        "comments": "21 pages; To be published in AAAI-26",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Recent advances in Neural Combinatorial Optimization (NCO) methods have significantly improved the capability of neural solvers to handle synthetic routing instances. Nonetheless, existing neural solvers typically struggle to generalize effectively from synthetic, uniformly-distributed training data to real-world VRP scenarios, including widely recognized benchmark instances from TSPLib and CVRPLib. To bridge this generalization gap, we present Evolutionary Realistic Instance Synthesis (EvoReal), which leverages an evolutionary module guided by large language models (LLMs) to generate synthetic instances characterized by diverse and realistic structural patterns. Specifically, the evolutionary module produces synthetic instances whose structural attributes statistically mimics those observed in authentic real-world instances. Subsequently, pre-trained NCO models are progressively refined, firstly aligning them with these structurally enriched synthetic distributions and then further adapting them through direct fine-tuning on actual benchmark instances. Extensive experimental evaluations demonstrate that EvoReal markedly improves the generalization capabilities of state-of-the-art neural solvers, yielding a notable reduced performance gap compared to the optimal solutions on the TSPLib (1.05%) and CVRPLib (2.71%) benchmarks across a broad spectrum of problem scales.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10291",
        "abs_url": "https://arxiv.org/abs/2511.10291",
        "pdf_url": "https://arxiv.org/pdf/2511.10291",
        "title": "Causal Model-Based Reinforcement Learning for Sample-Efficient IoT Channel Access",
        "authors": [
            "Aswin Arun",
            "Christo Kurisummoottil Thomas",
            "Rimalpudi Sarvendranath",
            "Walid Saad"
        ],
        "comments": "",
        "subjects": "Information Theory (cs.IT); Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "Despite the advantages of multi-agent reinforcement learning (MARL) for wireless use case such as medium access control (MAC), their real-world deployment in Internet of Things (IoT) is hindered by their sample inefficiency. To alleviate this challenge, one can leverage model-based reinforcement learning (MBRL) solutions, however, conventional MBRL approaches rely on black-box models that are not interpretable and cannot reason. In contrast, in this paper, a novel causal model-based MARL framework is developed by leveraging tools from causal learn- ing. In particular, the proposed model can explicitly represent causal dependencies between network variables using structural causal models (SCMs) and attention-based inference networks. Interpretable causal models are then developed to capture how MAC control messages influence observations, how transmission actions determine outcomes, and how channel observations affect rewards. Data augmentation techniques are then used to generate synthetic rollouts using the learned causal model for policy optimization via proximal policy optimization (PPO). Analytical results demonstrate exponential sample complexity gains of causal MBRL over black-box approaches. Extensive simulations demonstrate that, on average, the proposed approach can reduce environment interactions by 58%, and yield faster convergence compared to model-free baselines. The proposed approach inherently is also shown to provide interpretable scheduling decisions via attention-based causal attribution, revealing which network conditions drive the policy. The resulting combination of sample efficiency and interpretability establishes causal MBRL as a practical approach for resource-constrained wireless systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10296",
        "abs_url": "https://arxiv.org/abs/2511.10296",
        "pdf_url": "https://arxiv.org/pdf/2511.10296",
        "title": "Fault Detection in Solar Thermal Systems using Probabilistic Reconstructions",
        "authors": [
            "Florian Ebmeier",
            "Nicole Ludwig",
            "Jannik Thuemmel",
            "Georg Martius",
            "Volker H. Franz"
        ],
        "comments": "",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "Solar thermal systems (STS) present a promising avenue for low-carbon heat generation, with a well-running system providing heat at minimal cost and carbon emissions. However, STS can exhibit faults due to improper installation, maintenance, or operation, often resulting in a substantial reduction in efficiency or even damage to the system. As monitoring at the individual level is economically prohibitive for small-scale systems, automated monitoring and fault detection should be used to address such issues. Recent advances in data-driven anomaly detection, particularly in time series analysis, offer a cost-effective solution by leveraging existing sensors to identify abnormal system states. Here, we propose a probabilistic reconstruction-based framework for anomaly detection. We evaluate our method on the publicly available PaSTS dataset of operational domestic STS, which features real-world complexities and diverse fault types. Our experiments show that reconstruction-based methods can detect faults in domestic STS both qualitatively and quantitatively, while generalizing to previously unseen systems. We also demonstrate that our model outperforms both simple and more complex deep learning baselines. Additionally, we show that heteroscedastic uncertainty estimation is essential to fault detection performance. Finally, we discuss the engineering overhead required to unlock these improvements and make a case for simple deep learning models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10370",
        "abs_url": "https://arxiv.org/abs/2511.10370",
        "pdf_url": "https://arxiv.org/pdf/2511.10370",
        "title": "SHRUG-FM: Reliability-Aware Foundation Models for Earth Observation",
        "authors": [
            "Kai-Hendrik Cohrs",
            "Zuzanna Osika",
            "Maria Gonzalez-Calabuig",
            "Vishal Nedungadi",
            "Ruben Cartuyvels",
            "Steffen Knoblauch",
            "Joppe Massant",
            "Shruti Nath",
            "Patrick Ebel",
            "Vasileios Sitokonstantinou"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Geospatial foundation models for Earth observation often fail to perform reliably in environments underrepresented during pretraining. We introduce SHRUG-FM, a framework for reliability-aware prediction that integrates three complementary signals: out-of-distribution (OOD) detection in the input space, OOD detection in the embedding space and task-specific predictive uncertainty. Applied to burn scar segmentation, SHRUG-FM shows that OOD scores correlate with lower performance in specific environmental conditions, while uncertainty-based flags help discard many poorly performing predictions. Linking these flags to land cover attributes from HydroATLAS shows that failures are not random but concentrated in certain geographies, such as low-elevation zones and large river areas, likely due to underrepresentation in pretraining data. SHRUG-FM provides a pathway toward safer and more interpretable deployment of GFMs in climate-sensitive applications, helping bridge the gap between benchmark performance and real-world reliability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10383",
        "abs_url": "https://arxiv.org/abs/2511.10383",
        "pdf_url": "https://arxiv.org/pdf/2511.10383",
        "title": "Operator Models for Continuous-Time Offline Reinforcement Learning",
        "authors": [
            "Nicolas Hoischen",
            "Petar Bevanda",
            "Max Beier",
            "Stefan Sosnowski",
            "Boris Houska",
            "Sandra Hirche"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Systems and Control (eess.SY); Optimization and Control (math.OC)",
        "abstract": "Continuous-time stochastic processes underlie many natural and engineered systems. In healthcare, autonomous driving, and industrial control, direct interaction with the environment is often unsafe or impractical, motivating offline reinforcement learning from historical data. However, there is limited statistical understanding of the approximation errors inherent in learning policies from offline datasets. We address this by linking reinforcement learning to the Hamilton-Jacobi-Bellman equation and proposing an operator-theoretic algorithm based on a simple dynamic programming recursion. Specifically, we represent our world model in terms of the infinitesimal generator of controlled diffusion processes learned in a reproducing kernel Hilbert space. By integrating statistical learning methods and operator theory, we establish global convergence of the value function and derive finite-sample guarantees with bounds tied to system properties such as smoothness and stability. Our theoretical and numerical results indicate that operator-based approaches may hold promise in solving offline reinforcement learning using continuous-time optimal control.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10416",
        "abs_url": "https://arxiv.org/abs/2511.10416",
        "pdf_url": "https://arxiv.org/pdf/2511.10416",
        "title": "Generalizing Analogical Inference from Boolean to Continuous Domains",
        "authors": [
            "Francisco Cunha",
            "Yves Lepage",
            "Zied Bouraoui",
            "Miguel Couceiro"
        ],
        "comments": "11 pages, to appear in AAAI 2026, extended version",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Analogical reasoning is a powerful inductive mechanism, widely used in human cognition and increasingly applied in artificial intelligence. Formal frameworks for analogical inference have been developed for Boolean domains, where inference is provably sound for affine functions and approximately correct for functions close to affine. These results have informed the design of analogy-based classifiers. However, they do not extend to regression tasks or continuous domains. In this paper, we revisit analogical inference from a foundational perspective. We first present a counterexample showing that existing generalization bounds fail even in the Boolean setting. We then introduce a unified framework for analogical reasoning in real-valued domains based on parameterized analogies defined via generalized means. This model subsumes both Boolean classification and regression, and supports analogical inference over continuous functions. We characterize the class of analogy-preserving functions in this setting and derive both worst-case and average-case error bounds under smoothness assumptions. Our results offer a general theory of analogical inference across discrete and continuous domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 113,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10446",
        "abs_url": "https://arxiv.org/abs/2511.10446",
        "pdf_url": "https://arxiv.org/pdf/2511.10446",
        "title": "Continuum Dropout for Neural Differential Equations",
        "authors": [
            "Jonghun Lee",
            "YongKyung Oh",
            "Sungil Kim",
            "Dong-Young Lim"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Neural Differential Equations (NDEs) excel at modeling continuous-time dynamics, effectively handling challenges such as irregular observations, missing values, and noise. Despite their advantages, NDEs face a fundamental challenge in adopting dropout, a cornerstone of deep learning regularization, making them susceptible to overfitting. To address this research gap, we introduce Continuum Dropout, a universally applicable regularization technique for NDEs built upon the theory of alternating renewal processes. Continuum Dropout formulates the on-off mechanism of dropout as a stochastic process that alternates between active (evolution) and inactive (paused) states in continuous time. This provides a principled approach to prevent overfitting and enhance the generalization capabilities of NDEs. Moreover, Continuum Dropout offers a structured framework to quantify predictive uncertainty via Monte Carlo sampling at test time. Through extensive experiments, we demonstrate that Continuum Dropout outperforms existing regularization methods for NDEs, achieving superior performance on various time series and image classification tasks. It also yields better-calibrated and more trustworthy probability estimates, highlighting its effectiveness for uncertainty-aware modeling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 114,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10492",
        "abs_url": "https://arxiv.org/abs/2511.10492",
        "pdf_url": "https://arxiv.org/pdf/2511.10492",
        "title": "Don't Waste It: Guiding Generative Recommenders with Structured Human Priors via Multi-head Decoding",
        "authors": [
            "Yunkai Zhang",
            "Qiang Zhang",
            "Feng",
            "Ruizhong Qiu",
            "Hanchao Yu",
            "Jason Liu",
            "Yinglong Xia",
            "Zhuoran Yu",
            "Zeyu Zheng",
            "Diji Yang"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Optimizing recommender systems for objectives beyond accuracy, such as diversity, novelty, and personalization, is crucial for long-term user satisfaction. To this end, industrial practitioners have accumulated vast amounts of structured domain knowledge, which we term human priors (e.g., item taxonomies, temporal patterns). This knowledge is typically applied through post-hoc adjustments during ranking or post-ranking. However, this approach remains decoupled from the core model learning, which is particularly undesirable as the industry shifts to end-to-end generative recommendation foundation models. On the other hand, many methods targeting these beyond-accuracy objectives often require architecture-specific modifications and discard these valuable human priors by learning user intent in a fully unsupervised manner. Instead of discarding the human priors accumulated over years of practice, we introduce a backbone-agnostic framework that seamlessly integrates these human priors directly into the end-to-end training of generative recommenders. With lightweight, prior-conditioned adapter heads inspired by efficient LLM decoding strategies, our approach guides the model to disentangle user intent along human-understandable axes (e.g., interaction types, long- vs. short-term interests). We also introduce a hierarchical composition strategy for modeling complex interactions across different prior types. Extensive experiments on three large-scale datasets demonstrate that our method significantly enhances both accuracy and beyond-accuracy objectives. We also show that human priors allow the backbone model to more effectively leverage longer context lengths and larger model sizes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 115,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10540",
        "abs_url": "https://arxiv.org/abs/2511.10540",
        "pdf_url": "https://arxiv.org/pdf/2511.10540",
        "title": "Edge Machine Learning for Cluster Counting in Next-Generation Drift Chambers",
        "authors": [
            "Deniz Yilmaz",
            "Liangyu Wu",
            "Julia Gonski"
        ],
        "comments": "6 pages, 3 figures, 1 table. Machine Learning and the Physical Sciences Workshop, NeurIPS 2025",
        "subjects": "Instrumentation and Detectors (physics.ins-det); Machine Learning (cs.LG)",
        "abstract": "Drift chambers have long been central to collider tracking, but future machines like a Higgs factory motivate higher granularity and cluster counting for particle ID, posing new data processing challenges. Machine learning (ML) at the \"edge\", or in cell-level readout, can dramatically reduce the off-detector data rate for high-granularity drift chambers by performing cluster counting at-source. We present machine learning algorithms for cluster counting in real-time readout of future drift chambers. These algorithms outperform traditional derivative-based techniques based on achievable pion-kaon separation. When synthesized to FPGA resources, they can achieve latencies consistent with real-time operation in a future Higgs factory scenario, thus advancing both R&D for future collider detectors as well as hardware-based ML for edge applications in high energy physics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 116,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10542",
        "abs_url": "https://arxiv.org/abs/2511.10542",
        "pdf_url": "https://arxiv.org/pdf/2511.10542",
        "title": "Two Americas of Well-Being: Divergent Rural-Urban Patterns of Life Satisfaction and Happiness from 2.6 B Social Media Posts",
        "authors": [
            "Stefano Maria Iacus",
            "Giuseppe Porro"
        ],
        "comments": "",
        "subjects": "Social and Information Networks (cs.SI); Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "Using 2.6 billion geolocated social-media posts (2014-2022) and a fine-tuned generative language model, we construct county-level indicators of life satisfaction and happiness for the United States. We document an apparent rural-urban paradox: rural counties express higher life satisfaction while urban counties exhibit greater happiness. We reconcile this by treating the two as distinct layers of subjective well-being, evaluative vs. hedonic, showing that each maps differently onto place, politics, and time. Republican-leaning areas appear more satisfied in evaluative terms, but partisan gaps in happiness largely flatten outside major metros, indicating context-dependent political effects. Temporal shocks dominate the hedonic layer: happiness falls sharply during 2020-2022, whereas life satisfaction moves more modestly. These patterns are robust across logistic and OLS specifications and align with well-being theory. Interpreted as associations for the population of social-media posts, the results show that large-scale, language-based indicators can resolve conflicting findings about the rural-urban divide by distinguishing the type of well-being expressed, offering a transparent, reproducible complement to traditional surveys.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 117,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10572",
        "abs_url": "https://arxiv.org/abs/2511.10572",
        "pdf_url": "https://arxiv.org/pdf/2511.10572",
        "title": "Bi-Level Contextual Bandits for Individualized Resource Allocation under Delayed Feedback",
        "authors": [
            "Mohammadsina Almasi",
            "Hadis Anahideh"
        ],
        "comments": "Accepted at AAAI-26 (AISI Track). Final version to appear in the Proceedings of the AAAI Conference on Artificial Intelligence (AAAI-26), 2026",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Equitably allocating limited resources in high-stakes domains-such as education, employment, and healthcare-requires balancing short-term utility with long-term impact, while accounting for delayed outcomes, hidden heterogeneity, and ethical constraints. However, most learning-based allocation frameworks either assume immediate feedback or ignore the complex interplay between individual characteristics and intervention dynamics. We propose a novel bi-level contextual bandit framework for individualized resource allocation under delayed feedback, designed to operate in real-world settings with dynamic populations, capacity constraints, and time-sensitive impact. At the meta level, the model optimizes subgroup-level budget allocations to satisfy fairness and operational constraints. At the base level, it identifies the most responsive individuals within each group using a neural network trained on observational data, while respecting cooldown windows and delayed treatment effects modeled via resource-specific delay kernels. By explicitly modeling temporal dynamics and feedback delays, the algorithm continually refines its policy as new data arrive, enabling more responsive and adaptive decision-making. We validate our approach on two real-world datasets from education and workforce development, showing that it achieves higher cumulative outcomes, better adapts to delay structures, and ensures equitable distribution across subgroups. Our results highlight the potential of delay-aware, data-driven decision-making systems to improve institutional policy and social welfare.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 118,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10618",
        "abs_url": "https://arxiv.org/abs/2511.10618",
        "pdf_url": "https://arxiv.org/pdf/2511.10618",
        "title": "Know Your Limits: Entropy Estimation Modeling for Compression and Generalization",
        "authors": [
            "Benjamin L. Badger",
            "Matthew Neligeorge"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "Language prediction is constrained by informational entropy intrinsic to language, such that there exists a limit to how accurate any language model can become and equivalently a lower bound to language compression. The most efficient language compression algorithms today are causal (next token prediction) large language models, but the use of these models to form accurate estimates of language entropy is currently computationally infeasible. We introduce encoder-augmented causal decoder model architectures that exhibit superior training efficiency characteristics and achieve higher compression than causal transformers even when trained on modest hardware. We demonstrate how entropy estimates can be obtained on a per-token basis, and show that the generalization of models trained to approach the entropy of their training data necessarily exceeds the generalization of models trained to minimize loss beyond this value. We show empirically that causal models trained to approach but not exceed estimated per-token entropies exhibit greater generalization than models trained without taking entropy into account.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 119,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10626",
        "abs_url": "https://arxiv.org/abs/2511.10626",
        "pdf_url": "https://arxiv.org/pdf/2511.10626",
        "title": "Global Solutions to Non-Convex Functional Constrained Problems with Hidden Convexity",
        "authors": [
            "Ilyas Fatkhullin",
            "Niao He",
            "Guanghui Lan",
            "Florian Wolf"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "Constrained non-convex optimization is fundamentally challenging, as global solutions are generally intractable and constraint qualifications may not hold. However, in many applications, including safe policy optimization in control and reinforcement learning, such problems possess hidden convexity, meaning they can be reformulated as convex programs via a nonlinear invertible transformation. Typically such transformations are implicit or unknown, making the direct link with the convex program impossible. On the other hand, (sub-)gradients with respect to the original variables are often accessible or can be easily estimated, which motivates algorithms that operate directly in the original (non-convex) problem space using standard (sub-)gradient oracles. In this work, we develop the first algorithms to provably solve such non-convex problems to global minima. First, using a modified inexact proximal point method, we establish global last-iterate convergence guarantees with $\\widetilde{\\mathcal{O}}(\\varepsilon^{-3})$ oracle complexity in non-smooth setting. For smooth problems, we propose a new bundle-level type method based on linearly constrained quadratic subproblems, improving the oracle complexity to $\\widetilde{\\mathcal{O}}(\\varepsilon^{-1})$. Surprisingly, despite non-convexity, our methodology does not require any constraint qualifications, can handle hidden convex equality constraints, and achieves complexities matching those for solving unconstrained hidden convex optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 120,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10628",
        "abs_url": "https://arxiv.org/abs/2511.10628",
        "pdf_url": "https://arxiv.org/pdf/2511.10628",
        "title": "Instella: Fully Open Language Models with Stellar Performance",
        "authors": [
            "Jiang Liu",
            "Jialian Wu",
            "Xiaodong Yu",
            "Yusheng Su",
            "Prakamya Mishra",
            "Gowtham Ramesh",
            "Sudhanshu Ranjan",
            "Chaitanya Manem",
            "Ximeng Sun",
            "Ze Wang",
            "Pratik Prabhanjan Brahma",
            "Zicheng Liu",
            "Emad Barsoum"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) have demonstrated remarkable performance across a wide range of tasks, yet the majority of high-performing models remain closed-source or partially open, limiting transparency and reproducibility. In this work, we introduce Instella, a family of fully open three billion parameter language models trained entirely on openly available data and codebase. Powered by AMD Instinct MI300X GPUs, Instella is developed through large-scale pre-training, general-purpose instruction tuning, and alignment with human preferences. Despite using substantially fewer pre-training tokens than many contemporaries, Instella achieves state-of-the-art results among fully open models and is competitive with leading open-weight models of comparable size. We further release two specialized variants: Instella-Long, capable of handling context lengths up to 128K tokens, and Instella-Math, a reasoning-focused model enhanced through supervised fine-tuning and reinforcement learning on mathematical tasks. Together, these contributions establish Instella as a transparent, performant, and versatile alternative for the community, advancing the goal of open and reproducible language modeling research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 121,
        "date": "2025-11-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-14?abs=True",
        "arxiv_id": "2511.10635",
        "abs_url": "https://arxiv.org/abs/2511.10635",
        "pdf_url": "https://arxiv.org/pdf/2511.10635",
        "title": "Robot Crash Course: Learning Soft and Stylized Falling",
        "authors": [
            "Pascal Strauch",
            "David Müller",
            "Sammy Christen",
            "Agon Serifi",
            "Ruben Grandia",
            "Espen Knoop",
            "Moritz Bächer"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Despite recent advances in robust locomotion, bipedal robots operating in the real world remain at risk of falling. While most research focuses on preventing such events, we instead concentrate on the phenomenon of falling itself. Specifically, we aim to reduce physical damage to the robot while providing users with control over a robot's end pose. To this end, we propose a robot agnostic reward function that balances the achievement of a desired end pose with impact minimization and the protection of critical robot parts during reinforcement learning. To make the policy robust to a broad range of initial falling conditions and to enable the specification of an arbitrary and unseen end pose at inference time, we introduce a simulation-based sampling strategy of initial and end poses. Through simulated and real-world experiments, our work demonstrates that even bipedal robots can perform controlled, soft falls.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]