[
    {
        "order": 1,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08950",
        "abs_url": "https://arxiv.org/abs/2512.08950",
        "pdf_url": "https://arxiv.org/pdf/2512.08950",
        "title": "Optimizing Algorithms for Mobile Health Interventions with Active Querying Optimization",
        "authors": [
            "Aseel Rawashdeh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Reinforcement learning in mobile health (mHealth) interventions requires balancing intervention efficacy with user burden, particularly when state measurements (for example, user surveys or feedback) are costly yet essential. The Act-Then-Measure (ATM) heuristic addresses this challenge by decoupling control and measurement actions within the Action-Contingent Noiselessly Observable Markov Decision Process (ACNO-MDP) framework. However, the standard ATM algorithm relies on a temporal-difference-inspired Q-learning method, which is prone to instability in sparse and noisy environments. In this work, we propose a Bayesian extension to ATM that replaces standard Q-learning with a Kalman filter-style Bayesian update, maintaining uncertainty-aware estimates of Q-values and enabling more stable and sample-efficient learning. We evaluate our method in both toy environments and clinically motivated testbeds. In small, tabular environments, Bayesian ATM achieves comparable or improved scalarized returns with substantially lower variance and more stable policy behavior. In contrast, in larger and more complex mHealth settings, both the standard and Bayesian ATM variants perform poorly, suggesting a mismatch between ATM's modeling assumptions and the structural challenges of real-world mHealth domains. These findings highlight the value of uncertainty-aware methods in low-data settings while underscoring the need for new RL algorithms that explicitly model causal structure, continuous states, and delayed feedback under observation cost constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08954",
        "abs_url": "https://arxiv.org/abs/2512.08954",
        "pdf_url": "https://arxiv.org/pdf/2512.08954",
        "title": "An Electrocardiogram Multi-task Benchmark with Comprehensive Evaluations and Insightful Findings",
        "authors": [
            "Yuhao Xu",
            "Jiaying Lu",
            "Sirui Ding",
            "Defu Cao",
            "Xiao Hu",
            "Carl Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "In the process of patient diagnosis, non-invasive measurements are widely used due to their low risks and quick results. Electrocardiogram (ECG), as a non-invasive method to collect heart activities, is used to diagnose cardiac conditions. Analyzing the ECG typically requires domain expertise, which is a roadblock to applying artificial intelligence (AI) for healthcare. Through advances in self-supervised learning and foundation models, AI systems can now acquire and leverage domain knowledge without relying solely on human expertise. However, there is a lack of comprehensive analyses over the foundation models' performance on ECG. This study aims to answer the research question: \"Are Foundation Models Useful for ECG Analysis?\" To address it, we evaluate language/general time-series/ECG foundation models in comparison with time-series deep learning models. The experimental results show that general time-series/ECG foundation models achieve a top performance rate of 80%, indicating their effectiveness in ECG analysis. In-depth analyses and insights are provided along with comprehensive experimental results. This study highlights the limitations and potential of foundation models in advancing physiological waveform analysis. The data and code for this benchmark are publicly available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08956",
        "abs_url": "https://arxiv.org/abs/2512.08956",
        "pdf_url": "https://arxiv.org/pdf/2512.08956",
        "title": "DW-KNN: A Transparent Local Classifier Integrating Distance Consistency and Neighbor Reliability",
        "authors": [
            "Kumarjit Pathak",
            "Karthik K",
            "Sachin Madan",
            "Jitin Kapila"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "K-Nearest Neighbors (KNN) is one of the most used ML classifiers. However, if we observe closely, standard distance-weighted KNN and relative variants assume all 'k' neighbors are equally reliable. In heterogeneous feature space, this becomes a limitation that hinders reliability in predicting true levels of the observation. We propose DW-KNN (Double Weighted KNN), a transparent and robust variant that integrates exponential distance with neighbor validity. This enables instance-level interpretability, suppresses noisy or mislabeled samples, and reduces hyperparameter sensitivity. Comprehensive evaluation on 9 data-sets helps to demonstrate that DW-KNN achieves 0.8988 accuracy on average. It ranks 2nd among six methods and within 0.2% of the best-performing Ensemble KNN. It also exhibits the lowest cross-validation variance (0.0156), indicating reliable prediction stability. Statistical significance test confirmed ($p < 0.001$) improvement over compactness weighted KNN (+4.09\\%) and Kernel weighted KNN (+1.13\\%). The method provides a simple yet effective alternative to complex adaptive schemes, particularly valuable for high-stakes applications requiring explainable predictions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08959",
        "abs_url": "https://arxiv.org/abs/2512.08959",
        "pdf_url": "https://arxiv.org/pdf/2512.08959",
        "title": "EEG-Bench: A Benchmark for EEG Foundation Models in Clinical Applications",
        "authors": [
            "Ard Kastrati",
            "Josua Bürki",
            "Jonas Lauer",
            "Cheng Xuan",
            "Raffaele Iaquinto",
            "Roger Wattenhofer"
        ],
        "comments": "Foundation Models for the Brain and Body (BrainBodyFM@NeurIPS)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We introduce a unified benchmarking framework focused on evaluating EEG-based foundation models in clinical applications. The benchmark spans 11 well-defined diagnostic tasks across 14 publicly available EEG datasets, including epilepsy, schizophrenia, Parkinson's disease, OCD, and mild traumatic brain injury. It features minimal preprocessing, standardized evaluation protocols, and enables side-by-side comparisons of classical baselines and modern foundation models. Our results show that while foundation models achieve strong performance in certain settings, simpler models often remain competitive, particularly under clinical distribution shifts. To facilitate reproducibility and adoption, we release all prepared data and code in an accessible and extensible format.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08964",
        "abs_url": "https://arxiv.org/abs/2512.08964",
        "pdf_url": "https://arxiv.org/pdf/2512.08964",
        "title": "SEA: Spectral Edge Attacks on Graph Neural Networks",
        "authors": [
            "Yongyu Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph Neural Networks (GNNs) achieve strong performance on graph-structured data, but are notoriously vulnerable to small, carefully crafted perturbations of the graph structure. Most existing structure-based attacks rely on gradient-based heuristics or local connectivity patterns, and treat edges as equally important candidates for manipulation. In this paper, we propose Spectral Edge Attacks (SEA), a new family of adversarial attacks that explicitly leverage spectral robustness evaluation to guide structural perturbations. Our key idea is to compute a spectral embedding that captures the most fragile directions of the input manifold and to use it to assign a robustness score to each edge or non-edge. Based on these scores, we introduce two complementary attack variants: (i) a Spade-guided deletion attack that removes the most spectrally robust edges, and (ii) a Spade-guided addition attack that inserts edges between nodes that are maximally incompatible in the fragile spectral space. Both attacks operate at the graph level, are model-aware but conceptually simple, and can be plugged into existing GNN architectures without requiring gradients. We describe the spectral formulation, the attack algorithms, and experiments on benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08967",
        "abs_url": "https://arxiv.org/abs/2512.08967",
        "pdf_url": "https://arxiv.org/pdf/2512.08967",
        "title": "CluCERT: Certifying LLM Robustness via Clustering-Guided Denoising Smoothing",
        "authors": [
            "Zixia Wang",
            "Gaojie Jin",
            "Jia Hu",
            "Ronghui Mu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Recent advancements in Large Language Models (LLMs) have led to their widespread adoption in daily applications. Despite their impressive capabilities, they remain vulnerable to adversarial attacks, as even minor meaning-preserving changes such as synonym substitutions can lead to incorrect predictions. As a result, certifying the robustness of LLMs against such adversarial prompts is of vital importance. Existing approaches focused on word deletion or simple denoising strategies to achieve robustness certification. However, these methods face two critical limitations: (1) they yield loose robustness bounds due to the lack of semantic validation for perturbed outputs and (2) they suffer from high computational costs due to repeated sampling. To address these limitations, we propose CluCERT, a novel framework for certifying LLM robustness via clustering-guided denoising smoothing. Specifically, to achieve tighter certified bounds, we introduce a semantic clustering filter that reduces noisy samples and retains meaningful perturbations, supported by theoretical analysis. Furthermore, we enhance computational efficiency through two mechanisms: a refine module that extracts core semantics, and a fast synonym substitution strategy that accelerates the denoising process. Finally, we conduct extensive experiments on various downstream tasks and jailbreak defense scenarios. Experimental results demonstrate that our method outperforms existing certified approaches in both robustness bounds and computational efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08968",
        "abs_url": "https://arxiv.org/abs/2512.08968",
        "pdf_url": "https://arxiv.org/pdf/2512.08968",
        "title": "StructuredDNA: A Bio-Physical Framework for Energy-Aware Transformer Routing",
        "authors": [
            "Mustapha Hamdi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The rapid scaling of large computational models has led to a critical increase in energy and compute costs. Inspired by biological systems where structure and function emerge from low-energy configurations, we introduce StructuredDNA, a sparse architecture framework for modular, energy-aware Transformer routing. StructuredDNA replaces dense Mixture-of-Experts routing with a bio-physical, energy-guided routing layer based on semantic energy minimization. Inputs are dynamically grouped into semantic codons, and routing selects a single expert by minimizing a global energy functional that combines cohesion, uncertainty, and computational cost. We validate StructuredDNA on both specialized (BioASQ) and open-domain benchmarks (WikiText-103). On BioASQ (K = 50), we achieve a 97.7% reduction in Energy Utilization Density (EUD) and a Semantic Stability Index (SSI) of 0.998. We further demonstrate a Semantic Scaling Law on WikiText-103, showing that the architecture generalizes to open domains by scaling expert granularity (K = 2048) while maintaining more than 99% energy efficiency. StructuredDNA thus establishes a robust, domain-agnostic paradigm for future sparse computational frameworks. StructuredDNA provides an explicit link between bio-physical principles and sparse expert routing in Transformer architectures, and points toward future energy-aware, modular, and scalable computational systems. We discuss limitations of this proof-of-concept study and outline directions for scaling the approach to larger models, datasets, and hardware platforms. The StructuredDNA implementation is available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08976",
        "abs_url": "https://arxiv.org/abs/2512.08976",
        "pdf_url": "https://arxiv.org/pdf/2512.08976",
        "title": "Peek-a-Boo Reasoning: Contrastive Region Masking in MLLMs",
        "authors": [
            "Isha Chaturvedi",
            "Anjana Nair",
            "Yushen Li",
            "Adhitya Rajendra Kumar",
            "Kevin Zhu",
            "Sunishchal Dev",
            "Ashwinee Panda",
            "Vasu Sharma"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We introduce Contrastive Region Masking (CRM), a training free diagnostic that reveals how multimodal large language models (MLLMs) depend on specific visual regions at each step of chain-of-thought (CoT) reasoning. Unlike prior approaches limited to final answers or attention maps, CRM provides causal, step-level attri- bution by systematically masking annotated regions and contrasting the resulting reasoning traces with unmasked baselines. Applied to datasets such as VisArgs, CRM reveals distinct failure modes: some models preserve reasoning structure, but hallucinate when evidence is missing, while others ground tightly to visual cues yet collapse under perturbations. By shifting the evaluation from correctness of an- swers to faithfulness of reasoning, CRM reframes visual benchmarks as diagnostic tools, highlighting the need for multimodal evaluation frameworks that measure not just performance, but also robustness and fidelity of reasoning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09013",
        "abs_url": "https://arxiv.org/abs/2512.09013",
        "pdf_url": "https://arxiv.org/pdf/2512.09013",
        "title": "Graph Deep Learning for Intracranial Aneurysm Blood Flow Simulation and Risk Assessment",
        "authors": [
            "Paul Garnier",
            "Pablo Jeken-Rico",
            "Vincent Lannelongue",
            "Chiara Faitini",
            "Aurèle Goetz",
            "Lea Chanvillard",
            "Ramy Nemer",
            "Jonathan Viquerat",
            "Ugo Pelissier",
            "Philippe Meliga",
            "Jacques Sédat",
            "Thomas Liebig",
            "Yves Chau",
            "Elie Hachem"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Fluid Dynamics (physics.flu-dyn)",
        "abstract": "Intracranial aneurysms remain a major cause of neurological morbidity and mortality worldwide, where rupture risk is tightly coupled to local hemodynamics particularly wall shear stress and oscillatory shear index. Conventional computational fluid dynamics simulations provide accurate insights but are prohibitively slow and require specialized expertise. Clinical imaging alternatives such as 4D Flow MRI offer direct in-vivo measurements, yet their spatial resolution remains insufficient to capture the fine-scale shear patterns that drive endothelial remodeling and rupture risk while being extremely impractical and expensive. We present a graph neural network surrogate model that bridges this gap by reproducing full-field hemodynamics directly from vascular geometries in less than one minute per cardiac cycle. Trained on a comprehensive dataset of high-fidelity simulations of patient-specific aneurysms, our architecture combines graph transformers with autoregressive predictions to accurately simulate blood flow, wall shear stress, and oscillatory shear index. The model generalizes across unseen patient geometries and inflow conditions without mesh-specific calibration. Beyond accelerating simulation, our framework establishes the foundation for clinically interpretable hemodynamic prediction. By enabling near real-time inference integrated with existing imaging pipelines, it allows direct comparison with hospital phase-diagram assessments and extends them with physically grounded, high-resolution flow fields. This work transforms high-fidelity simulations from an expert-only research tool into a deployable, data-driven decision support system. Our full pipeline delivers high-resolution hemodynamic predictions within minutes of patient imaging, without requiring computational specialists, marking a step-change toward real-time, bedside aneurysm analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09054",
        "abs_url": "https://arxiv.org/abs/2512.09054",
        "pdf_url": "https://arxiv.org/pdf/2512.09054",
        "title": "Improving Multi-Class Calibration through Normalization-Aware Isotonic Techniques",
        "authors": [
            "Alon Arad",
            "Saharon Rosset"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate and reliable probability predictions are essential for multi-class supervised learning tasks, where well-calibrated models enable rational decision-making. While isotonic regression has proven effective for binary calibration, its extension to multi-class problems via one-vs-rest calibration produced suboptimal results when compared to parametric methods, limiting its practical adoption. In this work, we propose novel isotonic normalization-aware techniques for multiclass calibration, grounded in natural and intuitive assumptions expected by practitioners. Unlike prior approaches, our methods inherently account for probability normalization by either incorporating normalization directly into the optimization process (NA-FIR) or modeling the problem as a cumulative bivariate isotonic regression (SCIR). Empirical evaluation on a variety of text and image classification datasets across different model architectures reveals that our approach consistently improves negative log-likelihood (NLL) and expected calibration error (ECE) metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09059",
        "abs_url": "https://arxiv.org/abs/2512.09059",
        "pdf_url": "https://arxiv.org/pdf/2512.09059",
        "title": "A Diffusion-Based Framework for High-Resolution Precipitation Forecasting over CONUS",
        "authors": [
            "Marina Vicens-Miquel",
            "Amy McGovern",
            "Aaron J. Hill",
            "Efi Foufoula-Georgiou",
            "Clement Guilloteau",
            "Samuel S. P. Shen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate precipitation forecasting is essential for hydrometeorological risk management, especially for anticipating extreme rainfall that can lead to flash flooding and infrastructure damage. This study introduces a diffusion-based deep learning (DL) framework that systematically compares three residual prediction strategies differing only in their input sources: (1) a fully data-driven model using only past observations from the Multi-Radar Multi-Sensor (MRMS) system, (2) a corrective model using only forecasts from the High-Resolution Rapid Refresh (HRRR) numerical weather prediction system, and (3) a hybrid model integrating both MRMS and selected HRRR forecast variables. By evaluating these approaches under a unified setup, we provide a clearer understanding of how each data source contributes to predictive skill over the Continental United States (CONUS). Forecasts are produced at 1-km spatial resolution, beginning with direct 1-hour predictions and extending to 12 hours using autoregressive rollouts. Performance is evaluated using both CONUS-wide and region-specific metrics that assess overall performance and skill at extreme rainfall thresholds. Across all lead times, our DL framework consistently outperforms the HRRR baseline in pixel-wise and spatiostatistical metrics. The hybrid model performs best at the shortest lead time, while the HRRR-corrective model outperforms others at longer lead times, maintaining high skill through 12 hours. To assess reliability, we incorporate calibrated uncertainty quantification tailored to the residual learning setup. These gains, particularly at longer lead times, are critical for emergency preparedness, where modest increases in forecast horizon can improve decision-making. This work advances DL-based precipitation forecasting by enhancing predictive skill, reliability, and applicability across regions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09067",
        "abs_url": "https://arxiv.org/abs/2512.09067",
        "pdf_url": "https://arxiv.org/pdf/2512.09067",
        "title": "Contrast transfer functions help quantify neural network out-of-distribution generalization in HRTEM",
        "authors": [
            "Luis Rangel DaCosta",
            "Mary C. Scott"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Neural networks, while effective for tackling many challenging scientific tasks, are not known to perform well out-of-distribution (OOD), i.e., within domains which differ from their training data. Understanding neural network OOD generalization is paramount to their successful deployment in experimental workflows, especially when ground-truth knowledge about the experiment is hard to establish or experimental conditions significantly vary. With inherent access to ground-truth information and fine-grained control of underlying distributions, simulation-based data curation facilitates precise investigation of OOD generalization behavior. Here, we probe generalization with respect to imaging conditions of neural network segmentation models for high-resolution transmission electron microscopy (HRTEM) imaging of nanoparticles, training and measuring the OOD generalization of over 12,000 neural networks using synthetic data generated via random structure sampling and multislice simulation. Using the HRTEM contrast transfer function, we further develop a framework to compare information content of HRTEM datasets and quantify OOD domain shifts. We demonstrate that neural network segmentation models enjoy significant performance stability, but will smoothly and predictably worsen as imaging conditions shift from the training distribution. Lastly, we consider limitations of our approach in explaining other OOD shifts, such as of the atomic structures, and discuss complementary techniques for understanding generalization in such settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09074",
        "abs_url": "https://arxiv.org/abs/2512.09074",
        "pdf_url": "https://arxiv.org/pdf/2512.09074",
        "title": "Modular Deep-Learning-Based Early Warning System for Deadly Heatwave Prediction",
        "authors": [
            "Shangqing Xu",
            "Zhiyuan Zhao",
            "Megha Sharma",
            "José María Martín-Olalla",
            "Alexander Rodríguez",
            "Gregory A. Wellenius",
            "B. Aditya Prakash"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Severe heatwaves in urban areas significantly threaten public health, calling for establishing early warning strategies. Despite predicting occurrence of heatwaves and attributing historical mortality, predicting an incoming deadly heatwave remains a challenge due to the difficulty in defining and estimating heat-related mortality. Furthermore, establishing an early warning system imposes additional requirements, including data availability, spatial and temporal robustness, and decision costs. To address these challenges, we propose DeepTherm, a modular early warning system for deadly heatwave prediction without requiring heat-related mortality history. By highlighting the flexibility of deep learning, DeepTherm employs a dual-prediction pipeline, disentangling baseline mortality in the absence of heatwaves and other irregular events from all-cause mortality. We evaluated DeepTherm on real-world data across Spain. Results demonstrate consistent, robust, and accurate performance across diverse regions, time periods, and population groups while allowing trade-off between missed alarms and false alarms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09076",
        "abs_url": "https://arxiv.org/abs/2512.09076",
        "pdf_url": "https://arxiv.org/pdf/2512.09076",
        "title": "Beyond the Hype: Comparing Lightweight and Deep Learning Models for Air Quality Forecasting",
        "authors": [
            "Moazzam Umer Gondal",
            "Hamad ul Qudous",
            "Asma Ahmad Farhan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Machine Learning (stat.ML)",
        "abstract": "Accurate forecasting of urban air pollution is essential for protecting public health and guiding mitigation policies. While Deep Learning (DL) and hybrid pipelines dominate recent research, their complexity and limited interpretability hinder operational use. This study investigates whether lightweight additive models -- Facebook Prophet (FBP) and NeuralProphet (NP) -- can deliver competitive forecasts for particulate matter (PM$_{2.5}$, PM$_{10}$) in Beijing, China. Using multi-year pollutant and meteorological data, we applied systematic feature selection (correlation, mutual information, mRMR), leakage-safe scaling, and chronological data splits. Both models were trained with pollutant and precursor regressors, with NP additionally leveraging lagged dependencies. For context, two machine learning baselines (LSTM, LightGBM) and one traditional statistical model (SARIMAX) were also implemented. Performance was evaluated on a 7-day holdout using MAE, RMSE, and $R^2$. Results show that FBP consistently outperformed NP, SARIMAX, and the learning-based baselines, achieving test $R^2$ above 0.94 for both pollutants. These findings demonstrate that interpretable additive models remain competitive with both traditional and complex approaches, offering a practical balance of accuracy, transparency, and ease of deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09084",
        "abs_url": "https://arxiv.org/abs/2512.09084",
        "pdf_url": "https://arxiv.org/pdf/2512.09084",
        "title": "GS-KAN: Parameter-Efficient Kolmogorov-Arnold Networks via Sprecher-Type Shared Basis Functions",
        "authors": [
            "Oscar Eliasson"
        ],
        "comments": "10 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The Kolmogorov-Arnold representation theorem offers a theoretical alternative to Multi-Layer Perceptrons (MLPs) by placing learnable univariate functions on edges rather than nodes. While recent implementations such as Kolmogorov-Arnold Networks (KANs) demonstrate high approximation capabilities, they suffer from significant parameter inefficiency due to the requirement of maintaining unique parameterizations for every network edge. In this work, we propose GS-KAN (Generalized Sprecher-KAN), a lightweight architecture inspired by David Sprecher's refinement of the superposition theorem. GS-KAN constructs unique edge functions by applying learnable linear transformations to a single learnable, shared parent function per layer. We evaluate GS-KAN against existing KAN architectures and MLPs across synthetic function approximation, tabular data regression and image classification tasks. Our results demonstrate that GS-KAN outperforms both MLPs and standard KAN baselines on continuous function approximation tasks while maintaining superior parameter efficiency. Additionally, GS-KAN achieves competitive performance with existing KAN architectures on tabular regression and outperforms MLPs on high-dimensional classification tasks. Crucially, the proposed architecture enables the deployment of KAN-based architectures in high-dimensional regimes under strict parameter constraints, a setting where standard implementations are typically infeasible due to parameter explosion. The source code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09103",
        "abs_url": "https://arxiv.org/abs/2512.09103",
        "pdf_url": "https://arxiv.org/pdf/2512.09103",
        "title": "Natural Geometry of Robust Data Attribution: From Convex Models to Deep Networks",
        "authors": [
            "Shihao Li",
            "Jiachen Li",
            "Dongmei Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Data attribution methods identify which training examples are responsible for a model's predictions, but their sensitivity to distributional perturbations undermines practical reliability. We present a unified framework for certified robust attribution that extends from convex models to deep networks. For convex settings, we derive Wasserstein-Robust Influence Functions (W-RIF) with provable coverage guarantees. For deep networks, we demonstrate that Euclidean certification is rendered vacuous by spectral amplification -- a mechanism where the inherent ill-conditioning of deep representations inflates Lipschitz bounds by over $10{,}000\\times$. This explains why standard TRAK scores, while accurate point estimates, are geometrically fragile: naive Euclidean robustness analysis yields 0\\% certification. Our key contribution is the Natural Wasserstein metric, which measures perturbations in the geometry induced by the model's own feature covariance. This eliminates spectral amplification, reducing worst-case sensitivity by $76\\times$ and stabilizing attribution estimates. On CIFAR-10 with ResNet-18, Natural W-TRAK certifies 68.7\\% of ranking pairs compared to 0\\% for Euclidean baselines -- to our knowledge, the first non-vacuous certified bounds for neural network attribution. Furthermore, we prove that the Self-Influence term arising from our analysis equals the Lipschitz constant governing attribution stability, providing theoretical grounding for leverage-based anomaly detection. Empirically, Self-Influence achieves 0.970 AUROC for label noise detection, identifying 94.1\\% of corrupted labels by examining just the top 20\\% of training data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09106",
        "abs_url": "https://arxiv.org/abs/2512.09106",
        "pdf_url": "https://arxiv.org/pdf/2512.09106",
        "title": "Learning Unmasking Policies for Diffusion Language Models",
        "authors": [
            "Metod Jazbec",
            "Theo X. Olausson",
            "Louis Béthune",
            "Pierre Ablin",
            "Michael Kirchhof",
            "Joao Monterio",
            "Victor Turrisi",
            "Jason Ramapuram",
            "Marco Cuturi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Diffusion (Large) Language Models (dLLMs) now match the downstream performance of their autoregressive counterparts on many tasks, while holding the promise of being more efficient during inference. One particularly successful variant is masked discrete diffusion, in which a buffer filled with special mask tokens is progressively replaced with tokens sampled from the model's vocabulary. Efficiency can be gained by unmasking several tokens in parallel, but doing too many at once risks degrading the generation quality. Thus, one critical design aspect of dLLMs is the sampling procedure that selects, at each step of the diffusion process, which tokens to replace. Indeed, recent work has found that heuristic strategies such as confidence thresholding lead to both higher quality and token throughput compared to random unmasking. However, such heuristics have downsides: they require manual tuning, and we observe that their performance degrades with larger buffer sizes. In this work, we instead propose to train sampling procedures using reinforcement learning. Specifically, we formalize masked diffusion sampling as a Markov decision process in which the dLLM serves as the environment, and propose a lightweight policy architecture based on a single-layer transformer that maps dLLM token confidences to unmasking decisions. Our experiments show that these trained policies match the performance of state-of-the-art heuristics when combined with semi-autoregressive generation, while outperforming them in the full diffusion setting. We also examine the transferability of these policies, finding that they can generalize to new underlying dLLMs and longer sequence lengths. However, we also observe that their performance degrades when applied to out-of-domain data, and that fine-grained tuning of the accuracy-efficiency trade-off can be challenging with our approach.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09165",
        "abs_url": "https://arxiv.org/abs/2512.09165",
        "pdf_url": "https://arxiv.org/pdf/2512.09165",
        "title": "Spectral Embedding via Chebyshev Bases for Robust DeepONet Approximation",
        "authors": [
            "Muhammad Abid",
            "Omer San"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep Operator Networks (DeepONets) have become a central tool in data-driven operator learning, providing flexible surrogates for nonlinear mappings arising in partial differential equations (PDEs). However, the standard trunk design based on fully connected layers acting on raw spatial or spatiotemporal coordinates struggles to represent sharp gradients, boundary layers, and non-periodic structures commonly found in PDEs posed on bounded domains with Dirichlet or Neumann boundary conditions. To address these limitations, we introduce the Spectral-Embedded DeepONet (SEDONet), a new DeepONet variant in which the trunk is driven by a fixed Chebyshev spectral dictionary rather than coordinate inputs. This non-periodic spectral embedding provides a principled inductive bias tailored to bounded domains, enabling the learned operator to capture fine-scale non-periodic features that are difficult for Fourier or MLP trunks to represent. SEDONet is evaluated on a suite of PDE benchmarks including 2D Poisson, 1D Burgers, 1D advection-diffusion, Allen-Cahn dynamics, and the Lorenz-96 chaotic system, covering elliptic, parabolic, advective, and multiscale temporal phenomena, all of which can be viewed as canonical problems in computational mechanics. Across all datasets, SEDONet consistently achieves the lowest relative L2 errors among DeepONet, FEDONet, and SEDONet, with average improvements of about 30-40% over the baseline DeepONet and meaningful gains over Fourier-embedded variants on non-periodic geometries. Spectral analyses further show that SEDONet more accurately preserves high-frequency and boundary-localized features, demonstrating the value of Chebyshev embeddings in non-periodic operator learning. The proposed architecture offers a simple, parameter-neutral modification to DeepONets, delivering a robust and efficient spectral framework for surrogate modeling of PDEs on bounded domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09182",
        "abs_url": "https://arxiv.org/abs/2512.09182",
        "pdf_url": "https://arxiv.org/pdf/2512.09182",
        "title": "Understanding the Failure Modes of Transformers through the Lens of Graph Neural Networks",
        "authors": [
            "Hunjae Lee"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Transformers and more specifically decoder-only transformers dominate modern LLM architectures. While they have shown to work exceptionally well, they are not without issues, resulting in surprising failure modes and predictably asymmetric performance degradation. This article is a study of many of these observed failure modes of transformers through the lens of graph neural network (GNN) theory. We first make the case that much of deep learning, including transformers, is about learnable information mixing and propagation. This makes the study of model failure modes a study of bottlenecks in information propagation. This naturally leads to GNN theory, where there is already a rich literature on information propagation bottlenecks and theoretical failure modes of models. We then make the case that many issues faced by GNNs are also experienced by transformers. In addition, we analyze how the causal nature of decoder-only transformers create interesting geometric properties in information propagation, resulting in predictable and potentially devastating failure modes. Finally, we observe that existing solutions in transformer research tend to be ad-hoc and driven by intuition rather than grounded theoretical motivation. As such, we unify many such solutions under a more theoretical perspective, providing insight into why they work, what problem they are actually solving, and how they can be further improved to target specific failure modes of transformers. Overall, this article is an attempt to bridge the gap between observed failure modes in transformers and a general lack of theoretical understanding of them in this space.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09199",
        "abs_url": "https://arxiv.org/abs/2512.09199",
        "pdf_url": "https://arxiv.org/pdf/2512.09199",
        "title": "LLMs for Analog Circuit Design Continuum (ACDC)",
        "authors": [
            "Yasaman Esfandiari",
            "Jocelyn Rego",
            "Austin Meyer",
            "Jonathan Gallagher",
            "Mia Levy"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Performance (cs.PF)",
        "abstract": "Large Language Models (LLMs) and transformer architectures have shown impressive reasoning and generation capabilities across diverse natural language tasks. However, their reliability and robustness in real-world engineering domains remain largely unexplored, limiting their practical utility in human-centric workflows. In this work, we investigate the applicability and consistency of LLMs for analog circuit design -- a task requiring domain-specific reasoning, adherence to physical constraints, and structured representations -- focusing on AI-assisted design where humans remain in the loop. We study how different data representations influence model behavior and compare smaller models (e.g., T5, GPT-2) with larger foundation models (e.g., Mistral-7B, GPT-oss-20B) under varying training conditions. Our results highlight key reliability challenges, including sensitivity to data format, instability in generated designs, and limited generalization to unseen circuit configurations. These findings provide early evidence on the limits and potential of LLMs as tools to enhance human capabilities in complex engineering tasks, offering insights into designing reliable, deployable foundation models for structured, real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09267",
        "abs_url": "https://arxiv.org/abs/2512.09267",
        "pdf_url": "https://arxiv.org/pdf/2512.09267",
        "title": "Contrastive Learning for Semi-Supervised Deep Regression with Generalized Ordinal Rankings from Spectral Seriation",
        "authors": [
            "Ce Wang",
            "Weihang Dai",
            "Hanru Bai",
            "Xiaomeng Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Contrastive learning methods enforce label distance relationships in feature space to improve representation capability for regression models. However, these methods highly depend on label information to correctly recover ordinal relationships of features, limiting their applications to semi-supervised regression. In this work, we extend contrastive regression methods to allow unlabeled data to be used in the semi-supervised setting, thereby reducing the dependence on costly annotations. Particularly we construct the feature similarity matrix with both labeled and unlabeled samples in a mini-batch to reflect inter-sample relationships, and an accurate ordinal ranking of involved unlabeled samples can be recovered through spectral seriation algorithms if the level of error is within certain bounds. The introduction of labeled samples above provides regularization of the ordinal ranking with guidance from the ground-truth label information, making the ranking more reliable. To reduce feature perturbations, we further utilize the dynamic programming algorithm to select robust features for the matrix construction. The recovered ordinal relationship is then used for contrastive learning on unlabeled samples, and we thus allow more data to be used for feature representation learning, thereby achieving more robust results. The ordinal rankings can also be used to supervise predictions on unlabeled samples, serving as an additional training signal. We provide theoretical guarantees and empirical verification through experiments on various datasets, demonstrating that our method can surpass existing state-of-the-art semi-supervised deep regression methods. Our code have been released on this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09269",
        "abs_url": "https://arxiv.org/abs/2512.09269",
        "pdf_url": "https://arxiv.org/pdf/2512.09269",
        "title": "Goal inference with Rao-Blackwellized Particle Filters",
        "authors": [
            "Yixuan Wang",
            "Dan P. Guralnik",
            "Warren E. Dixon"
        ],
        "comments": "9 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG); Information Retrieval (cs.IR)",
        "abstract": "Inferring the eventual goal of a mobile agent from noisy observations of its trajectory is a fundamental estimation problem. We initiate the study of such intent inference using a variant of a Rao-Blackwellized Particle Filter (RBPF), subject to the assumption that the agent's intent manifests through closed-loop behavior with a state-of-the-art provable practical stability property. Leveraging the assumed closed-form agent dynamics, the RBPF analytically marginalizes the linear-Gaussian substructure and updates particle weights only, improving sample efficiency over a standard particle filter. Two difference estimators are introduced: a Gaussian mixture model using the RBPF weights and a reduced version confining the mixture to the effective sample. We quantify how well the adversary can recover the agent's intent using information-theoretic leakage metrics and provide computable lower bounds on the Kullback-Leibler (KL) divergence between the true intent distribution and RBPF estimates via Gaussian-mixture KL bounds. We also provide a bound on the difference in performance between the two estimators, highlighting the fact that the reduced estimator performs almost as well as the complete one. Experiments illustrate fast and accurate intent recovery for compliant agents, motivating future work on designing intent-obfuscating controllers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09322",
        "abs_url": "https://arxiv.org/abs/2512.09322",
        "pdf_url": "https://arxiv.org/pdf/2512.09322",
        "title": "Self-Supervised Learning with Gaussian Processes",
        "authors": [
            "Yunshan Duan",
            "Sinead Williamson"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "Self supervised learning (SSL) is a machine learning paradigm where models learn to understand the underlying structure of data without explicit supervision from labeled samples. The acquired representations from SSL have demonstrated useful for many downstream tasks including clustering, and linear classification, etc. To ensure smoothness of the representation space, most SSL methods rely on the ability to generate pairs of observations that are similar to a given instance. However, generating these pairs may be challenging for many types of data. Moreover, these methods lack consideration of uncertainty quantification and can perform poorly in out-of-sample prediction settings. To address these limitations, we propose Gaussian process self supervised learning (GPSSL), a novel approach that utilizes Gaussian processes (GP) models on representation learning. GP priors are imposed on the representations, and we obtain a generalized Bayesian posterior minimizing a loss function that encourages informative representations. The covariance function inherent in GPs naturally pulls representations of similar units together, serving as an alternative to using explicitly defined positive samples. We show that GPSSL is closely related to both kernel PCA and VICReg, a popular neural network-based SSL method, but unlike both allows for posterior uncertainties that can be propagated to downstream tasks. Experiments on various datasets, considering classification and regression tasks, demonstrate that GPSSL outperforms traditional methods in terms of accuracy, uncertainty quantification, and error control.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09329",
        "abs_url": "https://arxiv.org/abs/2512.09329",
        "pdf_url": "https://arxiv.org/pdf/2512.09329",
        "title": "Self Distillation Fine-Tuning of Protein Language Models Improves Versatility in Protein Design",
        "authors": [
            "Amin Tavakoli",
            "Raswanth Murugan",
            "Ozan Gokdemir",
            "Arvind Ramanathan",
            "Frances Arnold",
            "Anima Anandkumar"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computational Engineering, Finance, and Science (cs.CE)",
        "abstract": "Supervised fine-tuning (SFT) is a standard approach for adapting large language models to specialized domains, yet its application to protein sequence modeling and protein language models (PLMs) remains ad hoc. This is in part because high-quality annotated data are far more difficult to obtain for proteins than for natural language. We present a simple and general recipe for fast SFT of PLMs, designed to improve the fidelity, reliability, and novelty of generated protein sequences. Unlike existing approaches that require costly precompiled experimental datasets for SFT, our method leverages the PLM itself, integrating a lightweight curation pipeline with domain-specific filters to construct high-quality training data. These filters can independently refine a PLM's output and identify candidates for in vitro evaluation; when combined with SFT, they enable PLMs to generate more stable and functional enzymes, while expanding exploration into protein sequence space beyond natural variants. Although our approach is agnostic to both the choice of protein language model (PLM) and the protein system, we demonstrate its effectiveness with a genome-scale PLM (GenSLM) applied to the tryptophan synthase enzyme family. The supervised fine-tuned model generates sequences that are not only more novel but also display improved characteristics across both targeted design constraints and emergent protein property measures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09333",
        "abs_url": "https://arxiv.org/abs/2512.09333",
        "pdf_url": "https://arxiv.org/pdf/2512.09333",
        "title": "Improved Physics-Driven Neural Network to Solve Inverse Scattering Problems",
        "authors": [
            "Yutong Du",
            "Zicheng Liu",
            "Bo Wu",
            "Jingwei Kou",
            "Hang Li",
            "Changyou Li",
            "Yali Zong",
            "Bo Qi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper presents an improved physics-driven neural network (IPDNN) framework for solving electromagnetic inverse scattering problems (ISPs). A new Gaussian-localized oscillation-suppressing window (GLOW) activation function is introduced to stabilize convergence and enable a lightweight yet accurate network architecture. A dynamic scatter subregion identification strategy is further developed to adaptively refine the computational domain, preventing missed detections and reducing computational cost. Moreover, transfer learning is incorporated to extend the solver's applicability to practical scenarios, integrating the physical interpretability of iterative algorithms with the real-time inference capability of neural networks. Numerical simulations and experimental results demonstrate that the proposed solver achieves superior reconstruction accuracy, robustness, and efficiency compared with existing state-of-the-art methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09360",
        "abs_url": "https://arxiv.org/abs/2512.09360",
        "pdf_url": "https://arxiv.org/pdf/2512.09360",
        "title": "A Granular Framework for Construction Material Price Forecasting: Econometric and Machine-Learning Approaches",
        "authors": [
            "Boge Lyu",
            "Qianye Yin",
            "Iris Denise Tommelein",
            "Hanyang Liu",
            "Karnamohit Ranka",
            "Karthik Yeluripati",
            "Junzhe Shi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Econometrics (econ.EM)",
        "abstract": "The persistent volatility of construction material prices poses significant risks to cost estimation, budgeting, and project delivery, underscoring the urgent need for granular and scalable forecasting methods. This study develops a forecasting framework that leverages the Construction Specifications Institute (CSI) MasterFormat as the target data structure, enabling predictions at the six-digit section level and supporting detailed cost projections across a wide spectrum of building materials. To enhance predictive accuracy, the framework integrates explanatory variables such as raw material prices, commodity indexes, and macroeconomic indicators. Four time-series models, Long Short-Term Memory (LSTM), Autoregressive Integrated Moving Average (ARIMA), Vector Error Correction Model (VECM), and Chronos-Bolt, were evaluated under both baseline configurations (using CSI data only) and extended versions with explanatory variables. Results demonstrate that incorporating explanatory variables significantly improves predictive performance across all models. Among the tested approaches, the LSTM model consistently achieved the highest accuracy, with RMSE values as low as 1.390 and MAPE values of 0.957, representing improvements of up to 59\\% over the traditional statistical time-series model, ARIMA. Validation across multiple CSI divisions confirmed the framework's scalability, while Division 06 (Wood, Plastics, and Composites) is presented in detail as a demonstration case. This research offers a robust methodology that enables owners and contractors to improve budgeting practices and achieve more reliable cost estimation at the Definitive level.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09365",
        "abs_url": "https://arxiv.org/abs/2512.09365",
        "pdf_url": "https://arxiv.org/pdf/2512.09365",
        "title": "KGOT: Unified Knowledge Graph and Optimal Transport Pseudo-Labeling for Molecule-Protein Interaction Prediction",
        "authors": [
            "Jiayu Qin",
            "Zhengquan Luo",
            "Guy Tadmor",
            "Changyou Chen",
            "David Zeevi",
            "Zhiqiang Xu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Predicting molecule-protein interactions (MPIs) is a fundamental task in computational biology, with crucial applications in drug discovery and molecular function annotation. However, existing MPI models face two major challenges. First, the scarcity of labeled molecule-protein pairs significantly limits model performance, as available datasets capture only a small fraction of biological relevant interactions. Second, most methods rely solely on molecular and protein features, ignoring broader biological context such as genes, metabolic pathways, and functional annotations that could provide essential complementary information. To address these limitations, our framework first aggregates diverse biological datasets, including molecular, protein, genes and pathway-level interactions, and then develop an optimal transport-based approach to generate high-quality pseudo-labels for unlabeled molecule-protein pairs, leveraging the underlying distribution of known interactions to guide label assignment. By treating pseudo-labeling as a mechanism for bridging disparate biological modalities, our approach enables the effective use of heterogeneous data to enhance MPI prediction. We evaluate our framework on multiple MPI datasets including virtual screening tasks and protein retrieval tasks, demonstrating substantial improvements over state-of-the-art methods in prediction accuracies and zero shot ability across unseen interactions. Beyond MPI prediction, our approach provides a new paradigm for leveraging diverse biological data sources to tackle problems traditionally constrained by single- or bi-modal learning, paving the way for future advances in computational biology and drug discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09368",
        "abs_url": "https://arxiv.org/abs/2512.09368",
        "pdf_url": "https://arxiv.org/pdf/2512.09368",
        "title": "CFLight: Enhancing Safety with Traffic Signal Control through Counterfactual Learning",
        "authors": [
            "Mingyuan Li",
            "Chunyu Liu",
            "Zhuojun Li",
            "Xiao Liu",
            "Guangsheng Yu",
            "Bo Du",
            "Jun Shen",
            "Qiang Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "Traffic accidents result in millions of injuries and fatalities globally, with a significant number occurring at intersections each year. Traffic Signal Control (TSC) is an effective strategy for enhancing safety at these urban junctures. Despite the growing popularity of Reinforcement Learning (RL) methods in optimizing TSC, these methods often prioritize driving efficiency over safety, thus failing to address the critical balance between these two aspects. Additionally, these methods usually need more interpretability. CounterFactual (CF) learning is a promising approach for various causal analysis fields. In this study, we introduce a novel framework to improve RL for safety aspects in TSC. This framework introduces a novel method based on CF learning to address the question: ``What if, when an unsafe event occurs, we backtrack to perform alternative actions, and will this unsafe event still occur in the subsequent period?'' To answer this question, we propose a new structure causal model to predict the result after executing different actions, and we propose a new CF module that integrates with additional ``X'' modules to promote safe RL practices. Our new algorithm, CFLight, which is derived from this framework, effectively tackles challenging safety events and significantly improves safety at intersections through a near-zero collision control strategy. Through extensive numerical experiments on both real-world and synthetic datasets, we demonstrate that CFLight reduces collisions and improves overall traffic performance compared to conventional RL methods and the recent safe RL model. Moreover, our method represents a generalized and safe framework for RL methods, opening possibilities for applications in other domains. The data and code are available in the github this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09369",
        "abs_url": "https://arxiv.org/abs/2512.09369",
        "pdf_url": "https://arxiv.org/pdf/2512.09369",
        "title": "Are Hypervectors Enough? Single-Call LLM Reasoning over Knowledge Graphs",
        "authors": [
            "Yezi Liu",
            "William Youngwoo Chung",
            "Hanning Chen",
            "Calvin Yeung",
            "Mohsen Imani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Recent advances in large language models (LLMs) have enabled strong reasoning over both structured and unstructured knowledge. When grounded on knowledge graphs (KGs), however, prevailing pipelines rely on heavy neural encoders to embed and score symbolic paths or on repeated LLM calls to rank candidates, leading to high latency, GPU cost, and opaque decisions that hinder faithful, scalable deployment. We propose PathHD, a lightweight and encoder-free KG reasoning framework that replaces neural path scoring with hyperdimensional computing (HDC) and uses only a single LLM call per query. PathHD encodes relation paths into block-diagonal GHRR hypervectors, ranks candidates with blockwise cosine similarity and Top-K pruning, and then performs a one-shot LLM adjudication to produce the final answer together with cited supporting paths. Technically, PathHD is built on three ingredients: (i) an order-aware, non-commutative binding operator for path composition, (ii) a calibrated similarity for robust hypervector-based retrieval, and (iii) a one-shot adjudication step that preserves interpretability while eliminating per-path LLM scoring. On WebQSP, CWQ, and the GrailQA split, PathHD (i) attains comparable or better Hits@1 than strong neural baselines while using one LLM call per query; (ii) reduces end-to-end latency by $40-60\\%$ and GPU memory by $3-5\\times$ thanks to encoder-free retrieval; and (iii) delivers faithful, path-grounded rationales that improve error diagnosis and controllability. These results indicate that carefully designed HDC representations provide a practical substrate for efficient KG-LLM reasoning, offering a favorable accuracy-efficiency-interpretability trade-off.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09378",
        "abs_url": "https://arxiv.org/abs/2512.09378",
        "pdf_url": "https://arxiv.org/pdf/2512.09378",
        "title": "Federated Distillation Assisted Vehicle Edge Caching Scheme Based on Lightweight DDPM",
        "authors": [
            "Xun Li",
            "Qiong Wu",
            "Pingyi Fan",
            "Kezhi Wang",
            "Wen Chen",
            "Khaled B. Letaief"
        ],
        "comments": "This paper has been submitted to IEEE letters. The source code has been released at: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Vehicle edge caching is a promising technology that can significantly reduce the latency for vehicle users (VUs) to access content by pre-caching user-interested content at edge nodes. It is crucial to accurately predict the content that VUs are interested in without exposing their privacy. Traditional federated learning (FL) can protect user privacy by sharing models rather than raw data. However, the training of FL requires frequent model transmission, which can result in significant communication overhead. Additionally, vehicles may leave the road side unit (RSU) coverage area before training is completed, leading to training failures. To address these issues, in this letter, we propose a federated distillation-assisted vehicle edge caching scheme based on lightweight denoising diffusion probabilistic model (LDPM). The simulation results demonstrate that the proposed vehicle edge caching scheme has good robustness to variations in vehicle speed, significantly reducing communication overhead and improving cache hit percentage.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09403",
        "abs_url": "https://arxiv.org/abs/2512.09403",
        "pdf_url": "https://arxiv.org/pdf/2512.09403",
        "title": "Black-Box Behavioral Distillation Breaks Safety Alignment in Medical LLMs",
        "authors": [
            "Sohely Jahan",
            "Ruimin Sun"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As medical large language models (LLMs) become increasingly integrated into clinical workflows, concerns around alignment robustness, and safety are escalating. Prior work on model extraction has focused on classification models or memorization leakage, leaving the vulnerability of safety-aligned generative medical LLMs underexplored. We present a black-box distillation attack that replicates the domain-specific reasoning of safety-aligned medical LLMs using only output-level access. By issuing 48,000 instruction queries to Meditron-7B and collecting 25,000 benign instruction response pairs, we fine-tune a LLaMA3 8B surrogate via parameter efficient LoRA under a zero-alignment supervision setting, requiring no access to model weights, safety filters, or training data. With a cost of $12, the surrogate achieves strong fidelity on benign inputs while producing unsafe completions for 86% of adversarial prompts, far exceeding both Meditron-7B (66%) and the untuned base model (46%). This reveals a pronounced functional-ethical gap, task utility transfers, while alignment collapses. To analyze this collapse, we develop a dynamic adversarial evaluation framework combining Generative Query (GQ)-based harmful prompt generation, verifier filtering, category-wise failure analysis, and adaptive Random Search (RS) jailbreak attacks. We also propose a layered defense system, as a prototype detector for real-time alignment drift in black-box deployments. Our findings show that benign-only black-box distillation exposes a practical and under-recognized threat: adversaries can cheaply replicate medical LLM capabilities while stripping safety mechanisms, underscoring the need for extraction-aware safety monitoring.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09467",
        "abs_url": "https://arxiv.org/abs/2512.09467",
        "pdf_url": "https://arxiv.org/pdf/2512.09467",
        "title": "Cauchy-Schwarz Fairness Regularizer",
        "authors": [
            "Yezi Liu",
            "Hanning Chen",
            "Wenjun Huang",
            "Yang Ni",
            "Mohsen Imani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Group fairness in machine learning is often enforced by adding a regularizer that reduces the dependence between model predictions and sensitive attributes. However, existing regularizers are built on heterogeneous distance measures and design choices, which makes their behavior hard to reason about and their performance inconsistent across tasks. This raises a basic question: what properties make a good fairness regularizer? We address this question by first organizing existing in-process methods into three families: (i) matching prediction statistics across sensitive groups, (ii) aligning latent representations, and (iii) directly minimizing dependence between predictions and sensitive attributes. Through this lens, we identify desirable properties of the underlying distance measure, including tight generalization bounds, robustness to scale differences, and the ability to handle arbitrary prediction distributions. Motivated by these properties, we propose a Cauchy-Schwarz (CS) fairness regularizer that penalizes the empirical CS divergence between prediction distributions conditioned on sensitive groups. Under a Gaussian comparison, we show that CS divergence yields a tighter bound than Kullback-Leibler divergence, Maximum Mean Discrepancy, and the mean disparity used in Demographic Parity, and we discuss how these advantages translate to a distribution-free, kernel-based estimator that naturally extends to multiple sensitive attributes. Extensive experiments on four tabular benchmarks and one image dataset demonstrate that the proposed CS regularizer consistently improves Demographic Parity and Equal Opportunity metrics while maintaining competitive accuracy, and achieves a more stable utility-fairness trade-off across hyperparameter settings compared to prior regularizers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09513",
        "abs_url": "https://arxiv.org/abs/2512.09513",
        "pdf_url": "https://arxiv.org/pdf/2512.09513",
        "title": "Contextual Dynamic Pricing with Heterogeneous Buyers",
        "authors": [
            "Thodoris Lykouris",
            "Sloan Nietert",
            "Princewill Okoroafor",
            "Chara Podimata",
            "Julian Zimmert"
        ],
        "comments": "Appeared at NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We initiate the study of contextual dynamic pricing with a heterogeneous population of buyers, where a seller repeatedly posts prices (over $T$ rounds) that depend on the observable $d$-dimensional context and receives binary purchase feedback. Unlike prior work assuming homogeneous buyer types, in our setting the buyer's valuation type is drawn from an unknown distribution with finite support size $K_{\\star}$. We develop a contextual pricing algorithm based on optimistic posterior sampling with regret $\\widetilde{O}(K_{\\star}\\sqrt{dT})$, which we prove to be tight in $d$ and $T$ up to logarithmic terms. Finally, we refine our analysis for the non-contextual pricing case, proposing a variance-aware zooming algorithm that achieves the optimal dependence on $K_{\\star}$.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09517",
        "abs_url": "https://arxiv.org/abs/2512.09517",
        "pdf_url": "https://arxiv.org/pdf/2512.09517",
        "title": "QuanvNeXt: An end-to-end quanvolutional neural network for EEG-based detection of major depressive disorder",
        "authors": [
            "Nabil Anan Orka",
            "Ehtashamul Haque",
            "Maftahul Jannat",
            "Md Abdul Awal",
            "Mohammad Ali Moni"
        ],
        "comments": "Under review",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This study presents QuanvNeXt, an end-to-end fully quanvolutional model for EEG-based depression diagnosis. QuanvNeXt incorporates a novel Cross Residual block, which reduces feature homogeneity and strengthens cross-feature relationships while retaining parameter efficiency. We evaluated QuanvNeXt on two open-source datasets, where it achieved an average accuracy of 93.1% and an average AUC-ROC of 97.2%, outperforming state-of-the-art baselines such as InceptionTime (91.7% accuracy, 95.9% AUC-ROC). An uncertainty analysis across Gaussian noise levels demonstrated well-calibrated predictions, with ECE scores remaining low (0.0436, Dataset 1) to moderate (0.1159, Dataset 2) even at the highest perturbation ({\\epsilon} = 0.1). Additionally, a post-hoc explainable AI analysis confirmed that QuanvNeXt effectively identifies and learns spectrotemporal patterns that distinguish between healthy controls and major depressive disorder. Overall, QuanvNeXt establishes an efficient and reliable approach for EEG-based depression diagnosis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09535",
        "abs_url": "https://arxiv.org/abs/2512.09535",
        "pdf_url": "https://arxiv.org/pdf/2512.09535",
        "title": "Latent-Autoregressive GP-VAE Language Model",
        "authors": [
            "Yves Ruffenach"
        ],
        "comments": "27 pages, 1 figure, 4 tables. Proof-of-concept study of a latent-autoregressive GP-VAE language model with TCN encoder and non-autoregressive decoder. Code available at this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We investigate a fully Latent AutoRegressive scheme based on a Gaussian Process (GP) integrated into a Variational Autoencoder (VAE). In this setting, sequential dynamics are transferred from the observation space to a continuous latent space, while linguistic generation remains parallel through a non-autoregressive decoder. We present a complete methodological formulation, including a causal GP prior, a structured amortized posterior, and a training protocol based on a regularized ELBO. Empirical evaluation, conducted within a deliberately constrained proof-of-concept (POC) framework, shows that the model can be trained stably and that the sequential and parallel sampling variants exhibit consistent behavior. Overall, the results suggest that part of the temporal structure in a language model can be supported by the probabilistic geometry of the latent space rather than by explicit neural operations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09621",
        "abs_url": "https://arxiv.org/abs/2512.09621",
        "pdf_url": "https://arxiv.org/pdf/2512.09621",
        "title": "Semantic-Aware Cooperative Communication and Computation Framework in Vehicular Networks",
        "authors": [
            "Jingbo Zhang",
            "Maoxin Ji",
            "Qiong Wu",
            "Pingyi Fan",
            "Kezhi Wang",
            "Wen Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Semantic Communication (SC) combined with Vehicular edge computing (VEC) provides an efficient edge task processing paradigm for Internet of Vehicles (IoV). Focusing on highway scenarios, this paper proposes a Tripartite Cooperative Semantic Communication (TCSC) framework, which enables Vehicle Users (VUs) to perform semantic task offloading via Vehicle-to-Infrastructure (V2I) and Vehicle-to-Vehicle (V2V) communications. Considering task latency and the number of semantic symbols, the framework constructs a Mixed-Integer Nonlinear Programming (MINLP) problem, which is transformed into two subproblems. First, we innovatively propose a multi-agent proximal policy optimization task offloading optimization method based on parametric distribution noise (MAPPO-PDN) to solve the optimization problem of the number of semantic symbols; second, linear programming (LP) is used to solve offloading ratio. Simulations show that performance of this scheme is superior to that of other algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09654",
        "abs_url": "https://arxiv.org/abs/2512.09654",
        "pdf_url": "https://arxiv.org/pdf/2512.09654",
        "title": "Membership and Dataset Inference Attacks on Large Audio Generative Models",
        "authors": [
            "Jakub Proboszcz",
            "Paweł Kochanski",
            "Karol Korszun",
            "Donato Crisostomi",
            "Giorgio Strano",
            "Emanuele Rodolà",
            "Kamil Deja",
            "Jan Dubinski"
        ],
        "comments": "NeurIPS 2025 AI for Music Workshop NeurIPS 2025 Workshop on Creativity & Generative AI",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Generative audio models, based on diffusion and autoregressive architectures, have advanced rapidly in both quality and expressiveness. This progress, however, raises pressing copyright concerns, as such models are often trained on vast corpora of artistic and commercial works. A central question is whether one can reliably verify if an artist's material was included in training, thereby providing a means for copyright holders to protect their content. In this work, we investigate the feasibility of such verification through membership inference attacks (MIA) on open-source generative audio models, which attempt to determine whether a specific audio sample was part of the training set. Our empirical results show that membership inference alone is of limited effectiveness at scale, as the per-sample membership signal is weak for models trained on large and diverse datasets. However, artists and media owners typically hold collections of works rather than isolated samples. Building on prior work in text and vision domains, in this work we focus on dataset inference (DI), which aggregates diverse membership evidence across multiple samples. We find that DI is successful in the audio domain, offering a more practical mechanism for assessing whether an artist's works contributed to model training. Our results suggest DI as a promising direction for copyright protection and dataset accountability in the era of large audio generative models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09690",
        "abs_url": "https://arxiv.org/abs/2512.09690",
        "pdf_url": "https://arxiv.org/pdf/2512.09690",
        "title": "A data-driven approach to linking design features with manufacturing process data for sustainable product development",
        "authors": [
            "Jiahang Li",
            "Lucas Cazzonelli",
            "Jacqueline Höllig",
            "Markus Doellken",
            "Sven Matthiesen"
        ],
        "comments": "This is the preprint of a paper accepted for the CIRP Design Conference 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The growing adoption of Industrial Internet of Things (IIoT) technologies enables automated, real-time collection of manufacturing process data, unlocking new opportunities for data-driven product development. Current data-driven methods are generally applied within specific domains, such as design or manufacturing, with limited exploration of integrating design features and manufacturing process data. Since design decisions significantly affect manufacturing outcomes, such as error rates, energy consumption, and processing times, the lack of such integration restricts the potential for data-driven product design improvements. This paper presents a data-driven approach to mapping and analyzing the relationship between design features and manufacturing process data. A comprehensive system architecture is developed to ensure continuous data collection and integration. The linkage between design features and manufacturing process data serves as the basis for developing a machine learning model that enables automated design improvement suggestions. By integrating manufacturing process data with sustainability metrics, this approach opens new possibilities for sustainable product development.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09706",
        "abs_url": "https://arxiv.org/abs/2512.09706",
        "pdf_url": "https://arxiv.org/pdf/2512.09706",
        "title": "Training One Model to Master Cross-Level Agentic Actions via Reinforcement Learning",
        "authors": [
            "Kaichen He",
            "Zihao Wang",
            "Muyao Li",
            "Anji Liu",
            "Yitao Liang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The paradigm of agentic AI is shifting from engineered complex workflows to post-training native models. However, existing agents are typically confined to static, predefined action spaces--such as exclusively using APIs, GUI events, or robotic commands. This rigidity limits their adaptability in dynamic environments where the optimal granularity of interaction varies contextually. To bridge this gap, we propose CrossAgent, a unified agentic model that masters heterogeneous action spaces and autonomously selects the most effective interface for each step of a trajectory. We introduce a comprehensive training pipeline that integrates cold-start supervised fine-tuning with a Multi-Turn Group Relative Policy Optimization (GRPO) algorithm. This approach enables the agent to learn adaptive action switching--balancing high-level efficiency with low-level precision--without human-specified rules. Extensive experiments on over 800 tasks in the open-world Minecraft environment demonstrate that CrossAgent achieves state-of-the-art performance. By dynamically leveraging the strengths of diverse action spaces, our model significantly outperforms fixed-action baselines, exhibiting superior generalization and efficiency in long-horizon reasoning. All code and models are available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09723",
        "abs_url": "https://arxiv.org/abs/2512.09723",
        "pdf_url": "https://arxiv.org/pdf/2512.09723",
        "title": "Mixture of Lookup Key-Value Experts",
        "authors": [
            "Zongcheng Wang"
        ],
        "comments": "Preliminary Version; Work in Progress",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent research has developed several LLM architectures suitable for inference on end-user devices, such as the Mixture of Lookup Experts (MoLE)~\\parencite{jie_mixture_2025}. A key feature of MoLE is that each token id is associated with a dedicated group of experts. For a given input, only the experts corresponding to the input token id will be activated. Since the communication overhead of loading this small number of activated experts into RAM during inference is negligible, expert parameters can be offloaded to storage, making MoLE suitable for resource-constrained devices. However, MoLE's context-independent expert selection mechanism, based solely on input ids, may limit model performance. To address this, we propose the \\textbf{M}ixture \\textbf{o}f \\textbf{L}ookup \\textbf{K}ey-\\textbf{V}alue Experts (\\textbf{MoLKV}) model. In MoLKV, each expert is structured as a key-value pair. For a given input, the input-derived query interacts with the cached key-value experts from the current sequence, generating a context-aware expert output. This context-aware mechanism alleviates the limitation of MoLE, and experimental results demonstrate that MoLKV achieves significantly lower validation loss in small-scale evaluations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09780",
        "abs_url": "https://arxiv.org/abs/2512.09780",
        "pdf_url": "https://arxiv.org/pdf/2512.09780",
        "title": "Physics-Aware Heterogeneous GNN Architecture for Real-Time BESS Optimization in Unbalanced Distribution Systems",
        "authors": [
            "Aoxiang Ma",
            "Salah Ghamizi",
            "Jun Cao",
            "Pedro Rodriguez"
        ],
        "comments": "5 pages, 2 figures, 3 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Battery energy storage systems (BESS) have become increasingly vital in three-phase unbalanced distribution grids for maintaining voltage stability and enabling optimal dispatch. However, existing deep learning approaches often lack explicit three-phase representation, making it difficult to accurately model phase-specific dynamics and enforce operational constraints--leading to infeasible dispatch solutions. This paper demonstrates that by embedding detailed three-phase grid information--including phase voltages, unbalanced loads, and BESS states--into heterogeneous graph nodes, diverse GNN architectures (GCN, GAT, GraphSAGE, GPS) can jointly predict network state variables with high accuracy. Moreover, a physics-informed loss function incorporates critical battery constraints--SoC and C-rate limits--via soft penalties during training. Experimental validation on the CIGRE 18-bus distribution system shows that this embedding-loss approach achieves low prediction errors, with bus voltage MSEs of 6.92e-07 (GCN), 1.21e-06 (GAT), 3.29e-05 (GPS), and 9.04e-07 (SAGE). Importantly, the physics-informed method ensures nearly zero SoC and C-rate constraint violations, confirming its effectiveness for reliable, constraint-compliant dispatch.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09784",
        "abs_url": "https://arxiv.org/abs/2512.09784",
        "pdf_url": "https://arxiv.org/pdf/2512.09784",
        "title": "Predicting Polymer Solubility in Solvents Using SMILES Strings",
        "authors": [
            "Andrew Reinhard"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Understanding and predicting polymer solubility in various solvents is critical for applications ranging from recycling to pharmaceutical formulation. This work presents a deep learning framework that predicts polymer solubility, expressed as weight percent (wt%), directly from SMILES representations of both polymers and solvents. A dataset of 8,049 polymer solvent pairs at 25 deg C was constructed from calibrated molecular dynamics simulations (Zhou et al., 2023), and molecular descriptors and fingerprints were combined into a 2,394 feature representation per sample. A fully connected neural network with six hidden layers was trained using the Adam optimizer and evaluated using mean squared error loss, achieving strong agreement between predicted and actual solubility values. Generalizability was demonstrated using experimentally measured data from the Materials Genome Project, where the model maintained high accuracy on 25 unseen polymer solvent combinations. These findings highlight the viability of SMILES based machine learning models for scalable solubility prediction and high-throughput solvent screening, supporting applications in green chemistry, polymer processing, and materials design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09786",
        "abs_url": "https://arxiv.org/abs/2512.09786",
        "pdf_url": "https://arxiv.org/pdf/2512.09786",
        "title": "TinyDéjàVu: Smaller Memory Footprint & Faster Inference on Sensor Data Streams with Always-On Microcontrollers",
        "authors": [
            "Zhaolan Huang",
            "Emmanuel Baccelli"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Performance (cs.PF); Sound (cs.SD); Audio and Speech Processing (eess.AS); Signal Processing (eess.SP)",
        "abstract": "Always-on sensors are increasingly expected to embark a variety of tiny neural networks and to continuously perform inference on time-series of the data they sense. In order to fit lifetime and energy consumption requirements when operating on battery, such hardware uses microcontrollers (MCUs) with tiny memory budget e.g., 128kB of RAM. In this context, optimizing data flows across neural network layers becomes crucial. In this paper, we introduce TinyDéjàVu, a new framework and novel algorithms we designed to drastically reduce the RAM footprint required by inference using various tiny ML models for sensor data time-series on typical microcontroller hardware. We publish the implementation of TinyDéjàVu as open source, and we perform reproducible benchmarks on hardware. We show that TinyDéjàVu can save more than 60% of RAM usage and eliminate up to 90% of redundant compute on overlapping sliding window inputs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09796",
        "abs_url": "https://arxiv.org/abs/2512.09796",
        "pdf_url": "https://arxiv.org/pdf/2512.09796",
        "title": "Knowledge Diversion for Efficient Morphology Control and Policy Transfer",
        "authors": [
            "Fu Feng",
            "Ruixiao Shi",
            "Yucheng Xie",
            "Jianlu Shen",
            "Jing Wang",
            "Xin Geng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Universal morphology control aims to learn a universal policy that generalizes across heterogeneous agent morphologies, with Transformer-based controllers emerging as a popular choice. However, such architectures incur substantial computational costs, resulting in high deployment overhead, and existing methods exhibit limited cross-task generalization, necessitating training from scratch for each new task. To this end, we propose \\textbf{DivMorph}, a modular training paradigm that leverages knowledge diversion to learn decomposable controllers. DivMorph factorizes randomly initialized Transformer weights into factor units via SVD prior to training and employs dynamic soft gating to modulate these units based on task and morphology embeddings, separating them into shared \\textit{learngenes} and morphology- and task-specific \\textit{tailors}, thereby achieving knowledge disentanglement. By selectively activating relevant components, DivMorph enables scalable and efficient policy deployment while supporting effective policy transfer to novel tasks. Extensive experiments demonstrate that DivMorph achieves state-of-the-art performance, achieving a 3$\\times$ improvement in sample efficiency over direct finetuning for cross-task transfer and a 17$\\times$ reduction in model size for single-agent deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09800",
        "abs_url": "https://arxiv.org/abs/2512.09800",
        "pdf_url": "https://arxiv.org/pdf/2512.09800",
        "title": "Ariel-ML: Computing Parallelization with Embedded Rust for Neural Networks on Heterogeneous Multi-core Microcontrollers",
        "authors": [
            "Zhaolan Huang",
            "Kaspar Schleiser",
            "Gyungmin Myung",
            "Emmanuel Baccelli"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC); Performance (cs.PF)",
        "abstract": "Low-power microcontroller (MCU) hardware is currently evolving from single-core architectures to predominantly multi-core architectures. In parallel, new embedded software building blocks are more and more written in Rust, while C/C++ dominance fades in this domain. On the other hand, small artificial neural networks (ANN) of various kinds are increasingly deployed in edge AI use cases, thus deployed and executed directly on low-power MCUs. In this context, both incremental improvements and novel innovative services will have to be continuously retrofitted using ANNs execution in software embedded on sensing/actuating systems already deployed in the field. However, there was so far no Rust embedded software platform automating parallelization for inference computation on multi-core MCUs executing arbitrary TinyML models. This paper thus fills this gap by introducing Ariel-ML, a novel toolkit we designed combining a generic TinyML pipeline and an embedded Rust software platform which can take full advantage of multi-core capabilities of various 32bit microcontroller families (Arm Cortex-M, RISC-V, ESP-32). We published the full open source code of its implementation, which we used to benchmark its capabilities using a zoo of various TinyML models. We show that Ariel-ML outperforms prior art in terms of inference latency as expected, and we show that, compared to pre-existing toolkits using embedded C/C++, Ariel-ML achieves comparable memory footprints. Ariel-ML thus provides a useful basis for TinyML practitioners and resource-constrained embedded Rust developers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09810",
        "abs_url": "https://arxiv.org/abs/2512.09810",
        "pdf_url": "https://arxiv.org/pdf/2512.09810",
        "title": "Incorporating Fairness in Neighborhood Graphs for Fair Spectral Clustering",
        "authors": [
            "Adithya K Moorthy",
            "V Vijaya Saradhi",
            "Bhanu Prasad"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph clustering plays a pivotal role in unsupervised learning methods like spectral clustering, yet traditional methods for graph clustering often perpetuate bias through unfair graph constructions that may underrepresent some groups. The current research introduces novel approaches for constructing fair k-nearest neighbor (kNN) and fair epsilon-neighborhood graphs that proactively enforce demographic parity during graph formation. By incorporating fairness constraints at the earliest stage of neighborhood selection steps, our approaches incorporate proportional representation of sensitive features into the local graph structure while maintaining geometric this http URL work addresses a critical gap in pre-processing for fair spectral clustering, demonstrating that topological fairness in graph construction is essential for achieving equitable clustering outcomes. Widely used graph construction methods like kNN and epsilon-neighborhood graphs propagate edge based disparate impact on sensitive groups, leading to biased clustering results. Providing representation of each sensitive group in the neighborhood of every node leads to fairer spectral clustering results because the topological features of the graph naturally reflect equitable group ratios. This research fills an essential shortcoming in fair unsupervised learning, by illustrating how topological fairness in graph construction inherently facilitates fairer spectral clustering results without the need for changes to the clustering algorithm itself. Thorough experiments on three synthetic datasets, seven real-world tabular datasets, and three real-world image datasets prove that our fair graph construction methods surpass the current baselines in graph clustering tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09835",
        "abs_url": "https://arxiv.org/abs/2512.09835",
        "pdf_url": "https://arxiv.org/pdf/2512.09835",
        "title": "Predicting the Containment Time of California Wildfires Using Machine Learning",
        "authors": [
            "Shashank Bhardwaj"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "California's wildfire season keeps getting worse over the years, overwhelming the emergency response teams. These fires cause massive destruction to both property and human life. Because of these reasons, there's a growing need for accurate and practical predictions that can help assist with resources allocation for the Wildfire managers or the response teams. In this research, we built machine learning models to predict the number of days it will require to fully contain a wildfire in California. Here, we addressed an important gap in the current literature. Most prior research has concentrated on wildfire risk or how fires spread, and the few that examine the duration typically predict it in broader categories rather than a continuous measure. This research treats the wildfire duration prediction as a regression task, which allows for more detailed and precise forecasts rather than just the broader categorical predictions used in prior work. We built the models by combining three publicly available datasets from California Department of Forestry and Fire Protection's Fire and Resource Assessment Program (FRAP). This study compared the performance of baseline ensemble regressor, Random Forest and XGBoost, with a Long Short-Term Memory (LSTM) neural network. The results show that the XGBoost model slightly outperforms the Random Forest model, likely due to its superior handling of static features in the dataset. The LSTM model, on the other hand, performed worse than the ensemble models because the dataset lacked temporal features. Overall, this study shows that, depending on the feature availability, Wildfire managers or Fire management authorities can select the most appropriate model to accurately predict wildfire containment duration and allocate resources effectively.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09850",
        "abs_url": "https://arxiv.org/abs/2512.09850",
        "pdf_url": "https://arxiv.org/pdf/2512.09850",
        "title": "Conformal Bandits: Bringing statistical validity and reward efficiency to the small-gap regime",
        "authors": [
            "Simone Cuonzo",
            "Nina Deliu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce Conformal Bandits, a novel framework integrating Conformal Prediction (CP) into bandit problems, a classic paradigm for sequential decision-making under uncertainty. Traditional regret-minimisation bandit strategies like Thompson Sampling and Upper Confidence Bound (UCB) typically rely on distributional assumptions or asymptotic guarantees; further, they remain largely focused on regret, neglecting their statistical properties. We address this gap. Through the adoption of CP, we bridge the regret-minimising potential of a decision-making bandit policy with statistical guarantees in the form of finite-time prediction coverage. We demonstrate the potential of it Conformal Bandits through simulation studies and an application to portfolio allocation, a typical small-gap regime, where differences in arm rewards are far too small for classical policies to achieve optimal regret bounds in finite sample. Motivated by this, we showcase our framework's practical advantage in terms of regret in small-gap settings, as well as its added value in achieving nominal coverage guarantees where classical UCB policies fail. Focusing on our application of interest, we further illustrate how integrating hidden Markov models to capture the regime-switching behaviour of financial markets, enhances the exploration-exploitation trade-off, and translates into higher risk-adjusted regret efficiency returns, while preserving coverage guarantees.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09886",
        "abs_url": "https://arxiv.org/abs/2512.09886",
        "pdf_url": "https://arxiv.org/pdf/2512.09886",
        "title": "HPM-KD: Hierarchical Progressive Multi-Teacher Framework for Knowledge Distillation and Efficient Model Compression",
        "authors": [
            "Gustavo Coelho Haase",
            "Paulo Henrique Dourado da Silva"
        ],
        "comments": "9 pages",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "Knowledge Distillation (KD) has emerged as a promising technique for model compression but faces critical limitations: (1) sensitivity to hyperparameters requiring extensive manual tuning, (2) capacity gap when distilling from very large teachers to small students, (3) suboptimal coordination in multi-teacher scenarios, and (4) inefficient use of computational resources. We present \\textbf{HPM-KD}, a framework that integrates six synergistic components: (i) Adaptive Configuration Manager via meta-learning that eliminates manual hyperparameter tuning, (ii) Progressive Distillation Chain with automatically determined intermediate models, (iii) Attention-Weighted Multi-Teacher Ensemble that learns dynamic per-sample weights, (iv) Meta-Learned Temperature Scheduler that adapts temperature throughout training, (v) Parallel Processing Pipeline with intelligent load balancing, and (vi) Shared Optimization Memory for cross-experiment reuse. Experiments on CIFAR-10, CIFAR-100, and tabular datasets demonstrate that HPM-KD: achieves 10x-15x compression while maintaining 85% accuracy retention, eliminates the need for manual tuning, and reduces training time by 30-40% via parallelization. Ablation studies confirm independent contribution of each component (0.10-0.98 pp). HPM-KD is available as part of the open-source DeepBridge library.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09890",
        "abs_url": "https://arxiv.org/abs/2512.09890",
        "pdf_url": "https://arxiv.org/pdf/2512.09890",
        "title": "Analysis of Dirichlet Energies as Over-smoothing Measures",
        "authors": [
            "Anna Bison",
            "Alessandro Sperduti"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We analyze the distinctions between two functionals often used as over-smoothing measures: the Dirichlet energies induced by the unnormalized graph Laplacian and the normalized graph Laplacian. We demonstrate that the latter fails to satisfy the axiomatic definition of a node-similarity measure proposed by Rusch \\textit{et al.} By formalizing fundamental spectral properties of these two definitions, we highlight critical distinctions necessary to select the metric that is spectrally compatible with the GNN architecture, thereby resolving ambiguities in monitoring the dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09894",
        "abs_url": "https://arxiv.org/abs/2512.09894",
        "pdf_url": "https://arxiv.org/pdf/2512.09894",
        "title": "Exploring Protein Language Model Architecture-Induced Biases for Antibody Comprehension",
        "authors": [
            "Mengren",
            "Yixiang Zhang",
            "Yiming",
            "Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent advances in protein language models (PLMs) have demonstrated remarkable capabilities in understanding protein sequences. However, the extent to which different model architectures capture antibody-specific biological properties remains unexplored. In this work, we systematically investigate how architectural choices in PLMs influence their ability to comprehend antibody sequence characteristics and functions. We evaluate three state-of-the-art PLMs-AntiBERTa, BioBERT, and ESM2--against a general-purpose language model (GPT-2) baseline on antibody target specificity prediction tasks. Our results demonstrate that while all PLMs achieve high classification accuracy, they exhibit distinct biases in capturing biological features such as V gene usage, somatic hypermutation patterns, and isotype information. Through attention attribution analysis, we show that antibody-specific models like AntiBERTa naturally learn to focus on complementarity-determining regions (CDRs), while general protein models benefit significantly from explicit CDR-focused training strategies. These findings provide insights into the relationship between model architecture and biological feature extraction, offering valuable guidance for future PLM development in computational antibody design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09909",
        "abs_url": "https://arxiv.org/abs/2512.09909",
        "pdf_url": "https://arxiv.org/pdf/2512.09909",
        "title": "STACHE: Local Black-Box Explanations for Reinforcement Learning Policies",
        "authors": [
            "Andrew Elashkin",
            "Orna Grumberg"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Reinforcement learning agents often behave unexpectedly in sparse-reward or safety-critical environments, creating a strong need for reliable debugging and verification tools. In this paper, we propose STACHE, a comprehensive framework for generating local, black-box explanations for an agent's specific action within discrete Markov games. Our method produces a Composite Explanation consisting of two complementary components: (1) a Robustness Region, the connected neighborhood of states where the agent's action remains invariant, and (2) Minimal Counterfactuals, the smallest state perturbations required to alter that decision. By exploiting the structure of factored state spaces, we introduce an exact, search-based algorithm that circumvents the fidelity gaps of surrogate models. Empirical validation on Gymnasium environments demonstrates that our framework not only explains policy actions, but also effectively captures the evolution of policy logic during training - from erratic, unstable behavior to optimized, robust strategies - providing actionable insights into agent sensitivity and decision boundaries.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09929",
        "abs_url": "https://arxiv.org/abs/2512.09929",
        "pdf_url": "https://arxiv.org/pdf/2512.09929",
        "title": "Closing the Train-Test Gap in World Models for Gradient-Based Planning",
        "authors": [
            "Arjun Parthasarathy",
            "Nimit Kalra",
            "Rohun Agrawal",
            "Yann LeCun",
            "Oumayma Bounou",
            "Pavel Izmailov",
            "Micah Goldblum"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "World models paired with model predictive control (MPC) can be trained offline on large-scale datasets of expert trajectories and enable generalization to a wide range of planning tasks at inference time. Compared to traditional MPC procedures, which rely on slow search algorithms or on iteratively solving optimization problems exactly, gradient-based planning offers a computationally efficient alternative. However, the performance of gradient-based planning has thus far lagged behind that of other approaches. In this paper, we propose improved methods for training world models that enable efficient gradient-based planning. We begin with the observation that although a world model is trained on a next-state prediction objective, it is used at test-time to instead estimate a sequence of actions. The goal of our work is to close this train-test gap. To that end, we propose train-time data synthesis techniques that enable significantly improved gradient-based planning with existing world models. At test time, our approach outperforms or matches the classical gradient-free cross-entropy method (CEM) across a variety of object manipulation and navigation tasks in 10% of the time budget.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "1904.04375",
        "abs_url": "https://arxiv.org/abs/1904.04375",
        "pdf_url": "https://arxiv.org/pdf/1904.04375",
        "title": "Controlling Steering Angle for Cooperative Self-driving Vehicles utilizing CNN and LSTM-based Deep Networks",
        "authors": [
            "Rodolfo Valiente",
            "Mahdi Zaman",
            "Sedat Ozer",
            "Yaser P. Fallah"
        ],
        "comments": "Accepted in IV 2019, 6 pages, 9 figures",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "A fundamental challenge in autonomous vehicles is adjusting the steering angle at different road conditions. Recent state-of-the-art solutions addressing this challenge include deep learning techniques as they provide end-to-end solution to predict steering angles directly from the raw input images with higher accuracy. Most of these works ignore the temporal dependencies between the image frames. In this paper, we tackle the problem of utilizing multiple sets of images shared between two autonomous vehicles to improve the accuracy of controlling the steering angle by considering the temporal dependencies between the image frames. This problem has not been studied in the literature widely. We present and study a new deep architecture to predict the steering angle automatically by using Long-Short-Term-Memory (LSTM) in our deep architecture. Our deep architecture is an end-to-end network that utilizes CNN, LSTM and fully connected (FC) layers and it uses both present and futures images (shared by a vehicle ahead via Vehicle-to-Vehicle (V2V) communication) as input to control the steering angle. Our model demonstrates the lowest error when compared to the other existing approaches in the literature.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2202.00881",
        "abs_url": "https://arxiv.org/abs/2202.00881",
        "pdf_url": "https://arxiv.org/pdf/2202.00881",
        "title": "Robustness and Adaptability of Reinforcement Learning based Cooperative Autonomous Driving in Mixed-autonomy Traffic",
        "authors": [
            "Rodolfo Valiente",
            "Behrad Toghi",
            "Ramtin Pedarsani",
            "Yaser P. Fallah"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Building autonomous vehicles (AVs) is a complex problem, but enabling them to operate in the real world where they will be surrounded by human-driven vehicles (HVs) is extremely challenging. Prior works have shown the possibilities of creating inter-agent cooperation between a group of AVs that follow a social utility. Such altruistic AVs can form alliances and affect the behavior of HVs to achieve socially desirable outcomes. We identify two major challenges in the co-existence of AVs and HVs. First, social preferences and individual traits of a given human driver, e.g., selflessness and aggressiveness are unknown to an AV, and it is almost impossible to infer them in real-time during a short AV-HV interaction. Second, contrary to AVs that are expected to follow a policy, HVs do not necessarily follow a stationary policy and therefore are extremely hard to predict. To alleviate the above-mentioned challenges, we formulate the mixed-autonomy problem as a multi-agent reinforcement learning (MARL) problem and propose a decentralized framework and reward function for training cooperative AVs. Our approach enables AVs to learn the decision-making of HVs implicitly from experience, optimizes for a social utility while prioritizing safety and allowing adaptability; robustifying altruistic AVs to different human behaviors and constraining them to a safe action space. Finally, we investigate the robustness, safety and sensitivity of AVs to various HVs behavioral traits and present the settings in which the AVs can learn cooperative policies that are adaptable to different situations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2211.11963",
        "abs_url": "https://arxiv.org/abs/2211.11963",
        "pdf_url": "https://arxiv.org/pdf/2211.11963",
        "title": "Learning-based social coordination to improve safety and robustness of cooperative autonomous vehicles in mixed traffic",
        "authors": [
            "Rodolfo Valiente",
            "Behrad Toghi",
            "Mahdi Razzaghpour",
            "Ramtin Pedarsani",
            "Yaser P. Fallah"
        ],
        "comments": "arXiv admin note: substantial text overlap with arXiv:2202.00881",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "It is expected that autonomous vehicles(AVs) and heterogeneous human-driven vehicles(HVs) will coexist on the same road. The safety and reliability of AVs will depend on their social awareness and their ability to engage in complex social interactions in a socially accepted manner. However, AVs are still inefficient in terms of cooperating with HVs and struggle to understand and adapt to human behavior, which is particularly challenging in mixed autonomy. In a road shared by AVs and HVs, the social preferences or individual traits of HVs are unknown to the AVs and different from AVs, which are expected to follow a policy, HVs are particularly difficult to forecast since they do not necessarily follow a stationary policy. To address these challenges, we frame the mixed-autonomy problem as a multi-agent reinforcement learning (MARL) problem and propose an approach that allows AVs to learn the decision-making of HVs implicitly from experience, account for all vehicles' interests, and safely adapt to other traffic situations. In contrast with existing works, we quantify AVs' social preferences and propose a distributed reward structure that introduces altruism into their decision-making process, allowing the altruistic AVs to learn to establish coalitions and influence the behavior of HVs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08948",
        "abs_url": "https://arxiv.org/abs/2512.08948",
        "pdf_url": "https://arxiv.org/pdf/2512.08948",
        "title": "Online Inference of Constrained Optimization: Primal-Dual Optimality and Sequential Quadratic Programming",
        "authors": [
            "Yihang Gao",
            "Michael K. Ng",
            "Michael W. Mahoney",
            "Sen Na"
        ],
        "comments": "80 pages, 5 figures, 5 tables",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Optimization and Control (math.OC); Statistics Theory (math.ST)",
        "abstract": "We study online statistical inference for the solutions of stochastic optimization problems with equality and inequality constraints. Such problems are prevalent in statistics and machine learning, encompassing constrained $M$-estimation, physics-informed models, safe reinforcement learning, and algorithmic fairness. We develop a stochastic sequential quadratic programming (SSQP) method to solve these problems, where the step direction is computed by sequentially performing a quadratic approximation of the objective and a linear approximation of the constraints. Despite having access to unbiased estimates of population gradients, a key challenge in constrained stochastic problems lies in dealing with the bias in the step direction. As such, we apply a momentum-style gradient moving-average technique within SSQP to debias the step. We show that our method achieves global almost-sure convergence and exhibits local asymptotic normality with an optimal primal-dual limiting covariance matrix in the sense of Hájek and Le Cam. In addition, we provide a plug-in covariance matrix estimator for practical inference. To our knowledge, the proposed SSQP method is the first fully online method that attains primal-dual asymptotic minimax optimality without relying on projection operators onto the constraint set, which are generally intractable for nonlinear problems. Through extensive experiments on benchmark nonlinear problems, as well as on constrained generalized linear models and portfolio allocation problems using both synthetic and real data, we demonstrate superior performance of our method, showing that the method and its asymptotic behavior not only solve constrained stochastic problems efficiently but also provide valid and practical online inference in real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08963",
        "abs_url": "https://arxiv.org/abs/2512.08963",
        "pdf_url": "https://arxiv.org/pdf/2512.08963",
        "title": "Multivariate time series prediction using clustered echo state network",
        "authors": [
            "S. Hariharan",
            "R. Suresh",
            "V. K. Chandrasekar"
        ],
        "comments": "Published in Eur. Phys. J. Plus 140, 1133 (2025)",
        "subjects": "Chaotic Dynamics (nlin.CD); Machine Learning (cs.LG)",
        "abstract": "Many natural and physical processes can be understood by analyzing multiple system variables evolving, forming a multivariate time series. Predicting such time series is challenging due to the inherent noise and interdependencies among variables. Echo state networks (ESNs), a class of Reservoir Computing (RC) models, offer an efficient alternative to conventional recurrent neural networks by training only the output weights while keeping the reservoir dynamics fixed, reducing computational complexity. We propose a clustered ESNs (CESNs) that enhances the ability to model and predict multivariate time series by organizing the reservoir nodes into clusters, each corresponding to a distinct input variable. Input signals are directly mapped to their associated clusters, and intra-cluster connections remain dense while inter-cluster connections are sparse, mimicking the modular architecture of biological neural networks. This architecture improves information processing by limiting cross-variable interference and enhances computational efficiency through independent cluster-wise training via ridge regression. We further explore different reservoir topologies, including ring, Erdős-Rényi (ER), and scale-free (SF) networks, to evaluate their impact predictive performance. Our algorithm works well across diverse real-world datasets such as the stock market, solar wind, and chaotic Rössler system, demonstrating that CESNs consistently outperform conventional ESNs in terms of predictive accuracy and robustness to noise, particularly when using ER and SF topologies. These findings highlight the adaptability of CESNs for complex, multivariate time series forecasting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08974",
        "abs_url": "https://arxiv.org/abs/2512.08974",
        "pdf_url": "https://arxiv.org/pdf/2512.08974",
        "title": "FuXi-Nowcast: Meet the longstanding challenge of convective initiation in nowcasting",
        "authors": [
            "Lei Chen",
            "Zijian Zhu",
            "Xiaoran Zhuang",
            "Tianyuan Qi",
            "Yuxuan Feng",
            "Xiaohui Zhong",
            "Hao Li"
        ],
        "comments": "",
        "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph); Machine Learning (cs.LG)",
        "abstract": "Accurate nowcasting of convective storms remains a major challenge for operational forecasting, particularly for convective initiation and the evolution of high-impact rainfall and strong winds. Here we present FuXi-Nowcast, a deep-learning system that jointly predicts composite radar reflectivity, surface precipitation, near-surface temperature, wind speed and wind gusts at 1-km resolution over eastern China. FuXi-Nowcast integrates multi-source observations, such as radar, surface stations and the High-Resolution Land Data Assimilation System (HRLDAS), with three-dimensional atmospheric fields from the machine-learning weather model FuXi-2.0 within a multi-task Swin-Transformer architecture. A convective signal enhancement module and distribution-aware hybrid loss functions are designed to preserve intense convective structures and mitigate the rapid intensity decay common in deep-learning nowcasts. FuXi-Nowcast surpasses the operational CMA-MESO 3-km numerical model in Critical Success Index for reflectivity, precipitation and wind gusts across thresholds and lead times up to 12 h, with the largest gains for heavy rainfall. Case studies further show that FuXi-Nowcast more accurately captures the timing, location and structure of convective initiation and subsequent evolution of convection. These results demonstrate that coupling three-dimensional machine-learning forecasts with high-resolution observations can provide multi-hazard, long-lead nowcasts that outperforms current operational systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.08992",
        "abs_url": "https://arxiv.org/abs/2512.08992",
        "pdf_url": "https://arxiv.org/pdf/2512.08992",
        "title": "Enhanced Chest Disease Classification Using an Improved CheXNet Framework with EfficientNetV2-M and Optimization-Driven Learning",
        "authors": [
            "Ali M. Bahram",
            "Saman Muhammad Omer",
            "Hardi M. Mohammed",
            "Sirwan Abdolwahed Aula"
        ],
        "comments": "23 pages, 6 figures, 7 tables",
        "subjects": "Image and Video Processing (eess.IV); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "The interpretation of Chest X-ray is an important diagnostic issue in clinical practice and especially in the resource-limited setting where the shortage of radiologists plays a role in delayed diagnosis and poor patient outcomes. Although the original CheXNet architecture has shown potential in automated analysis of chest radiographs, DenseNet-121 backbone is computationally inefficient and poorly single-label classifier. To eliminate such shortcomings, we suggest a better classification framework of chest disease that relies on EfficientNetV2-M and incorporates superior training approaches such as Automatic Mixed Precision training, AdamW, Cosine Annealing learning rate scheduling, and Exponential Moving Average regularization. We prepared a dataset of 18,080 chest X-ray images of three source materials of high authority and representing five key clinically significant disease categories which included Cardiomegaly, COVID-19, Normal, Pneumonia, and Tuberculosis. To achieve statistical reliability and reproducibility, nine independent experimental runs were run. The suggested architecture showed significant gains with mean test accuracy of 96.45 percent compared to 95.30 percent at baseline (p less than 0.001) and macro-averaged F1-score increased to 91.08 percent (p less than 0.001). Critical infectious diseases showed near-perfect classification performance with COVID-19 detection having 99.95 percent accuracy and Tuberculosis detection having 99.97 percent accuracy. Although 6.8 times more parameters are included, the training time was reduced by 11.4 percent and performance stability was increased by 22.7 percent. This framework presents itself as a decision-support tool that can be used to respond to a pandemic, screen tuberculosis, and assess thoracic disease regularly in various healthcare facilities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09015",
        "abs_url": "https://arxiv.org/abs/2512.09015",
        "pdf_url": "https://arxiv.org/pdf/2512.09015",
        "title": "Luxical: High-Speed Lexical-Dense Text Embeddings",
        "authors": [
            "DatologyAI",
            "Luke Merrick",
            "Alex Fang",
            "Aldo Carranza",
            "Alvin Deng",
            "Amro Abbas",
            "Brett Larsen",
            "Cody Blakeney",
            "Darren Teh",
            "David Schwab",
            "Fan Pan",
            "Haakon Mongstad",
            "Haoli Yin",
            "Jack Urbanek",
            "Jason Lee",
            "Jason Telanoff",
            "Josh Wills",
            "Kaleigh Mentzer",
            "Paul Burstein",
            "Parth Doshi",
            "Paul Burnstein",
            "Pratyush Maini",
            "Ricardo Monti",
            "Rishabh Adiga",
            "Scott Loftin",
            "Siddharth Joshi",
            "Spandan Das",
            "Tony Jiang",
            "Vineeth Dorma",
            "Zhengping Wang",
            "Bogdan Gaza",
            "Ari Morcos",
            "Matthew Leavitt"
        ],
        "comments": "9 pages, 6 figures",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Frontier language model quality increasingly hinges on our ability to organize web-scale text corpora for training. Today's dominant tools trade off speed and flexibility: lexical classifiers (e.g., FastText) are fast but limited to producing classification output scores, while the vector-valued outputs of transformer text embedding models flexibly support numerous workflows (e.g., clustering, classification, and retrieval) but are computationally expensive to produce. We introduce Luxical, a library for high-speed \"lexical-dense\" text embeddings that aims to recover the best properties of both approaches for web-scale text organization. Luxical combines sparse TF--IDF features, a small ReLU network, and a knowledge distillation training regimen to approximate large transformer embedding models at a fraction of their operational cost. In this technical report, we describe the Luxical architecture and training objective and evaluate a concrete Luxical model in two disparate applications: a targeted webcrawl document retrieval test and an end-to-end language model data curation task grounded in text classification. In these tasks we demonstrate speedups ranging from 3x to 100x over varying-sized neural baselines, and comparable to FastText model inference during the data curation task. On these evaluations, the tested Luxical model illustrates favorable compute/quality trade-offs for large-scale text organization, matching the quality of neural baselines. Luxical is available as open-source software at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09021",
        "abs_url": "https://arxiv.org/abs/2512.09021",
        "pdf_url": "https://arxiv.org/pdf/2512.09021",
        "title": "Interpretable machine learning of halo gas density profiles: a sensitivity analysis of cosmological hydrodynamical simulations",
        "authors": [
            "Daniele Sorini",
            "Sownak Bose",
            "Mathilda Denison",
            "Romeel Davé"
        ],
        "comments": "To be submitted to The Open Journal of Astrophysics",
        "subjects": "Astrophysics of Galaxies (astro-ph.GA); Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)",
        "abstract": "Stellar and AGN-driven feedback processes affect the distribution of gas on a wide range of scales, from within galaxies well into the intergalactic medium. Yet, it remains unclear how feedback, through its connection to key galaxy properties, shapes the radial gas density profile in the host halo. We tackle this question using suites of the EAGLE, IllustrisTNG, and Simba cosmological hydrodynamical simulations, which span a variety of feedback models. We develop a random forest algorithm that predicts the radial gas density profile within haloes from the total halo mass and five global properties of the central galaxy: gas and stellar mass; star formation rate; mass and accretion rate of the central black hole (BH). The algorithm reproduces the simulated gas density profiles with an average accuracy of $\\sim$80-90% over the halo mass range $10^{9.5} \\, \\mathrm{M}_{\\odot} < M_{\\rm 200c} < 10^{15} \\, \\mathrm{M}_{\\odot}$ and redshift interval $0<z<4$. For the first time, we apply Sobol statistical sensitivity analysis to full cosmological hydrodynamical simulations, quantifying how each feature affects the gas density as a function of distance from the halo centre. Across all simulations and redshifts, the total halo mass and the gas mass of the central galaxy are the most strongly tied to the halo gas distribution, while stellar and BH properties are generally less informative. The exact relative importance of the different features depends on the feedback scenario and redshift. Our framework can be readily embedded in semi-analytic models of galaxy formation to incorporate halo gas density profiles consistent with different hydrodynamical simulations. Our work also provides a proof of concept for constraining feedback models with future observations of galaxy properties and of the surrounding gas distribution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09069",
        "abs_url": "https://arxiv.org/abs/2512.09069",
        "pdf_url": "https://arxiv.org/pdf/2512.09069",
        "title": "KD-OCT: Efficient Knowledge Distillation for Clinical-Grade Retinal OCT Classification",
        "authors": [
            "Erfan Nourbakhsh",
            "Nasrin Sanjari",
            "Ali Nourbakhsh"
        ],
        "comments": "7 pages, 5 figures",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Age-related macular degeneration (AMD) and choroidal neovascularization (CNV)-related conditions are leading causes of vision loss worldwide, with optical coherence tomography (OCT) serving as a cornerstone for early detection and management. However, deploying state-of-the-art deep learning models like ConvNeXtV2-Large in clinical settings is hindered by their computational demands. Therefore, it is desirable to develop efficient models that maintain high diagnostic performance while enabling real-time deployment. In this study, a novel knowledge distillation framework, termed KD-OCT, is proposed to compress a high-performance ConvNeXtV2-Large teacher model, enhanced with advanced augmentations, stochastic weight averaging, and focal loss, into a lightweight EfficientNet-B2 student for classifying normal, drusen, and CNV cases. KD-OCT employs real-time distillation with a combined loss balancing soft teacher knowledge transfer and hard ground-truth supervision. The effectiveness of the proposed method is evaluated on the Noor Eye Hospital (NEH) dataset using patient-level cross-validation. Experimental results demonstrate that KD-OCT outperforms comparable multi-scale or feature-fusion OCT classifiers in efficiency- accuracy balance, achieving near-teacher performance with substantial reductions in model size and inference time. Despite the compression, the student model exceeds most existing frameworks, facilitating edge deployment for AMD screening. Code is available at this https URL OCT.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09070",
        "abs_url": "https://arxiv.org/abs/2512.09070",
        "pdf_url": "https://arxiv.org/pdf/2512.09070",
        "title": "Banach neural operator for Navier-Stokes equations",
        "authors": [
            "Bo Zhang"
        ],
        "comments": "",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Classical neural networks are known for their ability to approximate mappings between finite-dimensional spaces, but they fall short in capturing complex operator dynamics across infinite-dimensional function spaces. Neural operators, in contrast, have emerged as powerful tools in scientific machine learning for learning such mappings. However, standard neural operators typically lack mechanisms for mixing or attending to input information across space and time. In this work, we introduce the Banach neural operator (BNO) -- a novel framework that integrates Koopman operator theory with deep neural networks to predict nonlinear, spatiotemporal dynamics from partial observations. The BNO approximates a nonlinear operator between Banach spaces by combining spectral linearization (via Koopman theory) with deep feature learning (via convolutional neural networks and nonlinear activations). This sequence-to-sequence model captures dominant dynamic modes and allows for mesh-independent prediction. Numerical experiments on the Navier-Stokes equations demonstrate the method's accuracy and generalization capabilities. In particular, BNO achieves robust zero-shot super-resolution in unsteady flow prediction and consistently outperforms conventional Koopman-based methods and deep learning models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09152",
        "abs_url": "https://arxiv.org/abs/2512.09152",
        "pdf_url": "https://arxiv.org/pdf/2512.09152",
        "title": "Understanding temperature tuning in energy-based models",
        "authors": [
            "Peter W Fields",
            "Vudtiwat Ngampruetikorn",
            "David J Schwab",
            "Stephanie E Palmer"
        ],
        "comments": "18 pages, 7 figures",
        "subjects": "Quantitative Methods (q-bio.QM); Machine Learning (cs.LG)",
        "abstract": "Generative models of complex systems often require post-hoc parameter adjustments to produce useful outputs. For example, energy-based models for protein design are sampled at an artificially low ''temperature'' to generate novel, functional sequences. This temperature tuning is a common yet poorly understood heuristic used across machine learning contexts to control the trade-off between generative fidelity and diversity. Here, we develop an interpretable, physically motivated framework to explain this phenomenon. We demonstrate that in systems with a large ''energy gap'' - separating a small fraction of meaningful states from a vast space of unrealistic states - learning from sparse data causes models to systematically overestimate high-energy state probabilities, a bias that lowering the sampling temperature corrects. More generally, we characterize how the optimal sampling temperature depends on the interplay between data size and the system's underlying energy landscape. Crucially, our results show that lowering the sampling temperature is not always desirable; we identify the conditions where \\emph{raising} it results in better generative performance. Our framework thus casts post-hoc temperature tuning as a diagnostic tool that reveals properties of the true data distribution and the limits of the learned model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09163",
        "abs_url": "https://arxiv.org/abs/2512.09163",
        "pdf_url": "https://arxiv.org/pdf/2512.09163",
        "title": "WTNN: Weibull-Tailored Neural Networks for survival analysis",
        "authors": [
            "Gabrielle Rives",
            "Olivier Lopez",
            "Nicolas Bousquet"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Applications (stat.AP); Methodology (stat.ME)",
        "abstract": "The Weibull distribution is a commonly adopted choice for modeling the survival of systems subject to maintenance over time. When only proxy indicators and censored observations are available, it becomes necessary to express the distribution's parameters as functions of time-dependent covariates. Deep neural networks provide the flexibility needed to learn complex relationships between these covariates and operational lifetime, thereby extending the capabilities of traditional regression-based models. Motivated by the analysis of a fleet of military vehicles operating in highly variable and demanding environments, as well as by the limitations observed in existing methodologies, this paper introduces WTNN, a new neural network-based modeling framework specifically designed for Weibull survival studies. The proposed architecture is specifically designed to incorporate qualitative prior knowledge regarding the most influential covariates, in a manner consistent with the shape and structure of the Weibull distribution. Through numerical experiments, we show that this approach can be reliably trained on proxy and right-censored data, and is capable of producing robust and interpretable survival predictions that can improve existing approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09266",
        "abs_url": "https://arxiv.org/abs/2512.09266",
        "pdf_url": "https://arxiv.org/pdf/2512.09266",
        "title": "Robust and Sparse Estimation of Unbounded Density Ratio under Heavy Contamination",
        "authors": [
            "Ryosuke Nagumo",
            "Hironori Fujisawa"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We examine the non-asymptotic properties of robust density ratio estimation (DRE) in contaminated settings. Weighted DRE is the most promising among existing methods, exhibiting doubly strong robustness from an asymptotic perspective. This study demonstrates that Weighted DRE achieves sparse consistency even under heavy contamination within a non-asymptotic framework. This method addresses two significant challenges in density ratio estimation and robust estimation. For density ratio estimation, we provide the non-asymptotic properties of estimating unbounded density ratios under the assumption that the weighted density ratio function is bounded. For robust estimation, we introduce a non-asymptotic framework for doubly strong robustness under heavy contamination, assuming that at least one of the following conditions holds: (i) contamination ratios are small, and (ii) outliers have small weighted values. This work provides the first non-asymptotic analysis of strong robustness under heavy contamination.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09275",
        "abs_url": "https://arxiv.org/abs/2512.09275",
        "pdf_url": "https://arxiv.org/pdf/2512.09275",
        "title": "Impact of Positional Encoding: Clean and Adversarial Rademacher Complexity for Transformers under In-Context Regression",
        "authors": [
            "Weiyi He",
            "Yue Xing"
        ],
        "comments": "25 pages, 3 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Positional encoding (PE) is a core architectural component of Transformers, yet its impact on the Transformer's generalization and robustness remains unclear. In this work, we provide the first generalization analysis for a single-layer Transformer under in-context regression that explicitly accounts for a completely trainable PE module. Our result shows that PE systematically enlarges the generalization gap. Extending to the adversarial setting, we derive the adversarial Rademacher generalization bound. We find that the gap between models with and without PE is magnified under attack, demonstrating that PE amplifies the vulnerability of models. Our bounds are empirically validated by a simulation study. Together, this work establishes a new framework for understanding the clean and adversarial generalization in ICL with PE.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09295",
        "abs_url": "https://arxiv.org/abs/2512.09295",
        "pdf_url": "https://arxiv.org/pdf/2512.09295",
        "title": "Distributional Shrinkage II: Optimal Transport Denoisers with Higher-Order Scores",
        "authors": [
            "Tengyuan Liang"
        ],
        "comments": "23 pages",
        "subjects": "Statistics Theory (math.ST); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We revisit the signal denoising problem through the lens of optimal transport: the goal is to recover an unknown scalar signal distribution $X \\sim P$ from noisy observations $Y = X + \\sigma Z$, with $Z$ being standard Gaussian independent of $X$ and $\\sigma>0$ a known noise level. Let $Q$ denote the distribution of $Y$. We introduce a hierarchy of denoisers $T_0, T_1, \\ldots, T_\\infty : \\mathbb{R} \\to \\mathbb{R}$ that are agnostic to the signal distribution $P$, depending only on higher-order score functions of $Q$. Each denoiser $T_K$ is progressively refined using the $(2K-1)$-th order score function of $Q$ at noise resolution $\\sigma^{2K}$, achieving better denoising quality measured by the Wasserstein metric $W(T_K \\sharp Q, P)$. The limiting denoiser $T_\\infty$ identifies the optimal transport map with $T_\\infty \\sharp Q = P$. We provide a complete characterization of the combinatorial structure underlying this hierarchy through Bell polynomial recursions, revealing how higher-order score functions encode the optimal transport map for signal denoising. We study two estimation strategies with convergence rates for higher-order scores from i.i.d. samples drawn from $Q$: (i) plug-in estimation via Gaussian kernel smoothing, and (ii) direct estimation via higher-order score matching. This hierarchy of agnostic denoisers opens new perspectives in signal denoising and empirical Bayes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09366",
        "abs_url": "https://arxiv.org/abs/2512.09366",
        "pdf_url": "https://arxiv.org/pdf/2512.09366",
        "title": "Meta-learning three-factor plasticity rules for structured credit assignment with sparse feedback",
        "authors": [
            "Dimitra Maoutsa"
        ],
        "comments": "10 pages, 2 figures; accepted & presented at NeurIPS 2025 workshop Symmetry and Geometry in Neural Representations (NeurReps)",
        "subjects": "Neurons and Cognition (q-bio.NC); Disordered Systems and Neural Networks (cond-mat.dis-nn); Machine Learning (cs.LG); Biological Physics (physics.bio-ph)",
        "abstract": "Biological neural networks learn complex behaviors from sparse, delayed feedback using local synaptic plasticity, yet the mechanisms enabling structured credit assignment remain elusive. In contrast, artificial recurrent networks solving similar tasks typically rely on biologically implausible global learning rules or hand-crafted local updates. The space of local plasticity rules capable of supporting learning from delayed reinforcement remains largely unexplored. Here, we present a meta-learning framework that discovers local learning rules for structured credit assignment in recurrent networks trained with sparse feedback. Our approach interleaves local neo-Hebbian-like updates during task execution with an outer loop that optimizes plasticity parameters via \\textbf{tangent-propagation through learning}. The resulting three-factor learning rules enable long-timescale credit assignment using only local information and delayed rewards, offering new insights into biologically grounded mechanisms for learning in recurrent circuits.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09385",
        "abs_url": "https://arxiv.org/abs/2512.09385",
        "pdf_url": "https://arxiv.org/pdf/2512.09385",
        "title": "BugSweeper: Function-Level Detection of Smart Contract Vulnerabilities Using Graph Neural Networks",
        "authors": [
            "Uisang Lee",
            "Changhoon Chung",
            "Junmo Lee",
            "Soo-Mook Moon"
        ],
        "comments": "This paper is accepted to AAAI 2026",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "The rapid growth of Ethereum has made it more important to quickly and accurately detect smart contract vulnerabilities. While machine-learning-based methods have shown some promise, many still rely on rule-based preprocessing designed by domain experts. Rule-based preprocessing methods often discard crucial context from the source code, potentially causing certain vulnerabilities to be overlooked and limiting adaptability to newly emerging threats. We introduce BugSweeper, an end-to-end deep learning framework that detects vulnerabilities directly from the source code without manual engineering. BugSweeper represents each Solidity function as a Function-Level Abstract Syntax Graph (FLAG), a novel graph that combines its Abstract Syntax Tree (AST) with enriched control-flow and data-flow semantics. Then, our two-stage Graph Neural Network (GNN) analyzes these graphs. The first-stage GNN filters noise from the syntax graphs, while the second-stage GNN conducts high-level reasoning to detect diverse vulnerabilities. Extensive experiments on real-world contracts show that BugSweeper significantly outperforms all state-of-the-art detection methods. By removing the need for handcrafted rules, our approach offers a robust, automated, and scalable solution for securing smart contracts without any dependence on security experts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09393",
        "abs_url": "https://arxiv.org/abs/2512.09393",
        "pdf_url": "https://arxiv.org/pdf/2512.09393",
        "title": "Detection and Localization of Subdural Hematoma Using Deep Learning on Computed Tomography",
        "authors": [
            "Vasiliki Stoumpou",
            "Rohan Kumar",
            "Bernard Burman",
            "Diego Ojeda",
            "Tapan Mehta",
            "Dimitris Bertsimas"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Background. Subdural hematoma (SDH) is a common neurosurgical emergency, with increasing incidence in aging populations. Rapid and accurate identification is essential to guide timely intervention, yet existing automated tools focus primarily on detection and provide limited interpretability or spatial localization. There remains a need for transparent, high-performing systems that integrate multimodal clinical and imaging information to support real-time decision-making. Methods. We developed a multimodal deep-learning framework that integrates structured clinical variables, a 3D convolutional neural network trained on CT volumes, and a transformer-enhanced 2D segmentation model for SDH detection and localization. Using 25,315 head CT studies from Hartford HealthCare (2015--2024), of which 3,774 (14.9\\%) contained clinician-confirmed SDH, tabular models were trained on demographics, comorbidities, medications, and laboratory results. Imaging models were trained to detect SDH and generate voxel-level probability maps. A greedy ensemble strategy combined complementary predictors. Findings. Clinical variables alone provided modest discriminatory power (AUC 0.75). Convolutional models trained on CT volumes and segmentation-derived maps achieved substantially higher accuracy (AUCs 0.922 and 0.926). The multimodal ensemble integrating all components achieved the best overall performance (AUC 0.9407; 95\\% CI, 0.930--0.951) and produced anatomically meaningful localization maps consistent with known SDH patterns. Interpretation. This multimodal, interpretable framework provides rapid and accurate SDH detection and localization, achieving high detection performance and offering transparent, anatomically grounded outputs. Integration into radiology workflows could streamline triage, reduce time to intervention, and improve consistency in SDH management.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09410",
        "abs_url": "https://arxiv.org/abs/2512.09410",
        "pdf_url": "https://arxiv.org/pdf/2512.09410",
        "title": "Generalizable Collaborative Search-and-Capture in Cluttered Environments via Path-Guided MAPPO and Directional Frontier Allocation",
        "authors": [
            "Jialin Ying",
            "Zhihao Li",
            "Zicheng Dong",
            "Guohua Wu",
            "Yihuan Liao"
        ],
        "comments": "7 pages, 7 figures",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Collaborative pursuit-evasion in cluttered environments presents significant challenges due to sparse rewards and constrained Fields of View (FOV). Standard Multi-Agent Reinforcement Learning (MARL) often suffers from inefficient exploration and fails to scale to large scenarios. We propose PGF-MAPPO (Path-Guided Frontier MAPPO), a hierarchical framework bridging topological planning with reactive control. To resolve local minima and sparse rewards, we integrate an A*-based potential field for dense reward shaping. Furthermore, we introduce Directional Frontier Allocation, combining Farthest Point Sampling (FPS) with geometric angle suppression to enforce spatial dispersion and accelerate coverage. The architecture employs a parameter-shared decentralized critic, maintaining O(1) model complexity suitable for robotic swarms. Experiments demonstrate that PGF-MAPPO achieves superior capture efficiency against faster evaders. Policies trained on 10x10 maps exhibit robust zero-shot generalization to unseen 20x20 environments, significantly outperforming rule-based and learning-based baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09458",
        "abs_url": "https://arxiv.org/abs/2512.09458",
        "pdf_url": "https://arxiv.org/pdf/2512.09458",
        "title": "Architectures for Building Agentic AI",
        "authors": [
            "Sławomir Nowaczyk"
        ],
        "comments": "This is a preprint of a chapter accepted for publication in Generative and Agentic AI Reliability: Architectures, Challenges, and Trust for Autonomous Systems, published by Springer Nature",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "This chapter argues that the reliability of agentic and generative AI is chiefly an architectural property. We define agentic systems as goal-directed, tool-using decision makers operating in closed loops, and show how reliability emerges from principled componentisation (goal manager, planner, tool-router, executor, memory, verifiers, safety monitor, telemetry), disciplined interfaces (schema-constrained, validated, least-privilege tool calls), and explicit control and assurance loops. Building on classical foundations, we propose a practical taxonomy-tool-using agents, memory-augmented agents, planning and self-improvement agents, multi-agent systems, and embodied or web agents - and analyse how each pattern reshapes the reliability envelope and failure modes. We distil design guidance on typed schemas, idempotency, permissioning, transactional semantics, memory provenance and hygiene, runtime governance (budgets, termination conditions), and simulate-before-actuate safeguards.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09472",
        "abs_url": "https://arxiv.org/abs/2512.09472",
        "pdf_url": "https://arxiv.org/pdf/2512.09472",
        "title": "WarmServe: Enabling One-for-Many GPU Prewarming for Multi-LLM Serving",
        "authors": [
            "Chiheng Lou",
            "Sheng Qi",
            "Rui Kang",
            "Yong Zhang",
            "Chen Sun",
            "Pengcheng Wang",
            "Bingyang Liu",
            "Xuanzhe Liu",
            "Xin Jin"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "Deploying multiple models within shared GPU clusters is promising for improving resource efficiency in large language model (LLM) serving. Existing multi-LLM serving systems optimize GPU utilization at the cost of worse inference performance, especially time-to-first-token (TTFT). We identify the root cause of such compromise as their unawareness of future workload characteristics. In contrast, recent analysis on real-world traces has shown the high periodicity and long-term predictability of LLM serving workloads. We propose universal GPU workers to enable one-for-many GPU prewarming that loads models with knowledge of future workloads. Based on universal GPU workers, we design and build WarmServe, a multi-LLM serving system that (1) mitigates cluster-wide prewarming interference by adopting an evict-aware model placement strategy, (2) prepares universal GPU workers in advance by proactive prewarming, and (3) manages GPU memory with a zero-overhead memory switching mechanism. Evaluation under real-world datasets shows that WarmServe improves TTFT by up to 50.8$\\times$ compared to the state-of-the-art autoscaling-based system, while being capable of serving up to 2.5$\\times$ more requests compared to the GPU-sharing system.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09499",
        "abs_url": "https://arxiv.org/abs/2512.09499",
        "pdf_url": "https://arxiv.org/pdf/2512.09499",
        "title": "Estimation of Stochastic Optimal Transport Maps",
        "authors": [
            "Sloan Nietert",
            "Ziv Goldfeld"
        ],
        "comments": "Appeared at NeurIPS 2025",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "The optimal transport (OT) map is a geometry-driven transformation between high-dimensional probability distributions which underpins a wide range of tasks in statistics, applied probability, and machine learning. However, existing statistical theory for OT map estimation is quite restricted, hinging on Brenier's theorem (quadratic cost, absolutely continuous source) to guarantee existence and uniqueness of a deterministic OT map, on which various additional regularity assumptions are imposed to obtain quantitative error bounds. In many real-world problems these conditions fail or cannot be certified, in which case optimal transportation is possible only via stochastic maps that can split mass. To broaden the scope of map estimation theory to such settings, this work introduces a novel metric for evaluating the transportation quality of stochastic maps. Under this metric, we develop computationally efficient map estimators with near-optimal finite-sample risk bounds, subject to easy-to-verify minimal assumptions. Our analysis further accommodates common forms of adversarial sample contamination, yielding estimators with robust estimation guarantees. Empirical experiments are provided which validate our theory and demonstrate the utility of the proposed framework in settings where existing theory fails. These contributions constitute the first general-purpose theory for map estimation, compatible with a wide spectrum of real-world applications where optimal transport may be intrinsically stochastic.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09514",
        "abs_url": "https://arxiv.org/abs/2512.09514",
        "pdf_url": "https://arxiv.org/pdf/2512.09514",
        "title": "Transport Novelty Distance: A Distributional Metric for Evaluating Material Generative Models",
        "authors": [
            "Paul Hagemann",
            "Simon Müller",
            "Janine George",
            "Philipp Benner"
        ],
        "comments": "",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG)",
        "abstract": "Recent advances in generative machine learning have opened new possibilities for the discovery and design of novel materials. However, as these models become more sophisticated, the need for rigorous and meaningful evaluation metrics has grown. Existing evaluation approaches often fail to capture both the quality and novelty of generated structures, limiting our ability to assess true generative performance. In this paper, we introduce the Transport Novelty Distance (TNovD) to judge generative models used for materials discovery jointly by the quality and novelty of the generated materials. Based on ideas from Optimal Transport theory, TNovD uses a coupling between the features of the training and generated sets, which is refined into a quality and memorization regime by a threshold. The features are generated from crystal structures using a graph neural network that is trained to distinguish between materials, their augmented counterparts, and differently sized supercells using contrastive learning. We evaluate our proposed metric on typical toy experiments relevant for crystal structure prediction, including memorization, noise injection and lattice deformations. Additionally, we validate the TNovD on the MP20 validation set and the WBM substitution dataset, demonstrating that it is capable of detecting both memorized and low-quality material data. We also benchmark the performance of several popular material generative models. While introduced for materials, our TNovD framework is domain-agnostic and can be adapted for other areas, such as images and molecules.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09530",
        "abs_url": "https://arxiv.org/abs/2512.09530",
        "pdf_url": "https://arxiv.org/pdf/2512.09530",
        "title": "Transformers for Tabular Data: A Training Perspective of Self-Attention via Optimal Transport",
        "authors": [
            "Antonio Candelieri",
            "Alessandro Quadrio"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "This thesis examines self-attention training through the lens of Optimal Transport (OT) and develops an OT-based alternative for tabular classification. The study tracks intermediate projections of the self-attention layer during training and evaluates their evolution using discrete OT metrics, including Wasserstein distance, Monge gap, optimality, and efficiency. Experiments are conducted on classification tasks with two and three classes, as well as on a biomedical dataset. Results indicate that the final self-attention mapping often approximates the OT optimal coupling, yet the training trajectory remains inefficient. Pretraining the MLP section on synthetic data partially improves convergence but is sensitive to their initialization. To address these limitations, an OT-based algorithm is introduced: it generates class-specific dummy Gaussian distributions, computes an OT alignment with the data, and trains an MLP to generalize this mapping. The method achieves accuracy comparable to Transformers while reducing computational cost and scaling more efficiently under standardized inputs, though its performance depends on careful dummy-geometry design. All experiments and implementations are conducted in R.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09538",
        "abs_url": "https://arxiv.org/abs/2512.09538",
        "pdf_url": "https://arxiv.org/pdf/2512.09538",
        "title": "Don't Throw Away Your Beams: Improving Consistency-based Uncertainties in LLMs via Beam Search",
        "authors": [
            "Ekaterina Fadeeva",
            "Maiya Goloburda",
            "Aleksandr Rubashevskii",
            "Roman Vashurin",
            "Artem Shelmanov",
            "Preslav Nakov",
            "Mrinmaya Sachan",
            "Maxim Panov"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Consistency-based methods have emerged as an effective approach to uncertainty quantification (UQ) in large language models. These methods typically rely on several generations obtained via multinomial sampling, measuring their agreement level. However, in short-form QA, multinomial sampling is prone to producing duplicates due to peaked distributions, and its stochasticity introduces considerable variance in uncertainty estimates across runs. We introduce a new family of methods that employ beam search to generate candidates for consistency-based UQ, yielding improved performance and reduced variance compared to multinomial sampling. We also provide a theoretical lower bound on the beam set probability mass under which beam search achieves a smaller error than multinomial sampling. We empirically evaluate our approach on six QA datasets and find that its consistent improvements over multinomial sampling lead to state-of-the-art UQ performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09539",
        "abs_url": "https://arxiv.org/abs/2512.09539",
        "pdf_url": "https://arxiv.org/pdf/2512.09539",
        "title": "Comparative Analysis of Hash-based Malware Clustering via K-Means",
        "authors": [
            "Aink Acrie Soe Thein",
            "Nikolaos Pitropakis",
            "Pavlos Papadopoulos",
            "Sam Grierson",
            "Sana Ullah Jan"
        ],
        "comments": "To be published in the proceedings of the 8th International Conference on Reliable Information and Communication Technology (IRICT 2025). Springer Book Series: \"Lecture Notes on Data Engineering and Communications Technologies\"",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "With the adoption of multiple digital devices in everyday life, the cyber-attack surface has increased. Adversaries are continuously exploring new avenues to exploit them and deploy malware. On the other hand, detection approaches typically employ hashing-based algorithms such as SSDeep, TLSH, and IMPHash to capture structural and behavioural similarities among binaries. This work focuses on the analysis and evaluation of these techniques for clustering malware samples using the K-means algorithm. More specifically, we experimented with established malware families and traits and found that TLSH and IMPHash produce more distinct, semantically meaningful clusters, whereas SSDeep is more efficient for broader classification tasks. The findings of this work can guide the development of more robust threat-detection mechanisms and adaptive security mechanisms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09586",
        "abs_url": "https://arxiv.org/abs/2512.09586",
        "pdf_url": "https://arxiv.org/pdf/2512.09586",
        "title": "Graph-Based Bayesian Optimization for Quantum Circuit Architecture Search with Uncertainty Calibrated Surrogates",
        "authors": [
            "Prashant Kumar Choudhary",
            "Nouhaila Innan",
            "Muhammad Shafique",
            "Rajeev Singh"
        ],
        "comments": "17 pages, 13 figures",
        "subjects": "Quantum Physics (quant-ph); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE); Networking and Internet Architecture (cs.NI)",
        "abstract": "Quantum circuit design is a key bottleneck for practical quantum machine learning on complex, real-world data. We present an automated framework that discovers and refines variational quantum circuits (VQCs) using graph-based Bayesian optimization with a graph neural network (GNN) surrogate. Circuits are represented as graphs and mutated and selected via an expected improvement acquisition function informed by surrogate uncertainty with Monte Carlo dropout. Candidate circuits are evaluated with a hybrid quantum-classical variational classifier on the next generation firewall telemetry and network internet of things (NF-ToN-IoT-V2) cybersecurity dataset, after feature selection and scaling for quantum embedding. We benchmark our pipeline against an MLP-based surrogate, random search, and greedy GNN selection. The GNN-guided optimizer consistently finds circuits with lower complexity and competitive or superior classification accuracy compared to all baselines. Robustness is assessed via a noise study across standard quantum noise channels, including amplitude damping, phase damping, thermal relaxation, depolarizing, and readout bit flip noise. The implementation is fully reproducible, with time benchmarking and export of best found circuits, providing a scalable and interpretable route to automated quantum circuit discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09629",
        "abs_url": "https://arxiv.org/abs/2512.09629",
        "pdf_url": "https://arxiv.org/pdf/2512.09629",
        "title": "An End-to-end Planning Framework with Agentic LLMs and PDDL",
        "authors": [
            "Emanuele La Malfa",
            "Ping Zhu",
            "Samuele Marro",
            "Sara Bernardini",
            "Michael Wooldridge"
        ],
        "comments": "Code: this https URL",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "We present an end-to-end framework for planning supported by verifiers. An orchestrator receives a human specification written in natural language and converts it into a PDDL (Planning Domain Definition Language) model, where the domain and problem are iteratively refined by sub-modules (agents) to address common planning requirements, such as time constraints and optimality, as well as ambiguities and contradictions that may exist in the human specification. The validated domain and problem are then passed to an external planning engine to generate a plan. The orchestrator and agents are powered by Large Language Models (LLMs) and require no human intervention at any stage of the process. Finally, a module translates the final plan back into natural language to improve human readability while maintaining the correctness of each step. We demonstrate the flexibility and effectiveness of our framework across various domains and tasks, including the Google NaturalPlan benchmark and PlanBench, as well as planning problems like Blocksworld and the Tower of Hanoi (where LLMs are known to struggle even with small instances). Our framework can be integrated with any PDDL planning engine and validator (such as Fast Downward, LPG, POPF, VAL, and uVAL, which we have tested) and represents a significant step toward end-to-end planning aided by LLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09665",
        "abs_url": "https://arxiv.org/abs/2512.09665",
        "pdf_url": "https://arxiv.org/pdf/2512.09665",
        "title": "OxEnsemble: Fair Ensembles for Low-Data Classification",
        "authors": [
            "Jonathan Rystrøm",
            "Zihao Fu",
            "Chris Russell"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Computers and Society (cs.CY); Machine Learning (cs.LG)",
        "abstract": "We address the problem of fair classification in settings where data is scarce and unbalanced across demographic groups. Such low-data regimes are common in domains like medical imaging, where false negatives can have fatal consequences. We propose a novel approach \\emph{OxEnsemble} for efficiently training ensembles and enforcing fairness in these low-data regimes. Unlike other approaches, we aggregate predictions across ensemble members, each trained to satisfy fairness constraints. By construction, \\emph{OxEnsemble} is both data-efficient, carefully reusing held-out data to enforce fairness reliably, and compute-efficient, requiring little more compute than used to fine-tune or evaluate an existing model. We validate this approach with new theoretical guarantees. Experimentally, our approach yields more consistent outcomes and stronger fairness-accuracy trade-offs than existing methods across multiple challenging medical imaging classification datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09730",
        "abs_url": "https://arxiv.org/abs/2512.09730",
        "pdf_url": "https://arxiv.org/pdf/2512.09730",
        "title": "Interpreto: An Explainability Library for Transformers",
        "authors": [
            "Antonin Poché",
            "Thomas Mullor",
            "Gabriele Sarti",
            "Frédéric Boisnard",
            "Corentin Friedrich",
            "Charlotte Claye",
            "François Hoofd",
            "Raphael Bernas",
            "Céline Hudelot",
            "Fanny Jourdan"
        ],
        "comments": "Equal contribution: Poché and Jourdan",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Interpreto is a Python library for post-hoc explainability of text HuggingFace models, from early BERT variants to LLMs. It provides two complementary families of methods: attributions and concept-based explanations. The library connects recent research to practical tooling for data scientists, aiming to make explanations accessible to end users. It includes documentation, examples, and tutorials. Interpreto supports both classification and generation models through a unified API. A key differentiator is its concept-based functionality, which goes beyond feature-level attributions and is uncommon in existing libraries. The library is open source; install via pip install interpreto. Code and documentation are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09778",
        "abs_url": "https://arxiv.org/abs/2512.09778",
        "pdf_url": "https://arxiv.org/pdf/2512.09778",
        "title": "Optimal certification of constant-local Hamiltonians",
        "authors": [
            "Junseo Lee",
            "Myeongjin Shin"
        ],
        "comments": "29 pages",
        "subjects": "Quantum Physics (quant-ph); Computational Complexity (cs.CC); Data Structures and Algorithms (cs.DS); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "We study the problem of certifying local Hamiltonians from real-time access to their dynamics. Given oracle access to $e^{-itH}$ for an unknown $k$-local Hamiltonian $H$ and a fully specified target Hamiltonian $H_0$, the goal is to decide whether $H$ is exactly equal to $H_0$ or differs from $H_0$ by at least $\\varepsilon$ in normalized Frobenius norm, while minimizing the total evolution time. We introduce the first intolerant Hamiltonian certification protocol that achieves optimal performance for all constant-locality Hamiltonians. For general $n$-qubit, $k$-local, traceless Hamiltonians, our procedure uses $O(c^k/\\varepsilon)$ total evolution time for a universal constant $c$, and succeeds with high probability. In particular, for $O(1)$-local Hamiltonians, the total evolution time becomes $\\Theta(1/\\varepsilon)$, matching the known $\\Omega(1/\\varepsilon)$ lower bounds and achieving the gold-standard Heisenberg-limit scaling. Prior certification methods either relied on implementing inverse evolution of $H$, required controlled access to $e^{-itH}$, or achieved near-optimal guarantees only in restricted settings such as the Ising case ($k=2$). In contrast, our algorithm requires neither inverse evolution nor controlled operations: it uses only forward real-time dynamics and achieves optimal intolerant certification for all constant-locality Hamiltonians.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09797",
        "abs_url": "https://arxiv.org/abs/2512.09797",
        "pdf_url": "https://arxiv.org/pdf/2512.09797",
        "title": "M3Net: A Multi-Metric Mixture of Experts Network Digital Twin with Graph Neural Networks",
        "authors": [
            "Blessed Guda",
            "Carlee Joe-Wong"
        ],
        "comments": "",
        "subjects": "Networking and Internet Architecture (cs.NI); Machine Learning (cs.LG)",
        "abstract": "The rise of 5G/6G network technologies promises to enable applications like autonomous vehicles and virtual reality, resulting in a significant increase in connected devices and necessarily complicating network management. Even worse, these applications often have strict, yet heterogeneous, performance requirements across metrics like latency and reliability. Much recent work has thus focused on developing the ability to predict network performance. However, traditional methods for network modeling, like discrete event simulators and emulation, often fail to balance accuracy and scalability. Network Digital Twins (NDTs), augmented by machine learning, present a viable solution by creating virtual replicas of physical networks for real- time simulation and analysis. State-of-the-art models, however, fall short of full-fledged NDTs, as they often focus only on a single performance metric or simulated network data. We introduce M3Net, a Multi-Metric Mixture-of-experts (MoE) NDT that uses a graph neural network architecture to estimate multiple performance metrics from an expanded set of network state data in a range of scenarios. We show that M3Net significantly enhances the accuracy of flow delay predictions by reducing the MAPE (Mean Absolute Percentage Error) from 20.06% to 17.39%, while also achieving 66.47% and 78.7% accuracy on jitter and packets dropped for each flow",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09804",
        "abs_url": "https://arxiv.org/abs/2512.09804",
        "pdf_url": "https://arxiv.org/pdf/2512.09804",
        "title": "OnCoCo 1.0: A Public Dataset for Fine-Grained Message Classification in Online Counseling Conversations",
        "authors": [
            "Jens Albrecht",
            "Robert Lehmann",
            "Aleksandra Poltermann",
            "Eric Rudolph",
            "Philipp Steigerwald",
            "Mara Stieler"
        ],
        "comments": "Submitted to LREC 2026",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "This paper presents OnCoCo 1.0, a new public dataset for fine-grained message classification in online counseling. It is based on a new, integrative system of categories, designed to improve the automated analysis of psychosocial online counseling conversations. Existing category systems, predominantly based on Motivational Interviewing (MI), are limited by their narrow focus and dependence on datasets derived mainly from face-to-face counseling. This limits the detailed examination of textual counseling conversations. In response, we developed a comprehensive new coding scheme that differentiates between 38 types of counselor and 28 types of client utterances, and created a labeled dataset consisting of about 2.800 messages from counseling conversations. We fine-tuned several models on our dataset to demonstrate its applicability. The data and models are publicly available to researchers and practitioners. Thus, our work contributes a new type of fine-grained conversational resource to the language resources community, extending existing datasets for social and mental-health dialogue analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09817",
        "abs_url": "https://arxiv.org/abs/2512.09817",
        "pdf_url": "https://arxiv.org/pdf/2512.09817",
        "title": "A roadmap of geospatial soil quality analysis systems",
        "authors": [
            "Habiba BEN ABDERRAHMANE",
            "Slimane Oulad-Naoui",
            "Benameur ZIANI"
        ],
        "comments": "",
        "subjects": "Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG)",
        "abstract": "Soil quality (SQ) plays a crucial role in sustainable agriculture, environmental conservation, and land-use planning. Traditional SQ assessment techniques rely on costly, labor-intensive sampling and laboratory analysis, limiting their spatial and temporal coverage. Advances in Geographic Information Systems (GIS), remote sensing, and machine learning (ML) enabled efficient SQ evaluation. This paper presents a comprehensive roadmap distinguishing it from previous reviews by proposing a unified and modular pipeline that integrates multi-source soil data, GIS and remote sensing tools, and machine learning techniques to support transparent and scalable soil quality assessment. It also includes practical applications. Contrary to existing studies that predominantly target isolated soil parameters or specific modeling methodologies, this approach consolidates recent advancements in Geographic Information Systems (GIS), remote sensing technologies, and machine learning algorithms within the entire soil quality assessment pipeline. It also addresses existing challenges and limitations while exploring future developments and emerging trends in the field that can deliver the next generation of soil quality systems making them more transparent, adaptive, and aligned with sustainable land management.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09831",
        "abs_url": "https://arxiv.org/abs/2512.09831",
        "pdf_url": "https://arxiv.org/pdf/2512.09831",
        "title": "Interpretation as Linear Transformation: A Cognitive-Geometric Model of Belief and Meaning",
        "authors": [
            "Chainarong Amornbunchornvej"
        ],
        "comments": "The first draft of cognitive geometry model",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Multiagent Systems (cs.MA); Social and Information Networks (cs.SI)",
        "abstract": "This paper develops a geometric framework for modeling belief, motivation, and influence across cognitively heterogeneous agents. Each agent is represented by a personalized value space, a vector space encoding the internal dimensions through which the agent interprets and evaluates meaning. Beliefs are formalized as structured vectors-abstract beings-whose transmission is mediated by linear interpretation maps. A belief survives communication only if it avoids the null spaces of these maps, yielding a structural criterion for intelligibility, miscommunication, and belief death. Within this framework, I show how belief distortion, motivational drift, counterfactual evaluation, and the limits of mutual understanding arise from purely algebraic constraints. A central result-\"the No-Null-Space Leadership Condition\"-characterizes leadership as a property of representational reachability rather than persuasion or authority. More broadly, the model explains how abstract beings can propagate, mutate, or disappear as they traverse diverse cognitive geometries. The account unifies insights from conceptual spaces, social epistemology, and AI value alignment by grounding meaning preservation in structural compatibility rather than shared information or rationality. I argue that this cognitive-geometric perspective clarifies the epistemic boundaries of influence in both human and artificial systems, and offers a general foundation for analyzing belief dynamics across heterogeneous agents.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-12-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-11?abs=True",
        "arxiv_id": "2512.09836",
        "abs_url": "https://arxiv.org/abs/2512.09836",
        "pdf_url": "https://arxiv.org/pdf/2512.09836",
        "title": "Fast Factorized Learning: Powered by In-Memory Database Systems",
        "authors": [
            "Bernhard Stöckl",
            "Maximilian E. Schüle"
        ],
        "comments": "",
        "subjects": "Databases (cs.DB); Machine Learning (cs.LG)",
        "abstract": "Learning models over factorized joins avoids redundant computations by identifying and pre-computing shared cofactors. Previous work has investigated the performance gain when computing cofactors on traditional disk-based database systems. Due to the absence of published code, the experiments could not be reproduced on in-memory database systems. This work describes the implementation when using cofactors for in-database factorized learning. We benchmark our open-source implementation for learning linear regression on factorized joins with PostgreSQL -- as a disk-based database system -- and HyPer -- as an in-memory engine. The evaluation shows a performance gain of factorized learning on in-memory database systems by 70\\% to non-factorized learning and by a factor of 100 compared to disk-based database systems. Thus, modern database engines can contribute to the machine learning pipeline by pre-computing aggregates prior to data extraction to accelerate training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]