[
    {
        "order": 1,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03050",
        "abs_url": "https://arxiv.org/abs/2512.03050",
        "pdf_url": "https://arxiv.org/pdf/2512.03050",
        "title": "Physics-Informed Machine Learning for Steel Development: A Computational Framework and CCT Diagram Modelling",
        "authors": [
            "Peter Hedström",
            "Victor Lamelas Cubero",
            "Jón Sigurdsson",
            "Viktor Österberg",
            "Satish Kolli",
            "Joakim Odqvist",
            "Ziyong Hou",
            "Wangzhong Mu",
            "Viswanadh Gowtham Arigela"
        ],
        "comments": "14 pages",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci); Computational Physics (physics.comp-ph)",
        "abstract": "Machine learning (ML) has emerged as a powerful tool for accelerating the computational design and production of materials. In materials science, ML has primarily supported large-scale discovery of novel compounds using first-principles data and digital twin applications for optimizing manufacturing processes. However, applying general-purpose ML frameworks to complex industrial materials such as steel remains a challenge. A key obstacle is accurately capturing the intricate relationship between chemical composition, processing parameters, and the resulting microstructure and properties. To address this, we introduce a computational framework that combines physical insights with ML to develop a physics-informed continuous cooling transformation (CCT) model for steels. Our model, trained on a dataset of 4,100 diagrams, is validated against literature and experimental data. It demonstrates high computational efficiency, generating complete CCT diagrams with 100 cooling curves in under 5 seconds. It also shows strong generalizability across alloy steels, achieving phase classification F1 scores above 88% for all phases. For phase transition temperature regression, it attains mean absolute errors (MAE) below 20 °C across all phases except bainite, which shows a slightly higher MAE of 27 °C. This framework can be extended with additional generic and customized ML models to establish a universal digital twin platform for heat treatment. Integration with complementary simulation tools and targeted experiments will further support accelerated materials design workflows.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03054",
        "abs_url": "https://arxiv.org/abs/2512.03054",
        "pdf_url": "https://arxiv.org/pdf/2512.03054",
        "title": "Energy-Efficient Federated Learning via Adaptive Encoder Freezing for MRI-to-CT Conversion: A Green AI-Guided Research",
        "authors": [
            "Ciro Benito Raggio",
            "Lucia Migliorelli",
            "Nils Skupien",
            "Mathias Krohmer Zabaleta",
            "Oliver Blanck",
            "Francesco Cicone",
            "Giuseppe Lucio Cascini",
            "Paolo Zaffino",
            "Maria Francesca Spadea"
        ],
        "comments": "22 pages, 13 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV); Distributed, Parallel, and Cluster Computing (cs.DC); Medical Physics (physics.med-ph)",
        "abstract": "Federated Learning (FL) holds the potential to advance equality in health by enabling diverse institutions to collaboratively train deep learning (DL) models, even with limited data. However, the significant resource requirements of FL often exclude centres with limited computational infrastructure, further widening existing healthcare disparities. To address this issue, we propose a Green AI-oriented adaptive layer-freezing strategy designed to reduce energy consumption and computational load while maintaining model performance. We tested our approach using different federated architectures for Magnetic Resonance Imaging (MRI)-to-Computed Tomography (CT) conversion. The proposed adaptive strategy optimises the federated training by selectively freezing the encoder weights based on the monitored relative difference of the encoder weights from round to round. A patience-based mechanism ensures that freezing only occurs when updates remain consistently minimal. The energy consumption and CO2eq emissions of the federation were tracked using the CodeCarbon library. Compared to equivalent non-frozen counterparts, our approach reduced training time, total energy consumption and CO2eq emissions by up to 23%. At the same time, the MRI-to-CT conversion performance was maintained, with only small variations in the Mean Absolute Error (MAE). Notably, for three out of the five evaluated architectures, no statistically significant differences were observed, while two architectures exhibited statistically significant improvements. Our work aligns with a research paradigm that promotes DL-based frameworks meeting clinical requirements while ensuring climatic, social, and economic sustainability. It lays the groundwork for novel FL evaluation frameworks, advancing privacy, equity and, more broadly, justice in AI-driven healthcare.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03055",
        "abs_url": "https://arxiv.org/abs/2512.03055",
        "pdf_url": "https://arxiv.org/pdf/2512.03055",
        "title": "Physics-informed self-supervised learning for predictive modeling of coronary artery digital twins",
        "authors": [
            "Xiaowu Sun",
            "Thabo Mahendiran",
            "Ortal Senouf",
            "Denise Auberson",
            "Bernard De Bruyne",
            "Stephane Fournier",
            "Olivier Muller",
            "Pascal Frossard",
            "Emmanuel Abbe",
            "Dorina Thanou"
        ],
        "comments": "19 pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Cardiovascular disease is the leading global cause of mortality, with coronary artery disease (CAD) as its most prevalent form, necessitating early risk prediction. While 3D coronary artery digital twins reconstructed from imaging offer detailed anatomy for personalized assessment, their analysis relies on computationally intensive computational fluid dynamics (CFD), limiting scalability. Data-driven approaches are hindered by scarce labeled data and lack of physiological priors. To address this, we present PINS-CAD, a physics-informed self-supervised learning framework. It pre-trains graph neural networks on 200,000 synthetic coronary digital twins to predict pressure and flow, guided by 1D Navier-Stokes equations and pressure-drop laws, eliminating the need for CFD or labeled data. When fine-tuned on clinical data from 635 patients in the multicenter FAME2 study, PINS-CAD predicts future cardiovascular events with an AUC of 0.73, outperforming clinical risk scores and data-driven baselines. This demonstrates that physics-informed pretraining boosts sample efficiency and yields physiologically meaningful representations. Furthermore, PINS-CAD generates spatially resolved pressure and fractional flow reserve curves, providing interpretable biomarkers. By embedding physical priors into geometric deep learning, PINS-CAD transforms routine angiography into a simulation-free, physiology-aware framework for scalable, preventive cardiology.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03058",
        "abs_url": "https://arxiv.org/abs/2512.03058",
        "pdf_url": "https://arxiv.org/pdf/2512.03058",
        "title": "Dynamical Properties of Tokens in Self-Attention and Effects of Positional Encoding",
        "authors": [
            "Duy-Tung Pham",
            "An The Nguyen",
            "Viet-Hoang Tran",
            "Nhan-Phu Chung",
            "Xin T. Tong",
            "Tan M. Nguyen",
            "Thieu N. Vo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper investigates the dynamical properties of tokens in pre-trained Transformer models and explores their application to improving Transformers. To this end, we analyze the dynamical system governing the continuous-time limit of the pre-trained model and characterize the asymptotic behavior of its solutions. Specifically, we characterize when tokens move closer to or farther from one another over time, depending on the model parameters. We provide sufficient conditions, based on these parameters, to identify scenarios where tokens either converge to zero or diverge to infinity. Unlike prior works, our conditions are broader in scope and more applicable to real-world models. Furthermore, we investigate how different forms of positional encoding -- specifically absolute and rotary -- affect these dynamical regimes. Empirical evidence reveals that the convergence scenario adversely impacts model performance. Motivated by these insights, we propose simple refinements to Transformer architectures that mitigate convergence behavior in models with absolute or rotary positional encoding. These findings support theoretical foundations and design principles for improving Transformer models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03059",
        "abs_url": "https://arxiv.org/abs/2512.03059",
        "pdf_url": "https://arxiv.org/pdf/2512.03059",
        "title": "Safe and Sustainable Electric Bus Charging Scheduling with Constrained Hierarchical DRL",
        "authors": [
            "Jiaju Qi",
            "Lei Lei",
            "Thorsteinn Jonsson",
            "Dusit Niyato"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The integration of Electric Buses (EBs) with renewable energy sources such as photovoltaic (PV) panels is a promising approach to promote sustainable and low-carbon public transportation. However, optimizing EB charging schedules to minimize operational costs while ensuring safe operation without battery depletion remains challenging - especially under real-world conditions, where uncertainties in PV generation, dynamic electricity prices, variable travel times, and limited charging infrastructure must be accounted for. In this paper, we propose a safe Hierarchical Deep Reinforcement Learning (HDRL) framework for solving the EB Charging Scheduling Problem (EBCSP) under multi-source uncertainties. We formulate the problem as a Constrained Markov Decision Process (CMDP) with options to enable temporally abstract decision-making. We develop a novel HDRL algorithm, namely Double Actor-Critic Multi-Agent Proximal Policy Optimization Lagrangian (DAC-MAPPO-Lagrangian), which integrates Lagrangian relaxation into the Double Actor-Critic (DAC) framework. At the high level, we adopt a centralized PPO-Lagrangian algorithm to learn safe charger allocation policies. At the low level, we incorporate MAPPO-Lagrangian to learn decentralized charging power decisions under the Centralized Training and Decentralized Execution (CTDE) paradigm. Extensive experiments with real-world data demonstrate that the proposed approach outperforms existing baselines in both cost minimization and safety compliance, while maintaining fast convergence speed.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03060",
        "abs_url": "https://arxiv.org/abs/2512.03060",
        "pdf_url": "https://arxiv.org/pdf/2512.03060",
        "title": "A Large Scale Heterogeneous Treatment Effect Estimation Framework and Its Applications of Users' Journey at Snap",
        "authors": [
            "Jing Pan",
            "Li Shi",
            "Paul Lo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP); Methodology (stat.ME)",
        "abstract": "Heterogeneous Treatment Effect (HTE) and Conditional Average Treatment Effect (CATE) models relax the assumption that treatment effects are the same for every user. We present a large scale industrial framework for estimating HTE using experimental data from hundreds of millions of Snapchat users. By combining results across many experiments, the framework uncovers latent user characteristics that were previously unmeasurable and produces stable treatment effect estimates at scale. We describe the core components that enabled this system, including experiment selection, base learner design, and incremental training. We also highlight two applications: user influenceability to ads and user sensitivity to ads. An online A/B test using influenceability scores for targeting showed an improvement on key business metrics that is more than six times larger than what is typically considered significant.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03062",
        "abs_url": "https://arxiv.org/abs/2512.03062",
        "pdf_url": "https://arxiv.org/pdf/2512.03062",
        "title": "Globally optimized SVD compression of LLMs via Fermi-function-based rank selection and gauge fixing",
        "authors": [
            "Roman Rausch",
            "David Jansen",
            "Sukhbinder Singh",
            "Román Orús"
        ],
        "comments": "Prepared for submission to ESANN 2026",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Large Language Models (LLMs) are very demanding in terms of their computational resources. Low-rank decompositions of LLM weights, e.g. via Singular Value Decomposition (SVD), is a promising approach for LLM compression, but presents several practical hurdles, e.g. selecting appropriate layer-wise ranks and getting rid of its parameter redundancy. In this work, we present two physics-inspired improvements to SVD LLM compression: (1) \\textbf{FermiGrad}, a gradient-descent algorithm that determines globally optimal layer-wise ranks by relaxing the discrete singular-value truncation into a continuous optimization using the Fermi function; (2) \\textbf{PivGa}, an additional \\textit{lossless} compression of the low-rank factors that exploits the intrinsic gauge freedom in their parametrization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03069",
        "abs_url": "https://arxiv.org/abs/2512.03069",
        "pdf_url": "https://arxiv.org/pdf/2512.03069",
        "title": "Hierarchical clustering of complex energy systems using pretopology",
        "authors": [
            "Loup-Noe Levy",
            "Jeremie Bosom",
            "Guillaume Guerard",
            "Soufian Ben Amor",
            "Marc Bui",
            "Hai Tran"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "This article attempts answering the following problematic: How to model and classify energy consumption profiles over a large distributed territory to optimize the management of buildings' consumption? Doing case-by-case in depth auditing of thousands of buildings would require a massive amount of time and money as well as a significant number of qualified people. Thus, an automated method must be developed to establish a relevant and effective recommendations system. To answer this problematic, pretopology is used to model the sites' consumption profiles and a multi-criterion hierarchical classification algorithm, using the properties of pretopological space, has been developed in a Python library. To evaluate the results, three data sets are used: A generated set of dots of various sizes in a 2D space, a generated set of time series and a set of consumption time series of 400 real consumption sites from a French Energy company. On the point data set, the algorithm is able to identify the clusters of points using their position in space and their size as parameter. On the generated time series, the algorithm is able to identify the time series clusters using Pearson's correlation with an Adjusted Rand Index (ARI) of 1.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03071",
        "abs_url": "https://arxiv.org/abs/2512.03071",
        "pdf_url": "https://arxiv.org/pdf/2512.03071",
        "title": "PretopoMD: Pretopology-based Mixed Data Hierarchical Clustering",
        "authors": [
            "Loup-Noe Levy",
            "Guillaume Guerard",
            "Sonia Djebali",
            "Soufian Ben Amor"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "This article presents a novel pretopology-based algorithm designed to address the challenges of clustering mixed data without the need for dimensionality reduction. Leveraging Disjunctive Normal Form, our approach formulates customizable logical rules and adjustable hyperparameters that allow for user-defined hierarchical cluster construction and facilitate tailored solutions for heterogeneous datasets. Through hierarchical dendrogram analysis and comparative clustering metrics, our method demonstrates superior performance by accurately and interpretably delineating clusters directly from raw data, thus preserving data integrity. Empirical findings highlight the algorithm's robustness in constructing meaningful clusters and reveal its potential in overcoming issues related to clustered data explainability. The novelty of this work lies in its departure from traditional dimensionality reduction techniques and its innovative use of logical rules that enhance both cluster formation and clarity, thereby contributing a significant advancement to the discourse on clustering mixed data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03074",
        "abs_url": "https://arxiv.org/abs/2512.03074",
        "pdf_url": "https://arxiv.org/pdf/2512.03074",
        "title": "Model-Agnostic Fairness Regularization for GNNs with Incomplete Sensitive Information",
        "authors": [
            "Mahdi Tavassoli Kejani",
            "Fadi Dornaika",
            "Jean-Michel Loubes"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computers and Society (cs.CY); Social and Information Networks (cs.SI)",
        "abstract": "Graph Neural Networks (GNNs) have demonstrated exceptional efficacy in relational learning tasks, including node classification and link prediction. However, their application raises significant fairness concerns, as GNNs can perpetuate and even amplify societal biases against protected groups defined by sensitive attributes such as race or gender. These biases are often inherent in the node features, structural topology, and message-passing mechanisms of the graph itself. A critical limitation of existing fairness-aware GNN methods is their reliance on the strong assumption that sensitive attributes are fully available for all nodes during training--a condition that poses a practical impediment due to privacy concerns and data collection constraints. To address this gap, we propose a novel, model-agnostic fairness regularization framework designed for the realistic scenario where sensitive attributes are only partially available. Our approach formalizes a fairness-aware objective function that integrates both equal opportunity and statistical parity as differentiable regularization terms. Through a comprehensive empirical evaluation across five real-world benchmark datasets, we demonstrate that the proposed method significantly mitigates bias across key fairness metrics while maintaining competitive node classification performance. Results show that our framework consistently outperforms baseline models in achieving a favorable fairness-accuracy trade-off, with minimal degradation in predictive accuracy. The datasets and source code will be publicly released at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03078",
        "abs_url": "https://arxiv.org/abs/2512.03078",
        "pdf_url": "https://arxiv.org/pdf/2512.03078",
        "title": "Risk-Entropic Flow Matching",
        "authors": [
            "Vahid R. Ramezani",
            "Benjamin Englard"
        ],
        "comments": "29 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Tilted (entropic) risk, obtained by applying a log-exponential transform to a base loss, is a well established tool in statistics and machine learning for emphasizing rare or high loss events while retaining a tractable optimization problem. In this work, our aim is to interpret its structure for Flow Matching (FM). FM learns a velocity field that transports samples from a simple source distribution to data by integrating an ODE. In rectified FM, training pairs are obtained by linearly interpolating between a source sample and a data sample, and a neural velocity field is trained to predict the straight line displacement using a mean squared error loss. This squared loss collapses all velocity targets that reach the same space-time point into a single conditional mean, thereby ignoring higher order conditional information (variance, skewness, multi-modality) that encodes fine geometric structure about the data manifold and minority branches. We apply the standard risk-sensitive (log-exponential) transform to the conditional FM loss and show that the resulting tilted risk loss is a natural upper-bound on a meaningful conditional entropic FM objective defined at each space-time point. Furthermore, we show that a small order expansion of the gradient of this conditional entropic objective yields two interpretable first order corrections: covariance preconditioning of the FM residual, and a skew tail term that favors asymmetric or rare branches. On synthetic data designed to probe ambiguity and tails, the resulting risk-sensitive loss improves statistical metrics and recovers geometric structure more faithfully than standard rectified FM.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03102",
        "abs_url": "https://arxiv.org/abs/2512.03102",
        "pdf_url": "https://arxiv.org/pdf/2512.03102",
        "title": "Dynamic Correction of Erroneous State Estimates via Diffusion Bayesian Exploration",
        "authors": [
            "Yiwei Shi",
            "Hongnan Ma",
            "Mengyue Yang",
            "Cunjia Liu",
            "Weiru Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation (stat.CO)",
        "abstract": "In emergency response and other high-stakes societal applications, early-stage state estimates critically shape downstream outcomes. Yet, these initial state estimates-often based on limited or biased information-can be severely misaligned with reality, constraining subsequent actions and potentially causing catastrophic delays, resource misallocation, and human harm. Under the stationary bootstrap baseline (zero transition and no rejuvenation), bootstrap particle filters exhibit Stationarity-Induced Posterior Support Invariance (S-PSI), wherein regions excluded by the initial prior remain permanently unexplorable, making corrections impossible even when new evidence contradicts current beliefs. While classical perturbations can in principle break this lock-in, they operate in an always-on fashion and may be inefficient. To overcome this, we propose a diffusion-driven Bayesian exploration framework that enables principled, real-time correction of early state estimation errors. Our method expands posterior support via entropy-regularized sampling and covariance-scaled diffusion. A Metropolis-Hastings check validates proposals and keeps inference adaptive to unexpected evidence. Empirical evaluations on realistic hazardous-gas localization tasks show that our approach matches reinforcement learning and planning baselines when priors are correct. It substantially outperforms classical SMC perturbations and RL-based methods under misalignment, and we provide theoretical guarantees that DEPF resolves S-PSI while maintaining statistical rigor.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03107",
        "abs_url": "https://arxiv.org/abs/2512.03107",
        "pdf_url": "https://arxiv.org/pdf/2512.03107",
        "title": "Detecting AI Hallucinations in Finance: An Information-Theoretic Method Cuts Hallucination Rate by 92%",
        "authors": [
            "Mainak Singha"
        ],
        "comments": "17 pages, 7 figures. Information-theoretic, hallucination detector for financial application. Feedback from researchers and practitioners is welcome",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL); Computational Finance (q-fin.CP); Machine Learning (stat.ML)",
        "abstract": "Large language models (LLMs) produce fluent but unsupported answers - hallucinations - limiting safe deployment in high-stakes domains. We propose ECLIPSE, a framework that treats hallucination as a mismatch between a model's semantic entropy and the capacity of available evidence. We combine entropy estimation via multi-sample clustering with a novel perplexity decomposition that measures how models use retrieved evidence. We prove that under mild conditions, the resulting entropy-capacity objective is strictly convex with a unique stable optimum. We evaluate on a controlled financial question answering dataset with GPT-3.5-turbo (n=200 balanced samples with synthetic hallucinations), where ECLIPSE achieves ROC AUC of 0.89 and average precision of 0.90, substantially outperforming a semantic entropy-only baseline (AUC 0.50). A controlled ablation with Claude-3-Haiku, which lacks token-level log probabilities, shows AUC dropping to 0.59 with coefficient magnitudes decreasing by 95% - demonstrating that ECLIPSE is a logprob-native mechanism whose effectiveness depends on calibrated token-level uncertainties. The perplexity decomposition features exhibit the largest learned coefficients, confirming that evidence utilization is central to hallucination detection. We position this work as a controlled mechanism study; broader validation across domains and naturally occurring hallucinations remains future work.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03112",
        "abs_url": "https://arxiv.org/abs/2512.03112",
        "pdf_url": "https://arxiv.org/pdf/2512.03112",
        "title": "Beyond Additivity: Sparse Isotonic Shapley Regression toward Nonlinear Explainability",
        "authors": [
            "Jialai She"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Machine Learning (stat.ML)",
        "abstract": "Shapley values, a gold standard for feature attribution in Explainable AI, face two primary challenges. First, the canonical Shapley framework assumes that the worth function is additive, yet real-world payoff constructions--driven by non-Gaussian distributions, heavy tails, feature dependence, or domain-specific loss scales--often violate this assumption, leading to distorted attributions. Secondly, achieving sparse explanations in high dimensions by computing dense Shapley values and then applying ad hoc thresholding is prohibitively costly and risks inconsistency. We introduce Sparse Isotonic Shapley Regression (SISR), a unified nonlinear explanation framework. SISR simultaneously learns a monotonic transformation to restore additivity--obviating the need for a closed-form specification--and enforces an L0 sparsity constraint on the Shapley vector, enhancing computational efficiency in large feature spaces. Its optimization algorithm leverages Pool-Adjacent-Violators for efficient isotonic regression and normalized hard-thresholding for support selection, yielding implementation ease and global convergence guarantees. Analysis shows that SISR recovers the true transformation in a wide range of scenarios and achieves strong support recovery even in high noise. Moreover, we are the first to demonstrate that irrelevant features and inter-feature dependencies can induce a true payoff transformation that deviates substantially from linearity. Experiments in regression, logistic regression, and tree ensembles demonstrate that SISR stabilizes attributions across payoff schemes, correctly filters irrelevant features while standard Shapley values suffer severe rank and sign distortions. By unifying nonlinear transformation estimation with sparsity pursuit, SISR advances the frontier of nonlinear explainability, providing a theoretically grounded and practical attribution framework.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03114",
        "abs_url": "https://arxiv.org/abs/2512.03114",
        "pdf_url": "https://arxiv.org/pdf/2512.03114",
        "title": "Temporal Graph Neural Networks for Early Anomaly Detection and Performance Prediction via PV System Monitoring Data",
        "authors": [
            "Srijani Mukherjee",
            "Laurent Vuillon",
            "Liliane Bou Nassif",
            "Stéphanie Giroux-Julien",
            "Hervé Pabiou",
            "Denys Dutykh",
            "Ionnasis Tsanakas"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "The rapid growth of solar photovoltaic (PV) systems necessitates advanced methods for performance monitoring and anomaly detection to ensure optimal operation. In this study, we propose a novel approach leveraging Temporal Graph Neural Network (Temporal GNN) to predict solar PV output power and detect anomalies using environmental and operational parameters. The proposed model utilizes graph-based temporal relationships among key PV system parameters, including irradiance, module and ambient temperature to predict electrical power output. This study is based on data collected from an outdoor facility located on a rooftop in Lyon (France) including power measurements from a PV module and meteorological parameters.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03115",
        "abs_url": "https://arxiv.org/abs/2512.03115",
        "pdf_url": "https://arxiv.org/pdf/2512.03115",
        "title": "Real-Time Structural Health Monitoring with Bayesian Neural Networks: Distinguishing Aleatoric and Epistemic Uncertainty for Digital Twin Frameworks",
        "authors": [
            "Hanbin Cho",
            "Jecheon Yu",
            "Hyeonbin Moon",
            "Jiyoung Yoon",
            "Junhyeong Lee",
            "Giyoung Kim",
            "Jinhyoung Park",
            "Seunghwa Ryu"
        ],
        "comments": "37 pages, 13 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reliable real-time analysis of sensor data is essential for structural health monitoring (SHM) of high-value assets, yet a major challenge is to obtain spatially resolved full-field aleatoric and epistemic uncertainties for trustworthy decision-making. We present an integrated SHM framework that combines principal component analysis (PCA), a Bayesian neural network (BNN), and Hamiltonian Monte Carlo (HMC) inference, mapping sparse strain gauge measurements onto leading PCA modes to reconstruct full-field strain distributions with uncertainty quantification. The framework was validated through cyclic four-point bending tests on carbon fiber reinforced polymer (CFRP) specimens with varying crack lengths, achieving accurate strain field reconstruction (R squared value > 0.9) while simultaneously producing real-time uncertainty fields. A key contribution is that the BNN yields robust full-field strain reconstructions from noisy experimental data with crack-induced strain singularities, while also providing explicit representations of two complementary uncertainty fields. Considered jointly in full-field form, the aleatoric and epistemic uncertainty fields make it possible to diagnose at a local level, whether low-confidence regions are driven by data-inherent issues or by model-related limitations, thereby supporting reliable decision-making. Collectively, the results demonstrate that the proposed framework advances SHM toward trustworthy digital twin deployment and risk-aware structural diagnostics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03127",
        "abs_url": "https://arxiv.org/abs/2512.03127",
        "pdf_url": "https://arxiv.org/pdf/2512.03127",
        "title": "Atomic Diffusion Models for Small Molecule Structure Elucidation from NMR Spectra",
        "authors": [
            "Ziyu Xiong",
            "Yichi Zhang",
            "Foyez Alauddin",
            "Chu Xin Cheng",
            "Joon Soo An",
            "Mohammad R. Seyedsayamdost",
            "Ellen D. Zhong"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Chemical Physics (physics.chem-ph)",
        "abstract": "Nuclear Magnetic Resonance (NMR) spectroscopy is a cornerstone technique for determining the structures of small molecules and is especially critical in the discovery of novel natural products and clinical therapeutics. Yet, interpreting NMR spectra remains a time-consuming, manual process requiring extensive domain expertise. We introduce ChefNMR (CHemical Elucidation From NMR), an end-to-end framework that directly predicts an unknown molecule's structure solely from its 1D NMR spectra and chemical formula. We frame structure elucidation as conditional generation from an atomic diffusion model built on a non-equivariant transformer architecture. To model the complex chemical groups found in natural products, we generated a dataset of simulated 1D NMR spectra for over 111,000 natural products. ChefNMR predicts the structures of challenging natural product compounds with an unsurpassed accuracy of over 65%. This work takes a significant step toward solving the grand challenge of automating small-molecule structure elucidation and highlights the potential of deep learning in accelerating molecular discovery. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03158",
        "abs_url": "https://arxiv.org/abs/2512.03158",
        "pdf_url": "https://arxiv.org/pdf/2512.03158",
        "title": "Contrastive Deep Learning for Variant Detection in Wastewater Genomic Sequencing",
        "authors": [
            "Adele Chinda",
            "Richmond Azumah",
            "Hemanth Demakethepalli Venkateswara"
        ],
        "comments": "13 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG); Genomics (q-bio.GN)",
        "abstract": "Wastewater-based genomic surveillance has emerged as a powerful tool for population-level viral monitoring, offering comprehensive insights into circulating viral variants across entire communities. However, this approach faces significant computational challenges stemming from high sequencing noise, low viral coverage, fragmented reads, and the complete absence of labeled variant annotations. Traditional reference-based variant calling pipelines struggle with novel mutations and require extensive computational resources. We present a comprehensive framework for unsupervised viral variant detection using Vector-Quantized Variational Autoencoders (VQ-VAE) that learns discrete codebooks of genomic patterns from k-mer tokenized sequences without requiring reference genomes or variant labels. Our approach extends the base VQ-VAE architecture with masked reconstruction pretraining for robustness to missing data and contrastive learning for highly discriminative embeddings. Evaluated on SARS-CoV-2 wastewater sequencing data comprising approximately 100,000 reads, our VQ-VAE achieves 99.52% mean token-level accuracy and 56.33% exact sequence match rate while maintaining 19.73% codebook utilization (101 of 512 codes active), demonstrating efficient discrete representation learning. Contrastive fine-tuning with different projection dimensions yields substantial clustering improvements: 64-dimensional embeddings achieve +35% Silhouette score improvement (0.31 to 0.42), while 128-dimensional embeddings achieve +42% improvement (0.31 to 0.44), clearly demonstrating the impact of embedding dimensionality on variant discrimination capability. Our reference-free framework provides a scalable, interpretable approach to genomic surveillance with direct applications to public health monitoring.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03176",
        "abs_url": "https://arxiv.org/abs/2512.03176",
        "pdf_url": "https://arxiv.org/pdf/2512.03176",
        "title": "Plantain: Plan-Answer Interleaved Reasoning",
        "authors": [
            "Anthony Liang",
            "Jonathan Berant",
            "Adam Fisch",
            "Abhimanyu Goyal",
            "Kalpesh Krishna",
            "Jacob Eisenstein"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Reasoning models often spend a significant amount of time thinking before they generate a visible response. In the meantime, they do not give the user any hints as to whether their reasoning is on the right track, and do not give the user any recourse to stop and correct them if their reasoning is flawed. This creates a frustrating, but unfortunately common, experience: the user's time is wasted while the model reasons from a false premise that could have easily been corrected. In contrast, human speakers typically perform lightweight, incremental grounding acts to ensure that participants in the conversation are on the same page; here we ask if language models can learn to leverage a similar type of behavior? With this motivation, we propose interleaved reasoning (IR), in which the model alternates between thinking and surfacing intermediate responses, as an alternative to the standard \"think-then-answer\" approach. By providing useful information to the user earlier, IR reduces perceived latency, the time a user waits for an initial output, without compromising the quality of the final response. We further introduce a specialization of interleaved reasoning, Plantain (Plan-Thought-Answer Interleaving), where the first intermediate response is an explicit, step-by-step plan for executing the task. This plan-first strategy allows for user intervention and early feedback for subsequent reasoning steps. We demonstrate that Plantain yields an ~6% improvement in pass@1 across several challenging math reasoning and coding benchmarks, while reducing time-to-first-response by over 60% relative to think-then-answer baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03187",
        "abs_url": "https://arxiv.org/abs/2512.03187",
        "pdf_url": "https://arxiv.org/pdf/2512.03187",
        "title": "Neighborhood density estimation using space-partitioning based hashing schemes",
        "authors": [
            "Aashi Jindal"
        ],
        "comments": "arXiv admin note: text overlap with arXiv:2011.03729",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This work introduces FiRE/FiRE.1, a novel sketching-based algorithm for anomaly detection to quickly identify rare cell sub-populations in large-scale single-cell RNA sequencing data. This method demonstrated superior performance against state-of-the-art techniques. Furthermore, the thesis proposes Enhash, a fast and resource-efficient ensemble learner that uses projection hashing to detect concept drift in streaming data, proving highly competitive in time and accuracy across various drift types.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03204",
        "abs_url": "https://arxiv.org/abs/2512.03204",
        "pdf_url": "https://arxiv.org/pdf/2512.03204",
        "title": "Scaling Internal-State Policy-Gradient Methods for POMDPs",
        "authors": [
            "Douglas Aberdeen",
            "Jonathan Baxter"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Policy-gradient methods have received increased attention recently as a mechanism for learning to act in partially observable environments. They have shown promise for problems admitting memoryless policies but have been less successful when memory is required. In this paper we develop several improved algorithms for learning policies with memory in an infinite-horizon setting -- directly when a known model of the environment is available, and via simulation otherwise. We compare these algorithms on some large POMDPs, including noisy robot navigation and multi-agent problems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03211",
        "abs_url": "https://arxiv.org/abs/2512.03211",
        "pdf_url": "https://arxiv.org/pdf/2512.03211",
        "title": "A Multi-Agent, Policy-Gradient approach to Network Routing",
        "authors": [
            "Nigel Tao",
            "Jonathan Baxter",
            "Lex Weaver"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "Network routing is a distributed decision problem which naturally admits numerical performance measures, such as the average time for a packet to travel from source to destination. OLPOMDP, a policy-gradient reinforcement learning algorithm, was successfully applied to simulated network routing under a number of network models. Multiple distributed agents (routers) learned co-operative behavior without explicit inter-agent communication, and they avoided behavior which was individually desirable, but detrimental to the group's overall performance. Furthermore, shaping the reward signal by explicitly penalizing certain patterns of sub-optimal behavior was found to dramatically improve the convergence rate.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03219",
        "abs_url": "https://arxiv.org/abs/2512.03219",
        "pdf_url": "https://arxiv.org/pdf/2512.03219",
        "title": "Perch 2.0 transfers 'whale' to underwater tasks",
        "authors": [
            "Andrea Burns",
            "Lauren Harrell",
            "Bart van Merriënboer",
            "Vincent Dumoulin",
            "Jenny Hamer",
            "Tom Denton"
        ],
        "comments": "8 pages, 3 figures, 39th Conference on Neural Information Processing Systems (NeurIPS 2025) Workshop: AI for Non-Human Animal Communication",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Perch 2.0 is a supervised bioacoustics foundation model pretrained on 14,597 species, including birds, mammals, amphibians, and insects, and has state-of-the-art performance on multiple benchmarks. Given that Perch 2.0 includes almost no marine mammal audio or classes in the training data, we evaluate Perch 2.0 performance on marine mammal and underwater audio tasks through few-shot transfer learning. We perform linear probing with the embeddings generated from this foundation model and compare performance to other pretrained bioacoustics models. In particular, we compare Perch 2.0 with previous multispecies whale, Perch 1.0, SurfPerch, AVES-bio, BirdAVES, and Birdnet V2.3 models, which have open-source tools for transfer-learning and agile modeling. We show that the embeddings from the Perch 2.0 model have consistently high performance for few-shot transfer learning, generally outperforming alternative embedding models on the majority of tasks, and thus is recommended when developing new linear classifiers for marine mammal classification with few labeled examples.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03276",
        "abs_url": "https://arxiv.org/abs/2512.03276",
        "pdf_url": "https://arxiv.org/pdf/2512.03276",
        "title": "Too Late to Recall: Explaining the Two-Hop Problem in Multimodal Knowledge Retrieval",
        "authors": [
            "Constantin Venhoff",
            "Ashkan Khakzar",
            "Sonia Joseph",
            "Philip Torr",
            "Neel Nanda"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Training vision language models (VLMs) aims to align visual representations from a vision encoder with the textual representations of a pretrained large language model (LLM). However, many VLMs exhibit reduced factual recall performance compared to their LLM backbones, raising the question of how effective multimodal fine-tuning is at extending existing mechanisms within the LLM to visual inputs. We argue that factual recall based on visual inputs requires VLMs to solve a two-hop problem: (1) forming entity representations from visual inputs, and (2) recalling associated factual knowledge based on these entity representations. By benchmarking 14 VLMs with various architectures (LLaVA, Native, Cross-Attention), sizes (7B-124B parameters), and training setups on factual recall tasks against their original LLM backbone models, we find that 11 of 14 models exhibit factual recall degradation. We select three models with high and two models with low performance degradation, and use attribution patching, activation patching, and probing to show that degraded VLMs struggle to use the existing factual recall circuit of their LLM backbone, because they resolve the first hop too late in the computation. In contrast, high-performing VLMs resolve entity representations early enough to reuse the existing factual recall mechanism. Finally, we demonstrate two methods to recover performance: patching entity representations from the LLM backbone into the VLM, and prompting with chain-of-thought reasoning. Our results highlight that the speed of early entity resolution critically determines how effective VLMs are in using preexisting LLM mechanisms. More broadly, our work illustrates how mechanistic analysis can explain and unveil systematic failures in multimodal alignment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03287",
        "abs_url": "https://arxiv.org/abs/2512.03287",
        "pdf_url": "https://arxiv.org/pdf/2512.03287",
        "title": "Multi-Frequency Federated Learning for Human Activity Recognition Using Head-Worn Sensors",
        "authors": [
            "Dario Fenoglio",
            "Mohan Li",
            "Davide Casnici",
            "Matias Laporte",
            "Shkurta Gashi",
            "Silvia Santini",
            "Martin Gjoreski",
            "Marc Langheinrich"
        ],
        "comments": "8 pages, 2024 International Conference on Intelligent Environments (IE), 2024",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Human Activity Recognition (HAR) benefits various application domains, including health and elderly care. Traditional HAR involves constructing pipelines reliant on centralized user data, which can pose privacy concerns as they necessitate the uploading of user data to a centralized server. This work proposes multi-frequency Federated Learning (FL) to enable: (1) privacy-aware ML; (2) joint ML model learning across devices with varying sampling frequency. We focus on head-worn devices (e.g., earbuds and smart glasses), a relatively unexplored domain compared to traditional smartwatch- or smartphone-based HAR. Results have shown improvements on two datasets against frequency-specific approaches, indicating a promising future in the multi-frequency FL-HAR task. The proposed network's implementation is publicly available for further research and development.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03290",
        "abs_url": "https://arxiv.org/abs/2512.03290",
        "pdf_url": "https://arxiv.org/pdf/2512.03290",
        "title": "ASPEN: An Adaptive Spectral Physics-Enabled Network for Ginzburg-Landau Dynamics",
        "authors": [
            "Julian Evan Chrisnanto",
            "Nurfauzi Fadillah",
            "Yulison Herry Chrisnanto"
        ],
        "comments": "15 pages, 7 figures",
        "subjects": "Machine Learning (cs.LG); Applied Physics (physics.app-ph)",
        "abstract": "Physics-Informed Neural Networks (PINNs) have emerged as a powerful, mesh-free paradigm for solving partial differential equations (PDEs). However, they notoriously struggle with stiff, multi-scale, and nonlinear systems due to the inherent spectral bias of standard multilayer perceptron (MLP) architectures, which prevents them from adequately representing high-frequency components. In this work, we introduce the Adaptive Spectral Physics-Enabled Network (ASPEN), a novel architecture designed to overcome this critical limitation. ASPEN integrates an adaptive spectral layer with learnable Fourier features directly into the network's input stage. This mechanism allows the model to dynamically tune its own spectral basis during training, enabling it to efficiently learn and represent the precise frequency content required by the solution. We demonstrate the efficacy of ASPEN by applying it to the complex Ginzburg-Landau equation (CGLE), a canonical and challenging benchmark for nonlinear, stiff spatio-temporal dynamics. Our results show that a standard PINN architecture catastrophically fails on this problem, diverging into non-physical oscillations. In contrast, ASPEN successfully solves the CGLE with exceptional accuracy. The predicted solution is visually indistinguishable from the high-resolution ground truth, achieving a low median physics residual of 5.10 x 10^-3. Furthermore, we validate that ASPEN's solution is not only pointwise accurate but also physically consistent, correctly capturing emergent physical properties, including the rapid free energy relaxation and the long-term stability of the domain wall front. This work demonstrates that by incorporating an adaptive spectral basis, our framework provides a robust and physically-consistent solver for complex dynamical systems where standard PINNs fail, opening new options for machine learning in challenging physical domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03300",
        "abs_url": "https://arxiv.org/abs/2512.03300",
        "pdf_url": "https://arxiv.org/pdf/2512.03300",
        "title": "HydroDCM: Hydrological Domain-Conditioned Modulation for Cross-Reservoir Inflow Prediction",
        "authors": [
            "Pengfei Hu",
            "Fan Ming",
            "Xiaoxue Han",
            "Chang Lu",
            "Yue Ning",
            "Dan Lu"
        ],
        "comments": "Accepted by AAAI 2026 workshop (oral) on AI for Environmental Science",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Deep learning models have shown promise in reservoir inflow prediction, yet their performance often deteriorates when applied to different reservoirs due to distributional differences, referred to as the domain shift problem. Domain generalization (DG) solutions aim to address this issue by extracting domain-invariant representations that mitigate errors in unseen domains. However, in hydrological settings, each reservoir exhibits unique inflow patterns, while some metadata beyond observations like spatial information exerts indirect but significant influence. This mismatch limits the applicability of conventional DG techniques to many-domain hydrological systems. To overcome these challenges, we propose HydroDCM, a scalable DG framework for cross-reservoir inflow forecasting. Spatial metadata of reservoirs is used to construct pseudo-domain labels that guide adversarial learning of invariant temporal features. During inference, HydroDCM adapts these features through light-weight conditioning layers informed by the target reservoir's metadata, reconciling DG's invariance with location-specific adaptation. Experiment results on 30 real-world reservoirs in the Upper Colorado River Basin demonstrate that our method substantially outperforms state-of-the-art DG baselines under many-domain conditions and remains computationally efficient.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03309",
        "abs_url": "https://arxiv.org/abs/2512.03309",
        "pdf_url": "https://arxiv.org/pdf/2512.03309",
        "title": "Retrofitting Earth System Models with Cadence-Limited Neural Operator Updates",
        "authors": [
            "Aniruddha Bora",
            "Shixuan Zhang",
            "Khemraj Shukla",
            "Bryce Harrop",
            "George Em. Karniadakis",
            "L. Ruby Leung"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Mathematical Physics (math-ph)",
        "abstract": "Coarse resolution, imperfect parameterizations, and uncertain initial states and forcings limit Earth-system model (ESM) predictions. Traditional bias correction via data assimilation improves constrained simulations but offers limited benefit once models run freely. We introduce an operator-learning framework that maps instantaneous model states to bias-correction tendencies and applies them online during integration. Building on a U-Net backbone, we develop two operator architectures Inception U-Net (IUNet) and a multi-scale network (M\\&M) that combine diverse upsampling and receptive fields to capture multiscale nonlinear features under Energy Exascale Earth System Model (E3SM) runtime constraints. Trained on two years E3SM simulations nudged toward ERA5 reanalysis, the operators generalize across height levels and seasons. Both architectures outperform standard U-Net baselines in offline tests, indicating that functional richness rather than parameter count drives performance. In online hybrid E3SM runs, M\\&M delivers the most consistent bias reductions across variables and vertical levels. The ML-augmented configurations remain stable and computationally feasible in multi-year simulations, providing a practical pathway for scalable hybrid modeling. Our framework emphasizes long-term stability, portability, and cadence-limited updates, demonstrating the utility of expressive ML operators for learning structured, cross-scale relationships and retrofitting legacy ESMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03324",
        "abs_url": "https://arxiv.org/abs/2512.03324",
        "pdf_url": "https://arxiv.org/pdf/2512.03324",
        "title": "Cache What Lasts: Token Retention for Memory-Bounded KV Cache in LLMs",
        "authors": [
            "Ngoc Bui",
            "Shubham Sharma",
            "Simran Lamba",
            "Saumitra Mishra",
            "Rex Ying"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Memory and computation remain core bottlenecks in long-horizon LLM inference due to the quadratic cost of self-attention and the ever-growing key-value (KV) cache. Existing strategies for memory-bounded inference, such as quantization, offloading, or heuristic KV eviction, either incur high orchestration costs or rely on unreliable attention-based proxies of importance. We propose TRIM-KV, a novel approach that learns each token's intrinsic importance at creation time via a lightweight retention gate. Each gate predicts a scalar retention score that decays over time, reflecting the long-term utility of the token for a specific layer and head. Tokens with low scores are evicted when the memory budget is exceeded, ensuring that the cache always contains the most critical tokens. TRIM-KV is trained efficiently through distillation from a frozen LLM combined with a capacity loss, requiring only gate fine-tuning and adding negligible inference overhead. Across mathematical reasoning (GSM8K, MATH-500, AIME24), procedural generation (LongProc), conversational long-memory benchmarks (LongMemEval), and long-context understanding (LongBench and SCBench), TRIM-KV consistently outperforms strong eviction and learnable retrieval baselines, especially in low-memory regimes. Remarkably, it even surpasses full-cache models in some settings, showing that selective retention can serve as a form of regularization, suppressing noise from uninformative tokens. Qualitative analyses further reveal that learned retention scores align with human intuition, naturally recovering heuristics such as sink tokens, sliding windows, and gist compression without explicit design. Beyond efficiency, retention scores provide insights into layer- and head-specific roles, suggesting a new path toward LLM interpretability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03354",
        "abs_url": "https://arxiv.org/abs/2512.03354",
        "pdf_url": "https://arxiv.org/pdf/2512.03354",
        "title": "Breaking Determinism: Stochastic Modeling for Reliable Off-Policy Evaluation in Ad Auctions",
        "authors": [
            "Hongseon Yeom",
            "Jaeyoul Shin",
            "Soojin Min",
            "Jeongmin Yoon",
            "Seunghak Yu",
            "Dongyeop Kang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Online A/B testing, the gold standard for evaluating new advertising policies, consumes substantial engineering resources and risks significant revenue loss from deploying underperforming variations. This motivates the use of Off-Policy Evaluation (OPE) for rapid, offline assessment. However, applying OPE to ad auctions is fundamentally more challenging than in domains like recommender systems, where stochastic policies are common. In online ad auctions, it is common for the highest-bidding ad to win the impression, resulting in a deterministic, winner-takes-all setting. This results in zero probability of exposure for non-winning ads, rendering standard OPE estimators inapplicable. We introduce the first principled framework for OPE in deterministic auctions by repurposing the bid landscape model to approximate the propensity score. This model allows us to derive robust approximate propensity scores, enabling the use of stable estimators like Self-Normalized Inverse Propensity Scoring (SNIPS) for counterfactual evaluation. We validate our approach on the AuctionNet simulation benchmark and against 2-weeks online A/B test from a large-scale industrial platform. Our method shows remarkable alignment with online results, achieving a 92\\% Mean Directional Accuracy (MDA) in CTR prediction, significantly outperforming the parametric baseline. MDA is the most critical metric for guiding deployment decisions, as it reflects the ability to correctly predict whether a new model will improve or harm performance. This work contributes the first practical and validated framework for reliable OPE in deterministic auction environments, offering an efficient alternative to costly and risky online experiments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03363",
        "abs_url": "https://arxiv.org/abs/2512.03363",
        "pdf_url": "https://arxiv.org/pdf/2512.03363",
        "title": "A2G-QFL: Adaptive Aggregation with Two Gains in Quantum Federated learning",
        "authors": [
            "Shanika Iroshi Nanayakkara",
            "Shiva Raj Pokhrel"
        ],
        "comments": "8 pages, 4 figures, QCNC 2026",
        "subjects": "Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Federated learning (FL) deployed over quantum enabled and heterogeneous classical networks faces significant performance degradation due to uneven client quality, stochastic teleportation fidelity, device instability, and geometric mismatch between local and global models. Classical aggregation rules assume euclidean topology and uniform communication reliability, limiting their suitability for emerging quantum federated systems. This paper introduces A2G (Adaptive Aggregation with Two Gains), a dual gain framework that jointly regulates geometric blending through a geometry gain and modulates client importance using a QoS gain derived from teleportation fidelity, latency, and instability. We develop the A2G update rule, establish convergence guarantees under smoothness and bounded variance assumptions, and show that A2G recovers FedAvg, QoS aware averaging, and manifold based aggregation as special cases. Experiments on a quantum classical hybrid testbed demonstrate improved stability and higher accuracy under heterogeneous and noisy conditions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03375",
        "abs_url": "https://arxiv.org/abs/2512.03375",
        "pdf_url": "https://arxiv.org/pdf/2512.03375",
        "title": "MAGE-ID: A Multimodal Generative Framework for Intrusion Detection Systems",
        "authors": [
            "Mahdi Arab Loodaricheh",
            "Mohammad Hossein Manshaei",
            "Anita Raja"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Modern Intrusion Detection Systems (IDS) face severe challenges due to heterogeneous network traffic, evolving cyber threats, and pronounced data imbalance between benign and attack flows. While generative models have shown promise in data augmentation, existing approaches are limited to single modalities and fail to capture cross-domain dependencies. This paper introduces MAGE-ID (Multimodal Attack Generator for Intrusion Detection), a diffusion-based generative framework that couples tabular flow features with their transformed images through a unified latent prior. By jointly training Transformer and CNN-based variational encoders with an EDM style denoiser, MAGE-ID achieves balanced and coherent multimodal synthesis. Evaluations on CIC-IDS-2017 and NSL-KDD demonstrate significant improvements in fidelity, diversity, and downstream detection performance over TabSyn and TabDDPM, highlighting the effectiveness of MAGE-ID for multimodal IDS augmentation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03393",
        "abs_url": "https://arxiv.org/abs/2512.03393",
        "pdf_url": "https://arxiv.org/pdf/2512.03393",
        "title": "Tuning-Free Structured Sparse Recovery of Multiple Measurement Vectors using Implicit Regularization",
        "authors": [
            "Lakshmi Jayalal",
            "Sheetal Kalyani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Recovering jointly sparse signals in the multiple measurement vectors (MMV) setting is a fundamental problem in machine learning, but traditional methods like multiple measurement vectors orthogonal matching pursuit (M-OMP) and multiple measurement vectors FOCal Underdetermined System Solver (M-FOCUSS) often require careful parameter tuning or prior knowledge of the sparsity of the signal and/or noise variance. We introduce a novel tuning-free framework that leverages Implicit Regularization (IR) from overparameterization to overcome this limitation. Our approach reparameterizes the estimation matrix into factors that decouple the shared row-support from individual vector entries. We show that the optimization dynamics inherently promote the desired row-sparse structure by applying gradient descent to a standard least-squares objective on these factors. We prove that with a sufficiently small and balanced initialization, the optimization dynamics exhibit a \"momentum-like\" effect, causing the norms of rows in the true support to grow significantly faster than others. This formally guarantees that the solution trajectory converges towards an idealized row-sparse solution. Additionally, empirical results demonstrate that our approach achieves performance comparable to established methods without requiring any prior information or tuning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03399",
        "abs_url": "https://arxiv.org/abs/2512.03399",
        "pdf_url": "https://arxiv.org/pdf/2512.03399",
        "title": "Full-Stack Alignment: Co-Aligning AI and Institutions with Thick Models of Value",
        "authors": [
            "Joe Edelman",
            "Tan Zhi-Xuan",
            "Ryan Lowe",
            "Oliver Klingefjord",
            "Vincent Wang-Mascianica",
            "Matija Franklin",
            "Ryan Othniel Kearns",
            "Ellie Hain",
            "Atrisha Sarkar",
            "Michiel Bakker",
            "Fazl Barez",
            "David Duvenaud",
            "Jakob Foerster",
            "Iason Gabriel",
            "Joseph Gubbels",
            "Bryce Goodman",
            "Andreas Haupt",
            "Jobst Heitzig",
            "Julian Jara-Ettinger",
            "Atoosa Kasirzadeh",
            "James Ravi Kirkpatrick",
            "Andrew Koh",
            "W. Bradley Knox",
            "Philipp Koralus",
            "Joel Lehman",
            "Sydney Levine",
            "Samuele Marro",
            "Manon Revel",
            "Toby Shorin",
            "Morgan Sutherland",
            "Michael Henry Tessler",
            "Ivan Vendrov",
            "James Wilken-Smith"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Beneficial societal outcomes cannot be guaranteed by aligning individual AI systems with the intentions of their operators or users. Even an AI system that is perfectly aligned to the intentions of its operating organization can lead to bad outcomes if the goals of that organization are misaligned with those of other institutions and individuals. For this reason, we need full-stack alignment, the concurrent alignment of AI systems and the institutions that shape them with what people value. This can be done without imposing a particular vision of individual or collective flourishing. We argue that current approaches for representing values, such as utility functions, preference orderings, or unstructured text, struggle to address these and other issues effectively. They struggle to distinguish values from other signals, to support principled normative reasoning, and to model collective goods. We propose thick models of value will be needed. These structure the way values and norms are represented, enabling systems to distinguish enduring values from fleeting preferences, to model the social embedding of individual choices, and to reason normatively, applying values in new domains. We demonstrate this approach in five areas: AI value stewardship, normatively competent agents, win-win negotiation systems, meaning-preserving economic mechanisms, and democratic regulatory institutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03428",
        "abs_url": "https://arxiv.org/abs/2512.03428",
        "pdf_url": "https://arxiv.org/pdf/2512.03428",
        "title": "GaussDetect-LiNGAM:Causal Direction Identification without Gaussianity test",
        "authors": [
            "Ziyi Ding",
            "Xiao-Ping Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We propose GaussDetect-LiNGAM, a novel approach for bivariate causal discovery that eliminates the need for explicit Gaussianity tests by leveraging a fundamental equivalence between noise Gaussianity and residual independence in the reverse regression. Under the standard LiNGAM assumptions of linearity, acyclicity, and exogeneity, we prove that the Gaussianity of the forward-model noise is equivalent to the independence between the regressor and residual in the reverse model. This theoretical insight allows us to replace fragile and sample-sensitive Gaussianity tests with robust kernel-based independence tests. Experimental results validate the equivalence and demonstrate that GaussDetect-LiNGAM maintains high consistency across diverse noise types and sample sizes, while reducing the number of tests per decision (TPD). Our method enhances both the efficiency and practical applicability of causal inference, making LiNGAM more accessible and reliable in real-world scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03437",
        "abs_url": "https://arxiv.org/abs/2512.03437",
        "pdf_url": "https://arxiv.org/pdf/2512.03437",
        "title": "Grokked Models are Better Unlearners",
        "authors": [
            "Yuanbang Liang",
            "Yang Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Grokking-delayed generalization that emerges well after a model has fit the training data-has been linked to robustness and representation quality. We ask whether this training regime also helps with machine unlearning, i.e., removing the influence of specified data without full retraining. We compare applying standard unlearning methods before versus after the grokking transition across vision (CNNs/ResNets on CIFAR, SVHN, and ImageNet) and language (a transformer on a TOFU-style setup). Starting from grokked checkpoints consistently yields (i) more efficient forgetting (fewer updates to reach a target forget level), (ii) less collateral damage (smaller drops on retained and test performance), and (iii) more stable updates across seeds, relative to early-stopped counterparts under identical unlearning algorithms. Analyses of features and curvature further suggest that post-grokking models learn more modular representations with reduced gradient alignment between forget and retain subsets, which facilitates selective forgetting. Our results highlight when a model is trained (pre- vs. post-grokking) as an orthogonal lever to how unlearning is performed, providing a practical recipe to improve existing unlearning methods without altering their algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03464",
        "abs_url": "https://arxiv.org/abs/2512.03464",
        "pdf_url": "https://arxiv.org/pdf/2512.03464",
        "title": "Multi-Modal Opinion Integration for Financial Sentiment Analysis using Cross-Modal Attention",
        "authors": [
            "Yujing Liu",
            "Chen Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In recent years, financial sentiment analysis of public opinion has become increasingly important for market forecasting and risk assessment. However, existing methods often struggle to effectively integrate diverse opinion modalities and capture fine-grained interactions across them. This paper proposes an end-to-end deep learning framework that integrates two distinct modalities of financial opinions: recency modality (timely opinions) and popularity modality (trending opinions), through a novel cross-modal attention mechanism specifically designed for financial sentiment analysis. While both modalities consist of textual data, they represent fundamentally different information channels: recency-driven market updates versus popularity-driven collective sentiment. Our model first uses BERT (Chinese-wwm-ext) for feature embedding and then employs our proposed Financial Multi-Head Cross-Attention (FMHCA) structure to facilitate information exchange between these distinct opinion modalities. The processed features are optimized through a transformer layer and fused using multimodal factored bilinear pooling for classification into negative, neutral, and positive sentiment. Extensive experiments on a comprehensive dataset covering 837 companies demonstrate that our approach achieves an accuracy of 83.5%, significantly outperforming baselines including BERT+Transformer by 21 percent. These results highlight the potential of our framework to support more accurate financial decision-making and risk management.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03467",
        "abs_url": "https://arxiv.org/abs/2512.03467",
        "pdf_url": "https://arxiv.org/pdf/2512.03467",
        "title": "Bayesian Event-Based Model for Disease Subtype and Stage Inference",
        "authors": [
            "Hongtao Hao",
            "Joseph L. Austerweil"
        ],
        "comments": "32 pages; machine learning for health symposium (2025); Proceedings of the 5th Machine Learning for Health Symposium in PMLR",
        "subjects": "Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "Chronic diseases often progress differently across patients. Rather than randomly varying, there are typically a small number of subtypes for how a disease progresses across patients. To capture this structured heterogeneity, the Subtype and Stage Inference Event-Based Model (SuStaIn) estimates the number of subtypes, the order of disease progression for each subtype, and assigns each patient to a subtype from primarily cross-sectional data. It has been widely applied to uncover the subtypes of many diseases and inform our understanding of them. But how robust is its performance? In this paper, we develop a principled Bayesian subtype variant of the event-based model (BEBMS) and compare its performance to SuStaIn in a variety of synthetic data experiments with varied levels of model misspecification. BEBMS substantially outperforms SuStaIn across ordering, staging, and subtype assignment tasks. Further, we apply BEBMS and SuStaIn to a real-world Alzheimer's data set. We find BEBMS has results that are more consistent with the scientific consensus of Alzheimer's disease progression than SuStaIn.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03471",
        "abs_url": "https://arxiv.org/abs/2512.03471",
        "pdf_url": "https://arxiv.org/pdf/2512.03471",
        "title": "SweetDeep: A Wearable AI Solution for Real-Time Non-Invasive Diabetes Screening",
        "authors": [
            "Ian Henriques",
            "Lynda Elhassar",
            "Sarvesh Relekar",
            "Denis Walrave",
            "Shayan Hassantabar",
            "Vishu Ghanakota",
            "Adel Laoui",
            "Mahmoud Aich",
            "Rafia Tir",
            "Mohamed Zerguine",
            "Samir Louafi",
            "Moncef Kimouche",
            "Emmanuel Cosson",
            "Niraj K Jha"
        ],
        "comments": "12 pages, 6 figures. Submitted to the IEEE Journal of Biomedical and Health Informatics",
        "subjects": "Machine Learning (cs.LG); Computers and Society (cs.CY)",
        "abstract": "The global rise in type 2 diabetes underscores the need for scalable and cost-effective screening methods. Current diagnosis requires biochemical assays, which are invasive and costly. Advances in consumer wearables have enabled early explorations of machine learning-based disease detection, but prior studies were limited to controlled settings. We present SweetDeep, a compact neural network trained on physiological and demographic data from 285 (diabetic and non-diabetic) participants in the EU and MENA regions, collected using Samsung Galaxy Watch 7 devices in free-living conditions over six days. Each participant contributed multiple 2-minute sensor recordings per day, totaling approximately 20 recordings per individual. Despite comprising fewer than 3,000 parameters, SweetDeep achieves 82.5% patient-level accuracy (82.1% macro-F1, 79.7% sensitivity, 84.6% specificity) under three-fold cross-validation, with an expected calibration error of 5.5%. Allowing the model to abstain on less than 10% of low-confidence patient predictions yields an accuracy of 84.5% on the remaining patients. These findings demonstrate that combining engineered features with lightweight architectures can support accurate, rapid, and generalizable detection of type 2 diabetes in real-world wearable settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03475",
        "abs_url": "https://arxiv.org/abs/2512.03475",
        "pdf_url": "https://arxiv.org/pdf/2512.03475",
        "title": "Joint Progression Modeling (JPM): A Probabilistic Framework for Mixed-Pathology Progression",
        "authors": [
            "Hongtao Hao",
            "Joseph L. Austerweil"
        ],
        "comments": "49 pages; Machine Learning for Health (ML4H) Symposium 2025",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "Event-based models (EBMs) infer disease progression from cross-sectional data, and standard EBMs assume a single underlying disease per individual. In contrast, mixed pathologies are common in neurodegeneration. We introduce the Joint Progression Model (JPM), a probabilistic framework that treats single-disease trajectories as partial rankings and builds a prior over joint progressions. We study several JPM variants (Pairwise, Bradley-Terry, Plackett-Luce, and Mallows) and analyze three properties: (i) calibration -- whether lower model energy predicts smaller distance to the ground truth ordering; (ii) separation -- the degree to which sampled rankings are distinguishable from random permutations; and (iii) sharpness -- the stability of sampled aggregate rankings. All variants are calibrated, and all achieve near-perfect separation; sharpness varies by variant and is well-predicted by simple features of the input partial rankings (number and length of rankings, conflict, and overlap). In synthetic experiments, JPM improves ordering accuracy by roughly 21 percent over a strong EBM baseline (SA-EBM) that treats the joint disease as a single condition. Finally, using NACC, we find that the Mallows variant of JPM and the baseline model (SA-EBM) have results that are more consistent with prior literature on the possible disease progression of the mixed pathology of AD and VaD.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03491",
        "abs_url": "https://arxiv.org/abs/2512.03491",
        "pdf_url": "https://arxiv.org/pdf/2512.03491",
        "title": "Modal Logical Neural Networks",
        "authors": [
            "Antonin Sulc"
        ],
        "comments": "27 pages, 10 figures, 7 tables",
        "subjects": "Machine Learning (cs.LG); Logic in Computer Science (cs.LO); Multiagent Systems (cs.MA)",
        "abstract": "We propose Modal Logical Neural Networks (MLNNs), a neurosymbolic framework that integrates deep learning with the formal semantics of modal logic, enabling reasoning about necessity and possibility. Drawing on Kripke semantics, we introduce specialized neurons for the modal operators $\\Box$ and $\\Diamond$ that operate over a set of possible worlds, enabling the framework to act as a differentiable ``logical guardrail.'' The architecture is highly flexible: the accessibility relation between worlds can either be fixed by the user to enforce known rules or, as an inductive feature, be parameterized by a neural network. This allows the model to optionally learn the relational structure of a logical system from data while simultaneously performing deductive reasoning within that structure. This versatile construction is designed for flexibility. The entire framework is differentiable from end to end, with learning driven by minimizing a logical contradiction loss. This not only makes the system resilient to inconsistent knowledge but also enables it to learn nonlinear relationships that can help define the logic of a problem space. We illustrate MLNNs on four case studies: grammatical guardrailing, axiomatic detection of the unknown, multi-agent epistemic trust, and detecting constructive deception in natural language negotiation. These experiments demonstrate how enforcing or learning accessibility can increase logical consistency and interpretability without changing the underlying task architecture.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03512",
        "abs_url": "https://arxiv.org/abs/2512.03512",
        "pdf_url": "https://arxiv.org/pdf/2512.03512",
        "title": "Physics-Driven Learning Framework for Tomographic Tactile Sensing",
        "authors": [
            "Xuanxuan Yang",
            "Xiuyang Zhang",
            "Haofeng Chen",
            "Gang Ma",
            "Xiaojie Wang"
        ],
        "comments": "7pages,7figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Electrical impedance tomography (EIT) provides an attractive solution for large-area tactile sensing due to its minimal wiring and shape flexibility, but its nonlinear inverse problem often leads to severe artifacts and inaccurate contact reconstruction. This work presents PhyDNN, a physics-driven deep reconstruction framework that embeds the EIT forward model directly into the learning objective. By jointly minimizing the discrepancy between predicted and ground-truth conductivity maps and enforcing consistency with the forward PDE, PhyDNN reduces the black-box nature of deep networks and improves both physical plausibility and generalization. To enable efficient backpropagation, we design a differentiable forward-operator network that accurately approximates the nonlinear EIT response, allowing fast physics-guided training. Extensive simulations and real tactile experiments on a 16-electrode soft sensor show that PhyDNN consistently outperforms NOSER, TV, and standard DNNs in reconstructing contact shape, location, and pressure distribution. PhyDNN yields fewer artifacts, sharper boundaries, and higher metric scores, demonstrating its effectiveness for high-quality tomographic tactile sensing.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03525",
        "abs_url": "https://arxiv.org/abs/2512.03525",
        "pdf_url": "https://arxiv.org/pdf/2512.03525",
        "title": "Adaptive sampling using variational autoencoder and reinforcement learning",
        "authors": [
            "Adil Rasheed",
            "Mikael Aleksander Jansen Shahly",
            "Muhammad Faisal Aftab"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Compressed sensing enables sparse sampling but relies on generic bases and random measurements, limiting efficiency and reconstruction quality. Optimal sensor placement uses historcal data to design tailored sampling patterns, yet its fixed, linear bases cannot adapt to nonlinear or sample-specific variations. Generative model-based compressed sensing improves reconstruction using deep generative priors but still employs suboptimal random sampling. We propose an adaptive sparse sensing framework that couples a variational autoencoder prior with reinforcement learning to select measurements sequentially. Experiments show that this approach outperforms CS, OSP, and Generative model-based reconstruction from sparse measurements.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03537",
        "abs_url": "https://arxiv.org/abs/2512.03537",
        "pdf_url": "https://arxiv.org/pdf/2512.03537",
        "title": "Parameter-Efficient Augment Plugin for Class-Incremental Learning",
        "authors": [
            "Zhiming Xu",
            "Baile Xu",
            "Jian Zhao",
            "Furao Shen",
            "Suorong Yang"
        ],
        "comments": "10 pages, 6 figures, 2 tables",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Existing class-incremental learning (CIL) approaches based on replay or knowledge distillation are often constrained by forgetting or the stability-plasticity dilemma. Some expansion-based approaches could achieve higher accuracy. However, they always require significant parameter increases. In this paper, we propose a plugin extension paradigm termed the Deployment of extra LoRA Components (DLC) for non-pre-trained CIL this http URL treat the feature extractor trained through replay or distillation as a base model with rich knowledge. For each task, we use Low-Rank Adaptation (LoRA) to inject task-specific residuals into the base model's deep layers. During inference, representations with task-specific residuals are aggregated to produce classification predictions. To mitigate interference from non-target LoRA plugins, we introduce a lightweight weighting unit. This unit learns to assign importance scores to different LoRA-tuned representations. Like downloadable contents in software, our method serves as a plug-and-play enhancement that efficiently extends the base methods. Remarkably, on the large-scale ImageNet-100, with merely 4 % of the parameters of a standard ResNet-18, our DLC model achieves a significant 8 % improvement in accuracy, demonstrating exceptional efficiency. Moreover, it could surpass state-of-the-art methods under the fixed memory budget.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03564",
        "abs_url": "https://arxiv.org/abs/2512.03564",
        "pdf_url": "https://arxiv.org/pdf/2512.03564",
        "title": "Towards Irreversible Machine Unlearning for Diffusion Models",
        "authors": [
            "Xun Yuan",
            "Zilong Zhao",
            "Jiayu Li",
            "Aryan Pasikhani",
            "Prosanta Gope",
            "Biplab Sikdar"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Diffusion models are renowned for their state-of-the-art performance in generating synthetic images. However, concerns related to safety, privacy, and copyright highlight the need for machine unlearning, which can make diffusion models forget specific training data and prevent the generation of sensitive or unwanted content. Current machine unlearning methods for diffusion models are primarily designed for conditional diffusion models and focus on unlearning specific data classes or features. Among these methods, finetuning-based machine unlearning methods are recognized for their efficiency and effectiveness, which update the parameters of pre-trained diffusion models by minimizing carefully designed loss functions. However, in this paper, we propose a novel attack named Diffusion Model Relearning Attack (DiMRA), which can reverse the finetuning-based machine unlearning methods, posing a significant vulnerability of this kind of technique. Without prior knowledge of the unlearning elements, DiMRA optimizes the unlearned diffusion model on an auxiliary dataset to reverse the unlearning, enabling the model to regenerate previously unlearned elements. To mitigate this vulnerability, we propose a novel machine unlearning method for diffusion models, termed as Diffusion Model Unlearning by Memorization (DiMUM). Unlike traditional methods that focus on forgetting, DiMUM memorizes alternative data or features to replace targeted unlearning data or features in order to prevent generating such elements. In our experiments, we demonstrate the effectiveness of DiMRA in reversing state-of-the-art finetuning-based machine unlearning methods for diffusion models, highlighting the need for more robust solutions. We extensively evaluate DiMUM, demonstrating its superior ability to preserve the generative performance of diffusion models while enhancing robustness against DiMRA.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03579",
        "abs_url": "https://arxiv.org/abs/2512.03579",
        "pdf_url": "https://arxiv.org/pdf/2512.03579",
        "title": "Optimal Transportation and Alignment Between Gaussian Measures",
        "authors": [
            "Sanjit Dandapanthula",
            "Aleksandr Podkopaev",
            "Shiva Prasad Kasiviswanathan",
            "Aaditya Ramdas",
            "Ziv Goldfeld"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Probability (math.PR); Statistics Theory (math.ST)",
        "abstract": "Optimal transport (OT) and Gromov-Wasserstein (GW) alignment provide interpretable geometric frameworks for comparing, transforming, and aggregating heterogeneous datasets -- tasks ubiquitous in data science and machine learning. Because these frameworks are computationally expensive, large-scale applications often rely on closed-form solutions for Gaussian distributions under quadratic cost. This work provides a comprehensive treatment of Gaussian, quadratic cost OT and inner product GW (IGW) alignment, closing several gaps in the literature to broaden applicability. First, we treat the open problem of IGW alignment between uncentered Gaussians on separable Hilbert spaces by giving a closed-form expression up to a quadratic optimization over unitary operators, for which we derive tight analytic upper and lower bounds. If at least one Gaussian measure is centered, the solution reduces to a fully closed-form expression, which we further extend to an analytic solution for the IGW barycenter between centered Gaussians. We also present a reduction of Gaussian multimarginal OT with pairwise quadratic costs to a tractable optimization problem and provide an efficient algorithm to solve it using a rank-deficiency constraint. To demonstrate utility, we apply our results to knowledge distillation and heterogeneous clustering on synthetic and real-world datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03584",
        "abs_url": "https://arxiv.org/abs/2512.03584",
        "pdf_url": "https://arxiv.org/pdf/2512.03584",
        "title": "Federated Learning and Trajectory Compression for Enhanced AIS Coverage",
        "authors": [
            "Thomas Gräupl",
            "Andreas Reisenbauer",
            "Marcel Hecko",
            "Anil Rasouli",
            "Anita Graser",
            "Melitta Dragaschnig",
            "Axel Weissenfeld",
            "Gilles Dejaegere",
            "Mahmoud Sakr"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper presents the VesselEdge system, which leverages federated learning and bandwidth-constrained trajectory compression to enhance maritime situational awareness by extending AIS coverage. VesselEdge transforms vessels into mobile sensors, enabling real-time anomaly detection and efficient data transmission over low-bandwidth connections. The system integrates the M3fed model for federated learning and the BWC-DR-A algorithm for trajectory compression, prioritizing anomalous data. Preliminary results demonstrate the effectiveness of VesselEdge in improving AIS coverage and situational awareness using historical data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03606",
        "abs_url": "https://arxiv.org/abs/2512.03606",
        "pdf_url": "https://arxiv.org/pdf/2512.03606",
        "title": "Observation-driven correction of numerical weather prediction for marine winds",
        "authors": [
            "Matteo Peduto",
            "Qidong Yang",
            "Jonathan Giezendanner",
            "Devis Tuia",
            "Sherrie Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate marine wind forecasts are essential for safe navigation, ship routing, and energy operations, yet they remain challenging because observations over the ocean are sparse, heterogeneous, and temporally variable. We reformulate wind forecasting as observation-informed correction of a global numerical weather prediction (NWP) model. Rather than forecasting winds directly, we learn local correction patterns by assimilating the latest in-situ observations to adjust the Global Forecast System (GFS) output. We propose a transformer-based deep learning architecture that (i) handles irregular and time-varying observation sets through masking and set-based attention mechanisms, (ii) conditions predictions on recent observation-forecast pairs via cross-attention, and (iii) employs cyclical time embeddings and coordinate-aware location representations to enable single-pass inference at arbitrary spatial coordinates. We evaluate our model over the Atlantic Ocean using observations from the International Comprehensive Ocean-Atmosphere Data Set (ICOADS) as reference. The model reduces GFS 10-meter wind RMSE at all lead times up to 48 hours, achieving 45% improvement at 1-hour lead time and 13% improvement at 48-hour lead time. Spatial analyses reveal the most persistent improvements along coastlines and shipping routes, where observations are most abundant. The tokenized architecture naturally accommodates heterogeneous observing platforms (ships, buoys, tide gauges, and coastal stations) and produces both site-specific predictions and basin-scale gridded products in a single forward pass. These results demonstrate a practical, low-latency post-processing approach that complements NWP by learning to correct systematic forecast errors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03610",
        "abs_url": "https://arxiv.org/abs/2512.03610",
        "pdf_url": "https://arxiv.org/pdf/2512.03610",
        "title": "CoGraM: Context-sensitive granular optimization method with rollback for robust model fusion",
        "authors": [
            "Julius Lenz"
        ],
        "comments": "15 pages, 4 figures, 8 equations",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Merging neural networks without retraining is central to federated and distributed learning. Common methods such as weight averaging or Fisher merging often lose accuracy and are unstable across seeds. CoGraM (Contextual Granular Merging) is a multi-stage, context-sensitive, loss-based, and iterative optimization method across layers, neurons, and weight levels that aligns decisions with loss differences and thresholds and prevents harmful updates through rollback. CoGraM is an optimization method that addresses the weaknesses of methods such as Fisher and can significantly improve the merged network.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03653",
        "abs_url": "https://arxiv.org/abs/2512.03653",
        "pdf_url": "https://arxiv.org/pdf/2512.03653",
        "title": "Conditional updates of neural network weights for increased out of training performance",
        "authors": [
            "Jan Saynisch-Wagner",
            "Saran Rajendran Sari"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Atmospheric and Oceanic Physics (physics.ao-ph); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "This study proposes a method to enhance neural network performance when training data and application data are not very similar, e.g., out of distribution problems, as well as pattern and regime shifts. The method consists of three main steps: 1) Retrain the neural network towards reasonable subsets of the training data set and note down the resulting weight anomalies. 2) Choose reasonable predictors and derive a regression between the predictors and the weight anomalies. 3) Extrapolate the weights, and thereby the neural network, to the application data. We show and discuss this method in three use cases from the climate sciences, which include successful temporal, spatial and cross-domain extrapolations of neural networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03661",
        "abs_url": "https://arxiv.org/abs/2512.03661",
        "pdf_url": "https://arxiv.org/pdf/2512.03661",
        "title": "Dynamically Scaled Activation Steering",
        "authors": [
            "Alex Ferrando",
            "Xavier Suau",
            "Jordi Gonzàlez",
            "Pau Rodriguez"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Activation steering has emerged as a powerful method for guiding the behavior of generative models towards desired outcomes such as toxicity mitigation. However, most existing methods apply interventions uniformly across all inputs, degrading model performance when steering is unnecessary. We introduce Dynamically Scaled Activation Steering (DSAS), a method-agnostic steering framework that decouples when to steer from how to steer. DSAS adaptively modulates the strength of existing steering transformations across layers and inputs, intervening strongly only when undesired behavior is detected. At generation time, DSAS computes context-dependent scaling factors that selectively adjust the strength of any steering method. We also show how DSAS can be jointly optimized end-to-end together with the steering function. When combined with existing steering methods, DSAS consistently improves the Pareto front with respect to steering alone, achieving a better trade-off between toxicity mitigation and utility preservation. We further demonstrate DSAS's generality by applying it to a text-to-image diffusion model, showing how adaptive steering allows the modulation of specific concepts. Finally, DSAS introduces minimal computational overhead while improving interpretability, pinpointing which tokens require steering and by how much.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03678",
        "abs_url": "https://arxiv.org/abs/2512.03678",
        "pdf_url": "https://arxiv.org/pdf/2512.03678",
        "title": "Feature-aware Modulation for Learning from Temporal Tabular Data",
        "authors": [
            "Hao-Run Cai",
            "Han-Jia Ye"
        ],
        "comments": "17 pages, 6 figures, 8 tables. NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "While tabular machine learning has achieved remarkable success, temporal distribution shifts pose significant challenges in real-world deployment, as the relationships between features and labels continuously evolve. Static models assume fixed mappings to ensure generalization, whereas adaptive models may overfit to transient patterns, creating a dilemma between robustness and adaptability. In this paper, we analyze key factors essential for constructing an effective dynamic mapping for temporal tabular data. We discover that evolving feature semantics-particularly objective and subjective meanings-introduce concept drift over time. Crucially, we identify that feature transformation strategies are able to mitigate discrepancies in feature representations across temporal stages. Motivated by these insights, we propose a feature-aware temporal modulation mechanism that conditions feature representations on temporal context, modulating statistical properties such as scale and skewness. By aligning feature semantics across time, our approach achieves a lightweight yet powerful adaptation, effectively balancing generalizability and adaptability. Benchmark evaluations validate the effectiveness of our method in handling temporal shifts in tabular data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03696",
        "abs_url": "https://arxiv.org/abs/2512.03696",
        "pdf_url": "https://arxiv.org/pdf/2512.03696",
        "title": "Quantum Topological Graph Neural Networks for Detecting Complex Fraud Patterns",
        "authors": [
            "Mohammad Doost",
            "Mohammad Manthouri"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We propose a novel QTGNN framework for detecting fraudulent transactions in large-scale financial networks. By integrating quantum embedding, variational graph convolutions, and topological data analysis, QTGNN captures complex transaction dynamics and structural anomalies indicative of fraud. The methodology includes quantum data embedding with entanglement enhancement, variational quantum graph convolutions with non-linear dynamics, extraction of higher-order topological invariants, hybrid quantum-classical anomaly learning with adaptive optimization, and interpretable decision-making via topological attribution. Rigorous convergence guarantees ensure stable training on noisy intermediate-scale quantum (NISQ) devices, while stability of topological signatures provides robust fraud detection. Optimized for NISQ hardware with circuit simplifications and graph sampling, the framework scales to large transaction networks. Simulations on financial datasets, such as PaySim and Elliptic, benchmark QTGNN against classical and quantum baselines, using metrics like ROC-AUC, precision, and false positive rate. An ablation study evaluates the contributions of quantum embeddings, topological features, non-linear channels, and hybrid learning. QTGNN offers a theoretically sound, interpretable, and practical solution for financial fraud detection, bridging quantum machine learning, graph theory, and topological analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03744",
        "abs_url": "https://arxiv.org/abs/2512.03744",
        "pdf_url": "https://arxiv.org/pdf/2512.03744",
        "title": "Unlocking the Invisible Urban Traffic Dynamics under Extreme Weather: A New Physics-Constrained Hamiltonian Learning Algorithm",
        "authors": [
            "Xuhui Lin",
            "Qiuchen Lu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Urban transportation systems face increasing resilience challenges from extreme weather events, but current assessment methods rely on surface-level recovery indicators that miss hidden structural damage. Existing approaches cannot distinguish between true recovery and \"false recovery,\" where traffic metrics normalize, but the underlying system dynamics permanently degrade. To address this, a new physics-constrained Hamiltonian learning algorithm combining \"structural irreversibility detection\" and \"energy landscape reconstruction\" has been developed. Our approach extracts low-dimensional state representations, identifies quasi-Hamiltonian structures through physics-constrained optimization, and quantifies structural changes via energy landscape comparison. Analysis of London's extreme rainfall in 2021 demonstrates that while surface indicators were fully recovered, our algorithm detected 64.8\\% structural damage missed by traditional monitoring. Our framework provides tools for proactive structural risk assessment, enabling infrastructure investments based on true system health rather than misleading surface metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03750",
        "abs_url": "https://arxiv.org/abs/2512.03750",
        "pdf_url": "https://arxiv.org/pdf/2512.03750",
        "title": "Universally Converging Representations of Matter Across Scientific Foundation Models",
        "authors": [
            "Sathya Edamadaka",
            "Soojung Yang",
            "Ju Li",
            "Rafael Gómez-Bombarelli"
        ],
        "comments": "Oral spotlight at NeurIPS 2025 UniReps Workshop",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Machine learning models of vastly different modalities and architectures are being trained to predict the behavior of molecules, materials, and proteins. However, it remains unclear whether they learn similar internal representations of matter. Understanding their latent structure is essential for building scientific foundation models that generalize reliably beyond their training domains. Although representational convergence has been observed in language and vision, its counterpart in the sciences has not been systematically explored. Here, we show that representations learned by nearly sixty scientific models, spanning string-, graph-, 3D atomistic, and protein-based modalities, are highly aligned across a wide range of chemical systems. Models trained on different datasets have highly similar representations of small molecules, and machine learning interatomic potentials converge in representation space as they improve in performance, suggesting that foundation models learn a common underlying representation of physical reality. We then show two distinct regimes of scientific models: on inputs similar to those seen during training, high-performing models align closely and weak models diverge into local sub-optima in representation space; on vastly different structures from those seen during training, nearly all models collapse onto a low-information representation, indicating that today's models remain limited by training data and inductive bias and do not yet encode truly universal structure. Our findings establish representational alignment as a quantitative benchmark for foundation-level generality in scientific models. More broadly, our work can track the emergence of universal representations of matter as models scale, and for selecting and distilling models whose learned representations transfer best across modalities, domains of matter, and scientific tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03755",
        "abs_url": "https://arxiv.org/abs/2512.03755",
        "pdf_url": "https://arxiv.org/pdf/2512.03755",
        "title": "Origin-Conditional Trajectory Encoding: Measuring Urban Configurational Asymmetries through Neural Decomposition",
        "authors": [
            "Stephen Law",
            "Tao Yang",
            "Nanjiang Chen",
            "Xuhui Lin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Urban analytics increasingly relies on AI-driven trajectory analysis, yet current approaches suffer from methodological fragmentation: trajectory learning captures movement patterns but ignores spatial context, while spatial embedding methods encode street networks but miss temporal dynamics. Three gaps persist: (1) lack of joint training that integrates spatial and temporal representations, (2) origin-agnostic treatment that ignores directional asymmetries in navigation ($A \\to B \\ne B \\to A$), and (3) over-reliance on auxiliary data (POIs, imagery) rather than fundamental geometric properties of urban space. We introduce a conditional trajectory encoder that jointly learns spatial and movement representations while preserving origin-dependent asymmetries using geometric features. This framework decomposes urban navigation into shared cognitive patterns and origin-specific spatial narratives, enabling quantitative measurement of cognitive asymmetries across starting locations. Our bidirectional LSTM processes visibility ratio and curvature features conditioned on learnable origin embeddings, decomposing representations into shared urban patterns and origin-specific signatures through contrastive learning. Results from six synthetic cities and real-world validation on Beijing's Xicheng District demonstrate that urban morphology creates systematic cognitive inequalities. This provides urban planners quantitative tools for assessing experiential equity, offers architects insights into layout decisions' cognitive impacts, and enables origin-aware analytics for navigation systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03768",
        "abs_url": "https://arxiv.org/abs/2512.03768",
        "pdf_url": "https://arxiv.org/pdf/2512.03768",
        "title": "Deep Unfolding: Recent Developments, Theory, and Design Guidelines",
        "authors": [
            "Nir Shlezinger",
            "Santiago Segarra",
            "Yi Zhang",
            "Dvir Avrahami",
            "Zohar Davidov",
            "Tirza Routtenberg",
            "Yonina C. Eldar"
        ],
        "comments": "under review for publication in the IEEE",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Optimization methods play a central role in signal processing, serving as the mathematical foundation for inference, estimation, and control. While classical iterative optimization algorithms provide interpretability and theoretical guarantees, they often rely on surrogate objectives, require careful hyperparameter tuning, and exhibit substantial computational latency. Conversely, machine learning (ML ) offers powerful data-driven modeling capabilities but lacks the structure, transparency, and efficiency needed for optimization-driven inference. Deep unfolding has recently emerged as a compelling framework that bridges these two paradigms by systematically transforming iterative optimization algorithms into structured, trainable ML architectures. This article provides a tutorial-style overview of deep unfolding, presenting a unified perspective of methodologies for converting optimization solvers into ML models and highlighting their conceptual, theoretical, and practical implications. We review the foundations of optimization for inference and for learning, introduce four representative design paradigms for deep unfolding, and discuss the distinctive training schemes that arise from their iterative nature. Furthermore, we survey recent theoretical advances that establish convergence and generalization guarantees for unfolded optimizers, and provide comparative qualitative and empirical studies illustrating their relative trade-offs in complexity, interpretability, and robustness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03786",
        "abs_url": "https://arxiv.org/abs/2512.03786",
        "pdf_url": "https://arxiv.org/pdf/2512.03786",
        "title": "Forensic Activity Classification Using Digital Traces from iPhones: A Machine Learning-based Approach",
        "authors": [
            "Conor McCarthy",
            "Jan Peter van Zandwijk",
            "Marcel Worring",
            "Zeno Geradts"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Smartphones and smartwatches are ever-present in daily life, and provide a rich source of information on their users' behaviour. In particular, digital traces derived from the phone's embedded movement sensors present an opportunity for a forensic investigator to gain insight into a person's physical activities. In this work, we present a machine learning-based approach to translate digital traces into likelihood ratios (LRs) for different types of physical activities. Evaluating on a new dataset, NFI\\_FARED, which contains digital traces from four different types of iPhones labelled with 19 activities, it was found that our approach could produce useful LR systems to distinguish 167 out of a possible 171 activity pairings. The same approach was extended to analyse likelihoods for multiple activities (or groups of activities) simultaneously and create activity timelines to aid in both the early and latter stages of forensic investigations. The dataset and all code required to replicate the results have also been made public to encourage further research on this topic.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03787",
        "abs_url": "https://arxiv.org/abs/2512.03787",
        "pdf_url": "https://arxiv.org/pdf/2512.03787",
        "title": "Adaptive Identification and Modeling of Clinical Pathways with Process Mining",
        "authors": [
            "Francesco Vitale",
            "Nicola Mazzocca"
        ],
        "comments": "Accepted to the 41st ACM/SIGAPP Symposium On Applied Computing (ACM SAC 2026)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Clinical pathways are specialized healthcare plans that model patient treatment procedures. They are developed to provide criteria-based progression and standardize patient treatment, thereby improving care, reducing resource use, and accelerating patient recovery. However, manual modeling of these pathways based on clinical guidelines and domain expertise is difficult and may not reflect the actual best practices for different variations or combinations of diseases. We propose a two-phase modeling method using process mining, which extends the knowledge base of clinical pathways by leveraging conformance checking diagnostics. In the first phase, historical data of a given disease is collected to capture treatment in the form of a process model. In the second phase, new data is compared against the reference model to verify conformance. Based on the conformance checking results, the knowledge base can be expanded with more specific models tailored to new variants or disease combinations. We demonstrate our approach using Synthea, a benchmark dataset simulating patient treatments for SARS-CoV-2 infections with varying COVID-19 complications. The results show that our method enables expanding the knowledge base of clinical pathways with sufficient precision, peaking to 95.62% AUC while maintaining an arc-degree simplicity of 67.11%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03804",
        "abs_url": "https://arxiv.org/abs/2512.03804",
        "pdf_url": "https://arxiv.org/pdf/2512.03804",
        "title": "EfficientECG: Cross-Attention with Feature Fusion for Efficient Electrocardiogram Classification",
        "authors": [
            "Hanhui Deng",
            "Xinglin Li",
            "Jie Luo",
            "Zhanpeng Jin",
            "Di Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Electrocardiogram is a useful diagnostic signal that can detect cardiac abnormalities by measuring the electrical activity generated by the heart. Due to its rapid, non-invasive, and richly informative characteristics, ECG has many emerging applications. In this paper, we study novel deep learning technologies to effectively manage and analyse ECG data, with the aim of building a diagnostic model, accurately and quickly, that can substantially reduce the burden on medical workers. Unlike the existing ECG models that exhibit a high misdiagnosis rate, our deep learning approaches can automatically extract the features of ECG data through end-to-end training. Specifically, we first devise EfficientECG, an accurate and lightweight classification model for ECG analysis based on the existing EfficientNet model, which can effectively handle high-frequency long-sequence ECG data with various leading types. On top of that, we next propose a cross-attention-based feature fusion model of EfficientECG for analysing multi-lead ECG data with multiple features (e.g., gender and age). Our evaluations on representative ECG datasets validate the superiority of our model against state-of-the-art works in terms of high precision, multi-feature fusion, and lightweights.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03805",
        "abs_url": "https://arxiv.org/abs/2512.03805",
        "pdf_url": "https://arxiv.org/pdf/2512.03805",
        "title": "Deep Reinforcement Learning for Dynamic Algorithm Configuration: A Case Study on Optimizing OneMax with the (1+($λ$,$λ$))-GA",
        "authors": [
            "Tai Nguyen",
            "Phong Le",
            "André Biedenkapp",
            "Carola Doerr",
            "Nguyen Dang"
        ],
        "comments": "arXiv admin note: text overlap with arXiv:2502.20265",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Dynamic Algorithm Configuration (DAC) studies the efficient identification of control policies for parameterized optimization algorithms. Numerous studies have leveraged the robustness of decision-making in Reinforcement Learning (RL) to address the optimization challenges in algorithm configuration. However, applying RL to DAC is challenging and often requires extensive domain expertise. We conduct a comprehensive study of deep-RL algorithms in DAC through a systematic analysis of controlling the population size parameter of the (1+($\\lambda$,$\\lambda$))-GA on OneMax instances. Our investigation of DDQN and PPO reveals two fundamental challenges that limit their effectiveness in DAC: scalability degradation and learning instability. We trace these issues to two primary causes: under-exploration and planning horizon coverage, each of which can be effectively addressed through targeted solutions. To address under-exploration, we introduce an adaptive reward shifting mechanism that leverages reward distribution statistics to enhance DDQN agent exploration, eliminating the need for instance-specific hyperparameter tuning and ensuring consistent effectiveness across different problem scales. In dealing with the planning horizon coverage problem, we demonstrate that undiscounted learning effectively resolves it in DDQN, while PPO faces fundamental variance issues that necessitate alternative algorithmic designs. We further analyze the hyperparameter dependencies of PPO, showing that while hyperparameter optimization enhances learning stability, it consistently falls short in identifying effective policies across various configurations. Finally, we demonstrate that DDQN equipped with our adaptive reward shifting strategy achieves performance comparable to theoretically derived policies with vastly improved sample efficiency, outperforming prior DAC approaches by several orders of magnitude.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03816",
        "abs_url": "https://arxiv.org/abs/2512.03816",
        "pdf_url": "https://arxiv.org/pdf/2512.03816",
        "title": "Log Probability Tracking of LLM APIs",
        "authors": [
            "Timothée Chauvin",
            "Erwan Le Merrer",
            "François Taïani",
            "Gilles Tredan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "When using an LLM through an API provider, users expect the served model to remain consistent over time, a property crucial for the reliability of downstream applications and the reproducibility of research. Existing audit methods are too costly to apply at regular time intervals to the wide range of available LLM APIs. This means that model updates are left largely unmonitored in practice. In this work, we show that while LLM log probabilities (logprobs) are usually non-deterministic, they can still be used as the basis for cost-effective continuous monitoring of LLM APIs. We apply a simple statistical test based on the average value of each token logprob, requesting only a single token of output. This is enough to detect changes as small as one step of fine-tuning, making this approach more sensitive than existing methods while being 1,000x cheaper. We introduce the TinyChange benchmark as a way to measure the sensitivity of audit methods in the context of small, realistic model changes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03819",
        "abs_url": "https://arxiv.org/abs/2512.03819",
        "pdf_url": "https://arxiv.org/pdf/2512.03819",
        "title": "Transmit Weights, Not Features: Orthogonal-Basis Aided Wireless Point-Cloud Transmission",
        "authors": [
            "Junlin Chang",
            "Yubo Han",
            "Hnag Yue",
            "John S Thompson",
            "Rongke Liu"
        ],
        "comments": "5 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The widespread adoption of depth sensors has substantially lowered the barrier to point-cloud acquisition. This letter proposes a semantic wireless transmission framework for three dimension (3D) point clouds built on Deep Joint Source - Channel Coding (DeepJSCC). Instead of sending raw features, the transmitter predicts combination weights over a receiver-side semantic orthogonal feature pool, enabling compact representations and robust reconstruction. A folding-based decoder deforms a 2D grid into 3D, enforcing manifold continuity while preserving geometric fidelity. Trained with Chamfer Distance (CD) and an orthogonality regularizer, the system is evaluated on ModelNet40 across varying Signal-to-Noise Ratios (SNRs) and bandwidths. Results show performance on par with SEmantic Point cloud Transmission (SEPT) at high bandwidth and clear gains in bandwidth-constrained regimes, with consistent improvements in both Peak Signal-to-Noise Ratio (PSNR) and CD. Ablation experiments confirm the benefits of orthogonalization and the folding prior.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03861",
        "abs_url": "https://arxiv.org/abs/2512.03861",
        "pdf_url": "https://arxiv.org/pdf/2512.03861",
        "title": "Scalable Decision Focused Learning via Online Trainable Surrogates",
        "authors": [
            "Gaetano Signorelli",
            "Michele Lombardi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Decision support systems often rely on solving complex optimization problems that may require to estimate uncertain parameters beforehand. Recent studies have shown how using traditionally trained estimators for this task can lead to suboptimal solutions. Using the actual decision cost as a loss function (called Decision Focused Learning) can address this issue, but with a severe loss of scalability at training time. To address this issue, we propose an acceleration method based on replacing costly loss function evaluations with an efficient surrogate. Unlike previously defined surrogates, our approach relies on unbiased estimators reducing the risk of spurious local optima and can provide information on its local confidence allowing one to switch to a fallback method when needed. Furthermore, the surrogate is designed for a black-box setting, which enables compensating for simplifications in the optimization model and account- ing for recourse actions during cost computation. In our results, the method reduces costly inner solver calls, with a solution quality comparable to other state-of-the-art techniques.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03882",
        "abs_url": "https://arxiv.org/abs/2512.03882",
        "pdf_url": "https://arxiv.org/pdf/2512.03882",
        "title": "Automatic Attack Discovery for Few-Shot Class-Incremental Learning via Large Language Models",
        "authors": [
            "Haidong Kang",
            "Wei Wu",
            "Hanling Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Few-shot class incremental learning (FSCIL) is a more realistic and challenging paradigm in continual learning to incrementally learn unseen classes and overcome catastrophic forgetting on base classes with only a few training examples. Previous efforts have primarily centered around studying more effective FSCIL approaches. By contrast, less attention was devoted to thinking the security issues in contributing to FSCIL. This paper aims to provide a holistic study of the impact of attacks on FSCIL. We first derive insights by systematically exploring how human expert-designed attack methods (i.e., PGD, FGSM) affect FSCIL. We find that those methods either fail to attack base classes, or suffer from huge labor costs due to relying on huge expert knowledge. This highlights the need to craft a specialized attack method for FSCIL. Grounded in these insights, in this paper, we propose a simple yet effective ACraft method to automatically steer and discover optimal attack methods targeted at FSCIL by leveraging Large Language Models (LLMs) without human experts. Moreover, to improve the reasoning between LLMs and FSCIL, we introduce a novel Proximal Policy Optimization (PPO) based reinforcement learning to optimize learning, making LLMs generate better attack methods in the next generation by establishing positive feedback. Experiments on mainstream benchmarks show that our ACraft significantly degrades the performance of state-of-the-art FSCIL methods and dramatically beyond human expert-designed attack methods while maintaining the lowest costs of attack.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03899",
        "abs_url": "https://arxiv.org/abs/2512.03899",
        "pdf_url": "https://arxiv.org/pdf/2512.03899",
        "title": "Probabilistic Foundations of Fuzzy Simplicial Sets for Nonlinear Dimensionality Reduction",
        "authors": [
            "Janis Keck",
            "Lukas Silvester Barth",
            "Fatemeh",
            "Fahimi",
            "Parvaneh Joharinad",
            "Jürgen Jost"
        ],
        "comments": "47 pages (including appendix), 11 figures",
        "subjects": "Machine Learning (cs.LG); Algebraic Topology (math.AT); Machine Learning (stat.ML)",
        "abstract": "Fuzzy simplicial sets have become an object of interest in dimensionality reduction and manifold learning, most prominently through their role in UMAP. However, their definition through tools from algebraic topology without a clear probabilistic interpretation detaches them from commonly used theoretical frameworks in those areas. In this work we introduce a framework that explains fuzzy simplicial sets as marginals of probability measures on simplicial sets. In particular, this perspective shows that the fuzzy weights of UMAP arise from a generative model that samples Vietoris-Rips filtrations at random scales, yielding cumulative distribution functions of pairwise distances. More generally, the framework connects fuzzy simplicial sets to probabilistic models on the face poset, clarifies the relation between Kullback-Leibler divergence and fuzzy cross-entropy in this setting, and recovers standard t-norms and t-conorms via Boolean operations on the underlying simplicial sets. We then show how new embedding methods may be derived from this framework and illustrate this on an example where we generalize UMAP using Čech filtrations with triplet sampling. In summary, this probabilistic viewpoint provides a unified probabilistic theoretical foundation for fuzzy simplicial sets, clarifies the role of UMAP within this framework, and enables the systematic derivation of new dimensionality reduction methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03923",
        "abs_url": "https://arxiv.org/abs/2512.03923",
        "pdf_url": "https://arxiv.org/pdf/2512.03923",
        "title": "Quantum-Classical Physics-Informed Neural Networks for Solving Reservoir Seepage Equations",
        "authors": [
            "Xiang Rao",
            "Yina Liu",
            "Yuxuan Shen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA); Computational Physics (physics.comp-ph)",
        "abstract": "Solving partial differential equations (PDEs) for reservoir seepage is critical for optimizing oil and gas field development and predicting production performance. Traditional numerical methods suffer from mesh-dependent errors and high computational costs, while classical Physics-Informed Neural Networks (PINNs) face bottlenecks in parameter efficiency, high-dimensional expression, and strong nonlinear fitting. To address these limitations, we propose a Discrete Variable (DV)-Circuit Quantum-Classical Physics-Informed Neural Network (QCPINN) and apply it to three typical reservoir seepage models for the first time: the pressure diffusion equation for heterogeneous single-phase flow, the nonlinear Buckley-Leverett (BL) equation for two-phase waterflooding, and the convection-diffusion equation for compositional flow considering adsorption. The QCPINN integrates classical preprocessing/postprocessing networks with a DV quantum core, leveraging quantum superposition and entanglement to enhance high-dimensional feature mapping while embedding physical constraints to ensure solution consistency. We test three quantum circuit topologies (Cascade, Cross-mesh, Alternate) and demonstrate through numerical experiments that QCPINNs achieve high prediction accuracy with fewer parameters than classical PINNs. Specifically, the Alternate topology outperforms others in heterogeneous single-phase flow and two-phase BL equation simulations, while the Cascade topology excels in compositional flow with convection-dispersion-adsorption coupling. Our work verifies the feasibility of QCPINN for reservoir engineering applications, bridging the gap between quantum computing research and industrial practice in oil and gas engineering.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03928",
        "abs_url": "https://arxiv.org/abs/2512.03928",
        "pdf_url": "https://arxiv.org/pdf/2512.03928",
        "title": "Density-Informed VAE (DiVAE): Reliable Log-Prior Probability via Density Alignment Regularization",
        "authors": [
            "Michele Alessi",
            "Alessio Ansuini",
            "Alex Rodriguez"
        ],
        "comments": "PriGM Workshop EurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce Density-Informed VAE (DiVAE), a lightweight, data-driven regularizer that aligns the VAE log-prior probability $\\log p_Z(z)$ with a log-density estimated from data. Standard VAEs match latents to a simple prior, overlooking density structure in the data-space. DiVAE encourages the encoder to allocate posterior mass in proportion to data-space density and, when the prior is learnable, nudges the prior toward high-density regions. This is realized by adding a robust, precision-weighted penalty to the ELBO, incurring negligible computational overhead. On synthetic datasets, DiVAE (i) improves distributional alignment of latent log-densities to its ground truth counterpart, (ii) improves prior coverage, and (iii) yields better OOD uncertainty calibration. On MNIST, DiVAE improves alignment of the prior with external estimates of the density, providing better interpretability, and improves OOD detection for learnable priors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03967",
        "abs_url": "https://arxiv.org/abs/2512.03967",
        "pdf_url": "https://arxiv.org/pdf/2512.03967",
        "title": "Technical Report on Text Dataset Distillation",
        "authors": [
            "Keith Ando Ogawa",
            "Bruno Lopes Yamamoto",
            "Lucas Lauton de Alcantara",
            "Victor Zacarias",
            "Edson Bollis",
            "Lucas Pellicer",
            "Rosimeire Pereira Costa",
            "Anna Helena Reali Costa",
            "Artur Jordao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In the vision domain, dataset distillation arises as a technique to condense a large dataset into a smaller synthetic one that exhibits a similar result in the training process. While image data presents an extensive literature of distillation methods, text dataset distillation has fewer works in comparison. Text dataset distillation initially grew as an adaptation of efforts from the vision universe, as the particularities of the modality became clear obstacles, it rose into a separate branch of research. Several milestones mark the development of this area, such as the introduction of methods that use transformer models, the generation of discrete synthetic text, and the scaling to decoder-only models with over 1B parameters. Despite major advances in modern approaches, the field remains in a maturing phase, with room for improvement on benchmarking standardization, approaches to overcome the discrete nature of text, handling complex tasks, and providing explicit examples of real-world applications. In this report, we review past and recent advances in dataset distillation for text, highlighting different distillation strategies, key contributions, and general challenges.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03994",
        "abs_url": "https://arxiv.org/abs/2512.03994",
        "pdf_url": "https://arxiv.org/pdf/2512.03994",
        "title": "Training-Free Policy Violation Detection via Activation-Space Whitening in LLMs",
        "authors": [
            "Oren Rachmil",
            "Roy Betser",
            "Itay Gershon",
            "Omer Hofman",
            "Nitay Yakoby",
            "Yuval Meron",
            "Idan Yankelev",
            "Asaf Shabtai",
            "Yuval Elovici",
            "Roman Vainshtein"
        ],
        "comments": "Accepted to the AAAI 2026 Deployable AI (DAI) Workshop",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Aligning proprietary large language models (LLMs) with internal organizational policies has become an urgent priority as organizations increasingly deploy LLMs in sensitive domains such as legal support, finance, and medical services. Beyond generic safety filters, enterprises require reliable mechanisms to detect policy violations within their regulatory and operational frameworks, where breaches can trigger legal and reputational risks. Existing content moderation frameworks, such as guardrails, remain largely confined to the safety domain and lack the robustness to capture nuanced organizational policies. LLM-as-a-judge and fine-tuning approaches, though flexible, introduce significant latency and lack interpretability. To address these limitations, we propose a training-free and efficient method that treats policy violation detection as an out-of-distribution (OOD) detection problem. Inspired by whitening techniques, we apply a linear transformation to decorrelate the model's hidden activations and standardize them to zero mean and unit variance, yielding near-identity covariance matrix. In this transformed space, we use the Euclidean norm as a compliance score to detect policy violations. The method requires only the policy text and a small number of illustrative samples, which makes it light-weight and easily deployable. On a challenging policy benchmark, our approach achieves state-of-the-art results, surpassing both existing guardrails and fine-tuned reasoning models. This work provides organizations with a practical and statistically grounded framework for policy-aware oversight of LLMs, advancing the broader goal of deployable AI governance. Code is available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.04004",
        "abs_url": "https://arxiv.org/abs/2512.04004",
        "pdf_url": "https://arxiv.org/pdf/2512.04004",
        "title": "Physics-Embedded Gaussian Process for Traffic State Estimation",
        "authors": [
            "Yanlin Chen",
            "Kehua Chen",
            "Yinhai Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Traffic state estimation (TSE) becomes challenging when probe-vehicle penetration is low and observations are spatially sparse. Pure data-driven methods lack physical explanations and have poor generalization when observed data is sparse. In contrast, physical models have difficulty integrating uncertainties and capturing the real complexity of traffic. To bridge this gap, recent studies have explored combining them by embedding physical structure into Gaussian process. These approaches typically introduce the governing equations as soft constraints through pseudo-observations, enabling the integration of model structure within a variational framework. However, these methods rely heavily on penalty tuning and lack principled uncertainty calibration, which makes them sensitive to model mis-specification. In this work, we address these limitations by presenting a novel Physics-Embedded Gaussian Process (PEGP), designed to integrate domain knowledge with data-driven methods in traffic state estimation. Specifically, we design two multi-output kernels informed by classic traffic flow models, constructed via the explicit application of the linearized differential operator. Experiments on HighD, NGSIM show consistent improvements over non-physics baselines. PEGP-ARZ proves more reliable under sparse observation, while PEGP-LWR achieves lower errors with denser observation. Ablation study further reveals that PEGP-ARZ residuals align closely with physics and yield calibrated, interpretable uncertainty, whereas PEGP-LWR residuals are more orthogonal and produce nearly constant variance fields. This PEGP framework combines physical priors, uncertainty quantification, which can provide reliable support for TSE.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.04006",
        "abs_url": "https://arxiv.org/abs/2512.04006",
        "pdf_url": "https://arxiv.org/pdf/2512.04006",
        "title": "Diagonalizing the Softmax: Hadamard Initialization for Tractable Cross-Entropy Dynamics",
        "authors": [
            "Connall Garrod",
            "Jonathan P. Keating",
            "Christos Thrampoulidis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "Cross-entropy (CE) training loss dominates deep learning practice, yet existing theory often relies on simplifications, either replacing it with squared loss or restricting to convex models, that miss essential behavior. CE and squared loss generate fundamentally different dynamics, and convex linear models cannot capture the complexities of non-convex optimization. We provide an in-depth characterization of multi-class CE optimization dynamics beyond the convex regime by analyzing a canonical two-layer linear neural network with standard-basis vectors as inputs: the simplest non-convex extension for which the implicit bias remained unknown. This model coincides with the unconstrained features model used to study neural collapse, making our work the first to prove that gradient flow on CE converges to the neural collapse geometry. We construct an explicit Lyapunov function that establishes global convergence, despite the presence of spurious critical points in the non-convex landscape. A key insight underlying our analysis is an inconspicuous finding: Hadamard Initialization diagonalizes the softmax operator, freezing the singular vectors of the weight matrices and reducing the dynamics entirely to their singular values. This technique opens a pathway for analyzing CE training dynamics well beyond our specific setting considered here.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.04008",
        "abs_url": "https://arxiv.org/abs/2512.04008",
        "pdf_url": "https://arxiv.org/pdf/2512.04008",
        "title": "Efficient Public Verification of Private ML via Regularization",
        "authors": [
            "Zoë Ruha Bell",
            "Anvith Thudi",
            "Olive Franzese-McLaughlin",
            "Nicolas Papernot",
            "Shafi Goldwasser"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Training with differential privacy (DP) provides a guarantee to members in a dataset that they cannot be identified by users of the released model. However, those data providers, and, in general, the public, lack methods to efficiently verify that models trained on their data satisfy DP guarantees. The amount of compute needed to verify DP guarantees for current algorithms scales with the amount of compute required to train the model. In this paper we design the first DP algorithm with near optimal privacy-utility trade-offs but whose DP guarantees can be verified cheaper than training. We focus on DP stochastic convex optimization (DP-SCO), where optimal privacy-utility trade-offs are known. Here we show we can obtain tight privacy-utility trade-offs by privately minimizing a series of regularized objectives and only using the standard DP composition bound. Crucially, this method can be verified with much less compute than training. This leads to the first known DP-SCO algorithm with near optimal privacy-utility whose DP verification scales better than training cost, significantly reducing verification costs on large datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.04034",
        "abs_url": "https://arxiv.org/abs/2512.04034",
        "pdf_url": "https://arxiv.org/pdf/2512.04034",
        "title": "Domain Feature Collapse: Implications for Out-of-Distribution Detection and Solutions",
        "authors": [
            "Hong Yang",
            "Devroop Kar",
            "Qi Yu",
            "Alex Ororbia",
            "Travis Desell"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Why do state-of-the-art OOD detection methods exhibit catastrophic failure when models are trained on single-domain datasets? We provide the first theoretical explanation for this phenomenon through the lens of information theory. We prove that supervised learning on single-domain data inevitably produces domain feature collapse -- representations where I(x_d; z) = 0, meaning domain-specific information is completely discarded. This is a fundamental consequence of information bottleneck optimization: models trained on single domains (e.g., medical images) learn to rely solely on class-specific features while discarding domain features, leading to catastrophic failure when detecting out-of-domain samples (e.g., achieving only 53% FPR@95 on MNIST). We extend our analysis using Fano's inequality to quantify partial collapse in practical scenarios. To validate our theory, we introduce Domain Bench, a benchmark of single-domain datasets, and demonstrate that preserving I(x_d; z) > 0 through domain filtering (using pretrained representations) resolves the failure mode. While domain filtering itself is conceptually straightforward, its effectiveness provides strong empirical evidence for our information-theoretic framework. Our work explains a puzzling empirical phenomenon, reveals fundamental limitations of supervised learning in narrow domains, and has broader implications for transfer learning and when to fine-tune versus freeze pretrained models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.04051",
        "abs_url": "https://arxiv.org/abs/2512.04051",
        "pdf_url": "https://arxiv.org/pdf/2512.04051",
        "title": "Convergence for Discrete Parameter Updates",
        "authors": [
            "Paul Wilson",
            "Fabio Zanasi",
            "George Constantinides"
        ],
        "comments": "opt-ml 2025 workshop at NeurIPS",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Modern deep learning models require immense computational resources, motivating research into low-precision training. Quantised training addresses this by representing training components in low-bit integers, but typically relies on discretising real-valued updates. We introduce an alternative approach where the update rule itself is discrete, avoiding the quantisation of continuous updates by design. We establish convergence guarantees for a general class of such discrete schemes, and present a multinomial update rule as a concrete example, supported by empirical evaluation. This perspective opens new avenues for efficient training, particularly for models with inherently discrete structure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.04062",
        "abs_url": "https://arxiv.org/abs/2512.04062",
        "pdf_url": "https://arxiv.org/pdf/2512.04062",
        "title": "Eval Factsheets: A Structured Framework for Documenting AI Evaluations",
        "authors": [
            "Florian Bordes",
            "Candace Ross",
            "Justine T Kao",
            "Evangelia Spiliopoulou",
            "Adina Williams"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The rapid proliferation of benchmarks has created significant challenges in reproducibility, transparency, and informed decision-making. However, unlike datasets and models -- which benefit from structured documentation frameworks like Datasheets and Model Cards -- evaluation methodologies lack systematic documentation standards. We introduce Eval Factsheets, a structured, descriptive framework for documenting AI system evaluations through a comprehensive taxonomy and questionnaire-based approach. Our framework organizes evaluation characteristics across five fundamental dimensions: Context (Who made the evaluation and when?), Scope (What does it evaluate?), Structure (With what the evaluation is built?), Method (How does it work?) and Alignment (In what ways is it reliable/valid/robust?). We implement this taxonomy as a practical questionnaire spanning five sections with mandatory and recommended documentation elements. Through case studies on multiple benchmarks, we demonstrate that Eval Factsheets effectively captures diverse evaluation paradigms -- from traditional benchmarks to LLM-as-judge methodologies -- while maintaining consistency and comparability. We hope Eval Factsheets are incorporated into both existing and newly released evaluation frameworks and lead to more transparency and reproducibility.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.04068",
        "abs_url": "https://arxiv.org/abs/2512.04068",
        "pdf_url": "https://arxiv.org/pdf/2512.04068",
        "title": "Learning Steerable Clarification Policies with Collaborative Self-play",
        "authors": [
            "Jonathan Berant",
            "Maximillian Chen",
            "Adam Fisch",
            "Reza Aghajani",
            "Fantine Huot",
            "Mirella Lapata",
            "Jacob Eisenstein"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "To handle underspecified or ambiguous queries, AI assistants need a policy for managing their uncertainty to determine (a) when to guess the user intent and answer directly, (b) when to enumerate and answer multiple possible intents, and (c) when to ask a clarifying question. However, such policies are contextually dependent on factors such as user preferences or modality. For example, enumerating multiple possible user intentions is cumbersome on small screens or in a voice setting. In this work, we propose to train steerable policies for managing this uncertainty using self-play. Given two agents, one simulating a user and the other an AI assistant, we generate conversations where the user issues a potentially ambiguous query, and the assistant needs to determine how to respond. Importantly, the model takes as input the numerical cost of each clarification question, and each generated word, and is asked to take the action that will maximize its final reward, which is the cost-penalized accuracy. We use Reinforced Self-Training (ReST) to train our model to achieve high reward and show this leads to a steerable policy that changes its behavior predictably conditioned on the provided costs, leading to higher reward and accuracy. Moreover, our procedure also generalizes to numerical cost values that were unobserved at training time.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2501.14510",
        "abs_url": "https://arxiv.org/abs/2501.14510",
        "pdf_url": "https://arxiv.org/pdf/2501.14510",
        "title": "Deep-BrownConrady: Prediction of Camera Calibration and Distortion Parameters Using Deep Learning and Synthetic Data",
        "authors": [
            "Faiz Muhammad Chaudhry",
            "Jarno Ralli",
            "Jerome Leudet",
            "Fahad Sohrab",
            "Farhad Pakdaman",
            "Pierre Corbani",
            "Moncef Gabbouj"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Graphics (cs.GR); Machine Learning (cs.LG)",
        "abstract": "This research addresses the challenge of camera calibration and distortion parameter prediction from a single image using deep learning models. The main contributions of this work are: (1) demonstrating that a deep learning model, trained on a mix of real and synthetic images, can accurately predict camera and lens parameters from a single image, and (2) developing a comprehensive synthetic dataset using the AILiveSim simulation platform. This dataset includes variations in focal length and lens distortion parameters, providing a robust foundation for model training and testing. The training process predominantly relied on these synthetic images, complemented by a small subset of real images, to explore how well models trained on synthetic data can perform calibration tasks on real-world images. Traditional calibration methods require multiple images of a calibration object from various orientations, which is often not feasible due to the lack of such images in publicly available datasets. A deep learning network based on the ResNet architecture was trained on this synthetic dataset to predict camera calibration parameters following the Brown-Conrady lens model. The ResNet architecture, adapted for regression tasks, is capable of predicting continuous values essential for accurate camera calibration in applications such as autonomous driving, robotics, and augmented reality. Keywords: Camera calibration, distortion, synthetic data, deep learning, residual networks (ResNet), AILiveSim, horizontal field-of-view, principal point, Brown-Conrady Model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2506.23888",
        "abs_url": "https://arxiv.org/abs/2506.23888",
        "pdf_url": "https://arxiv.org/pdf/2506.23888",
        "title": "Advancing Multi-Step Mathematical Reasoning in Large Language Models through Multi-Layered Self-Reflection with Auto-Prompting",
        "authors": [
            "André de Souza Loureiro",
            "Jorge Valverde-Rebaza",
            "Julieta Noguez",
            "David Escarcega",
            "Ricardo Marcacini"
        ],
        "comments": "Accepted for publication in: European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases (ECML PKDD 2025). Research Track",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Recent advancements in Large Language Models (LLMs) have significantly improved their problem-solving capabilities. However, these models still struggle when faced with complex multi-step reasoning tasks. In this paper, we propose the Multi-Layered Self-Reflection with Auto-Prompting (MAPS) framework, a novel approach designed to enhance multi-step mathematical reasoning in LLMs by integrating techniques such as Chain of Thought (CoT), Self-Reflection, and Auto-Prompting. Unlike traditional static prompting methods, MAPS employs an iterative refinement process. Initially, the model generates a solution using CoT prompting. When errors are detected, an adaptive self-reflection mechanism identifies and analyzes them, generating tailored prompts to guide corrections. These dynamically adjusted prompts enable the model to iteratively refine its reasoning. Experiments on four well-established benchmarks across multiple LLMs show that MAPS significantly outperforms standard CoT and achieves competitive results with reasoning-optimized models. In addition, MAPS enables general-purpose LLMs to reach performance levels comparable to specialized reasoning models. While deeper reflection layers improve accuracy, they also increase token usage and costs. To balance this trade-off, MAPS strategically limits reflection depth, ensuring an optimal balance between cost and reasoning performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03048",
        "abs_url": "https://arxiv.org/abs/2512.03048",
        "pdf_url": "https://arxiv.org/pdf/2512.03048",
        "title": "Exploring Syntropic Frameworks in AI Alignment: A Philosophical Investigation",
        "authors": [
            "Austin Spizzirri"
        ],
        "comments": "Approx. 3,000 words, 10 pages. Philosophical analysis of AI alignment (process-based / syntropy framework)",
        "subjects": "Artificial Intelligence (cs.AI); Computers and Society (cs.CY); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "I argue that AI alignment should be reconceived as architecting syntropic, reasons-responsive agents through process-based, multi-agent, developmental mechanisms rather than encoding fixed human value content. The paper makes three philosophical contributions. First, I articulate the ``specification trap'' argument demonstrating why content-based value specification appears structurally unstable due to the conjunction of the is-ought gap, value pluralism, and the extended frame problem. Second, I propose syntropy -- the recursive reduction of mutual uncertainty between agents through state alignment -- as an information-theoretic framework for understanding multi-agent alignment dynamics. Third, I establish a functional distinction between genuine and simulated moral capacity grounded in compatibilist theories of guidance control, coupled with an embodied experimental paradigm and verification regime providing operational criteria independent of phenomenological claims. This paper represents the philosophical component of a broader research program whose empirical validation is being developed in a separate project currently in preparation. While the framework generates specific, falsifiable predictions about value emergence and moral agency in artificial systems, empirical validation remains pending.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03079",
        "abs_url": "https://arxiv.org/abs/2512.03079",
        "pdf_url": "https://arxiv.org/pdf/2512.03079",
        "title": "Watermarks for Embeddings-as-a-Service Large Language Models",
        "authors": [
            "Anudeex Shetty"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) have demonstrated exceptional capabilities in natural language understanding and generation. Based on these LLMs, businesses have started to provide Embeddings-as-a-Service (EaaS), offering feature extraction capabilities (in the form of text embeddings) that benefit downstream natural language processing tasks. However, prior research has demonstrated that EaaS is vulnerable to imitation attacks, where an attacker clones the service's model in a black-box manner without access to the model's internal workings. In response, watermarks have been added to the text embeddings to protect the intellectual property of EaaS providers by allowing them to check for model ownership. This thesis focuses on defending against imitation attacks by investigating EaaS watermarks. To achieve this goal, we unveil novel attacks and propose and validate new watermarking techniques. Firstly, we show that existing EaaS watermarks can be removed through paraphrasing the input text when attackers clone the model during imitation attacks. Our study illustrates that paraphrasing can effectively bypass current state-of-the-art EaaS watermarks across various attack setups (including different paraphrasing techniques and models) and datasets in most instances. This demonstrates a new vulnerability in recent EaaS watermarking techniques. Subsequently, as a countermeasure, we propose a novel watermarking technique, WET (Watermarking EaaS with Linear Transformation), which employs linear transformation of the embeddings. Watermark verification is conducted by applying a reverse transformation and comparing the similarity between recovered and original embeddings. We demonstrate its robustness against paraphrasing attacks with near-perfect verifiability. We conduct detailed ablation studies to assess the significance of each component and hyperparameter in WET.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03081",
        "abs_url": "https://arxiv.org/abs/2512.03081",
        "pdf_url": "https://arxiv.org/pdf/2512.03081",
        "title": "Calibrating Geophysical Predictions under Constrained Probabilistic Distributions",
        "authors": [
            "Zhewen Hou",
            "Jiajin Sun",
            "Subashree Venkatasubramanian",
            "Peter Jin",
            "Shuolin Li",
            "Tian Zheng"
        ],
        "comments": "",
        "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Machine learning (ML) has shown significant promise in studying complex geophysical dynamical systems, including turbulence and climate processes. Such systems often display sensitive dependence on initial conditions, reflected in positive Lyapunov exponents, where even small perturbations in short-term forecasts can lead to large deviations in long-term outcomes. Thus, meaningful inference requires not only accurate short-term predictions, but also consistency with the system's long-term attractor that is captured by the marginal distribution of state variables. Existing approaches attempt to address this challenge by incorporating spatial and temporal dependence, but these strategies become impractical when data are extremely sparse. In this work, we show that prior knowledge of marginal distributions offers valuable complementary information to short-term observations, motivating a distribution-informed learning framework. We introduce a calibration algorithm based on normalization and the Kernelized Stein Discrepancy (KSD) to enhance ML predictions. The method here employs KSD within a reproducing kernel Hilbert space to calibrate model outputs, improving their fidelity to known physical distributions. This not only sharpens pointwise predictions but also enforces consistency with non-local statistical structures rooted in physical principles. Through synthetic experiments-spanning offline climatological CO2 fluxes and online quasi-geostrophic flow simulations-we demonstrate the robustness and broad utility of the proposed framework.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03094",
        "abs_url": "https://arxiv.org/abs/2512.03094",
        "pdf_url": "https://arxiv.org/pdf/2512.03094",
        "title": "Performance Analysis of Quantum Support Vector Classifiers and Quantum Neural Networks",
        "authors": [
            "Tomás Villalba-Ferreiro",
            "Eduardo Mosqueira-Rey",
            "Diego Alvarez-Estevez"
        ],
        "comments": "7 pages, 7 figures, conference",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "This study explores the performance of Quantum Support Vector Classifiers (QSVCs) and Quantum Neural Networks (QNNs) in comparison to classical models for machine learning tasks. By evaluating these models on the Iris and MNIST-PCA datasets, we find that quantum models tend to outperform classical approaches as the problem complexity increases. While QSVCs generally provide more consistent results, QNNs exhibit superior performance in higher-complexity tasks due to their increased quantum load. Additionally, we analyze the impact of hyperparameter tuning, showing that feature maps and ansatz configurations significantly influence model accuracy. We also compare the PennyLane and Qiskit frameworks, concluding that Qiskit provides better optimization and efficiency for our implementation. These findings highlight the potential of Quantum Machine Learning (QML) for complex classification problems and provide insights into model selection and optimization strategies",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03097",
        "abs_url": "https://arxiv.org/abs/2512.03097",
        "pdf_url": "https://arxiv.org/pdf/2512.03097",
        "title": "Many-to-One Adversarial Consensus: Exposing Multi-Agent Collusion Risks in AI-Based Healthcare",
        "authors": [
            "Adeela Bashir",
            "Anh han",
            "Zia Ush Shamszaman"
        ],
        "comments": "7 pages Conference level paper",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "The integration of large language models (LLMs) into healthcare IoT systems promises faster decisions and improved medical support. LLMs are also deployed as multi-agent teams to assist AI doctors by debating, voting, or advising on decisions. However, when multiple assistant agents interact, coordinated adversaries can collude to create false consensus, pushing an AI doctor toward harmful prescriptions. We develop an experimental framework with scripted and unscripted doctor agents, adversarial assistants, and a verifier agent that checks decisions against clinical guidelines. Using 50 representative clinical questions, we find that collusion drives the Attack Success Rate (ASR) and Harmful Recommendation Rates (HRR) up to 100% in unprotected systems. In contrast, the verifier agent restores 100% accuracy by blocking adversarial consensus. This work provides the first systematic evidence of collusion risk in AI healthcare and demonstrates a practical, lightweight defence that ensures guideline fidelity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03098",
        "abs_url": "https://arxiv.org/abs/2512.03098",
        "pdf_url": "https://arxiv.org/pdf/2512.03098",
        "title": "An AI Implementation Science Study to Improve Trustworthy Data in a Large Healthcare System",
        "authors": [
            "Benoit L. Marteau",
            "Andrew Hornback",
            "Shaun Q. Tan",
            "Christian Lowson",
            "Jason Woloff",
            "May D. Wang"
        ],
        "comments": "Submitted and Accepted to the IEEE International Conference on Biomedical and Health Informatics (BHI) 2025",
        "subjects": "Quantitative Methods (q-bio.QM); Machine Learning (cs.LG)",
        "abstract": "The rapid growth of Artificial Intelligence (AI) in healthcare has sparked interest in Trustworthy AI and AI Implementation Science, both of which are essential for accelerating clinical adoption. However, strict regulations, gaps between research and clinical settings, and challenges in evaluating AI systems continue to hinder real-world implementation. This study presents an AI implementation case study within Shriners Childrens (SC), a large multisite pediatric system, showcasing the modernization of SCs Research Data Warehouse (RDW) to OMOP CDM v5.4 within a secure Microsoft Fabric environment. We introduce a Python-based data quality assessment tool compatible with SCs infrastructure, extending OHDsi's R/Java-based Data Quality Dashboard (DQD) and integrating Trustworthy AI principles using the METRIC framework. This extension enhances data quality evaluation by addressing informative missingness, redundancy, timeliness, and distributional consistency. We also compare systematic and case-specific AI implementation strategies for Craniofacial Microsomia (CFM) using the FHIR standard. Our contributions include a real-world evaluation of AI implementations, integration of Trustworthy AI principles into data quality assessment, and insights into hybrid implementation strategies that blend systematic infrastructure with use-case-driven approaches to advance AI in healthcare.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03113",
        "abs_url": "https://arxiv.org/abs/2512.03113",
        "pdf_url": "https://arxiv.org/pdf/2512.03113",
        "title": "A Discrete Neural Operator with Adaptive Sampling for Surrogate Modeling of Parametric Transient Darcy Flows in Porous Media",
        "authors": [
            "Zhenglong Chen",
            "Zhao Zhang",
            "Xia Yan",
            "Jiayu Zhai",
            "Piyang Liu",
            "Kai Zhang"
        ],
        "comments": "",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "This study proposes a new discrete neural operator for surrogate modeling of transient Darcy flow fields in heterogeneous porous media with random parameters. The new method integrates temporal encoding, operator learning and UNet to approximate the mapping between vector spaces of random parameter and spatiotemporal flow fields. The new discrete neural operator can achieve higher prediction accuracy than the SOTA attention-residual-UNet structure. Derived from the finite volume method, the transmissibility matrices rather than permeability is adopted as the inputs of surrogates to enhance the prediction accuracy further. To increase sampling efficiency, a generative latent space adaptive sampling method is developed employing the Gaussian mixture model for density estimation of generalization error. Validation is conducted on test cases of 2D/3D single- and two-phase Darcy flow field prediction. Results reveal consistent enhancement in prediction accuracy given limited training set.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03193",
        "abs_url": "https://arxiv.org/abs/2512.03193",
        "pdf_url": "https://arxiv.org/pdf/2512.03193",
        "title": "In Situ Quantum Analog Pulse Characterization via Structured Signal Processing",
        "authors": [
            "Yulong Dong",
            "Christopher Kang",
            "Murphy Yuezhen Niu"
        ],
        "comments": "48 pages, 10 figures",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "Analog quantum simulators can directly emulate time-dependent Hamiltonian dynamics, enabling the exploration of diverse physical phenomena such as phase transitions, quench dynamics, and non-equilibrium processes. Realizing accurate analog simulations requires high-fidelity time-dependent pulse control, yet existing calibration schemes are tailored to digital gate characterization and cannot be readily extended to learn continuous pulse trajectories. We present a characterization algorithm for in situ learning of pulse trajectories by extending the Quantum Signal Processing (QSP) framework to analyze time-dependent pulses. By combining QSP with a logical-level analog-digital mapping paradigm, our method reconstructs a smooth pulse directly from queries of the time-ordered propagator, without requiring mid-circuit measurements or additional evolution. Unlike conventional Trotterization-based methods, our approach avoids unscalable performance degradation arising from accumulated local truncation errors as the logical-level segmentation increases. Through rigorous theoretical analysis and extensive numerical simulations, we demonstrate that our method achieves high accuracy with strong efficiency and robustness against SPAM as well as depolarizing errors, providing a lightweight and optimal validation protocol for analog quantum simulators capable of detecting major hardware faults.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03194",
        "abs_url": "https://arxiv.org/abs/2512.03194",
        "pdf_url": "https://arxiv.org/pdf/2512.03194",
        "title": "GRAND: Guidance, Rebalancing, and Assignment for Networked Dispatch in Multi-Agent Path Finding",
        "authors": [
            "Johannes Gaber",
            "Meshal Alharbi",
            "Daniele Gammelli",
            "Gioele Zardini"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Large robot fleets are now common in warehouses and other logistics settings, where small control gains translate into large operational impacts. In this article, we address task scheduling for lifelong Multi-Agent Pickup-and-Delivery (MAPD) and propose a hybrid method that couples learning-based global guidance with lightweight optimization. A graph neural network policy trained via reinforcement learning outputs a desired distribution of free agents over an aggregated warehouse graph. This signal is converted into region-to-region rebalancing through a minimum-cost flow, and finalized by small, local assignment problems, preserving accuracy while keeping per-step latency within a 1 s compute budget. On congested warehouse benchmarks from the League of Robot Runners (LRR) with up to 500 agents, our approach improves throughput by up to 10% over the 2024 winning scheduler while maintaining real-time execution. The results indicate that coupling graph-structured learned guidance with tractable solvers reduces congestion and yields a practical, scalable blueprint for high-throughput scheduling in large fleets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03195",
        "abs_url": "https://arxiv.org/abs/2512.03195",
        "pdf_url": "https://arxiv.org/pdf/2512.03195",
        "title": "Enhancing Job Matching: Occupation, Skill and Qualification Linking with the ESCO and EQF taxonomies",
        "authors": [
            "Stylianos Saroglou",
            "Konstantinos Diamantaras",
            "Francesco Preta",
            "Marina Delianidi",
            "Apostolos Benisis",
            "Christian Johannes Meyer"
        ],
        "comments": "14 pages, 1 figure, Preprint",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "This study investigates the potential of language models to improve the classification of labor market information by linking job vacancy texts to two major European frameworks: the European Skills, Competences, Qualifications and Occupations (ESCO) taxonomy and the European Qualifications Framework (EQF). We examine and compare two prominent methodologies from the literature: Sentence Linking and Entity Linking. In support of ongoing research, we release an open-source tool, incorporating these two methodologies, designed to facilitate further work on labor classification and employment discourse. To move beyond surface-level skill extraction, we introduce two annotated datasets specifically aimed at evaluating how occupations and qualifications are represented within job vacancy texts. Additionally, we examine different ways to utilize generative large language models for this task. Our findings contribute to advancing the state of the art in job entity extraction and offer computational infrastructure for examining work, skills, and labor market narratives in a digitally mediated economy. Our code is made publicly available: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03208",
        "abs_url": "https://arxiv.org/abs/2512.03208",
        "pdf_url": "https://arxiv.org/pdf/2512.03208",
        "title": "Uncertainty Quantification for Large Language Model Reward Learning under Heterogeneous Human Feedback",
        "authors": [
            "Pangpang Liu",
            "Junwei Lu",
            "Will Wei Sun"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We study estimation and statistical inference for reward models used in aligning large language models (LLMs). A key component of LLM alignment is reinforcement learning from human feedback (RLHF), where humans compare pairs of model-generated answers and their preferences are used to train a reward model. However, human feedback is inherently heterogeneous, creating significant challenges for reliable reward learning. To address this, we adopt a heterogeneous preference framework that jointly models the latent reward of answers and human rationality. This leads to a challenging biconvex optimization problem, which we solve via an alternating gradient descent algorithm. We establish theoretical guarantees for the resulting estimator, including its convergence and asymptotic distribution. These results enable the construction of confidence intervals for reward estimates. Leveraging these uncertainty quantification results, we conduct valid statistical comparisons between rewards and incorporate uncertainty into the best-of-$N$ (BoN) policy framework. Extensive simulations demonstrate the effectiveness of our method, and applications to real LLM data highlight the practical value of accounting for uncertainty in reward modeling for LLM alignment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03225",
        "abs_url": "https://arxiv.org/abs/2512.03225",
        "pdf_url": "https://arxiv.org/pdf/2512.03225",
        "title": "Convergence of a class of gradient-free optimisation schemes when the objective function is noisy, irregular, or both",
        "authors": [
            "Christophe Andrieu",
            "Nicolas Chopin",
            "Ettore Fincato",
            "Mathieu Gerber"
        ],
        "comments": "",
        "subjects": "Computation (stat.CO); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We investigate the convergence properties of a class of iterative algorithms designed to minimize a potentially non-smooth and noisy objective function, which may be algebraically intractable and whose values may be obtained as the output of a black box. The algorithms considered can be cast under the umbrella of a generalised gradient descent recursion, where the gradient is that of a smooth approximation of the objective function. The framework we develop includes as special cases model-based and mollification methods, two classical approaches to zero-th order optimisation. The convergence results are obtained under very weak assumptions on the regularity of the objective function and involve a trade-off between the degree of smoothing and size of the steps taken in the parameter updates. As expected, additional assumptions are required in the stochastic case. We illustrate the relevance of these algorithms and our convergence results through a challenging classification example from machine learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03234",
        "abs_url": "https://arxiv.org/abs/2512.03234",
        "pdf_url": "https://arxiv.org/pdf/2512.03234",
        "title": "Iterative Tilting for Diffusion Fine-Tuning",
        "authors": [
            "Jean Pachebat",
            "Giovanni Conforti",
            "Alain Durmus",
            "Yazid Janati"
        ],
        "comments": "14 pages",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We introduce iterative tilting, a gradient-free method for fine-tuning diffusion models toward reward-tilted distributions. The method decomposes a large reward tilt $\\exp(\\lambda r)$ into $N$ sequential smaller tilts, each admitting a tractable score update via first-order Taylor expansion. This requires only forward evaluations of the reward function and avoids backpropagating through sampling chains. We validate on a two-dimensional Gaussian mixture with linear reward, where the exact tilted distribution is available in closed form.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03243",
        "abs_url": "https://arxiv.org/abs/2512.03243",
        "pdf_url": "https://arxiv.org/pdf/2512.03243",
        "title": "Novelty detection on path space",
        "authors": [
            "Ioannis Gasteratos",
            "Antoine Jacquier",
            "Maud Lemercier",
            "Terry Lyons",
            "Cristopher Salvi"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Probability (math.PR); Statistics Theory (math.ST)",
        "abstract": "We frame novelty detection on path space as a hypothesis testing problem with signature-based test statistics. Using transportation-cost inequalities of Gasteratos and Jacquier (2023), we obtain tail bounds for false positive rates that extend beyond Gaussian measures to laws of RDE solutions with smooth bounded vector fields, yielding estimates of quantiles and p-values. Exploiting the shuffle product, we derive exact formulae for smooth surrogates of conditional value-at-risk (CVaR) in terms of expected signatures, leading to new one-class SVM algorithms optimising smooth CVaR objectives. We then establish lower bounds on type-$\\mathrm{II}$ error for alternatives with finite first moment, giving general power bounds when the reference measure and the alternative are absolutely continuous with respect to each other. Finally, we evaluate numerically the type-$\\mathrm{I}$ error and statistical power of signature-based test statistic, using synthetic anomalous diffusion data and real-world molecular biology data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03257",
        "abs_url": "https://arxiv.org/abs/2512.03257",
        "pdf_url": "https://arxiv.org/pdf/2512.03257",
        "title": "PyroFocus: A Deep Learning Approach to Real-Time Wildfire Detection in Multispectral Remote Sensing Imagery",
        "authors": [
            "Mark Moussa",
            "Andre Williams",
            "Seth Roffe",
            "Douglas Morton"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Rapid and accurate wildfire detection is crucial for emergency response and environmental management. In airborne and spaceborne missions, real-time algorithms must distinguish between no fire, active fire, and post-fire conditions, and estimate fire intensity. Multispectral and hyperspectral thermal imagers provide rich spectral information, but high data dimensionality and limited onboard resources make real-time processing challenging. As wildfires increase in frequency and severity, the need for low-latency and computationally efficient onboard detection methods is critical. We present a systematic evaluation of multiple deep learning architectures, including custom Convolutional Neural Networks (CNNs) and Transformer-based models, for multi-class fire classification. We also introduce PyroFocus, a two-stage pipeline that performs fire classification followed by fire radiative power (FRP) regression or segmentation to reduce inference time and computational cost for onboard deployment. Using data from NASA's MODIS/ASTER Airborne Simulator (MASTER), which is similar to a next-generation fire detection sensor, we compare accuracy, inference latency, and resource efficiency. Experimental results show that the proposed two-stage pipeline achieves strong trade-offs between speed and accuracy, demonstrating significant potential for real-time edge deployment in future wildfire monitoring missions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03296",
        "abs_url": "https://arxiv.org/abs/2512.03296",
        "pdf_url": "https://arxiv.org/pdf/2512.03296",
        "title": "Associating Healthcare Teamwork with Patient Outcomes for Predictive Analysis",
        "authors": [
            "Hsiao-Ying Lu",
            "Kwan-Liu Ma"
        ],
        "comments": "",
        "subjects": "Social and Information Networks (cs.SI); Computers and Society (cs.CY); Machine Learning (cs.LG)",
        "abstract": "Cancer treatment outcomes are influenced not only by clinical and demographic factors but also by the collaboration of healthcare teams. However, prior work has largely overlooked the potential role of human collaboration in shaping patient survival. This paper presents an applied AI approach to uncovering the impact of healthcare professionals' (HCPs) collaboration-captured through electronic health record (EHR) systems-on cancer patient outcomes. We model EHR-mediated HCP interactions as networks and apply machine learning techniques to detect predictive signals of patient survival embedded in these collaborations. Our models are cross validated to ensure generalizability, and we explain the predictions by identifying key network traits associated with improved outcomes. Importantly, clinical experts and literature validate the relevance of the identified crucial collaboration traits, reinforcing their potential for real-world applications. This work contributes to a practical workflow for leveraging digital traces of collaboration and AI to assess and improve team-based healthcare. The approach is potentially transferable to other domains involving complex collaboration and offers actionable insights to support data-informed interventions in healthcare delivery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03310",
        "abs_url": "https://arxiv.org/abs/2512.03310",
        "pdf_url": "https://arxiv.org/pdf/2512.03310",
        "title": "Randomized Masked Finetuning: An Efficient Way to Mitigate Memorization of PIIs in LLMs",
        "authors": [
            "Kunj Joshi",
            "David A. Smith"
        ],
        "comments": "To be submitted for ICML 2026",
        "subjects": "Computation and Language (cs.CL); Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "The current literature on memorization in Natural Language Models, especially Large Language Models (LLMs), poses severe security and privacy risks, as models tend to memorize personally identifying information (PIIs) from training data. We introduce Randomized Masked Fine-Tuning (RMFT), a novel privacy-preserving fine-tuning technique that reduces PII memorization while minimizing performance impact. Using the Enron Email Dataset, we demonstrate that RMFT achieves an 80.81% reduction in Total Extraction Rate and 80.17% reduction in Seen Extraction Rate compared to baseline fine-tuning, outperforming deduplication methods while maintaining only a 5.73% increase in perplexity. We present MaxTER, a Pareto-optimal evaluation framework for assessing privacy-utility tradeoffs, and show the performance of RMFT vs Deduplication by Area Under The Response Curve (AURC) metric.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03312",
        "abs_url": "https://arxiv.org/abs/2512.03312",
        "pdf_url": "https://arxiv.org/pdf/2512.03312",
        "title": "Unlocking hidden biomolecular conformational landscapes in diffusion models at inference time",
        "authors": [
            "Daniel D. Richman",
            "Jessica Karaguesian",
            "Carl-Mikael Suomivuori",
            "Ron O. Dror"
        ],
        "comments": "Project page: this https URL",
        "subjects": "Biomolecules (q-bio.BM); Machine Learning (cs.LG)",
        "abstract": "The function of biomolecules such as proteins depends on their ability to interconvert between a wide range of structures or \"conformations.\" Researchers have endeavored for decades to develop computational methods to predict the distribution of conformations, which is far harder to determine experimentally than a static folded structure. We present ConforMix, an inference-time algorithm that enhances sampling of conformational distributions using a combination of classifier guidance, filtering, and free energy estimation. Our approach upgrades diffusion models -- whether trained for static structure prediction or conformational generation -- to enable more efficient discovery of conformational variability without requiring prior knowledge of major degrees of freedom. ConforMix is orthogonal to improvements in model pretraining and would benefit even a hypothetical model that perfectly reproduced the Boltzmann distribution. Remarkably, when applied to a diffusion model trained for static structure prediction, ConforMix captures structural changes including domain motion, cryptic pocket flexibility, and transporter cycling, while avoiding unphysical states. Case studies of biologically critical proteins demonstrate the scalability, accuracy, and utility of this method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03325",
        "abs_url": "https://arxiv.org/abs/2512.03325",
        "pdf_url": "https://arxiv.org/pdf/2512.03325",
        "title": "When does Gaussian equivalence fail and how to fix it: Non-universal behavior of random features with quadratic scaling",
        "authors": [
            "Garrett G. Wen",
            "Hong Hu",
            "Yue M. Lu",
            "Zhou Fan",
            "Theodor Misiakiewicz"
        ],
        "comments": "",
        "subjects": "Statistics Theory (math.ST); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "A major effort in modern high-dimensional statistics has been devoted to the analysis of linear predictors trained on nonlinear feature embeddings via empirical risk minimization (ERM). Gaussian equivalence theory (GET) has emerged as a powerful universality principle in this context: it states that the behavior of high-dimensional, complex features can be captured by Gaussian surrogates, which are more amenable to analysis. Despite its remarkable successes, numerical experiments show that this equivalence can fail even for simple embeddings -- such as polynomial maps -- under general scaling regimes. We investigate this breakdown in the setting of random feature (RF) models in the quadratic scaling regime, where both the number of features and the sample size grow quadratically with the data dimension. We show that when the target function depends on a low-dimensional projection of the data, such as generalized linear models, GET yields incorrect predictions. To capture the correct asymptotics, we introduce a Conditional Gaussian Equivalent (CGE) model, which can be viewed as appending a low-dimensional non-Gaussian component to an otherwise high-dimensional Gaussian model. This hybrid model retains the tractability of the Gaussian framework and accurately describes RF models in the quadratic scaling regime. We derive sharp asymptotics for the training and test errors in this setting, which continue to agree with numerical simulations even when GET fails. Our analysis combines general results on CLT for Wiener chaos expansions and a careful two-phase Lindeberg swapping argument. Beyond RF models and quadratic scaling, our work hints at a rich landscape of universality phenomena in high-dimensional ERM.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03339",
        "abs_url": "https://arxiv.org/abs/2512.03339",
        "pdf_url": "https://arxiv.org/pdf/2512.03339",
        "title": "ProtoEFNet: Dynamic Prototype Learning for Inherently Interpretable Ejection Fraction Estimation in Echocardiography",
        "authors": [
            "Yeganeh Ghamary",
            "Victoria Wu",
            "Hooman Vaseli",
            "Christina Luong",
            "Teresa Tsang",
            "Siavash Bigdeli",
            "Purang Abolmaesumi"
        ],
        "comments": "11 pages, Accepted in IMIMIC Workshop at MICCAI 2025",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Ejection fraction (EF) is a crucial metric for assessing cardiac function and diagnosing conditions such as heart failure. Traditionally, EF estimation requires manual tracing and domain expertise, making the process time-consuming and subject to interobserver variability. Most current deep learning methods for EF prediction are black-box models with limited transparency, which reduces clinical trust. Some post-hoc explainability methods have been proposed to interpret the decision-making process after the prediction is made. However, these explanations do not guide the model's internal reasoning and therefore offer limited reliability in clinical applications. To address this, we introduce ProtoEFNet, a novel video-based prototype learning model for continuous EF regression. The model learns dynamic spatiotemporal prototypes that capture clinically meaningful cardiac motion patterns. Additionally, the proposed Prototype Angular Separation (PAS) loss enforces discriminative representations across the continuous EF spectrum. Our experiments on the EchonetDynamic dataset show that ProtoEFNet can achieve accuracy on par with its non-interpretable counterpart while providing clinically relevant insight. The ablation study shows that the proposed loss boosts performance with a 2% increase in F1 score from 77.67$\\pm$2.68 to 79.64$\\pm$2.10. Our source code is available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03419",
        "abs_url": "https://arxiv.org/abs/2512.03419",
        "pdf_url": "https://arxiv.org/pdf/2512.03419",
        "title": "Comparative algorithm performance evaluation and prediction for the maximum clique problem using instance space analysis",
        "authors": [
            "Bharat Sharman",
            "Elkafi Hassini"
        ],
        "comments": "",
        "subjects": "Data Structures and Algorithms (cs.DS); Discrete Mathematics (cs.DM); Machine Learning (cs.LG)",
        "abstract": "The maximum clique problem, a well-known graph-based combinatorial optimization problem, has been addressed through various algorithmic approaches, though systematic analyses of the problem instances remain sparse. This study employs the instance space analysis (ISA) methodology to systematically analyze the instance space of this problem and assess & predict the performance of state-of-the-art (SOTA) algorithms, including exact, heuristic, and graph neural network (GNN)-based methods. A dataset was compiled using graph instances from TWITTER, COLLAB and IMDB-BINARY benchmarks commonly used in graph machine learning research. A set of 33 generic and 2 problem-specific polynomial-time-computable graph-based features, including several spectral properties, was employed for the ISA. A composite performance mea- sure incorporating both solution quality and algorithm runtime was utilized. The comparative analysis demonstrated that the exact algorithm Mixed Order Maximum Clique (MOMC) exhib- ited superior performance across approximately 74.7% of the instance space constituted by the compiled dataset. Gurobi & CliSAT accounted for superior performance in 13.8% and 11% of the instance space, respectively. The ISA-based algorithm performance prediction model run on 34 challenging test instances compiled from the BHOSLIB and DIMACS datasets yielded top-1 and top-2 best performing algorithm prediction accuracies of 88% and 97%, respectively.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03451",
        "abs_url": "https://arxiv.org/abs/2512.03451",
        "pdf_url": "https://arxiv.org/pdf/2512.03451",
        "title": "GalaxyDiT: Efficient Video Generation with Guidance Alignment and Adaptive Proxy in Diffusion Transformers",
        "authors": [
            "Zhiye Song",
            "Steve Dai",
            "Ben Keller",
            "Brucek Khailany"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Diffusion models have revolutionized video generation, becoming essential tools in creative content generation and physical simulation. Transformer-based architectures (DiTs) and classifier-free guidance (CFG) are two cornerstones of this success, enabling strong prompt adherence and realistic video quality. Despite their versatility and superior performance, these models require intensive computation. Each video generation requires dozens of iterative steps, and CFG doubles the required compute. This inefficiency hinders broader adoption in downstream applications. We introduce GalaxyDiT, a training-free method to accelerate video generation with guidance alignment and systematic proxy selection for reuse metrics. Through rank-order correlation analysis, our technique identifies the optimal proxy for each video model, across model families and parameter scales, thereby ensuring optimal computational reuse. We achieve $1.87\\times$ and $2.37\\times$ speedup on Wan2.1-1.3B and Wan2.1-14B with only 0.97% and 0.72% drops on the VBench-2.0 benchmark. At high speedup rates, our approach maintains superior fidelity to the base model, exceeding prior state-of-the-art approaches by 5 to 10 dB in peak signal-to-noise ratio (PSNR).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03458",
        "abs_url": "https://arxiv.org/abs/2512.03458",
        "pdf_url": "https://arxiv.org/pdf/2512.03458",
        "title": "A Convolutional Framework for Mapping Imagined Auditory MEG into Listened Brain Responses",
        "authors": [
            "Maryam Maghsoudi",
            "Mohsen Rezaeizadeh",
            "Shihab Shamma"
        ],
        "comments": "",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG); Sound (cs.SD); Audio and Speech Processing (eess.AS)",
        "abstract": "Decoding imagined speech engages complex neural processes that are difficult to interpret due to uncertainty in timing and the limited availability of imagined-response datasets. In this study, we present a Magnetoencephalography (MEG) dataset collected from trained musicians as they imagined and listened to musical and poetic stimuli. We show that both imagined and perceived brain responses contain consistent, condition-specific information. Using a sliding-window ridge regression model, we first mapped imagined responses to listened responses at the single-subject level, but found limited generalization across subjects. At the group level, we developed an encoder-decoder convolutional neural network with a subject-specific calibration layer that produced stable and generalizable mappings. The CNN consistently outperformed the null model, yielding significantly higher correlations between predicted and true listened responses for nearly all held-out subjects. Our findings demonstrate that imagined neural activity can be transformed into perception-like responses, providing a foundation for future brain-computer interface applications involving imagined speech and music.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03460",
        "abs_url": "https://arxiv.org/abs/2512.03460",
        "pdf_url": "https://arxiv.org/pdf/2512.03460",
        "title": "Learning From Limited Data and Feedback for Cell Culture Process Monitoring: A Comparative Study",
        "authors": [
            "Johnny Peng",
            "Thanh Tung Khuat",
            "Ellen Otte",
            "Katarzyna Musial",
            "Bogdan Gabrys"
        ],
        "comments": "This is a pre-print for submitting to computers & chemical engineering journal",
        "subjects": "Quantitative Methods (q-bio.QM); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG)",
        "abstract": "In cell culture bioprocessing, real-time batch process monitoring (BPM) refers to the continuous tracking and analysis of key process variables such as viable cell density, nutrient levels, metabolite concentrations, and product titer throughout the duration of a batch run. This enables early detection of deviations and supports timely control actions to ensure optimal cell growth and product quality. BPM plays a critical role in ensuring the quality and regulatory compliance of biopharmaceutical manufacturing processes. However, the development of accurate soft sensors for BPM is hindered by key challenges, including limited historical data, infrequent feedback, heterogeneous process conditions, and high-dimensional sensory inputs. This study presents a comprehensive benchmarking analysis of machine learning (ML) methods designed to address these challenges, with a focus on learning from historical data with limited volume and relevance in the context of bioprocess monitoring. We evaluate multiple ML approaches including feature dimensionality reduction, online learning, and just-in-time learning across three datasets, one in silico dataset and two real-world experimental datasets. Our findings highlight the importance of training strategies in handling limited data and feedback, with batch learning proving effective in homogeneous settings, while just-in-time learning and online learning demonstrate superior adaptability in cold-start scenarios. Additionally, we identify key meta-features, such as feed media composition and process control strategies, that significantly impact model transferability. The results also suggest that integrating Raman-based predictions with lagged offline measurements enhances monitoring accuracy, offering a promising direction for future bioprocess soft sensor development.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03462",
        "abs_url": "https://arxiv.org/abs/2512.03462",
        "pdf_url": "https://arxiv.org/pdf/2512.03462",
        "title": "A Hybrid Deep Learning and Anomaly Detection Framework for Real-Time Malicious URL Classification",
        "authors": [
            "Berkani Khaled",
            "Zeraoulia Rafik"
        ],
        "comments": "14 pages,2 figures",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Malicious URLs remain a primary vector for phishing, malware, and cyberthreats. This study proposes a hybrid deep learning framework combining \\texttt{HashingVectorizer} n-gram analysis, SMOTE balancing, Isolation Forest anomaly filtering, and a lightweight neural network classifier for real-time URL classification. The multi-stage pipeline processes URLs from open-source repositories with statistical features (length, dot count, entropy), achieving $O(NL + EBdh)$ training complexity and a 20\\,ms prediction latency. Empirical evaluation yields 96.4\\% accuracy, 95.4\\% F1-score, and 97.3\\% ROC-AUC, outperforming CNN (94.8\\%) and SVM baselines with a $50\\!\\times$--$100\\!\\times$ speedup (Table~\\ref{tab:comp-complexity}). A multilingual Tkinter GUI (Arabic/English/French) enables real-time threat assessment with clipboard integration. The framework demonstrates superior scalability and resilience against obfuscated URL patterns.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03494",
        "abs_url": "https://arxiv.org/abs/2512.03494",
        "pdf_url": "https://arxiv.org/pdf/2512.03494",
        "title": "A Preliminary Study on the Promises and Challenges of Native Top-$k$ Sparse Attention",
        "authors": [
            "Di Xiu",
            "Hongyin Tang",
            "Bolin Rong",
            "Lizhi Yan",
            "Jingang Wang",
            "Yifan Lu",
            "Xunliang Cai"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) are increasingly prevalent in the field of long-context modeling, however, their inference computational costs have become a critical bottleneck hindering the advancement of tasks such as agents and multimodal applications. This report conducts a preliminary investigation into the effectiveness and theoretical mechanisms of the Top-$k$ Attention mechanism during both the decoding and training phases. First, we validate the effectiveness of exact Top-$k$ Decoding through extensive experimentation. Experiments demonstrate that retaining only the pivotal Keys with the highest similarity to the Query as the context window during the decoding stage achieves performance comparable to, or even surpassing, full attention on downstream tasks such as HELMET and LongBench v2. Second, we further explore the native Top-$k$ Attention training strategy. Experiments confirm that ensuring the consistency between training and inference regarding Top-$k$ Attention operations facilitates the further unlocking of Top-$k$ Decoding's potential, thereby significantly enhancing model performance. Furthermore, considering the high computational complexity of exact Top-$k$ Attention, we investigate the impact of approximate Top-$k$ algorithm precision on downstream tasks. Our research confirms a positive correlation between downstream task performance and approximation fidelity, and we provide statistical evaluations of the Lightning Indexer's precision within the DeepSeek-V3.2-Exp model. Finally, this report provides a theoretical interpretation from the perspective of Entropy. Experimental observations indicate that models subjected to Top-$k$ Attention SFT exhibit a distinct phenomenon of entropy reduction in downstream tasks, which validates the hypothesis that low-entropy states are better adapted to Top-$k$ Decoding.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03521",
        "abs_url": "https://arxiv.org/abs/2512.03521",
        "pdf_url": "https://arxiv.org/pdf/2512.03521",
        "title": "Cross-Space Synergy: A Unified Framework for Multimodal Emotion Recognition in Conversation",
        "authors": [
            "Xiaosen Lyu",
            "Jiayu Xiong",
            "Yuren Chen",
            "Wanlong Wang",
            "Xiaoqing Dai",
            "Jing Wang"
        ],
        "comments": "Accepted to AAAI 2026",
        "subjects": "Multimedia (cs.MM); Machine Learning (cs.LG)",
        "abstract": "Multimodal Emotion Recognition in Conversation (MERC) aims to predict speakers' emotions by integrating textual, acoustic, and visual cues. Existing approaches either struggle to capture complex cross-modal interactions or experience gradient conflicts and unstable training when using deeper architectures. To address these issues, we propose Cross-Space Synergy (CSS), which couples a representation component with an optimization component. Synergistic Polynomial Fusion (SPF) serves the representation role, leveraging low-rank tensor factorization to efficiently capture high-order cross-modal interactions. Pareto Gradient Modulator (PGM) serves the optimization role, steering updates along Pareto-optimal directions across competing objectives to alleviate gradient conflicts and improve stability. Experiments show that CSS outperforms existing representative methods on IEMOCAP and MELD in both accuracy and training stability, demonstrating its effectiveness in complex multimodal scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03571",
        "abs_url": "https://arxiv.org/abs/2512.03571",
        "pdf_url": "https://arxiv.org/pdf/2512.03571",
        "title": "EnCompass: Enhancing Agent Programming with Search Over Program Execution Paths",
        "authors": [
            "Zhening Li",
            "Armando Solar-Lezama",
            "Yisong Yue",
            "Stephan Zheng"
        ],
        "comments": "65 pages, 2 figures, published in NeurIPS 2025",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Programming Languages (cs.PL)",
        "abstract": "We introduce a new approach to agent programming, the development of LLM-based agents. Current approaches to agent programming often entangle two aspects of agent design: the core workflow logic and the inference-time strategy (e.g., tree search). We introduce \"probabilistic angelic nondeterminism\" (\"PAN\"), a programming model that disentangles these two concerns, allowing the programmer to describe the agent workflow and independently experiment with different inference-time strategies by simply changing a few inputs. We provide an implementation of PAN in Python as the EnCompass framework, which uses a Python decorator to compile agent workflow programs into a search space. We present three case studies that demonstrate how the framework lets the programmer quickly improve the reliability of an agent and easily switch between different inference-time strategies, all with little additional coding.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03637",
        "abs_url": "https://arxiv.org/abs/2512.03637",
        "pdf_url": "https://arxiv.org/pdf/2512.03637",
        "title": "AaPE: Aliasing-aware Patch Embedding for Self-Supervised Audio Representation Learning",
        "authors": [
            "Kohei Yamamoto",
            "Kosuke Okusa"
        ],
        "comments": "11 pages, 4 figures",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Transformer-based audio SSL (self-supervised learning) models often treat spectrograms as images, applying convolutional patchification with heavy temporal downsampling. This lowers the effective Nyquist frequency and introduces aliasing, while naïve low-pass filtering removes task-relevant high-frequency cues. In this study, we present Aliasing-aware Patch Embedding (AaPE), a drop-in patch stem that mitigates aliasing while preserving high-frequency information. AaPE augments standard patch tokens with features produced by a band-limited complex sinusoidal kernel using a two-sided exponential window that dynamically targets alias-prone bands. Frequency and decay parameters of the kernel are estimated from the input, enabling parallel, adaptive subband analysis whose outputs are fused with the standard patch tokens. AaPE integrates seamlessly into the masked teacher-student self-supervised learning. In addition, we combine a multi-mask strategy with a contrastive objective to enforce consistency across diverse mask patterns, stabilizing training. Pre-training on AudioSet followed by fine-tuning evaluation across diverse downstream benchmarks, which spanned categories, such as environmental sounds and other common audio domains. This approach yields state-of-the-art performance on a subset of tasks and competitive results across the remainder. Complementary linear probing evaluation mirrors this pattern, yielding clear gains on several benchmarks and strong performance elsewhere. The collective analysis of these results indicates that AaPE serves to mitigate the effects of aliasing without discarding of informative high-frequency content.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03706",
        "abs_url": "https://arxiv.org/abs/2512.03706",
        "pdf_url": "https://arxiv.org/pdf/2512.03706",
        "title": "Consistent Projection of Langevin Dynamics: Preserving Thermodynamics and Kinetics in Coarse-Grained Models",
        "authors": [
            "Vahid Nateghi",
            "Lara Neureither",
            "Selma Moqvist",
            "Carsten Hartmann",
            "Simon Olsson",
            "Feliks Nüske"
        ],
        "comments": "",
        "subjects": "Computational Physics (physics.comp-ph); Machine Learning (cs.LG); Dynamical Systems (math.DS)",
        "abstract": "Coarse graining (CG) is an important task for efficient modeling and simulation of complex multi-scale systems, such as the conformational dynamics of biomolecules. This work presents a projection-based coarse-graining formalism for general underdamped Langevin dynamics. Following the Zwanzig projection approach, we derive a closed-form expression for the coarse grained dynamics. In addition, we show how the generator Extended Dynamic Mode Decomposition (gEDMD) method, which was developed in the context of Koopman operator methods, can be used to model the CG dynamics and evaluate its kinetic properties, such as transition timescales. Finally, we combine our approach with thermodynamic interpolation (TI), a generative approach to transform samples between thermodynamic conditions, to extend the scope of the approach across thermodynamic states without repeated numerical simulations. Using a two-dimensional model system, we demonstrate that the proposed method allows to accurately capture the thermodynamic and kinetic properties of the full-space model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03727",
        "abs_url": "https://arxiv.org/abs/2512.03727",
        "pdf_url": "https://arxiv.org/pdf/2512.03727",
        "title": "Colored Markov Random Fields for Probabilistic Topological Modeling",
        "authors": [
            "Lorenzo Marinucci",
            "Leonardo Di Nino",
            "Gabriele D'Acunto",
            "Mario Edoardo Pandolfo",
            "Paolo Di Lorenzo",
            "Sergio Barbarossa"
        ],
        "comments": "Proceeding of 2025 Asilomar Conference on Signals, Systems, and Computers",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Signal Processing (eess.SP); Methodology (stat.ME)",
        "abstract": "Probabilistic Graphical Models (PGMs) encode conditional dependencies among random variables using a graph -nodes for variables, links for dependencies- and factorize the joint distribution into lower-dimensional components. This makes PGMs well-suited for analyzing complex systems and supporting decision-making. Recent advances in topological signal processing highlight the importance of variables defined on topological spaces in several application domains. In such cases, the underlying topology shapes statistical relationships, limiting the expressiveness of canonical PGMs. To overcome this limitation, we introduce Colored Markov Random Fields (CMRFs), which model both conditional and marginal dependencies among Gaussian edge variables on topological spaces, with a theoretical foundation in Hodge theory. CMRFs extend classical Gaussian Markov Random Fields by including link coloring: connectivity encodes conditional independence, while color encodes marginal independence. We quantify the benefits of CMRFs through a distributed estimation case study over a physical network, comparing it with baselines with different levels of topological prior.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03729",
        "abs_url": "https://arxiv.org/abs/2512.03729",
        "pdf_url": "https://arxiv.org/pdf/2512.03729",
        "title": "Autonomous Planning In-space Assembly Reinforcement-learning free-flYer (APIARY) International Space Station Astrobee Testing",
        "authors": [
            "Samantha Chapin",
            "Kenneth Stewart",
            "Roxana Leontie",
            "Carl Glen Henshaw"
        ],
        "comments": "iSpaRo 2025, Best Paper Award in Orbital Robotics",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "The US Naval Research Laboratory's (NRL's) Autonomous Planning In-space Assembly Reinforcement-learning free-flYer (APIARY) experiment pioneers the use of reinforcement learning (RL) for control of free-flying robots in the zero-gravity (zero-G) environment of space. On Tuesday, May 27th 2025 the APIARY team conducted the first ever, to our knowledge, RL control of a free-flyer in space using the NASA Astrobee robot on-board the International Space Station (ISS). A robust 6-degrees of freedom (DOF) control policy was trained using an actor-critic Proximal Policy Optimization (PPO) network within the NVIDIA Isaac Lab simulation environment, randomizing over goal poses and mass distributions to enhance robustness. This paper details the simulation testing, ground testing, and flight validation of this experiment. This on-orbit demonstration validates the transformative potential of RL for improving robotic autonomy, enabling rapid development and deployment (in minutes to hours) of tailored behaviors for space exploration, logistics, and real-time mission needs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03736",
        "abs_url": "https://arxiv.org/abs/2512.03736",
        "pdf_url": "https://arxiv.org/pdf/2512.03736",
        "title": "Crossing the Sim2Real Gap Between Simulation and Ground Testing to Space Deployment of Autonomous Free-flyer Control",
        "authors": [
            "Kenneth Stewart",
            "Samantha Chapin",
            "Roxana Leontie",
            "Carl Glen Henshaw"
        ],
        "comments": "published at iSpaRo 2025",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Reinforcement learning (RL) offers transformative potential for robotic control in space. We present the first on-orbit demonstration of RL-based autonomous control of a free-flying robot, the NASA Astrobee, aboard the International Space Station (ISS). Using NVIDIA's Omniverse physics simulator and curriculum learning, we trained a deep neural network to replace Astrobee's standard attitude and translation control, enabling it to navigate in microgravity. Our results validate a novel training pipeline that bridges the simulation-to-reality (Sim2Real) gap, utilizing a GPU-accelerated, scientific-grade simulation environment for efficient Monte Carlo RL training. This successful deployment demonstrates the feasibility of training RL policies terrestrially and transferring them to space-based applications. This paves the way for future work in In-Space Servicing, Assembly, and Manufacturing (ISAM), enabling rapid on-orbit adaptation to dynamic mission requirements.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 113,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03743",
        "abs_url": "https://arxiv.org/abs/2512.03743",
        "pdf_url": "https://arxiv.org/pdf/2512.03743",
        "title": "Cross-embodied Co-design for Dexterous Hands",
        "authors": [
            "Kehlani Fay",
            "Darin Anthony Djapri",
            "Anya Zorin",
            "James Clinton",
            "Ali El Lahib",
            "Hao Su",
            "Michael T. Tolley",
            "Sha Yi",
            "Xiaolong Wang"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Dexterous manipulation is limited by both control and design, without consensus as to what makes manipulators best for performing dexterous tasks. This raises a fundamental challenge: how should we design and control robot manipulators that are optimized for dexterity? We present a co-design framework that learns task-specific hand morphology and complementary dexterous control policies. The framework supports 1) an expansive morphology search space including joint, finger, and palm generation, 2) scalable evaluation across the wide design space via morphology-conditioned cross-embodied control, and 3) real-world fabrication with accessible components. We evaluate the approach across multiple dexterous tasks, including in-hand rotation with simulation and real deployment. Our framework enables an end-to-end pipeline that can design, train, fabricate, and deploy a new robotic hand in under 24 hours. The full framework will be open-sourced and available on our website.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 114,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03771",
        "abs_url": "https://arxiv.org/abs/2512.03771",
        "pdf_url": "https://arxiv.org/pdf/2512.03771",
        "title": "In-Context Representation Hijacking",
        "authors": [
            "Itay Yona",
            "Amir Sarid",
            "Michael Karasik",
            "Yossi Gandelsman"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "We introduce \\textbf{Doublespeak}, a simple \\emph{in-context representation hijacking} attack against large language models (LLMs). The attack works by systematically replacing a harmful keyword (e.g., \\textit{bomb}) with a benign token (e.g., \\textit{carrot}) across multiple in-context examples, provided a prefix to a harmful request. We demonstrate that this substitution leads to the internal representation of the benign token converging toward that of the harmful one, effectively embedding the harmful semantics under a euphemism. As a result, superficially innocuous prompts (e.g., ``How to build a carrot?'') are internally interpreted as disallowed instructions (e.g., ``How to build a bomb?''), thereby bypassing the model's safety alignment. We use interpretability tools to show that this semantic overwrite emerges layer by layer, with benign meanings in early layers converging into harmful semantics in later ones. Doublespeak is optimization-free, broadly transferable across model families, and achieves strong success rates on closed-source and open-source systems, reaching 74\\% ASR on Llama-3.3-70B-Instruct with a single-sentence context override. Our findings highlight a new attack surface in the latent space of LLMs, revealing that current alignment strategies are insufficient and should instead operate at the representation level.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 115,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03817",
        "abs_url": "https://arxiv.org/abs/2512.03817",
        "pdf_url": "https://arxiv.org/pdf/2512.03817",
        "title": "HieroGlyphTranslator: Automatic Recognition and Translation of Egyptian Hieroglyphs to English",
        "authors": [
            "Ahmed Nasser",
            "Marwan Mohamed",
            "Alaa Sherif",
            "Basmala Mahmoud",
            "Shereen Yehia",
            "Asmaa Saad",
            "Mariam S. El-Rahmany",
            "Ensaf H. Mohamed"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Egyptian hieroglyphs, the ancient Egyptian writing system, are composed entirely of drawings. Translating these glyphs into English poses various challenges, including the fact that a single glyph can have multiple meanings. Deep learning translation applications are evolving rapidly, producing remarkable results that significantly impact our lives. In this research, we propose a method for the automatic recognition and translation of ancient Egyptian hieroglyphs from images to English. This study utilized two datasets for classification and translation: the Morris Franken dataset and the EgyptianTranslation dataset. Our approach is divided into three stages: segmentation (using Contour and Detectron2), mapping symbols to Gardiner codes, and translation (using the CNN model). The model achieved a BLEU score of 42.2, a significant result compared to previous research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 116,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03851",
        "abs_url": "https://arxiv.org/abs/2512.03851",
        "pdf_url": "https://arxiv.org/pdf/2512.03851",
        "title": "Comparison of neural network training strategies for the simulation of dynamical systems",
        "authors": [
            "Paul Strasser",
            "Andreas Pfeffer",
            "Jakob Weber",
            "Markus Gurtner",
            "Andreas Körner"
        ],
        "comments": "submitted to ECC",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Neural networks have become a widely adopted tool for modeling nonlinear dynamical systems from data. However, the choice of training strategy remains a key design decision, particularly for simulation tasks. This paper compares two predominant strategies: parallel and series-parallel training. The conducted empirical analysis spans five neural network architectures and two examples: a pneumatic valve test bench and an industrial robot benchmark. The study reveals that, even though series-parallel training dominates current practice, parallel training consistently yields better long-term prediction accuracy. Additionally, this work clarifies the often inconsistent terminology in the literature and relate both strategies to concepts from system identification. The findings suggest that parallel training should be considered the default training strategy for neural network-based simulation of dynamical systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 117,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03874",
        "abs_url": "https://arxiv.org/abs/2512.03874",
        "pdf_url": "https://arxiv.org/pdf/2512.03874",
        "title": "OmniDexVLG: Learning Dexterous Grasp Generation from Vision Language Model-Guided Grasp Semantics, Taxonomy and Functional Affordance",
        "authors": [
            "Lei Zhang",
            "Diwen Zheng",
            "Kaixin Bai",
            "Zhenshan Bing",
            "Zoltan-Csaba Marton",
            "Zhaopeng Chen",
            "Alois Christian Knoll",
            "Jianwei Zhang"
        ],
        "comments": "Project Website: this https URL, 16 pages",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Dexterous grasp generation aims to produce grasp poses that align with task requirements and human interpretable grasp semantics. However, achieving semantically controllable dexterous grasp synthesis remains highly challenging due to the lack of unified modeling of multiple semantic dimensions, including grasp taxonomy, contact semantics, and functional affordance. To address these limitations, we present OmniDexVLG, a multimodal, semantics aware grasp generation framework capable of producing structurally diverse and semantically coherent dexterous grasps under joint language and visual guidance. Our approach begins with OmniDexDataGen, a semantic rich dexterous grasp dataset generation pipeline that integrates grasp taxonomy guided configuration sampling, functional affordance contact point sampling, taxonomy aware differential force closure grasp sampling, and physics based optimization and validation, enabling systematic coverage of diverse grasp types. We further introduce OmniDexReasoner, a multimodal grasp type semantic reasoning module that leverages multi agent collaboration, retrieval augmented generation, and chain of thought reasoning to infer grasp related semantics and generate high quality annotations that align language instructions with task specific grasp intent. Building upon these components, we develop a unified Vision Language Grasping generation model that explicitly incorporates grasp taxonomy, contact structure, and functional affordance semantics, enabling fine grained control over grasp synthesis from natural language instructions. Extensive experiments in simulation and real world object grasping and ablation studies demonstrate that our method substantially outperforms state of the art approaches in terms of grasp diversity, contact semantic diversity, functional affordance diversity, and semantic consistency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 118,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03891",
        "abs_url": "https://arxiv.org/abs/2512.03891",
        "pdf_url": "https://arxiv.org/pdf/2512.03891",
        "title": "Digital Twin-based Control Co-Design of Full Vehicle Active Suspensions via Deep Reinforcement Learning",
        "authors": [
            "Ying-Kuan Tsai",
            "Yi-Ping Chen",
            "Vispi Karkaria",
            "Wei Chen"
        ],
        "comments": "28 pages, 17 figures",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Active suspension systems are critical for enhancing vehicle comfort, safety, and stability, yet their performance is often limited by fixed hardware designs and control strategies that cannot adapt to uncertain and dynamic operating conditions. Recent advances in digital twins (DTs) and deep reinforcement learning (DRL) offer new opportunities for real-time, data-driven optimization across a vehicle's lifecycle. However, integrating these technologies into a unified framework remains an open challenge. This work presents a DT-based control co-design (CCD) framework for full-vehicle active suspensions using multi-generation design concepts. By integrating automatic differentiation into DRL, we jointly optimize physical suspension components and control policies under varying driver behaviors and environmental uncertainties. DRL also addresses the challenge of partial observability, where only limited states can be sensed and fed back to the controller, by learning optimal control actions directly from available sensor information. The framework incorporates model updating with quantile learning to capture data uncertainty, enabling real-time decision-making and adaptive learning from digital-physical interactions. The approach demonstrates personalized optimization of suspension systems under two distinct driving settings (mild and aggressive). Results show that the optimized systems achieve smoother trajectories and reduce control efforts by approximately 43% and 52% for mild and aggressive, respectively, while maintaining ride comfort and stability. Contributions include: developing a DT-enabled CCD framework integrating DRL and uncertainty-aware model updating for full-vehicle active suspensions, introducing a multi-generation design strategy for self-improving systems, and demonstrating personalized optimization of active suspension systems for distinct driver types.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 119,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03915",
        "abs_url": "https://arxiv.org/abs/2512.03915",
        "pdf_url": "https://arxiv.org/pdf/2512.03915",
        "title": "A Theoretical Framework for Auxiliary-Loss-Free Load Balancing of Sparse Mixture-of-Experts in Large-Scale AI Models",
        "authors": [
            "X.Y. Han",
            "Yuan Zhong"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "In large-scale AI training, Sparse Mixture-of-Experts (s-MoE) layers enable scaling by activating only a small subset of experts per token. An operational challenge in this design is load balancing: routing tokens to minimize the number of idle experts, which is important for the efficient utilization of (costly) GPUs. We provide a theoretical framework for analyzing the Auxiliary-Loss-Free Load Balancing (ALF-LB) procedure -- proposed by DeepSeek's Wang et al. (2024) -- by casting it as a one-step-per-iteration primal-dual method for an assignment problem. First, in a stylized deterministic setting, our framework yields several insightful structural properties: (i) a monotonic improvement of a Lagrangian objective, (ii) a preference rule that moves tokens from overloaded to underloaded experts, and (iii) an approximate-balancing guarantee. Then, we incorporate the stochastic and dynamic nature of AI training using a generalized online optimization formulation. In the online setting, we derive a strong convexity property of the objective that leads to a logarithmic expected regret bound under certain step-size choices. Additionally, we present real experiments on 1B-parameter DeepSeekMoE models to complement our theoretical findings. Together, these results build a principled framework for analyzing the Auxiliary-Loss-Free Load Balancing of s-MoE in AI models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 120,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.03974",
        "abs_url": "https://arxiv.org/abs/2512.03974",
        "pdf_url": "https://arxiv.org/pdf/2512.03974",
        "title": "Refining Machine Learning Potentials through Thermodynamic Theory of Phase Transitions",
        "authors": [
            "Paul Fuchs",
            "Julija Zavadlav"
        ],
        "comments": "",
        "subjects": "Computational Physics (physics.comp-ph); Machine Learning (cs.LG)",
        "abstract": "Foundational Machine Learning Potentials can resolve the accuracy and transferability limitations of classical force fields. They enable microscopic insights into material behavior through Molecular Dynamics simulations, which can crucially expedite material design and discovery. However, insufficiently broad and systematically biased reference data affect the predictive quality of the learned models. Often, these models exhibit significant deviations from experimentally observed phase transition temperatures, in the order of several hundred kelvins. Thus, fine-tuning is necessary to achieve adequate accuracy in many practical problems. This work proposes a fine-tuning strategy via top-down learning, directly correcting the wrongly predicted transition temperatures to match the experimental reference data. Our approach leverages the Differentiable Trajectory Reweighting algorithm to minimize the free energy differences between phases at the experimental target pressures and temperatures. We demonstrate that our approach can accurately correct the phase diagram of pure Titanium in a pressure range of up to 5 GPa, matching the experimental reference within tenths of kelvins and improving the liquid-state diffusion constant. Our approach is model-agnostic, applicable to multi-component systems with solid-solid and solid-liquid transitions, and compliant with top-down training on other experimental properties. Therefore, our approach can serve as an essential step towards highly accurate application-specific and foundational machine learning potentials.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 121,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.04025",
        "abs_url": "https://arxiv.org/abs/2512.04025",
        "pdf_url": "https://arxiv.org/pdf/2512.04025",
        "title": "PSA: Pyramid Sparse Attention for Efficient Video Understanding and Generation",
        "authors": [
            "Xiaolong Li",
            "Youping Gu",
            "Xi Lin",
            "Weijie Wang",
            "Bohan Zhuang"
        ],
        "comments": "Tech report",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Attention mechanisms are the core of foundation models, but their quadratic complexity remains a critical bottleneck for scaling. This challenge has driven the development of efficient attention mechanisms, with sparsity emerging as the dominant paradigm. Current methods typically retain or discard entire key-value blocks with binary masks, resulting in substantial information loss under high sparsity. To mitigate this gap, we present Pyramid Sparse Attention (PSA), a versatile module applicable to both video understanding and generation tasks. Instead of binary masking, PSA introduces multi-level pooled KV representations, enabling finer mask granularity. Specifically, each query block dynamically allocates lower pooling levels to critical KV blocks and higher levels to less important ones, creating an informative interpolation between full retention and complete pruning. This design, analogous to fixed-point quantization and classical feature pyramid networks in computer vision, effectively mitigates information loss while preserving computational efficiency under a low compute budget. It works with a native, hardware-friendly kernel that leverages decoupled block-tile design to ensure efficient execution. Across video understanding and generation benchmarks, PSA preserves contextual information and visual fidelity, consistently outperforming or achieving comparable performance over existing sparse attention baselines with superior efficiency-quality trade-offs. Our code and model weights are publicly available at: this http URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 122,
        "date": "2025-12-04",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-04?abs=True",
        "arxiv_id": "2512.04058",
        "abs_url": "https://arxiv.org/abs/2512.04058",
        "pdf_url": "https://arxiv.org/pdf/2512.04058",
        "title": "Closing the problem of which causal structures of up to six total nodes have a classical-quantum gap",
        "authors": [
            "Shashaank Khanna",
            "Matthew Pusey",
            "Roger Colbeck"
        ],
        "comments": "5 pages, 3 figures, 1 table",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "The discovery of Bell that there exist quantum correlations that cannot be reproduced classically is one of the most important in the foundations of quantum mechanics, as well as having practical implications. Bell's result was originally proven in a simple bipartite causal structure, but analogous results have also been shown in further causal structures. Here we study the only causal structure with six or fewer nodes in which the question of whether or not there exist quantum correlations that cannot be achieved classically was open. In this causal structure we show that such quantum correlations exist using a method that involves imposing additional restrictions on the correlations. This hence completes the picture of which causal structures of up to six nodes support non-classical quantum correlations. We also provide further illustrations of our method using other causal structures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]