[
    {
        "order": 1,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04125",
        "abs_url": "https://arxiv.org/abs/2512.04125",
        "pdf_url": "https://arxiv.org/pdf/2512.04125",
        "title": "ASCIIBench: Evaluating Language-Model-Based Understanding of Visually-Oriented Text",
        "authors": [
            "Kerry Luo",
            "Michael Fu",
            "Joshua Peguero",
            "Husnain Malik",
            "Anvay Patil",
            "Joyce Lin",
            "Megan Van Overborg",
            "Ryan Sarmiento",
            "Kevin Zhu"
        ],
        "comments": "Accepted to The Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS 2025): LLM Evaluation Workshop & Multimodal Algorithmic Reasoning Workshop",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) have demonstrated several emergent behaviors with scale, including reasoning and fluency in long-form text generation. However, they continue to struggle with tasks requiring precise spatial and positional reasoning. ASCII art, a symbolic medium where characters encode structure and form, provides a unique probe of this limitation. We introduce ASCIIBench, a novel benchmark for evaluating both the generation and classification of ASCII-text images. ASCIIBench consists of a filtered dataset of 5,315 class-labeled ASCII images and is, to our knowledge, the first publicly available benchmark of its kind. Alongside the dataset, we release weights for a fine-tuned CLIP model adapted to capture ASCII structure, enabling the evaluation of LLM-generated ASCII art. Our analysis shows that cosine similarity over CLIP embeddings fails to separate most ASCII categories, yielding chance-level performance even for low-variance classes. In contrast, classes with high internal mean similarity exhibit clear discriminability, revealing that the bottleneck lies in representation rather than generational variance. These findings position ASCII art as a stress test for multimodal representations and motivate the development of new embedding methods or evaluation metrics tailored to symbolic visual modalities. All resources are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04135",
        "abs_url": "https://arxiv.org/abs/2512.04135",
        "pdf_url": "https://arxiv.org/pdf/2512.04135",
        "title": "Decoding Large Language Diffusion Models with Foreseeing Movement",
        "authors": [
            "Yichuan Mo",
            "Quan Chen",
            "Mingjie Li",
            "Zeming Wei",
            "Yisen Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large Language Diffusion Models (LLDMs) benefit from a flexible decoding mechanism that enables parallelized inference and controllable generations over autoregressive models. Yet such flexibility introduces a critical challenge: inference performance becomes highly sensitive to the decoding order of tokens. Existing heuristic methods, however, focus mainly on local effects while overlooking long-term impacts. To address this limitation, we propose the Foreseeing Decoding Method (FDM), a novel approach that integrates both local and global considerations to unlock the full potential, employing a search-based strategy to enable effective optimization in discrete spaces. Furthermore, by analyzing the consistency of chosen tokens in the full decoding process, we develop a variant, FDM with Acceleration (FDM-A), which restricts deep exploration to critical steps identified as the exploration and balance circumantences. Extensive experiments across diverse benchmarks and model architectures validate the scalability of FDM and demonstrate the superior efficiency-performance trade-off achieved by FDM-A. Our work might potentially provide a principled step toward more powerful decoding methods for LLDMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04138",
        "abs_url": "https://arxiv.org/abs/2512.04138",
        "pdf_url": "https://arxiv.org/pdf/2512.04138",
        "title": "MechDetect: Detecting Data-Dependent Errors",
        "authors": [
            "Philipp Jung",
            "Nicholas Chandler",
            "Sebastian Jäger",
            "Felix Biessmann"
        ],
        "comments": "International Conference on Data Science and Intelligent Systems (DSIS 2025)",
        "subjects": "Machine Learning (cs.LG); Databases (cs.DB); Information Retrieval (cs.IR)",
        "abstract": "Data quality monitoring is a core challenge in modern information processing systems. While many approaches to detect data errors or shifts have been proposed, few studies investigate the mechanisms governing error generation. We argue that knowing how errors were generated can be key to tracing and fixing them. In this study, we build on existing work in the statistics literature on missing values and propose MechDetect, a simple algorithm to investigate error generation mechanisms. Given a tabular data set and a corresponding error mask, the algorithm estimates whether or not the errors depend on the data using machine learning models. Our work extends established approaches to detect mechanisms underlying missing values and can be readily applied to other error types, provided that an error mask is available. We demonstrate the effectiveness of MechDetect in experiments on established benchmark datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04165",
        "abs_url": "https://arxiv.org/abs/2512.04165",
        "pdf_url": "https://arxiv.org/pdf/2512.04165",
        "title": "Mitigating the Curse of Detail: Scaling Arguments for Feature Learning and Sample Complexity",
        "authors": [
            "Noa Rubin",
            "Orit Davidovich",
            "Zohar Ringel"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Two pressing topics in the theory of deep learning are the interpretation of feature learning mechanisms and the determination of implicit bias of networks in the rich regime. Current theories of rich feature learning effects revolve around networks with one or two trainable layers or deep linear networks. Furthermore, even under such limiting settings, predictions often appear in the form of high-dimensional non-linear equations, which require computationally intensive numerical solutions. Given the many details that go into defining a deep learning problem, this analytical complexity is a significant and often unavoidable challenge. Here, we propose a powerful heuristic route for predicting the data and width scales at which various patterns of feature learning emerge. This form of scale analysis is considerably simpler than such exact theories and reproduces the scaling exponents of various known results. In addition, we make novel predictions on complex toy architectures, such as three-layer non-linear networks and attention heads, thus extending the scope of first-principle theories of deep learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04189",
        "abs_url": "https://arxiv.org/abs/2512.04189",
        "pdf_url": "https://arxiv.org/pdf/2512.04189",
        "title": "BEP: A Binary Error Propagation Algorithm for Binary Neural Networks Training",
        "authors": [
            "Luca Colombo",
            "Fabrizio Pittorino",
            "Daniele Zambon",
            "Carlo Baldassi",
            "Manuel Roveri",
            "Cesare Alippi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Binary Neural Networks (BNNs), which constrain both weights and activations to binary values, offer substantial reductions in computational complexity, memory footprint, and energy consumption. These advantages make them particularly well suited for deployment on resource-constrained devices. However, training BNNs via gradient-based optimization remains challenging due to the discrete nature of their variables. The dominant approach, quantization-aware training, circumvents this issue by employing surrogate gradients. Yet, this method requires maintaining latent full-precision parameters and performing the backward pass with floating-point arithmetic, thereby forfeiting the efficiency of binary operations during training. While alternative approaches based on local learning rules exist, they are unsuitable for global credit assignment and for back-propagating errors in multi-layer architectures. This paper introduces Binary Error Propagation (BEP), the first learning algorithm to establish a principled, discrete analog of the backpropagation chain rule. This mechanism enables error signals, represented as binary vectors, to be propagated backward through multiple layers of a neural network. BEP operates entirely on binary variables, with all forward and backward computations performed using only bitwise operations. Crucially, this makes BEP the first solution to enable end-to-end binary training for recurrent neural network architectures. We validate the effectiveness of BEP on both multi-layer perceptrons and recurrent neural networks, demonstrating gains of up to +6.89% and +10.57% in test accuracy, respectively. The proposed algorithm is released as an open-source repository.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04223",
        "abs_url": "https://arxiv.org/abs/2512.04223",
        "pdf_url": "https://arxiv.org/pdf/2512.04223",
        "title": "ActVAE: Modelling human activity schedules with a deep conditional generative approach",
        "authors": [
            "Fred Shone",
            "Tim Hillel"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Modelling the complexity and diversity of human activity scheduling behaviour is inherently challenging. We demonstrate a deep conditional-generative machine learning approach for the modelling of realistic activity schedules depending on input labels such as an individual's age, employment status, or other information relevant to their scheduling. We combine (i) a structured latent generative approach, with (ii) a conditional approach, through a novel Conditional VAE architecture. This allows for the rapid generation of precise and realistic schedules for different input labels. We extensively evaluate model capabilities using a joint density estimation framework and several case studies. We additionally show that our approach has practical data and computational requirements, and can be deployed within new and existing demand modelling frameworks. We evaluate the importance of generative capability more generally, by comparing our combined approach to (i) a purely generative model without conditionality, and (ii) a purely conditional model which outputs the most likely schedule given the input labels. This comparison highlights the usefulness of explicitly modelling the randomness of complex and diverse human behaviours using deep generative approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04252",
        "abs_url": "https://arxiv.org/abs/2512.04252",
        "pdf_url": "https://arxiv.org/pdf/2512.04252",
        "title": "Fine-Tuning ChemBERTa for Predicting Inhibitory Activity Against TDP1 Using Deep Learning",
        "authors": [
            "Baichuan Zeng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Predicting the inhibitory potency of small molecules against Tyrosyl-DNA Phosphodiesterase 1 (TDP1)-a key target in overcoming cancer chemoresistance-remains a critical challenge in early drug discovery. We present a deep learning framework for the quantitative regression of pIC50 values from molecular Simplified Molecular Input Line Entry System (SMILES) strings using fine-tuned variants of ChemBERTa, a pre-trained chemical language model. Leveraging a large-scale consensus dataset of 177,092 compounds, we systematically evaluate two pre-training strategies-Masked Language Modeling (MLM) and Masked Token Regression (MTR)-under stratified data splits and sample weighting to address severe activity imbalance which only 2.1% are active. Our approach outperforms classical baselines Random Predictor in both regression accuracy and virtual screening utility, and has competitive performance compared to Random Forest, achieving high enrichment factor EF@1% 17.4 and precision Precision@1% 37.4 among top-ranked predictions. The resulting model, validated through rigorous ablation and hyperparameter studies, provides a robust, ready-to-deploy tool for prioritizing TDP1 inhibitors for experimental testing. By enabling accurate, 3D-structure-free pIC50 prediction directly from SMILES, this work demonstrates the transformative potential of chemical transformers in accelerating target-specific drug discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04268",
        "abs_url": "https://arxiv.org/abs/2512.04268",
        "pdf_url": "https://arxiv.org/pdf/2512.04268",
        "title": "The Initialization Determines Whether In-Context Learning Is Gradient Descent",
        "authors": [
            "Shifeng Xie",
            "Rui Yuan",
            "Simone Rossi",
            "Thomas Hannagan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "In-context learning (ICL) in large language models (LLMs) is a striking phenomenon, yet its underlying mechanisms remain only partially understood. Previous work connects linear self-attention (LSA) to gradient descent (GD), this connection has primarily been established under simplified conditions with zero-mean Gaussian priors and zero initialization for GD. However, subsequent studies have challenged this simplified view by highlighting its overly restrictive assumptions, demonstrating instead that under conditions such as multi-layer or nonlinear attention, self-attention performs optimization-like inference, akin to but distinct from GD. We investigate how multi-head LSA approximates GD under more realistic conditions specifically when incorporating non-zero Gaussian prior means in linear regression formulations of ICL. We first extend multi-head LSA embedding matrix by introducing an initial estimation of the query, referred to as the initial guess. We prove an upper bound on the number of heads needed for ICL linear regression setup. Our experiments confirm this result and further observe that a performance gap between one-step GD and multi-head LSA persists. To address this gap, we introduce yq-LSA, a simple generalization of single-head LSA with a trainable initial guess yq. We theoretically establish the capabilities of yq-LSA and provide experimental validation on linear regression tasks, thereby extending the theory that bridges ICL and GD. Finally, inspired by our findings in the case of linear regression, we consider widespread LLMs augmented with initial guess capabilities, and show that their performance is improved on a semantic similarity task.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04296",
        "abs_url": "https://arxiv.org/abs/2512.04296",
        "pdf_url": "https://arxiv.org/pdf/2512.04296",
        "title": "GRASP: GRouped Activation Shared Parameterization for Parameter-Efficient Fine-Tuning and Robust Inference of Transformers",
        "authors": [
            "Malyaban Bal",
            "Abhronil Sengupta"
        ],
        "comments": "Under Review",
        "subjects": "Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Parameter-efficient fine-tuning (PEFT) provides a scalable alternative to full-model adaptation by updating only a small subset of parameters in large pre-trained models. We introduce GRASP - GRouped Activation Shared Parameterization - a lightweight PEFT framework that partitions the D-dimensional token representations of selected layers into K << D groups and learns a shared scaling and shifting vector for each group. This grouped modulation reduces the number of trainable parameters significantly while preserving the ability of the model to learn task-specific features. Building on this formulation, we further propose StochGRASP, which learns Gaussian distributions as perturbations to the pre-trained weights rather than deterministic values. This probabilistic parameterization along with a noise-aware loss function formulation enables modelling hardware-level variability in programmed weights and significantly improves robustness under non-ideal inference conditions-an important requirement for deployment on edge-based emerging AI hardware. Across GLUE (RoBERTa-base & RoBERTa-large) and E2E NLG (GPT-2 Medium), GRASP matches or exceeds the performance of established PEFT methods while achieving an order of magnitude reduction in trainable parameters compared to LoRA and BitFit. Under varying levels of noise, StochGRASP consistently outperforms deterministic variants, demonstrating its suitability for energy-efficient and noise-prone hardware platforms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04299",
        "abs_url": "https://arxiv.org/abs/2512.04299",
        "pdf_url": "https://arxiv.org/pdf/2512.04299",
        "title": "When do spectral gradient updates help in deep learning?",
        "authors": [
            "Damek Davis",
            "Dmitriy Drusvyatskiy"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "Spectral gradient methods, such as the recently popularized Muon optimizer, are a promising alternative to standard Euclidean gradient descent for training deep neural networks and transformers, but it is still unclear in which regimes they are expected to perform better. We propose a simple layerwise condition that predicts when a spectral update yields a larger decrease in the loss than a Euclidean gradient step. This condition compares, for each parameter block, the squared nuclear-to-Frobenius ratio of the gradient to the stable rank of the incoming activations. To understand when this condition may be satisfied, we first prove that post-activation matrices have low stable rank at Gaussian initialization in random feature regression, feedforward networks, and transformer blocks. In spiked random feature models we then show that, after a short burn-in, the Euclidean gradient's nuclear-to-Frobenius ratio grows with the data dimension while the stable rank of the activations remains bounded, so the predicted advantage of spectral updates scales with dimension. We validate these predictions in synthetic regression experiments and in NanoGPT-scale language model training, where we find that intermediate activations have low-stable-rank throughout training and the corresponding gradients maintain large nuclear-to-Frobenius ratios. Together, these results identify conditions for spectral gradient methods, such as Muon, to be effective in training deep networks and transformers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04310",
        "abs_url": "https://arxiv.org/abs/2512.04310",
        "pdf_url": "https://arxiv.org/pdf/2512.04310",
        "title": "RNNs perform task computations by dynamically warping neural representations",
        "authors": [
            "Arthur Pellegrino",
            "Angus Chadwick"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Differential Geometry (math.DG); Dynamical Systems (math.DS); Neurons and Cognition (q-bio.NC)",
        "abstract": "Analysing how neural networks represent data features in their activations can help interpret how they perform tasks. Hence, a long line of work has focused on mathematically characterising the geometry of such \"neural representations.\" In parallel, machine learning has seen a surge of interest in understanding how dynamical systems perform computations on time-varying input data. Yet, the link between computation-through-dynamics and representational geometry remains poorly understood. Here, we hypothesise that recurrent neural networks (RNNs) perform computations by dynamically warping their representations of task variables. To test this hypothesis, we develop a Riemannian geometric framework that enables the derivation of the manifold topology and geometry of a dynamical system from the manifold of its inputs. By characterising the time-varying geometry of RNNs, we show that dynamic warping is a fundamental feature of their computations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04332",
        "abs_url": "https://arxiv.org/abs/2512.04332",
        "pdf_url": "https://arxiv.org/pdf/2512.04332",
        "title": "Data-regularized Reinforcement Learning for Diffusion Models at Scale",
        "authors": [
            "Haotian Ye",
            "Kaiwen Zheng",
            "Jiashu Xu",
            "Puheng Li",
            "Huayu Chen",
            "Jiaqi Han",
            "Sheng Liu",
            "Qinsheng Zhang",
            "Hanzi Mao",
            "Zekun Hao",
            "Prithvijit Chattopadhyay",
            "Dinghao Yang",
            "Liang Feng",
            "Maosheng Liao",
            "Junjie Bai",
            "Ming-Yu Liu",
            "James Zou",
            "Stefano Ermon"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Aligning generative diffusion models with human preferences via reinforcement learning (RL) is critical yet challenging. Most existing algorithms are often vulnerable to reward hacking, such as quality degradation, over-stylization, or reduced diversity. Our analysis demonstrates that this can be attributed to the inherent limitations of their regularization, which provides unreliable penalties. We introduce Data-regularized Diffusion Reinforcement Learning (DDRL), a novel framework that uses the forward KL divergence to anchor the policy to an off-policy data distribution. Theoretically, DDRL enables robust, unbiased integration of RL with standard diffusion training. Empirically, this translates into a simple yet effective algorithm that combines reward maximization with diffusion loss minimization. With over a million GPU hours of experiments and ten thousand double-blind human evaluations, we demonstrate on high-resolution video generation tasks that DDRL significantly improves rewards while alleviating the reward hacking seen in baselines, achieving the highest human preference and establishing a robust and scalable paradigm for diffusion post-training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04341",
        "abs_url": "https://arxiv.org/abs/2512.04341",
        "pdf_url": "https://arxiv.org/pdf/2512.04341",
        "title": "Long-Horizon Model-Based Offline Reinforcement Learning Without Conservatism",
        "authors": [
            "Tianwei Ni",
            "Esther Derman",
            "Vineet Jain",
            "Vincent Taboga",
            "Siamak Ravanbakhsh",
            "Pierre-Luc Bacon"
        ],
        "comments": "Preprint (52 pages, 15 figures)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Popular offline reinforcement learning (RL) methods rely on conservatism, either by penalizing out-of-dataset actions or by restricting planning horizons. In this work, we question the universality of this principle and instead revisit a complementary one: a Bayesian perspective. Rather than enforcing conservatism, the Bayesian approach tackles epistemic uncertainty in offline data by modeling a posterior distribution over plausible world models and training a history-dependent agent to maximize expected rewards, enabling test-time generalization. We first illustrate, in a bandit setting, that Bayesianism excels on low-quality datasets where conservatism fails. We then scale the principle to realistic tasks, identifying key design choices, such as layer normalization in the world model and adaptive long-horizon planning, that mitigate compounding error and value overestimation. These yield our practical algorithm, Neubay, grounded in the neutral Bayesian principle. On D4RL and NeoRL benchmarks, Neubay generally matches or surpasses leading conservative algorithms, achieving new state-of-the-art on 7 datasets. Notably, it succeeds with planning horizons of several hundred steps, challenging common belief. Finally, we characterize when Neubay is preferable to conservatism, laying the foundation for a new direction in offline and model-based RL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04351",
        "abs_url": "https://arxiv.org/abs/2512.04351",
        "pdf_url": "https://arxiv.org/pdf/2512.04351",
        "title": "Distance Is All You Need: Radial Dispersion for Uncertainty Estimation in Large Language Models",
        "authors": [
            "Manh Nguyen",
            "Sunil Gupta",
            "Hung Le"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Detecting when large language models (LLMs) are uncertain is critical for building reliable systems, yet existing methods are overly complicated, relying on brittle semantic clustering or internal states. We introduce \\textbf{Radial Dispersion Score (RDS)}, a simple, parameter-free, fully model-agnostic uncertainty metric that measures the radial dispersion of sampled generations in embedding space. A lightweight probability-weighted variant further incorporates the model's own token probabilities when available, outperforming different nine strong baselines. Moroever, RDS naturally extends to per-sample scoring, enabling applications such as best-of-$N$ selection and confidence-based filtering. Across four challenging free-form QA datasets and multiple LLMs, our metrics achieve state-of-the-art hallucination detection and answer selection performance, while remaining robust and scalable with respect to sample size and embedding choice.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04354",
        "abs_url": "https://arxiv.org/abs/2512.04354",
        "pdf_url": "https://arxiv.org/pdf/2512.04354",
        "title": "SmartAlert: Implementing Machine Learning-Driven Clinical Decision Support for Inpatient Lab Utilization Reduction",
        "authors": [
            "April S. Liang",
            "Fatemeh Amrollahi",
            "Yixing Jiang",
            "Conor K. Corbin",
            "Grace Y.E. Kim",
            "David Mui",
            "Trevor Crowell",
            "Aakash Acharya",
            "Sreedevi Mony",
            "Soumya Punnathanam",
            "Jack McKeown",
            "Margaret Smith",
            "Steven Lin",
            "Arnold Milstein",
            "Kevin Schulman",
            "Jason Hom",
            "Michael A. Pfeffer",
            "Tho D. Pham",
            "David Svec",
            "Weihan Chu",
            "Lisa Shieh",
            "Christopher Sharp",
            "Stephen P. Ma",
            "Jonathan H. Chen"
        ],
        "comments": "22 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG); Human-Computer Interaction (cs.HC)",
        "abstract": "Repetitive laboratory testing unlikely to yield clinically useful information is a common practice that burdens patients and increases healthcare costs. Education and feedback interventions have limited success, while general test ordering restrictions and electronic alerts impede appropriate clinical care. We introduce and evaluate SmartAlert, a machine learning (ML)-driven clinical decision support (CDS) system integrated into the electronic health record that predicts stable laboratory results to reduce unnecessary repeat testing. This case study describes the implementation process, challenges, and lessons learned from deploying SmartAlert targeting complete blood count (CBC) utilization in a randomized controlled pilot across 9270 admissions in eight acute care units across two hospitals between August 15, 2024, and March 15, 2025. Results show significant decrease in number of CBC results within 52 hours of SmartAlert display (1.54 vs 1.82, p <0.01) without adverse effect on secondary safety outcomes, representing a 15% relative reduction in repetitive testing. Implementation lessons learned include interpretation of probabilistic model predictions in clinical contexts, stakeholder engagement to define acceptable model behavior, governance processes for deploying a complex model in a clinical environment, user interface design considerations, alignment with clinical operational priorities, and the value of qualitative feedback from end users. In conclusion, a machine learning-driven CDS system backed by a deliberate implementation and governance process can provide precision guidance on inpatient laboratory testing to safely reduce unnecessary repetitive testing.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04388",
        "abs_url": "https://arxiv.org/abs/2512.04388",
        "pdf_url": "https://arxiv.org/pdf/2512.04388",
        "title": "Learning to Orchestrate Agents in Natural Language with the Conductor",
        "authors": [
            "Stefan Nielsen",
            "Edoardo Cetin",
            "Peter Schwendeman",
            "Qi Sun",
            "Jinglue Xu",
            "Yujin Tang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Powerful large language models (LLMs) from different providers have been expensively trained and finetuned to specialize across varying domains. In this work, we introduce a new kind of Conductor model trained with reinforcement learning to automatically discover powerful coordination strategies among LLMs. Our Conductor learns not only to design targeted communication topologies for effective agent-to-agent collaboration, but also to prompt engineer focused instructions to the LLMs to maximally leverage their individual capabilities. We show that, by learning optimal coordination strategies over pools of powerful worker LLMs, a 7B Conductor achieves significant performance gains beyond any individual worker, attaining state-of-the-art results in challenging reasoning benchmarks, such as LiveCodeBench and GPQA. By training with randomized agent pools, our conductor effectively adapts to arbitrary sets of open- and closed-source agents, meeting any user requirements. Furthermore, allowing the Conductor to select itself as a worker gives rise to recursive topologies, elevating performance with a new form of dynamic test-time scaling through online iterative adaptation. More broadly, ours is among the early work demonstrating language model coordination can be unlocked through RL, where powerful coordination strategies emerge naturally in LLMs through pure end-to-end reward maximization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04475",
        "abs_url": "https://arxiv.org/abs/2512.04475",
        "pdf_url": "https://arxiv.org/pdf/2512.04475",
        "title": "GraphBench: Next-generation graph learning benchmarking",
        "authors": [
            "Timo Stoll",
            "Chendi Qian",
            "Ben Finkelshtein",
            "Ali Parviz",
            "Darius Weber",
            "Fabrizio Frasca",
            "Hadar Shavit",
            "Antoine Siraudin",
            "Arman Mielke",
            "Marie Anastacio",
            "Erik Müller",
            "Maya Bechler-Speicher",
            "Michael Bronstein",
            "Mikhail Galkin",
            "Holger Hoos",
            "Mathias Niepert",
            "Bryan Perozzi",
            "Jan Tönshoff",
            "Christopher Morris"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Neural and Evolutionary Computing (cs.NE); Machine Learning (stat.ML)",
        "abstract": "Machine learning on graphs has recently achieved impressive progress in various domains, including molecular property prediction and chip design. However, benchmarking practices remain fragmented, often relying on narrow, task-specific datasets and inconsistent evaluation protocols, which hampers reproducibility and broader progress. To address this, we introduce GraphBench, a comprehensive benchmarking suite that spans diverse domains and prediction tasks, including node-level, edge-level, graph-level, and generative settings. GraphBench provides standardized evaluation protocols -- with consistent dataset splits and performance metrics that account for out-of-distribution generalization -- as well as a unified hyperparameter tuning framework. Additionally, we benchmark GraphBench using message-passing neural networks and graph transformer models, providing principled baselines and establishing a reference performance. See this http URL for further details.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04476",
        "abs_url": "https://arxiv.org/abs/2512.04476",
        "pdf_url": "https://arxiv.org/pdf/2512.04476",
        "title": "Context-Aware Mixture-of-Experts Inference on CXL-Enabled GPU-NDP Systems",
        "authors": [
            "Zehao Fan",
            "Zhenyu Liu",
            "Yunzhen Liu",
            "Yayue Hou",
            "Hadjer Benmeziane",
            "Kaoutar El Maghraoui",
            "Liu Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Hardware Architecture (cs.AR)",
        "abstract": "Mixture-of-Experts (MoE) models scale large language models through conditional computation, but inference becomes memory-bound once expert weights exceed the capacity of GPU memory. In this case, weights must be offloaded to external memory, and fetching them incurs costly and repeated transfers. We address this by adopting CXL-attached near-data processing (CXL-NDP) as the offloading tier to execute cold experts in place, converting expensive parameter movement into cheaper activation movement. Unlike prior GPU-NDP systems that are largely context-agnostic and reactive, we develop a context-aware MoE system that uses prefill-stage activation statistics to guide decoding-stage expert placement, dynamically pins hot experts in GPU-side HBM, and maps the remainder to CXL-NDP. To meet NDP's limited compute throughput, we introduce context-aware mixed-precision quantization that allocates per-expert bitwidths (1-4 bit) based on prefill stage. The resulting MoE inference system overlaps GPU and NDP execution while minimizing cross-device movement. The evaluation on the GPU-NDP system shows that our approach achieves up to an 8.7-fold decoding throughput improvement over the state-of-the-art method, while incurring only a 0.13% average accuracy drop.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04530",
        "abs_url": "https://arxiv.org/abs/2512.04530",
        "pdf_url": "https://arxiv.org/pdf/2512.04530",
        "title": "Explainable Graph Representation Learning via Graph Pattern Analysis",
        "authors": [
            "Xudong Wang",
            "Ziheng Sun",
            "Chris Ding",
            "Jicong Fan"
        ],
        "comments": "Full version with appendix of the paper published in the Proceedings of the Thirty-Fourth International Joint Conference on Artificial Intelligence (IJCAI-25), Main Track",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Explainable artificial intelligence (XAI) is an important area in the AI community, and interpretability is crucial for building robust and trustworthy AI models. While previous work has explored model-level and instance-level explainable graph learning, there has been limited investigation into explainable graph representation learning. In this paper, we focus on representation-level explainable graph learning and ask a fundamental question: What specific information about a graph is captured in graph representations? Our approach is inspired by graph kernels, which evaluate graph similarities by counting substructures within specific graph patterns. Although the pattern counting vector can serve as an explainable representation, it has limitations such as ignoring node features and being high-dimensional. To address these limitations, we introduce a framework (PXGL-GNN) for learning and explaining graph representations through graph pattern analysis. We start by sampling graph substructures of various patterns. Then, we learn the representations of these patterns and combine them using a weighted sum, where the weights indicate the importance of each graph pattern's contribution. We also provide theoretical analyses of our methods, including robustness and generalization. In our experiments, we show how to learn and explain graph representations for real-world data using pattern analysis. Additionally, we compare our method against multiple baselines in both supervised and unsupervised learning tasks to demonstrate its effectiveness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04558",
        "abs_url": "https://arxiv.org/abs/2512.04558",
        "pdf_url": "https://arxiv.org/pdf/2512.04558",
        "title": "On the Limits of Test-Time Compute: Sequential Reward Filtering for Better Inference",
        "authors": [
            "Yue Yu",
            "Qiwei Di",
            "Quanquan Gu",
            "Dongruo Zhou"
        ],
        "comments": "45 pages, 6 figures, 3 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Test-time compute (TTC) has become an increasingly prominent paradigm for enhancing large language models (LLMs). Despite the empirical success of methods such as best-of-$n$ (BoN) sampling and sequential revision, their fundamental limits remain unclear. We address this gap by analyzing a mixture-of-reference policy model and proving that standard BoN is inherently suboptimal. To move closer to the optimal frontier, we study reward-filtered sequential inference, a simple procedure that selectively incorporates only high-reward generations into the context. This mechanism concentrates computation on superior policy candidates and suppresses inferior ones. On the theoretical side, we show that reward-filtered sequential inference yields strictly stronger guarantees than standard TTC paradigms. On the empirical side, we evaluate such an inference strategy across diverse benchmarks and observe consistent improvements over widely used approaches, demonstrating the practical effectiveness of our framework.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04562",
        "abs_url": "https://arxiv.org/abs/2512.04562",
        "pdf_url": "https://arxiv.org/pdf/2512.04562",
        "title": "LeMat-GenBench: A Unified Evaluation Framework for Crystal Generative Models",
        "authors": [
            "Siddharth Betala",
            "Samuel P. Gleason",
            "Ali Ramlaoui",
            "Andy Xu",
            "Georgia Channing",
            "Daniel Levy",
            "Clémentine Fourrier",
            "Nikita Kazeev",
            "Chaitanya K. Joshi",
            "Sékou-Oumar Kaba",
            "Félix Therrien",
            "Alex Hernandez-Garcia",
            "Rocío Mercado",
            "N. M. Anoop Krishnan",
            "Alexandre Duval"
        ],
        "comments": "46 pages, 17 figures, 16 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Generative machine learning (ML) models hold great promise for accelerating materials discovery through the inverse design of inorganic crystals, enabling an unprecedented exploration of chemical space. Yet, the lack of standardized evaluation frameworks makes it challenging to evaluate, compare, and further develop these ML models meaningfully. In this work, we introduce LeMat-GenBench, a unified benchmark for generative models of crystalline materials, supported by a set of evaluation metrics designed to better inform model development and downstream applications. We release both an open-source evaluation suite and a public leaderboard on Hugging Face, and benchmark 12 recent generative models. Results reveal that an increase in stability leads to a decrease in novelty and diversity on average, with no model excelling across all dimensions. Altogether, LeMat-GenBench establishes a reproducible and extensible foundation for fair model comparison and aims to guide the development of more reliable, discovery-oriented generative models for crystalline materials.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04566",
        "abs_url": "https://arxiv.org/abs/2512.04566",
        "pdf_url": "https://arxiv.org/pdf/2512.04566",
        "title": "Reliable Statistical Guarantees for Conformal Predictors with Small Datasets",
        "authors": [
            "Miguel Sánchez-Domínguez",
            "Lucas Lacasa",
            "Javier de Vicente",
            "Gonzalo Rubio",
            "Eusebio Valero"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an); Machine Learning (stat.ML)",
        "abstract": "Surrogate models (including deep neural networks and other machine learning algorithms in supervised learning) are capable of approximating arbitrarily complex, high-dimensional input-output problems in science and engineering, but require a thorough data-agnostic uncertainty quantification analysis before these can be deployed for any safety-critical application. The standard approach for data-agnostic uncertainty quantification is to use conformal prediction (CP), a well-established framework to build uncertainty models with proven statistical guarantees that do not assume any shape for the error distribution of the surrogate model. However, since the classic statistical guarantee offered by CP is given in terms of bounds for the marginal coverage, for small calibration set sizes (which are frequent in realistic surrogate modelling that aims to quantify error at different regions), the potentially strong dispersion of the coverage distribution around its average negatively impacts the reliability of the uncertainty model, often obtaining coverages below the expected value, resulting in a less applicable framework. After providing a gentle presentation of uncertainty quantification for surrogate models for machine learning practitioners, in this paper we bridge the gap by proposing a new statistical guarantee that offers probabilistic information for the coverage of a single conformal predictor. We show that the proposed framework converges to the standard solution offered by CP for large calibration set sizes and, unlike the classic guarantee, still offers reliable information about the coverage of a conformal predictor for small data sizes. We illustrate and validate the methodology in a suite of examples, and implement an open access software solution that can be used alongside common conformal prediction libraries to obtain uncertainty models that fulfil the new guarantee.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04571",
        "abs_url": "https://arxiv.org/abs/2512.04571",
        "pdf_url": "https://arxiv.org/pdf/2512.04571",
        "title": "Temp-SCONE: A Novel Out-of-Distribution Detection and Domain Generalization Framework for Wild Data with Temporal Shift",
        "authors": [
            "Aditi Naiknaware",
            "Sanchit Singh",
            "Hajar Homayouni",
            "Salimeh Sekeh"
        ],
        "comments": "22 pages, 12 figures, 72 subfigures, 6 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Open-world learning (OWL) requires models that can adapt to evolving environments while reliably detecting out-of-distribution (OOD) inputs. Existing approaches, such as SCONE, achieve robustness to covariate and semantic shifts but assume static environments, leading to degraded performance in dynamic domains. In this paper, we propose Temp-SCONE, a temporally consistent extension of SCONE designed to handle temporal shifts in dynamic environments. Temp-SCONE introduces a confidence-driven regularization loss based on Average Thresholded Confidence (ATC), penalizing instability in predictions across time steps while preserving SCONE's energy-margin separation. Experiments on dynamic datasets demonstrate that Temp-SCONE significantly improves robustness under temporal drift, yielding higher corrupted-data accuracy and more reliable OOD detection compared to SCONE. On distinct datasets without temporal continuity, Temp-SCONE maintains comparable performance, highlighting the importance and limitations of temporal regularization. Our theoretical insights on temporal stability and generalization error further establish Temp-SCONE as a step toward reliable OWL in evolving dynamic environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04590",
        "abs_url": "https://arxiv.org/abs/2512.04590",
        "pdf_url": "https://arxiv.org/pdf/2512.04590",
        "title": "Exploiting \\texttt{ftrace}'s \\texttt{function\\_graph} Tracer Features for Machine Learning: A Case Study on Encryption Detection",
        "authors": [
            "Kenan Begovic",
            "Abdulaziz Al-Ali",
            "Qutaibah Malluhi"
        ],
        "comments": "Conference paper presented at AICCSA 2025",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "This paper proposes using the Linux kernel ftrace framework, particularly the function graph tracer, to generate informative system level data for machine learning (ML) applications. Experiments on a real world encryption detection task demonstrate the efficacy of the proposed features across several learning algorithms. The learner faces the problem of detecting encryption activities across a large dataset of files, using function call traces and graph based features. Empirical results highlight an outstanding accuracy of 99.28 on the task at hand, underscoring the efficacy of features derived from the function graph tracer. The results were further validated in an additional experiment targeting a multilabel classification problem, in which running programs were identified from trace data. This work provides comprehensive methodologies for preprocessing raw trace data and extracting graph based features, offering significant advancements in applying ML to system behavior analysis, program identification, and anomaly detection. By bridging the gap between system tracing and ML, this paper paves the way for innovative solutions in performance monitoring and security analytics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04596",
        "abs_url": "https://arxiv.org/abs/2512.04596",
        "pdf_url": "https://arxiv.org/pdf/2512.04596",
        "title": "QoSDiff: An Implicit Topological Embedding Learning Framework Leveraging Denoising Diffusion and Adversarial Attention for Robust QoS Prediction",
        "authors": [
            "Guanchen Du",
            "Jianlong Xu",
            "Wei Wei"
        ],
        "comments": "Preprint submitted to IEEE Transactions on Services Computing",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate Quality of Service (QoS) prediction is fundamental to service computing, providing essential data-driven guidance for service selection and ensuring superior user experiences. However, prevalent approaches, particularly Graph Neural Networks (GNNs), heavily rely on constructing explicit user--service interaction graphs. This dependency introduces severe scalability bottlenecks and limits performance when explicit connections are sparse or corrupted by noise. To address these challenges, this paper introduces \\emph{QoSDiff}, a novel embedding learning framework that bypasses the prerequisite of explicit graph construction. Specifically, it leverages a denoising diffusion probabilistic model to recover intrinsic latent structures from noisy initializations. To further capture high-order interactions, we propose an adversarial interaction module that integrates a bidirectional hybrid attention mechanism. This adversarial paradigm dynamically distinguishes informative patterns from noise, enabling a dual-perspective modeling of intricate user--service associations. Extensive experiments on two large-scale real-world datasets demonstrate that QoSDiff significantly outperforms state-of-the-art baselines. Notably, the results highlight the framework's superior cross-dataset generalization capability and exceptional robustness against data sparsity and observational noise.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04601",
        "abs_url": "https://arxiv.org/abs/2512.04601",
        "pdf_url": "https://arxiv.org/pdf/2512.04601",
        "title": "Natural Language Actor-Critic: Scalable Off-Policy Learning in Language Space",
        "authors": [
            "Joey Hong",
            "Kang Liu",
            "Zhan Ling",
            "Jiecao Chen",
            "Sergey Levine"
        ],
        "comments": "22 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Large language model (LLM) agents -- LLMs that dynamically interact with an environment over long horizons -- have become an increasingly important area of research, enabling automation in complex tasks involving tool-use, web browsing, and dialogue with people. In the absence of expert demonstrations, training LLM agents has relied on policy gradient methods that optimize LLM policies with respect to an (often sparse) reward function. However, in long-horizon tasks with sparse rewards, learning from trajectory-level rewards can be noisy, leading to training that is unstable and has high sample complexity. Furthermore, policy improvement hinges on discovering better actions through exploration, which can be difficult when actions lie in natural language space. In this paper, we propose Natural Language Actor-Critic (NLAC), a novel actor-critic algorithm that trains LLM policies using a generative LLM critic that produces natural language rather than scalar values. This approach leverages the inherent strengths of LLMs to provide a richer and more actionable training signal; particularly, in tasks with large, open-ended action spaces, natural language explanations for why an action is suboptimal can be immensely useful for LLM policies to reason how to improve their actions, without relying on random exploration. Furthermore, our approach can be trained off-policy without policy gradients, offering a more data-efficient and stable alternative to existing on-policy methods. We present results on a mixture of reasoning, web browsing, and tool-use with dialogue tasks, demonstrating that NLAC shows promise in outperforming existing training approaches and offers a more scalable and stable training paradigm for LLM agents.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04617",
        "abs_url": "https://arxiv.org/abs/2512.04617",
        "pdf_url": "https://arxiv.org/pdf/2512.04617",
        "title": "Score Matching for Estimating Finite Point Processes",
        "authors": [
            "Haoqun Cao",
            "Yixuan Zhang",
            "Feng Zhou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Score matching estimators have garnered significant attention in recent years because they eliminate the need to compute normalizing constants, thereby mitigating the computational challenges associated with maximum likelihood estimation (MLE).While several studies have proposed score matching estimators for point processes, this work highlights the limitations of these existing methods, which stem primarily from the lack of a mathematically rigorous analysis of how score matching behaves on finite point processes -- special random configurations on bounded spaces where many of the usual assumptions and properties of score matching no longer hold. To this end, we develop a formal framework for score matching on finite point processes via Janossy measures and, within this framework, introduce an (autoregressive) weighted score-matching estimator, whose statistical properties we analyze in classical parametric settings. For general nonparametric (e.g., deep) point process models, we show that score matching alone does not uniquely identify the ground-truth distribution due to subtle normalization issues, and we propose a simple survival-classification augmentation that yields a complete, integration-free training objective for any intensity-based point process model for spatio-temporal case. Experiments on synthetic and real-world temporal and spatio-temporal datasets, demonstrate that our method accurately recovers intensities and achieves performance comparable to MLE with better efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04635",
        "abs_url": "https://arxiv.org/abs/2512.04635",
        "pdf_url": "https://arxiv.org/pdf/2512.04635",
        "title": "Federated Learning for Anomaly Detection in Maritime Movement Data",
        "authors": [
            "Anita Graser",
            "Axel Weißenfeld",
            "Clemens Heistracher",
            "Melitta Dragaschnig",
            "Peter Widhalm"
        ],
        "comments": "Accepted at MDM2024",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper introduces M3fed, a novel solution for federated learning of movement anomaly detection models. This innovation has the potential to improve data privacy and reduce communication costs in machine learning for movement anomaly detection. We present the novel federated learning (FL) strategies employed to train M3fed, perform an example experiment with maritime AIS data, and evaluate the results with respect to communication costs and FL model quality by comparing classic centralized M3 and the new federated M3fed.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04644",
        "abs_url": "https://arxiv.org/abs/2512.04644",
        "pdf_url": "https://arxiv.org/pdf/2512.04644",
        "title": "Contract-Governed Training for Earth Observation: Observed Service Agreement Graphs and Coverage-Accuracy Trade-offs",
        "authors": [
            "Wenzhang Du"
        ],
        "comments": "9 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Earth observation (EO) models are frequently trained under implicit sampling policies that optimize global accuracy but provide no explicit guarantees on who (which regions, classes, or mission-critical strata) is being served throughout training. This paper introduces a contract-governed training paradigm for EO in which training samples are grouped into service contracts -- semantically meaningful units such as (dataset, region, rare-crop indicator) -- and each contract is assigned a target service share. We instantiate this paradigm as an Observed Service Agreement Graph (OSAG), a lightweight governance layer that (i) monitors contract-level exposure (coverage) during optimization, (ii) drives empirical coverage toward target shares via contract-normalized sampling weights, and (iii) exposes explicit accuracy-governance trade-offs through two knobs: a sampling mixture coefficient alpha and a contract-regularization weight lambda_C. We provide a compact theory in a toy setting: OSAG sampling concentrates empirical coverage to targets; coverage deviations upper-bound service-risk deviations; and contract design (coarse vs. fine) modulates governance cost. Experiments on AVIRIS hyperspectral scenes (Indian Pines plus Salinas) and multispectral Sentinel-2 EuroSAT demonstrate that OSAG can substantially reduce priority coverage error while maintaining global accuracy and improving high-priority accuracy. A EuroSAT coarse-vs-fine contract ablation further evidences how semantically refined contracts can reduce the accuracy cost per unit of governance improvement.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04695",
        "abs_url": "https://arxiv.org/abs/2512.04695",
        "pdf_url": "https://arxiv.org/pdf/2512.04695",
        "title": "TRINITY: An Evolved LLM Coordinator",
        "authors": [
            "Jinglue Xu",
            "Qi Sun",
            "Peter Schwendeman",
            "Stefan Nielsen",
            "Edoardo Cetin",
            "Yujin Tang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Combining diverse foundation models is promising, but weight-merging is limited by mismatched architectures and closed APIs. Trinity addresses this with a lightweight coordinator that orchestrates collaboration among large language models (LLMs). The coordinator, comprising a compact language model (approximately $0.6$B parameters) and a lightweight head (approximately $10$K parameters), is optimized with an evolutionary strategy for efficient and adaptive delegation. Trinity processes queries over multiple turns, where at each turn the coordinator assigns one of three roles (Thinker, Worker, or Verifier) to a selected LLM, effectively offloading complex skill acquisition from the coordinator itself. Experiments show that Trinity consistently outperforms individual models and existing methods across coding, math, reasoning, and domain knowledge tasks, and generalizes robustly to out-of-distribution tasks. On standard benchmarks, Trinity achieves state-of-the-art results, including a score of 86.2% on LiveCodeBench. Theoretical and empirical analyses identify two main factors behind this performance: (1) the coordinator's hidden-state representations provide rich contextualization of inputs, and (2) under high dimensionality and strict budget constraints, the separable Covariance Matrix Adaptation Evolution Strategy offers advantages over reinforcement learning, imitation learning, and random search by exploiting potential block-epsilon-separability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04703",
        "abs_url": "https://arxiv.org/abs/2512.04703",
        "pdf_url": "https://arxiv.org/pdf/2512.04703",
        "title": "Towards Continuous-Time Approximations for Stochastic Gradient Descent without Replacement",
        "authors": [
            "Stefan Perko"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Probability (math.PR)",
        "abstract": "Gradient optimization algorithms using epochs, that is those based on stochastic gradient descent without replacement (SGDo), are predominantly used to train machine learning models in practice. However, the mathematical theory of SGDo and related algorithms remain underexplored compared to their \"with replacement\" and \"one-pass\" counterparts. In this article, we propose a stochastic, continuous-time approximation to SGDo with additive noise based on a Young differential equation driven by a stochastic process we call an \"epoched Brownian motion\". We show its usefulness by proving the almost sure convergence of the continuous-time approximation for strongly convex objectives and learning rate schedules of the form $u_t = \\frac{1}{(1+t)^\\beta}, \\beta \\in (0,1)$. Moreover, we compute an upper bound on the asymptotic rate of almost sure convergence, which is as good or better than previous results for SGDo.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04747",
        "abs_url": "https://arxiv.org/abs/2512.04747",
        "pdf_url": "https://arxiv.org/pdf/2512.04747",
        "title": "A Tutorial on Regression Analysis: From Linear Models to Deep Learning -- Lecture Notes on Artificial Intelligence",
        "authors": [
            "Jingyuan Wang",
            "Jiahao Ji"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This article serves as the regression analysis lecture notes in the Intelligent Computing course cluster (including the courses of Artificial Intelligence, Data Mining, Machine Learning, and Pattern Recognition). It aims to provide students -- who are assumed to possess only basic university-level mathematics (i.e., with prerequisite courses in calculus, linear algebra, and probability theory) -- with a comprehensive and self-contained understanding of regression analysis without requiring any additional references. The lecture notes systematically introduce the fundamental concepts, modeling components, and theoretical foundations of regression analysis, covering linear regression, logistic regression, multinomial logistic regression, polynomial regression, basis-function models, kernel-based methods, and neural-network-based nonlinear regression. Core methodological topics include loss-function design, parameter-estimation principles, ordinary least squares, gradient-based optimization algorithms and their variants, as well as regularization techniques such as Ridge and LASSO regression. Through detailed mathematical derivations, illustrative examples, and intuitive visual explanations, the materials help students understand not only how regression models are constructed and optimized, but also how they reveal the underlying relationships between features and response variables. By bridging classical statistical modeling and modern machine-learning practice, these lecture notes aim to equip students with a solid conceptual and technical foundation for further study in advanced artificial intelligence models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04752",
        "abs_url": "https://arxiv.org/abs/2512.04752",
        "pdf_url": "https://arxiv.org/pdf/2512.04752",
        "title": "RLHFSpec: Breaking the Efficiency Bottleneck in RLHF Training via Adaptive Drafting",
        "authors": [
            "Siqi Wang",
            "Hailong Yang",
            "Junjie Zhu",
            "Xuezhu Wang",
            "Yufan Xu",
            "Depei Qian"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reinforcement Learning from Human Feedback (RLHF) is an important fine-tuning technique for large language models (LLMs) and comprises three stages: generation, inference, and training. The generation stage generates samples that are then used to infer learnable experiences for training. We observe that the generation stage is the bottleneck of the entire execution process and consider it a key point for optimization. Specifically, we realize the first attempt to integrate speculative decoding into the RLHF generation stage and propose RLHFSpec, an RLHF system that accelerates generation execution with adaptive speculative decoding and sample reallocation. To fully exploit the performance potential provided by speculative decoding, especially dealing with the dynamic workload of the generation stage, RLHFSpec proposes a workload-aware drafting strategy selection mechanism, which selects the near-optimal strategy by jointly considering the verification cost and the number of accepted tokens. Moreover, RLHFSpec also proposes sample reallocation to fully utilize the GPU resources, and optimizes it with an efficient sample migration mechanism. The experimental results show that the RLHFSpec can achieve higher throughput in the generation stage compared to state-of-the-art works. Moreover, due to the effective alleviation of the generation bottleneck, RLHFSpec also shows significant performance speedup in the entire RLHF execution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04912",
        "abs_url": "https://arxiv.org/abs/2512.04912",
        "pdf_url": "https://arxiv.org/pdf/2512.04912",
        "title": "A result relating convex n-widths to covering numbers with some applications to neural networks",
        "authors": [
            "Jonathan Baxter",
            "Peter Bartlett"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In general, approximating classes of functions defined over high-dimensional input spaces by linear combinations of a fixed set of basis functions or ``features'' is known to be hard. Typically, the worst-case error of the best basis set decays only as fast as $\\Theta\\(n^{-1/d}\\)$, where $n$ is the number of basis functions and $d$ is the input dimension. However, there are many examples of high-dimensional pattern recognition problems (such as face recognition) where linear combinations of small sets of features do solve the problem well. Hence these function classes do not suffer from the ``curse of dimensionality'' associated with more general classes. It is natural then, to look for characterizations of high-dimensional function classes that nevertheless are approximated well by linear combinations of small sets of features. In this paper we give a general result relating the error of approximation of a function class to the covering number of its ``convex core''. For one-hidden-layer neural networks, covering numbers of the class of functions computed by a single hidden node upper bound the covering numbers of the convex core. Hence, using standard results we obtain upper bounds on the approximation rate of neural network classes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04918",
        "abs_url": "https://arxiv.org/abs/2512.04918",
        "pdf_url": "https://arxiv.org/pdf/2512.04918",
        "title": "Multi-Agent Reinforcement Learning for Intraday Operating Rooms Scheduling under Uncertainty",
        "authors": [
            "Kailiang Liu",
            "Ying Chen",
            "Ralf Borndörfer",
            "Thorsten Koch"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Intraday surgical scheduling is a multi-objective decision problem under uncertainty-balancing elective throughput, urgent and emergency demand, delays, sequence-dependent setups, and overtime. We formulate the problem as a cooperative Markov game and propose a multi-agent reinforcement learning (MARL) framework in which each operating room (OR) is an agent trained with centralized training and decentralized execution. All agents share a policy trained via Proximal Policy Optimization (PPO), which maps rich system states to actions, while a within-epoch sequential assignment protocol constructs conflict-free joint schedules across ORs. A mixed-integer pre-schedule provides reference starting times for electives; we impose type-specific quadratic delay penalties relative to these references and a terminal overtime penalty, yielding a single reward that captures throughput, timeliness, and staff workload. In simulations reflecting a realistic hospital mix (six ORs, eight surgery types, random urgent and emergency arrivals), the learned policy outperforms six rule-based heuristics across seven metrics and three evaluation subsets, and, relative to an ex post MIP oracle, quantifies optimality gaps. Policy analytics reveal interpretable behavior-prioritizing emergencies, batching similar cases to reduce setups, and deferring lower-value electives. We also derive a suboptimality bound for the sequential decomposition under simplifying assumptions. We discuss limitations-including OR homogeneity and the omission of explicit staffing constraints-and outline extensions. Overall, the approach offers a practical, interpretable, and tunable data-driven complement to optimization for real-time OR scheduling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04954",
        "abs_url": "https://arxiv.org/abs/2512.04954",
        "pdf_url": "https://arxiv.org/pdf/2512.04954",
        "title": "Amortized Inference of Multi-Modal Posteriors using Likelihood-Weighted Normalizing Flows",
        "authors": [
            "Rajneil Baruah"
        ],
        "comments": "14 pages, 8 figures",
        "subjects": "Machine Learning (cs.LG); High Energy Physics - Experiment (hep-ex); High Energy Physics - Phenomenology (hep-ph); Computational Physics (physics.comp-ph); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "We present a novel technique for amortized posterior estimation using Normalizing Flows trained with likelihood-weighted importance sampling. This approach allows for the efficient inference of theoretical parameters in high-dimensional inverse problems without the need for posterior training samples. We implement the method on multi-modal benchmark tasks in 2D and 3D to check for the efficacy. A critical observation of our study is the impact of the topology of the base distributions on the modelled posteriors. We find that standard unimodal base distributions fail to capture disconnected support, resulting in spurious probability bridges between modes. We demonstrate that initializing the flow with a Gaussian Mixture Model that matches the cardinality of the target modes significantly improves reconstruction fidelity, as measured by some distance and divergence metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04974",
        "abs_url": "https://arxiv.org/abs/2512.04974",
        "pdf_url": "https://arxiv.org/pdf/2512.04974",
        "title": "Efficient Generative Transformer Operators For Million-Point PDEs",
        "authors": [
            "Armand Kassaï Koupaï",
            "Lise Le Boudec",
            "Patrick Gallinari"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce ECHO, a transformer-operator framework for generating million-point PDE trajectories. While existing neural operators (NOs) have shown promise for solving partial differential equations, they remain limited in practice due to poor scalability on dense grids, error accumulation during dynamic unrolling, and task-specific design. ECHO addresses these challenges through three key innovations. (i) It employs a hierarchical convolutional encode-decode architecture that achieves a 100 $\\times$ spatio-temporal compression while preserving fidelity on mesh points. (ii) It incorporates a training and adaptation strategy that enables high-resolution PDE solution generation from sparse input grids. (iii) It adopts a generative modeling paradigm that learns complete trajectory segments, mitigating long-horizon error drift. The training strategy decouples representation learning from downstream task supervision, allowing the model to tackle multiple tasks such as trajectory generation, forward and inverse problems, and interpolation. The generative model further supports both conditional and unconditional generation. We demonstrate state-of-the-art performance on million-point simulations across diverse PDE systems featuring complex geometries, high-frequency dynamics, and long-term horizons.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05030",
        "abs_url": "https://arxiv.org/abs/2512.05030",
        "pdf_url": "https://arxiv.org/pdf/2512.05030",
        "title": "Dual-Path Region-Guided Attention Network for Ground Reaction Force and Moment Regression",
        "authors": [
            "Xuan Li",
            "Samuel Bello"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Accurate estimation of three-dimensional ground reaction forces and moments (GRFs/GRMs) is crucial for both biomechanics research and clinical rehabilitation evaluation. In this study, we focus on insole-based GRF/GRM estimation and further validate our approach on a public walking dataset. We propose a Dual-Path Region-Guided Attention Network that integrates anatomy-inspired spatial priors and temporal priors into a region-level attention mechanism, while a complementary path captures context from the full sensor field. The two paths are trained jointly and their outputs are combined to produce the final GRF/GRM predictions. Conclusions: Our model outperforms strong baseline models, including CNN and CNN-LSTM architectures on two datasets, achieving the lowest six-component average NRMSE of 5.78% on the insole dataset and 1.42% for the vertical ground reaction force on the public dataset. This demonstrates robust performance for ground reaction force and moment estimation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05038",
        "abs_url": "https://arxiv.org/abs/2512.05038",
        "pdf_url": "https://arxiv.org/pdf/2512.05038",
        "title": "SuperActivators: Only the Tail of the Distribution Contains Reliable Concept Signals",
        "authors": [
            "Cassandra Goldberg",
            "Chaehyeon Kim",
            "Adam Stein",
            "Eric Wong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Concept vectors aim to enhance model interpretability by linking internal representations with human-understandable semantics, but their utility is often limited by noisy and inconsistent activations. In this work, we uncover a clear pattern within the noise, which we term the SuperActivator Mechanism: while in-concept and out-of-concept activations overlap considerably, the token activations in the extreme high tail of the in-concept distribution provide a reliable signal of concept presence. We demonstrate the generality of this mechanism by showing that SuperActivator tokens consistently outperform standard vector-based and prompting concept detection approaches, achieving up to a 14% higher F1 score across image and text modalities, model architectures, model layers, and concept extraction techniques. Finally, we leverage SuperActivator tokens to improve feature attributions for concepts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05069",
        "abs_url": "https://arxiv.org/abs/2512.05069",
        "pdf_url": "https://arxiv.org/pdf/2512.05069",
        "title": "Hybrid Quantum-Classical Autoencoders for Unsupervised Network Intrusion Detection",
        "authors": [
            "Mohammad Arif Rasyidi",
            "Omar Alhussein",
            "Sami Muhaidat",
            "Ernesto Damiani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR); Quantum Physics (quant-ph)",
        "abstract": "Unsupervised anomaly-based intrusion detection requires models that can generalize to attack patterns not observed during training. This work presents the first large-scale evaluation of hybrid quantum-classical (HQC) autoencoders for this task. We construct a unified experimental framework that iterates over key quantum design choices, including quantum-layer placement, measurement approach, variational and non-variational formulations, and latent-space regularization. Experiments across three benchmark NIDS datasets show that HQC autoencoders can match or exceed classical performance in their best configurations, although they exhibit higher sensitivity to architectural decisions. Under zero-day evaluation, well-configured HQC models provide stronger and more stable generalization than classical and supervised baselines. Simulated gate-noise experiments reveal early performance degradation, indicating the need for noise-aware HQC designs. These results provide the first data-driven characterization of HQC autoencoder behavior for network intrusion detection and outline key factors that govern their practical viability. All experiment code and configurations are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05080",
        "abs_url": "https://arxiv.org/abs/2512.05080",
        "pdf_url": "https://arxiv.org/pdf/2512.05080",
        "title": "OMTRA: A Multi-Task Generative Model for Structure-Based Drug Design",
        "authors": [
            "Ian Dunn",
            "Liv Toft",
            "Tyler Katz",
            "Juhi Gupta",
            "Riya Shah",
            "Ramith Hettiarachchi",
            "David R. Koes"
        ],
        "comments": "Presented at the Machine Learning for Structural Biology Workshop, 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Structure-based drug design (SBDD) focuses on designing small-molecule ligands that bind to specific protein pockets. Computational methods are integral in modern SBDD workflows and often make use of virtual screening methods via docking or pharmacophore search. Modern generative modeling approaches have focused on improving novel ligand discovery by enabling de novo design. In this work, we recognize that these tasks share a common structure and can therefore be represented as different instantiations of a consistent generative modeling framework. We propose a unified approach in OMTRA, a multi-modal flow matching model that flexibly performs many tasks relevant to SBDD, including some with no analogue in conventional workflows. Additionally, we curate a dataset of 500M 3D molecular conformers, complementing protein-ligand data and expanding the chemical diversity available for training. OMTRA obtains state of the art performance on pocket-conditioned de novo design and docking; however, the effects of large-scale pretraining and multi-task training are modest. All code, trained models, and dataset for reproducing this work are available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05084",
        "abs_url": "https://arxiv.org/abs/2512.05084",
        "pdf_url": "https://arxiv.org/pdf/2512.05084",
        "title": "Gradient Descent with Provably Tuned Learning-rate Schedules",
        "authors": [
            "Dravyansh Sharma"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Gradient-based iterative optimization methods are the workhorse of modern machine learning. They crucially rely on careful tuning of parameters like learning rate and momentum. However, one typically sets them using heuristic approaches without formal near-optimality guarantees. Recent work by Gupta and Roughgarden studies how to learn a good step-size in gradient descent. However, like most of the literature with theoretical guarantees for gradient-based optimization, their results rely on strong assumptions on the function class including convexity and smoothness which do not hold in typical applications. In this work, we develop novel analytical tools for provably tuning hyperparameters in gradient-based algorithms that apply to non-convex and non-smooth functions. We obtain matching sample complexity bounds for learning the step-size in gradient descent shown for smooth, convex functions in prior work (up to logarithmic factors) but for a much broader class of functions. Our analysis applies to gradient descent on neural networks with commonly used activation functions (including ReLU, sigmoid and tanh). We extend our framework to tuning multiple hyperparameters, including tuning the learning rate schedule, simultaneously tuning momentum and step-size, and pre-training the initialization vector. Our approach can be used to bound the sample complexity for minimizing both the validation loss as well as the number of gradient descent iterations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05089",
        "abs_url": "https://arxiv.org/abs/2512.05089",
        "pdf_url": "https://arxiv.org/pdf/2512.05089",
        "title": "The Geometry of Intelligence: Deterministic Functional Topology as a Foundation for Real-World Perception",
        "authors": [
            "Eduardo Di Santi"
        ],
        "comments": "35 pages, 6 figures. This preprint develops a deterministic functional-topological framework showing that physical systems generate compact perceptual manifolds with finite radius. We provide theory, Monte-Carlo estimators, and validation across PM, battery, and ECG domains, unifying biological perception and self-supervised AI",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Real-world physical processes do not generate arbitrary variability: their signals concentrate on compact and low-variability subsets of functional space. This geometric structure enables rapid generalization from a few examples in both biological and artificial systems. This work develops a deterministic functional-topological framework in which the set of valid realizations of a physical phenomenon forms a compact perceptual manifold with stable invariants and a finite Hausdorff radius. We show that the boundaries of this manifold can be discovered in a fully self-supervised manner through Monte Carlo sampling, even when the governing equations of the system are unknown. We provide theoretical guarantees, practical estimators of knowledge boundaries, and empirical validations across three domains: electromechanical railway point machines, electrochemical battery discharge curves, and physiological ECG signals. Our results demonstrate that deterministic functional topology offers a unified mathematical foundation for perception, representation, and world-model construction, explaining why biological learners and self-supervised AI models can generalize from limited observations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05114",
        "abs_url": "https://arxiv.org/abs/2512.05114",
        "pdf_url": "https://arxiv.org/pdf/2512.05114",
        "title": "Deep infant brain segmentation from multi-contrast MRI",
        "authors": [
            "Malte Hoffmann",
            "Lilla Zöllei",
            "Adrian V. Dalca"
        ],
        "comments": "8 pages, 8 figures, 1 table, website at this https URL, presented at the 2025 IEEE Asilomar Conference on Signals, Systems, and Computers",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV); Image and Video Processing (eess.IV)",
        "abstract": "Segmentation of magnetic resonance images (MRI) facilitates analysis of human brain development by delineating anatomical structures. However, in infants and young children, accurate segmentation is challenging due to development and imaging constraints. Pediatric brain MRI is notoriously difficult to acquire, with inconsistent availability of imaging modalities, substantial non-head anatomy in the field of view, and frequent motion artifacts. This has led to specialized segmentation models that are often limited to specific image types or narrow age groups, or that are fragile for more variable images such as those acquired clinically. We address this method fragmentation with BabySeg, a deep learning brain segmentation framework for infants and young children that supports diverse MRI protocols, including repeat scans and image types unavailable during training. Our approach builds on recent domain randomization techniques, which synthesize training images far beyond realistic bounds to promote dataset shift invariance. We also describe a mechanism that enables models to flexibly pool and interact features from any number of input scans. We demonstrate state-of-the-art performance that matches or exceeds the accuracy of several existing methods for various age cohorts and input configurations using a single model, in a fraction of the runtime required by many existing tools.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05117",
        "abs_url": "https://arxiv.org/abs/2512.05117",
        "pdf_url": "https://arxiv.org/pdf/2512.05117",
        "title": "The Universal Weight Subspace Hypothesis",
        "authors": [
            "Prakhar Kaushik",
            "Shravan Chaudhari",
            "Ankit Vaidya",
            "Rama Chellappa",
            "Alan Yuille"
        ],
        "comments": "37 pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "We show that deep neural networks trained across diverse tasks exhibit remarkably similar low-dimensional parametric subspaces. We provide the first large-scale empirical evidence that demonstrates that neural networks systematically converge to shared spectral subspaces regardless of initialization, task, or domain. Through mode-wise spectral analysis of over 1100 models - including 500 Mistral-7B LoRAs, 500 Vision Transformers, and 50 LLaMA-8B models - we identify universal subspaces capturing majority variance in just a few principal directions. By applying spectral decomposition techniques to the weight matrices of various architectures trained on a wide range of tasks and datasets, we identify sparse, joint subspaces that are consistently exploited, within shared architectures across diverse tasks and datasets. Our findings offer new insights into the intrinsic organization of information within deep networks and raise important questions about the possibility of discovering these universal subspaces without the need for extensive data and computational resources. Furthermore, this inherent structure has significant implications for model reusability, multi-task learning, model merging, and the development of training and inference-efficient algorithms, potentially reducing the carbon footprint of large-scale neural models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04113",
        "abs_url": "https://arxiv.org/abs/2512.04113",
        "pdf_url": "https://arxiv.org/pdf/2512.04113",
        "title": "AI-Enabled grading with near-domain data for scaling feedback with human-level accuracy",
        "authors": [
            "Shyam Agarwal",
            "Ali Moghimi",
            "Kevin C. Haudek"
        ],
        "comments": "",
        "subjects": "Computers and Society (cs.CY); Artificial Intelligence (cs.AI); Human-Computer Interaction (cs.HC); Machine Learning (cs.LG)",
        "abstract": "Constructed-response questions are crucial to encourage generative processing and test a learner's understanding of core concepts. However, the limited availability of instructor time, large class sizes, and other resource constraints pose significant challenges in providing timely and detailed evaluation, which is crucial for a holistic educational experience. In addition, providing timely and frequent assessments is challenging since manual grading is labor intensive, and automated grading is complex to generalize to every possible response scenario. This paper proposes a novel and practical approach to grade short-answer constructed-response questions. We discuss why this problem is challenging, define the nature of questions on which our method works, and finally propose a framework that instructors can use to evaluate their students' open-responses, utilizing near-domain data like data from similar questions administered in previous years. The proposed method outperforms the state of the art machine learning models as well as non-fine-tuned large language models like GPT 3.5, GPT 4, and GPT 4o by a considerable margin of over 10-20% in some cases, even after providing the LLMs with reference/model answers. Our framework does not require pre-written grading rubrics and is designed explicitly with practical classroom settings in mind. Our results also reveal exciting insights about learning from near-domain data, including what we term as accuracy and data advantages using human-labeled data, and we believe this is the first work to formalize the problem of automated short answer grading based on the near-domain data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04118",
        "abs_url": "https://arxiv.org/abs/2512.04118",
        "pdf_url": "https://arxiv.org/pdf/2512.04118",
        "title": "Patient Safety Risks from AI Scribes: Signals from End-User Feedback",
        "authors": [
            "Jessica Dai",
            "Anwen Huang",
            "Catherine Nasrallah",
            "Rhiannon Croci",
            "Hossein Soleimani",
            "Sarah J. Pollet",
            "Julia Adler-Milstein",
            "Sara G. Murray",
            "Jinoos Yazdany",
            "Irene Y. Chen"
        ],
        "comments": "ML4H Findings 2025",
        "subjects": "Computers and Society (cs.CY); Machine Learning (cs.LG)",
        "abstract": "AI scribes are transforming clinical documentation at scale. However, their real-world performance remains understudied, especially regarding their impacts on patient safety. To this end, we initiate a mixed-methods study of patient safety issues raised in feedback submitted by AI scribe users (healthcare providers) in a large U.S. hospital system. Both quantitative and qualitative analysis suggest that AI scribes may induce various patient safety risks due to errors in transcription, most significantly regarding medication and treatment; however, further study is needed to contextualize the absolute degree of risk.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04149",
        "abs_url": "https://arxiv.org/abs/2512.04149",
        "pdf_url": "https://arxiv.org/pdf/2512.04149",
        "title": "Enhancing next token prediction based pre-training for jet foundation models",
        "authors": [
            "Joschka Birk",
            "Anna Hallin",
            "Gregor Kasieczka",
            "Nikol Madzharova",
            "Ian Pang",
            "David Shih"
        ],
        "comments": "",
        "subjects": "High Energy Physics - Phenomenology (hep-ph); Machine Learning (cs.LG); High Energy Physics - Experiment (hep-ex); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "Next token prediction is an attractive pre-training task for jet foundation models, in that it is simulation free and enables excellent generative capabilities that can transfer across datasets. Here we study multiple improvements to next token prediction, building on the initial work of OmniJet-$\\alpha$. Instead of tokenizing particles and subsequently only using the token-ID as the model input for both the generative and the classification task, we adopt a hybrid setup, which allows us to use continuous feature vectors as model input while only using token-IDs in the next token prediction target. Secondly, we explore a combined pre-training strategy that combines masked particle modeling and generative learning objectives. Taken together, these changes greatly improve the performance in downstream classification tasks without any loss in generative performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04257",
        "abs_url": "https://arxiv.org/abs/2512.04257",
        "pdf_url": "https://arxiv.org/pdf/2512.04257",
        "title": "Computational Linguistics Meets Libyan Dialect: A Study on Dialect Identification",
        "authors": [
            "Mansour Essgaer",
            "Khamis Massud",
            "Rabia Al Mamlook",
            "Najah Ghmaid"
        ],
        "comments": "13 pages, 8 figures",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "This study investigates logistic regression, linear support vector machine, multinomial Naive Bayes, and Bernoulli Naive Bayes for classifying Libyan dialect utterances gathered from Twitter. The dataset used is the QADI corpus, which consists of 540,000 sentences across 18 Arabic dialects. Preprocessing challenges include handling inconsistent orthographic variations and non-standard spellings typical of the Libyan dialect. The chi-square analysis revealed that certain features, such as email mentions and emotion indicators, were not significantly associated with dialect classification and were thus excluded from further analysis. Two main experiments were conducted: (1) evaluating the significance of meta-features extracted from the corpus using the chi-square test and (2) assessing classifier performance using different word and character n-gram representations. The classification experiments showed that Multinomial Naive Bayes (MNB) achieved the highest accuracy of 85.89% and an F1-score of 0.85741 when using a (1,2) word n-gram and (1,5) character n-gram representation. In contrast, Logistic Regression and Linear SVM exhibited slightly lower performance, with maximum accuracies of 84.41% and 84.73%, respectively. Additional evaluation metrics, including log loss, Cohen kappa, and Matthew correlation coefficient, further supported the effectiveness of MNB in this task. The results indicate that carefully selected n-gram representations and classification models play a crucial role in improving the accuracy of Libyan dialect identification. This study provides empirical benchmarks and insights for future research in Arabic dialect NLP applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04263",
        "abs_url": "https://arxiv.org/abs/2512.04263",
        "pdf_url": "https://arxiv.org/pdf/2512.04263",
        "title": "Polynomiogram: An Integrated Framework for Root Visualization and Generative Art",
        "authors": [
            "Hoang Duc Nguyen",
            "Anh Van Pham",
            "Hien D. Nguyen"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG); Mathematical Software (cs.MS)",
        "abstract": "This work presents the Polynomiogram framework, an integrated computational platform for exploring, visualizing, and generating art from polynomial root systems. The main innovation is a flexible sampling scheme in which two independent parameters are drawn from user defined domains and mapped to the polynomial coefficients through a generating function. This design allows the same mathematical foundation to support both scientific investigation and generative algorithmic art. The framework integrates two complementary numerical engines: NumPy companion matrix solver for fast, large scale computation and MPSolve for high precision, scientifically rigorous validation. This dual architecture enables efficient visualization for creative use and accurate computation for research and education. Numerical accuracy was verified using classical ensembles, including the Kac and Lucas polynomials. The method was applied to the cubic polynomial system to analyze its bifurcation structure, demonstrating its value as both a scientific tool for exploring root phenomena and an educational aid for visualizing fundamental concepts in algebra and dynamical systems. Beyond analysis, the Polynomiogram also demonstrated its potential as a tool for personalized generative art. Examples include the use of the platform to generate a natural form resembling a hibiscus flower and to create personalized artwork expressing gratitude toward advances in artificial intelligence and large language models through a tribute composition.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04282",
        "abs_url": "https://arxiv.org/abs/2512.04282",
        "pdf_url": "https://arxiv.org/pdf/2512.04282",
        "title": "Inference-time Stochastic Refinement of GRU-Normalizing Flow for Real-time Video Motion Transfer",
        "authors": [
            "Tasmiah Haque",
            "Srinjoy Das"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Real-time video motion transfer applications such as immersive gaming and vision-based anomaly detection require accurate yet diverse future predictions to support realistic synthesis and robust downstream decision making under uncertainty. To improve the diversity of such sequential forecasts we propose a novel inference-time refinement technique that combines Gated Recurrent Unit-Normalizing Flows (GRU-NF) with stochastic sampling methods. While GRU-NF can capture multimodal distributions through its integration of normalizing flows within a temporal forecasting framework, its deterministic transformation structure can limit expressivity. To address this, inspired by Stochastic Normalizing Flows (SNF), we introduce Markov Chain Monte Carlo (MCMC) steps during GRU-NF inference, enabling the model to explore a richer output space and better approximate the true data distribution without retraining. We validate our approach in a keypoint-based video motion transfer pipeline, where capturing temporally coherent and perceptually diverse future trajectories is essential for realistic samples and low bandwidth communication. Experiments show that our inference framework, Gated Recurrent Unit- Stochastic Normalizing Flows (GRU-SNF) outperforms GRU-NF in generating diverse outputs without sacrificing accuracy, even under longer prediction horizons. By injecting stochasticity during inference, our approach captures multimodal behavior more effectively. These results highlight the potential of integrating stochastic dynamics with flow-based sequence models for generative time series forecasting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04323",
        "abs_url": "https://arxiv.org/abs/2512.04323",
        "pdf_url": "https://arxiv.org/pdf/2512.04323",
        "title": "Bayes-DIC Net: Estimating Digital Image Correlation Uncertainty with Bayesian Neural Networks",
        "authors": [
            "Biao Chen",
            "Zhenhua Lei",
            "Yahui Zhang",
            "Tongzhi Niu"
        ],
        "comments": "17 pages, 8 figures",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG)",
        "abstract": "This paper introduces a novel method for generating high-quality Digital Image Correlation (DIC) dataset based on non-uniform B-spline surfaces. By randomly generating control point coordinates, we construct displacement fields that encompass a variety of realistic displacement scenarios, which are subsequently used to generate speckle pattern datasets. This approach enables the generation of a large-scale dataset that capture real-world displacement field situations, thereby enhancing the training and generalization capabilities of deep learning-based DIC algorithms. Additionally, we propose a novel network architecture, termed Bayes-DIC Net, which extracts information at multiple levels during the down-sampling phase and facilitates the aggregation of information across various levels through a single skip connection during the up-sampling phase. Bayes-DIC Net incorporates a series of lightweight convolutional blocks designed to expand the receptive field and capture rich contextual information while minimizing computational costs. Furthermore, by integrating appropriate dropout modules into Bayes-DIC Net and activating them during the network inference stage, Bayes-DIC Net is transformed into a Bayesian neural network. This transformation allows the network to provide not only predictive results but also confidence levels in these predictions when processing real unlabeled datasets. This feature significantly enhances the practicality and reliability of our network in real-world displacement field prediction tasks. Through these innovations, this paper offers new perspectives and methods for dataset generation and algorithm performance enhancement in the field of DIC.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04338",
        "abs_url": "https://arxiv.org/abs/2512.04338",
        "pdf_url": "https://arxiv.org/pdf/2512.04338",
        "title": "One Detector Fits All: Robust and Adaptive Detection of Malicious Packages from PyPI to Enterprises",
        "authors": [
            "Biagio Montaruli",
            "Luca Compagna",
            "Serena Elisa Ponta",
            "Davide Balzarotti"
        ],
        "comments": "Proceedings of the 2025 Annual Computer Security Applications Conference (ACSAC' 25), December 8-12, 2025, Honolulu, Hawaii, USA",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "The rise of supply chain attacks via malicious Python packages demands robust detection solutions. Current approaches, however, overlook two critical challenges: robustness against adversarial source code transformations and adaptability to the varying false positive rate (FPR) requirements of different actors, from repository maintainers (requiring low FPR) to enterprise security teams (higher FPR tolerance). We introduce a robust detector capable of seamless integration into both public repositories like PyPI and enterprise ecosystems. To ensure robustness, we propose a novel methodology for generating adversarial packages using fine-grained code obfuscation. Combining these with adversarial training (AT) enhances detector robustness by 2.5x. We comprehensively evaluate AT effectiveness by testing our detector against 122,398 packages collected daily from PyPI over 80 days, showing that AT needs careful application: it makes the detector more robust to obfuscations and allows finding 10% more obfuscated packages, but slightly decreases performance on non-obfuscated packages. We demonstrate production adaptability of our detector via two case studies: (i) one for PyPI maintainers (tuned at 0.1% FPR) and (ii) one for enterprise teams (tuned at 10% FPR). In the former, we analyze 91,949 packages collected from PyPI over 37 days, achieving a daily detection rate of 2.48 malicious packages with only 2.18 false positives. In the latter, we analyze 1,596 packages adopted by a multinational software company, obtaining only 1.24 false positives daily. These results show that our detector can be seamlessly integrated into both public repositories like PyPI and enterprise ecosystems, ensuring a very low time budget of a few minutes to review the false positives. Overall, we uncovered 346 malicious packages, now reported to the community.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04368",
        "abs_url": "https://arxiv.org/abs/2512.04368",
        "pdf_url": "https://arxiv.org/pdf/2512.04368",
        "title": "AutoGuard: A Self-Healing Proactive Security Layer for DevSecOps Pipelines Using Reinforcement Learning",
        "authors": [
            "Praveen Anugula",
            "Avdhesh Kumar Bhardwaj",
            "Navin Chhibber",
            "Rohit Tewari",
            "Sunil Khemka",
            "Piyush Ranjan"
        ],
        "comments": "Accepted and Presented at 1st IEEE Uttar Pradesh Section Women in Engineering International Conference on Electrical Electronics and Computer Engineering (UPWIECON 2025) organized by NIELIT Dehradun held during 30th 31st October 2025",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Performance (cs.PF)",
        "abstract": "Contemporary DevSecOps pipelines have to deal with the evolution of security in an ever-continuously integrated and deployed environment. Existing methods,such as rule-based intrusion detection and static vulnerability scanning, are inadequate and unreceptive to changes in the system, causing longer response times and organization needs exposure to emerging attack vectors. In light of the previous constraints, we introduce AutoGuard to the DevSecOps ecosystem, a reinforcement learning (RL)-powered self-healing security framework built to pre-emptively protect DevSecOps environments. AutoGuard is a self-securing security environment that continuously observes pipeline activities for potential anomalies while preemptively remediating the environment. The model observes and reacts based on a policy that is continually learned dynamically over time. The RL agent improves each action over time through reward-based learning aimed at improving the agent's ability to prevent, detect and respond to a security incident in real-time. Testing using simulated ContinuousIntegration / Continuous Deployment (CI/CD) environments showed AutoGuard to successfully improve threat detection accuracy by 22%, reduce mean time torecovery (MTTR) for incidents by 38% and increase overall resilience to incidents as compared to traditional methods. Keywords- DevSecOps, Reinforcement Learning, Self- Healing Security, Continuous Integration, Automated Threat Mitigation",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04371",
        "abs_url": "https://arxiv.org/abs/2512.04371",
        "pdf_url": "https://arxiv.org/pdf/2512.04371",
        "title": "Constructive Approximation under Carleman's Condition, with Applications to Smoothed Analysis",
        "authors": [
            "Frederic Koehler",
            "Beining Wu"
        ],
        "comments": "",
        "subjects": "Probability (math.PR); Machine Learning (cs.LG); Functional Analysis (math.FA); Statistics Theory (math.ST); Machine Learning (stat.ML)",
        "abstract": "A classical result of Carleman, based on the theory of quasianalytic functions, shows that polynomials are dense in $L^2(\\mu)$ for any $\\mu$ such that the moments $\\int x^k d\\mu$ do not grow too rapidly as $k \\to \\infty$. In this work, we develop a fairly tight quantitative analogue of the underlying Denjoy-Carleman theorem via complex analysis, and show that this allows for nonasymptotic control of the rate of approximation by polynomials for any smooth function with polynomial growth at infinity. In many cases, this allows us to establish $L^2$ approximation-theoretic results for functions over general classes of distributions (e.g., multivariate sub-Gaussian or sub-exponential distributions) which were previously known only in special cases. As one application, we show that the Paley--Wiener class of functions bandlimited to $[-\\Omega,\\Omega]$ admits superexponential rates of approximation over all strictly sub-exponential distributions, which leads to a new characterization of the class. As another application, we solve an open problem recently posed by Chandrasekaran, Klivans, Kontonis, Meka and Stavropoulos on the smoothed analysis of learning, and also obtain quantitative improvements to their main results and applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04392",
        "abs_url": "https://arxiv.org/abs/2512.04392",
        "pdf_url": "https://arxiv.org/pdf/2512.04392",
        "title": "Informative missingness and its implications in semi-supervised learning",
        "authors": [
            "Jinran Wu",
            "You-Gan Wang",
            "Geoffrey J. McLachlan"
        ],
        "comments": "1",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Semi-supervised learning (SSL) constructs classifiers using both labelled and unlabelled data. It leverages information from labelled samples, whose acquisition is often costly or labour-intensive, together with unlabelled data to enhance prediction performance. This defines an incomplete-data problem, which statistically can be formulated within the likelihood framework for finite mixture models that can be fitted using the expectation-maximisation (EM) algorithm. Ideally, one would prefer a completely labelled sample, as one would anticipate that a labelled observation provides more information than an unlabelled one. However, when the mechanism governing label absence depends on the observed features or the class labels or both, the missingness indicators themselves contain useful information. In certain situations, the information gained from modelling the missing-label mechanism can even outweigh the loss due to missing labels, yielding a classifier with a smaller expected error than one based on a completely labelled sample analysed. This improvement arises particularly when class overlap is moderate, labelled data are sparse, and the missingness is informative. Modelling such informative missingness thus offers a coherent statistical framework that unifies likelihood-based inference with the behaviour of empirical SSL methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04396",
        "abs_url": "https://arxiv.org/abs/2512.04396",
        "pdf_url": "https://arxiv.org/pdf/2512.04396",
        "title": "Sarcasm Detection on Reddit Using Classical Machine Learning and Feature Engineering",
        "authors": [
            "Subrata Karmaker"
        ],
        "comments": "11 pages, 2 figures, includes full Python code. Classical machine learning baseline for sarcasm detection on the SARC 2.0 dataset",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Sarcasm is common in online discussions, yet difficult for machines to identify because the intended meaning often contradicts the literal wording. In this work, I study sarcasm detection using only classical machine learning methods and explicit feature engineering, without relying on neural networks or context from parent comments. Using a 100,000-comment subsample of the Self-Annotated Reddit Corpus (SARC 2.0), I combine word-level and character-level TF-IDF features with simple stylistic indicators. Four models are evaluated: logistic regression, a linear SVM, multinomial Naive Bayes, and a random forest. Naive Bayes and logistic regression perform the strongest, achieving F1-scores around 0.57 for sarcastic comments. Although the lack of conversational context limits performance, the results offer a clear and reproducible baseline for sarcasm detection using lightweight and interpretable methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04434",
        "abs_url": "https://arxiv.org/abs/2512.04434",
        "pdf_url": "https://arxiv.org/pdf/2512.04434",
        "title": "Predicting Time-Dependent Flow Over Complex Geometries Using Operator Networks",
        "authors": [
            "Ali Rabeh",
            "Suresh Murugaiyan",
            "Adarsh Krishnamurthy",
            "Baskar Ganapathysubramanian"
        ],
        "comments": "",
        "subjects": "Fluid Dynamics (physics.flu-dyn); Machine Learning (cs.LG)",
        "abstract": "Fast, geometry-generalizing surrogates for unsteady flow remain challenging. We present a time-dependent, geometry-aware Deep Operator Network that predicts velocity fields for moderate-Re flows around parametric and non-parametric shapes. The model encodes geometry via a signed distance field (SDF) trunk and flow history via a CNN branch, trained on 841 high-fidelity simulations. On held-out shapes, it attains $\\sim 5\\%$ relative L2 single-step error and up to 1000X speedups over CFD. We provide physics-centric rollout diagnostics, including phase error at probes and divergence norms, to quantify long-horizon fidelity. These reveal accurate near-term transients but error accumulation in fine-scale wakes, most pronounced for sharp-cornered geometries. We analyze failure modes and outline practical mitigations. Code, splits, and scripts are openly released at: this https URL to support reproducibility and benchmarking.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04469",
        "abs_url": "https://arxiv.org/abs/2512.04469",
        "pdf_url": "https://arxiv.org/pdf/2512.04469",
        "title": "Mathematical Framing for Different Agent Strategies",
        "authors": [
            "Philip Stephens",
            "Emmanuel Salawu"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "We introduce a unified mathematical and probabilistic framework for understanding and comparing diverse AI agent strategies. We bridge the gap between high-level agent design concepts, such as ReAct, multi-agent systems, and control flows, and a rigorous mathematical formulation. Our approach frames agentic processes as a chain of probabilities, enabling a detailed analysis of how different strategies manipulate these probabilities to achieve desired outcomes. Our framework provides a common language for discussing the trade-offs inherent in various agent architectures. One of our many key contributions is the introduction of the \"Degrees of Freedom\" concept, which intuitively differentiates the optimizable levers available for each approach, thereby guiding the selection of appropriate strategies for specific tasks. This work aims to enhance the clarity and precision in designing and evaluating AI agents, offering insights into maximizing the probability of successful actions within complex agentic systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04643",
        "abs_url": "https://arxiv.org/abs/2512.04643",
        "pdf_url": "https://arxiv.org/pdf/2512.04643",
        "title": "SEASON: Mitigating Temporal Hallucination in Video Large Language Models via Self-Diagnostic Contrastive Decoding",
        "authors": [
            "Chang-Hsun Wu",
            "Kai-Po Chang",
            "Yu-Yang Sheng",
            "Hung-Kai Chung",
            "Kuei-Chun Wang",
            "Yu-Chiang Frank Wang"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Video Large Language Models (VideoLLMs) have shown remarkable progress in video understanding. However, these models still struggle to effectively perceive and exploit rich temporal information in videos when responding to user queries. Therefore, they often generate descriptions of events that are temporal inconsistent or causally implausible, causing severe hallucination issues. While most prior studies have focused on spatial hallucinations (e.g. object mismatches), temporal reasoning in video understanding remains relatively underexplored. To address this issue, we propose Self-Diagnostic Contrastive Decoding (SEASON), a training-free method that adaptively enhances temporal and spatial faithfulness for each output token. It achieves this by dynamically diagnosing each token's hallucination tendency and applying adaptive contrastive decoding against its corresponding temporal and spatial negatives. Extensive experiments demonstrate that SEASON outperforms all existing training-free hallucination mitigation approaches on three hallucination examination benchmarks, while further improves VideoLLMs across four general video understanding benchmarks. The code will be released upon acceptance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04653",
        "abs_url": "https://arxiv.org/abs/2512.04653",
        "pdf_url": "https://arxiv.org/pdf/2512.04653",
        "title": "Semi Centralized Training Decentralized Execution Architecture for Multi Agent Deep Reinforcement Learning in Traffic Signal Control",
        "authors": [
            "Pouria Yazdani",
            "Arash Rezaali",
            "Monireh Abdoos"
        ],
        "comments": "Co-first authors: Pouria Yazdani and Arash Rezaali",
        "subjects": "Multiagent Systems (cs.MA); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Multi-agent reinforcement learning (MARL) has emerged as a promising paradigm for adaptive traffic signal control (ATSC) of multiple intersections. Existing approaches typically follow either a fully centralized or a fully decentralized design. Fully centralized approaches suffer from the curse of dimensionality, and reliance on a single learning server, whereas purely decentralized approaches operate under severe partial observability and lack explicit coordination resulting in suboptimal performance. These limitations motivate region-based MARL, where the network is partitioned into smaller, tightly coupled intersections that form regions, and training is organized around these regions. This paper introduces a Semi-Centralized Training, Decentralized Execution (SEMI-CTDE) architecture for multi intersection ATSC. Within each region, SEMI-CTDE performs centralized training with regional parameter sharing and employs composite state and reward formulations that jointly encode local and regional information. The architecture is highly transferable across different policy backbones and state-reward instantiations. Building on this architecture, we implement two models with distinct design objectives. A multi-perspective experimental analysis of the two implemented SEMI-CTDE-based models covering ablations of the architecture's core elements including rule based and fully decentralized baselines shows that they achieve consistently superior performance and remain effective across a wide range of traffic densities and distributions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04663",
        "abs_url": "https://arxiv.org/abs/2512.04663",
        "pdf_url": "https://arxiv.org/pdf/2512.04663",
        "title": "Fermionic neural Gibbs states",
        "authors": [
            "Jannes Nys",
            "Juan Carrasquilla"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Strongly Correlated Electrons (cond-mat.str-el); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "We introduce fermionic neural Gibbs states (fNGS), a variational framework for modeling finite-temperature properties of strongly interacting fermions. fNGS starts from a reference mean-field thermofield-double state and uses neural-network transformations together with imaginary-time evolution to systematically build strong correlations. Applied to the doped Fermi-Hubbard model, a minimal lattice model capturing essential features of strong electronic correlations, fNGS accurately reproduces thermal energies over a broad range of temperatures, interaction strengths, even at large dopings, for system sizes beyond the reach of exact methods. These results demonstrate a scalable route to studying finite-temperature properties of strongly correlated fermionic systems beyond one dimension with neural-network representations of quantum states.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04690",
        "abs_url": "https://arxiv.org/abs/2512.04690",
        "pdf_url": "https://arxiv.org/pdf/2512.04690",
        "title": "Recurrent Neural Networks with Linear Structures for Electricity Price Forecasting",
        "authors": [
            "Souhir Ben Amor",
            "Florian Ziel"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We present a novel recurrent neural network architecture designed explicitly for day-ahead electricity price forecasting, aimed at improving short-term decision-making and operational management in energy systems. Our combined forecasting model embeds linear structures, such as expert models and Kalman filters, into recurrent networks, enabling efficient computation and enhanced interpretability. The design leverages the strengths of both linear and non-linear model structures, allowing it to capture all relevant stylised price characteristics in power markets, including calendar and autoregressive effects, as well as influences from load, renewable energy, and related fuel and carbon markets. For empirical testing, we use hourly data from the largest European electricity market spanning 2018 to 2025 in a comprehensive forecasting study, comparing our model against state-of-the-art approaches, particularly high-dimensional linear and neural network models. The proposed model achieves approximately 12% higher accuracy than leading benchmarks. We evaluate the contributions of the interpretable model components and conclude on the impact of combining linear and non-linear structures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04696",
        "abs_url": "https://arxiv.org/abs/2512.04696",
        "pdf_url": "https://arxiv.org/pdf/2512.04696",
        "title": "Provable FDR Control for Deep Feature Selection: Deep MLPs and Beyond",
        "authors": [
            "Kazuma Sawaya"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "We develop a flexible feature selection framework based on deep neural networks that approximately controls the false discovery rate (FDR), a measure of Type-I error. The method applies to architectures whose first layer is fully connected. From the second layer onward, it accommodates multilayer perceptrons (MLPs) of arbitrary width and depth, convolutional and recurrent networks, attention mechanisms, residual connections, and dropout. The procedure also accommodates stochastic gradient descent with data-independent initializations and learning rates. To the best of our knowledge, this is the first work to provide a theoretical guarantee of FDR control for feature selection within such a general deep learning setting. Our analysis is built upon a multi-index data-generating model and an asymptotic regime in which the feature dimension $n$ diverges faster than the latent dimension $q^{*}$, while the sample size, the number of training iterations, the network depth, and hidden layer widths are left unrestricted. Under this setting, we show that each coordinate of the gradient-based feature-importance vector admits a marginal normal approximation, thereby supporting the validity of asymptotic FDR control. As a theoretical limitation, we assume $\\mathbf{B}$-right orthogonal invariance of the design matrix, and we discuss broader generalizations. We also present numerical experiments that underscore the theoretical findings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04697",
        "abs_url": "https://arxiv.org/abs/2512.04697",
        "pdf_url": "https://arxiv.org/pdf/2512.04697",
        "title": "Continuous-time reinforcement learning for optimal switching over multiple regimes",
        "authors": [
            "Yijie Huang",
            "Mengge Li",
            "Xiang Yu",
            "Zhou Zhou"
        ],
        "comments": "Keywords: Optimal regime switching, multiple regimes, continuous-time reinforcement learning, system of HJB equations, policy improvement, policy iteration convergence",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG); Computational Finance (q-fin.CP)",
        "abstract": "This paper studies the continuous-time reinforcement learning (RL) for optimal switching problems across multiple regimes. We consider a type of exploratory formulation under entropy regularization where the agent randomizes both the timing of switches and the selection of regimes through the generator matrix of an associated continuous-time finite-state Markov chain. We establish the well-posedness of the associated system of Hamilton-Jacobi-Bellman (HJB) equations and provide a characterization of the optimal policy. The policy improvement and the convergence of the policy iterations are rigorously established by analyzing the system of equations. We also show the convergence of the value function in the exploratory formulation towards the value function in the classical formulation as the temperature parameter vanishes. Finally, a reinforcement learning algorithm is devised and implemented by invoking the policy evaluation based on the martingale characterization. Our numerical examples with the aid of neural networks illustrate the effectiveness of the proposed RL algorithm.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04771",
        "abs_url": "https://arxiv.org/abs/2512.04771",
        "pdf_url": "https://arxiv.org/pdf/2512.04771",
        "title": "Complementary Characterization of Agent-Based Models via Computational Mechanics and Diffusion Models",
        "authors": [
            "Roberto Garrone"
        ],
        "comments": "11 pages. Methods paper introducing a dual-domain framework for analyzing ABM dynamics. Companion temporal-analysis preprint: arXiv:2510.12729",
        "subjects": "Multiagent Systems (cs.MA); Machine Learning (cs.LG)",
        "abstract": "This article extends the preprint \"Characterizing Agent-Based Model Dynamics via $\\epsilon$-Machines and Kolmogorov-Style Complexity\" by introducing diffusion models as orthogonal and complementary tools for characterizing the output of agent-based models (ABMs). Where $\\epsilon$-machines capture the predictive temporal structure and intrinsic computation of ABM-generated time series, diffusion models characterize high-dimensional cross-sectional distributions, learn underlying data manifolds, and enable synthetic generation of plausible population-level outcomes. We provide a formal analysis demonstrating that the two approaches operate on distinct mathematical domains -processes vs.\\ distributions- and show that their combination yields a two-axis representation of ABM behavior based on temporal organization and distributional geometry. To our knowledge, this is the first framework to integrate computational mechanics with score-based generative modeling for the structural analysis of ABM outputs, thereby situating ABM characterization within the broader landscape of modern machine-learning methods for density estimation and intrinsic computation. The framework is validated using the same elder-caregiver ABM dataset introduced in the companion paper, and we provide precise definitions and propositions formalizing the mathematical complementarity between $\\epsilon$-machines and diffusion models. This establishes a principled methodology for jointly analyzing temporal predictability and high-dimensional distributional structure in complex simulation models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04781",
        "abs_url": "https://arxiv.org/abs/2512.04781",
        "pdf_url": "https://arxiv.org/pdf/2512.04781",
        "title": "Pick-to-Learn for Systems and Control: Data-driven Synthesis with State-of-the-art Safety Guarantees",
        "authors": [
            "Dario Paccagnan",
            "Daniel Marks",
            "Marco C. Campi",
            "Simone Garatti"
        ],
        "comments": "27 double-column pages, 18 figures",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "Data-driven methods have become paramount in modern systems and control problems characterized by growing levels of complexity. In safety-critical environments, deploying these methods requires rigorous guarantees, a need that has motivated much recent work at the interface of statistical learning and control. However, many existing approaches achieve this goal at the cost of sacrificing valuable data for testing and calibration, or by constraining the choice of learning algorithm, thus leading to suboptimal performances. In this paper, we describe Pick-to-Learn (P2L) for Systems and Control, a framework that allows any data-driven control method to be equipped with state-of-the-art safety and performance guarantees. P2L enables the use of all available data to jointly synthesize and certify the design, eliminating the need to set aside data for calibration or validation purposes. In presenting a comprehensive version of P2L for systems and control, this paper demonstrates its effectiveness across a range of core problems, including optimal control, reachability analysis, safe synthesis, and robust control. In many of these applications, P2L delivers designs and certificates that outperform commonly employed methods, and shows strong potential for broad applicability in diverse practical settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04827",
        "abs_url": "https://arxiv.org/abs/2512.04827",
        "pdf_url": "https://arxiv.org/pdf/2512.04827",
        "title": "Contract-Driven QoE Auditing for Speech and Singing Services: From MOS Regression to Service Graphs",
        "authors": [
            "Wenzhang Du"
        ],
        "comments": "11 pages, 3 figures",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG)",
        "abstract": "Subjective mean opinion scores (MOS) remain the de-facto target for non-intrusive speech and singing quality assessment. However, MOS is a scalar that collapses heterogeneous user expectations, ignores service-level objectives, and is difficult to compare across deployment graphs. We propose a contract-driven QoE auditing framework: each service graph G is evaluated under a set of human-interpretable experience contracts C, yielding a contract-level satisfaction vector Q(G, C). We show that (i) classical MOS regression is a special case with a degenerate contract set, (ii) contract-driven quality is more stable than MOS under graph view transformations (e.g., pooling by system vs. by system type), and (iii) the effective sample complexity of learning contracts is governed by contract semantics rather than merely the dimensionality of C. We instantiate the framework on URGENT2024 MOS (6.9k speech utterances with raw rating vectors) and SingMOS v1 (7,981 singing clips; 80 systems). On URGENT, we train a contract-aware neural auditor on self-supervised WavLM embeddings; on SingMOS, we perform contract-driven graph auditing using released rating vectors and metadata without decoding audio. Empirically, our auditor matches strong MOS predictors in MOS accuracy while providing calibrated contract probabilities; on SingMOS, Q(G, C) exhibits substantially smaller cross-view drift than raw MOS and graph-only baselines; on URGENT, difficulty curves reveal that mis-specified \"simple\" contracts can be harder to learn than richer but better aligned contract sets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04865",
        "abs_url": "https://arxiv.org/abs/2512.04865",
        "pdf_url": "https://arxiv.org/pdf/2512.04865",
        "title": "Series of quasi-uniform scatterings with fast search, root systems and neural network classifications",
        "authors": [
            "Igor V. Netay"
        ],
        "comments": "",
        "subjects": "Algebraic Geometry (math.AG); Machine Learning (cs.LG); Representation Theory (math.RT)",
        "abstract": "In this paper we describe an approach to construct large extendable collections of vectors in predefined spaces of given dimensions. These collections are useful for neural network latent space configuration and training. For classification problem with large or unknown number of classes this allows to construct classifiers without classification layer and extend the number of classes without retraining of network from the very beginning. The construction allows to create large well-spaced vector collections in spaces of minimal possible dimension. If the number of classes is known or approximately predictable, one can choose sufficient enough vector collection size. If one needs to significantly extend the number of classes, one can extend the collection in the same latent space, or to incorporate the collection into collection of higher dimensions with same spacing between vectors. Also, regular symmetric structure of constructed vector collections can significantly simplify problems of search for nearest cluster centers or embeddings in the latent space. Construction of vector collections is based on combinatorics and geometry of semi-simple Lie groups irreducible representations with highest weight.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04874",
        "abs_url": "https://arxiv.org/abs/2512.04874",
        "pdf_url": "https://arxiv.org/pdf/2512.04874",
        "title": "Shorting Dynamics and Structured Kernel Regularization",
        "authors": [
            "James Tian"
        ],
        "comments": "",
        "subjects": "Functional Analysis (math.FA); Machine Learning (cs.LG)",
        "abstract": "This paper develops a nonlinear operator dynamic that progressively removes the influence of a prescribed feature subspace while retaining maximal structure elsewhere. The induced sequence of positive operators is monotone, admits an exact residual decomposition, and converges to the classical shorted operator. Transporting this dynamic to reproducing kernel Hilbert spaces yields a corresponding family of kernels that converges to the largest kernel dominated by the original one and annihilating the given subspace. In the finite-sample setting, the associated Gram operators inherit a structured residual decomposition that leads to a canonical form of kernel ridge regression and a principled way to enforce nuisance invariance. This gives a unified operator-analytic approach to invariant kernel construction and structured regularization in data analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04966",
        "abs_url": "https://arxiv.org/abs/2512.04966",
        "pdf_url": "https://arxiv.org/pdf/2512.04966",
        "title": "Environment-Aware Channel Inference via Cross-Modal Flow: From Multimodal Sensing to Wireless Channels",
        "authors": [
            "Guangming Liang",
            "Mingjie Yang",
            "Dongzhu Liu",
            "Paul Henderson",
            "Lajos Hanzo"
        ],
        "comments": "13 pages, 13 figures, 40 references, submitted to IEEE for possible publication",
        "subjects": "Information Theory (cs.IT); Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Accurate channel state information (CSI) underpins reliable and efficient wireless communication. However, acquiring CSI via pilot estimation incurs substantial overhead, especially in massive multiple-input multiple-output (MIMO) systems operating in high-Doppler environments. By leveraging the growing availability of environmental sensing data, this treatise investigates pilot-free channel inference that estimates complete CSI directly from multimodal observations, including camera images, LiDAR point clouds, and GPS coordinates. In contrast to prior studies that rely on predefined channel models, we develop a data-driven framework that formulates the sensing-to-channel mapping as a cross-modal flow matching problem. The framework fuses multimodal features into a latent distribution within the channel domain, and learns a velocity field that continuously transforms the latent distribution toward the channel distribution. To make this formulation tractable and efficient, we reformulate the problem as an equivalent conditional flow matching objective and incorporate a modality alignment loss, while adopting low-latency inference mechanisms to enable real-time CSI estimation. In experiments, we build a procedural data generator based on Sionna and Blender to support realistic modeling of sensing scenes and wireless propagation. System-level evaluations demonstrate significant improvements over pilot- and sensing-based benchmarks in both channel estimation accuracy and spectral efficiency for the downstream beamforming task.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04980",
        "abs_url": "https://arxiv.org/abs/2512.04980",
        "pdf_url": "https://arxiv.org/pdf/2512.04980",
        "title": "Learning Causality for Longitudinal Data",
        "authors": [
            "Mouad EL Bouchattaoui"
        ],
        "comments": "PhD thesis manuscript",
        "subjects": "Machine Learning (stat.ML); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "This thesis develops methods for causal inference and causal representation learning (CRL) in high-dimensional, time-varying data. The first contribution introduces the Causal Dynamic Variational Autoencoder (CDVAE), a model for estimating Individual Treatment Effects (ITEs) by capturing unobserved heterogeneity in treatment response driven by latent risk factors that affect only outcomes. CDVAE comes with theoretical guarantees on valid latent adjustment and generalization bounds for ITE error. Experiments on synthetic and real datasets show that CDVAE outperforms baselines, and that state-of-the-art models greatly improve when augmented with its latent substitutes, approaching oracle performance without access to true adjustment variables. The second contribution proposes an efficient framework for long-term counterfactual regression based on RNNs enhanced with Contrastive Predictive Coding (CPC) and InfoMax. It captures long-range dependencies under time-varying confounding while avoiding the computational cost of transformers, achieving state-of-the-art results and introducing CPC into causal inference. The third contribution advances CRL by addressing how latent causes manifest in observed variables. We introduce a model-agnostic interpretability layer based on the geometry of the decoder Jacobian. A sparse self-expression prior induces modular, possibly overlapping groups of observed features aligned with shared latent influences. We provide recovery guarantees in both disjoint and overlapping settings and show that meaningful latent-to-observed structure can be recovered without anchor features or single-parent assumptions. Scalable Jacobian-based regularization techniques are also developed.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.04985",
        "abs_url": "https://arxiv.org/abs/2512.04985",
        "pdf_url": "https://arxiv.org/pdf/2512.04985",
        "title": "Towards a unified framework for guided diffusion models",
        "authors": [
            "Yuchen Jiao",
            "Yuxin Chen",
            "Gen Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "Guided or controlled data generation with diffusion models\\blfootnote{Partial preliminary results of this work appeared in International Conference on Machine Learning 2025 \\citep{li2025provable}.} has become a cornerstone of modern generative modeling. Despite substantial advances in diffusion model theory, the theoretical understanding of guided diffusion samplers remains severely limited. We make progress by developing a unified algorithmic and theoretical framework that accommodates both diffusion guidance and reward-guided diffusion. Aimed at fine-tuning diffusion models to improve certain rewards, we propose injecting a reward guidance term -- constructed from the difference between the original and reward-reweighted scores -- into the backward diffusion process, and rigorously quantify the resulting reward improvement over the unguided counterpart. As a key application, our framework shows that classifier-free guidance (CFG) decreases the expected reciprocal of the classifier probability, providing the first theoretical characterization of the specific performance metric that CFG improves for general target distributions. When applied to reward-guided diffusion, our framework yields a new sampler that is easy-to-train and requires no full diffusion trajectories during training. Numerical experiments further corroborate our theoretical findings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05021",
        "abs_url": "https://arxiv.org/abs/2512.05021",
        "pdf_url": "https://arxiv.org/pdf/2512.05021",
        "title": "HTR-ConvText: Leveraging Convolution and Textual Information for Handwritten Text Recognition",
        "authors": [
            "Pham Thach Thanh Truc",
            "Dang Hoai Nam",
            "Huynh Tong Dang Khoa",
            "Vo Nguyen Le Duy"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Handwritten Text Recognition remains challenging due to the limited data, high writing style variance, and scripts with complex diacritics. Existing approaches, though partially address these issues, often struggle to generalize without massive synthetic data. To address these challenges, we propose HTR-ConvText, a model designed to capture fine-grained, stroke-level local features while preserving global contextual dependencies. In the feature extraction stage, we integrate a residual Convolutional Neural Network backbone with a MobileViT with Positional Encoding block. This enables the model to both capture structural patterns and learn subtle writing details. We then introduce the ConvText encoder, a hybrid architecture combining global context and local features within a hierarchical structure that reduces sequence length for improved efficiency. Additionally, an auxiliary module injects textual context to mitigate the weakness of Connectionist Temporal Classification. Evaluations on IAM, READ2016, LAM and HANDS-VNOnDB demonstrate that our approach achieves improved performance and better generalization compared to existing methods, especially in scenarios with limited training samples and high handwriting diversity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05024",
        "abs_url": "https://arxiv.org/abs/2512.05024",
        "pdf_url": "https://arxiv.org/pdf/2512.05024",
        "title": "Model-Free Assessment of Simulator Fidelity via Quantile Curves",
        "authors": [
            "Garud Iyengar",
            "Yu-Shiou Willy Lin",
            "Kaizheng Wang"
        ],
        "comments": "33 pages, 11 figures",
        "subjects": "Methodology (stat.ME); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Simulation of complex systems originated in manufacturing and queuing applications. It is now widely used for large-scale, ML-based systems in research, education, and consumer surveys. However, characterizing the discrepancy between simulators and ground truth remains challenging for increasingly complex, machine-learning-based systems. We propose a computationally tractable method to estimate the quantile function of the discrepancy between the simulated and ground-truth outcome distributions. Our approach focuses on output uncertainty and treats the simulator as a black box, imposing no modeling assumptions on its internals, and hence applies broadly across many parameter families, from Bernoulli and multinomial models to continuous, vector-valued settings. The resulting quantile curve supports confidence interval construction for unseen scenarios, risk-aware summaries of sim-to-real discrepancy (e.g., VaR/CVaR), and comparison of simulators' performance. We demonstrate our methodology in an application assessing LLM simulation fidelity on the WorldValueBench dataset spanning four LLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05049",
        "abs_url": "https://arxiv.org/abs/2512.05049",
        "pdf_url": "https://arxiv.org/pdf/2512.05049",
        "title": "QKAN-LSTM: Quantum-inspired Kolmogorov-Arnold Long Short-term Memory",
        "authors": [
            "Yu-Chao Hsu",
            "Jiun-Cheng Jiang",
            "Chun-Hua Lin",
            "Kuo-Chung Peng",
            "Nan-Yow Chen",
            "Samuel Yen-Chi Chen",
            "En-Jui Kuo",
            "Hsi-Sheng Goan"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Long short-term memory (LSTM) models are a particular type of recurrent neural networks (RNNs) that are central to sequential modeling tasks in domains such as urban telecommunication forecasting, where temporal correlations and nonlinear dependencies dominate. However, conventional LSTMs suffer from high parameter redundancy and limited nonlinear expressivity. In this work, we propose the Quantum-inspired Kolmogorov-Arnold Long Short-Term Memory (QKAN-LSTM), which integrates Data Re-Uploading Activation (DARUAN) modules into the gating structure of LSTMs. Each DARUAN acts as a quantum variational activation function (QVAF), enhancing frequency adaptability and enabling an exponentially enriched spectral representation without multi-qubit entanglement. The resulting architecture preserves quantum-level expressivity while remaining fully executable on classical hardware. Empirical evaluations on three datasets, Damped Simple Harmonic Motion, Bessel Function, and Urban Telecommunication, demonstrate that QKAN-LSTM achieves superior predictive accuracy and generalization with a 79% reduction in trainable parameters compared to classical LSTMs. We extend the framework to the Jiang-Huang-Chen-Goan Network (JHCG Net), which generalizes KAN to encoder-decoder structures, and then further use QKAN to realize the latent KAN, thereby creating a Hybrid QKAN (HQKAN) for hierarchical representation learning. The proposed HQKAN-LSTM thus provides a scalable and interpretable pathway toward quantum-inspired sequential modeling in real-world data environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05070",
        "abs_url": "https://arxiv.org/abs/2512.05070",
        "pdf_url": "https://arxiv.org/pdf/2512.05070",
        "title": "Control Consistency Losses for Diffusion Bridges",
        "authors": [
            "Samuel Howard",
            "Nikolas Nüsken",
            "Jakiw Pidstrigach"
        ],
        "comments": "Frontiers in Probabilistic Inference: Sampling Meets Learning Workshop at NeurIPS 2025 (Oral)",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Simulating the conditioned dynamics of diffusion processes, given their initial and terminal states, is an important but challenging problem in the sciences. The difficulty is particularly pronounced for rare events, for which the unconditioned dynamics rarely reach the terminal state. In this work, we leverage a self-consistency property of the conditioned dynamics to learn the diffusion bridge in an iterative online manner, and demonstrate promising empirical results in a range of settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05092",
        "abs_url": "https://arxiv.org/abs/2512.05092",
        "pdf_url": "https://arxiv.org/pdf/2512.05092",
        "title": "Foundations of Diffusion Models in General State Spaces: A Self-Contained Introduction",
        "authors": [
            "Vincent Pauline",
            "Tobias Höppe",
            "Kirill Neklyudov",
            "Alexander Tong",
            "Stefan Bauer",
            "Andrea Dittadi"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Although diffusion models now occupy a central place in generative modeling, introductory treatments commonly assume Euclidean data and seldom clarify their connection to discrete-state analogues. This article is a self-contained primer on diffusion over general state spaces, unifying continuous domains and discrete/categorical structures under one lens. We develop the discrete-time view (forward noising via Markov kernels and learned reverse dynamics) alongside its continuous-time limits -- stochastic differential equations (SDEs) in $\\mathbb{R}^d$ and continuous-time Markov chains (CTMCs) on finite alphabets -- and derive the associated Fokker--Planck and master equations. A common variational treatment yields the ELBO that underpins standard training losses. We make explicit how forward corruption choices -- Gaussian processes in continuous spaces and structured categorical transition kernels (uniform, masking/absorbing and more) in discrete spaces -- shape reverse dynamics and the ELBO. The presentation is layered for three audiences: newcomers seeking a self-contained intuitive introduction; diffusion practitioners wanting a global theoretical synthesis; and continuous-diffusion experts looking for an analogy-first path into discrete diffusion. The result is a unified roadmap to modern diffusion methodology across continuous domains and discrete sequences, highlighting a compact set of reusable proofs, identities, and core theoretical principles.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05100",
        "abs_url": "https://arxiv.org/abs/2512.05100",
        "pdf_url": "https://arxiv.org/pdf/2512.05100",
        "title": "Structured Document Translation via Format Reinforcement Learning",
        "authors": [
            "Haiyue Song",
            "Johannes Eschbach-Dymanus",
            "Hour Kaing",
            "Sumire Honda",
            "Hideki Tanaka",
            "Bianka Buschbeck",
            "Masao Utiyama"
        ],
        "comments": "IJCNLP-AACL 2025 Main (Oral)",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Recent works on structured text translation remain limited to the sentence level, as they struggle to effectively handle the complex document-level XML or HTML structures. To address this, we propose \\textbf{Format Reinforcement Learning (FormatRL)}, which employs Group Relative Policy Optimization on top of a supervised fine-tuning model to directly optimize novel structure-aware rewards: 1) TreeSim, which measures structural similarity between predicted and reference XML trees and 2) Node-chrF, which measures translation quality at the level of XML nodes. Additionally, we apply StrucAUC, a fine-grained metric distinguishing between minor errors and major structural failures. Experiments on the SAP software-documentation benchmark demonstrate improvements across six metrics and an analysis further shows how different reward functions contribute to improvements in both structural and translation quality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05105",
        "abs_url": "https://arxiv.org/abs/2512.05105",
        "pdf_url": "https://arxiv.org/pdf/2512.05105",
        "title": "Semantic Soft Bootstrapping: Long Context Reasoning in LLMs without Reinforcement Learning",
        "authors": [
            "Purbesh Mitra",
            "Sennur Ulukus"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Information Theory (cs.IT); Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Long context reasoning in large language models (LLMs) has demonstrated enhancement of their cognitive capabilities via chain-of-thought (CoT) inference. Training such models is usually done via reinforcement learning with verifiable rewards (RLVR) in reasoning based problems, like math and programming. However, RLVR is limited by several bottlenecks, such as, lack of dense reward, and inadequate sample efficiency. As a result, it requires significant compute resources in post-training phase. To overcome these limitations, in this work, we propose \\textbf{Semantic Soft Bootstrapping (SSB)}, a self-distillation technique, in which the same base language model plays the role of both teacher and student, but receives different semantic contexts about the correctness of its outcome at training time. The model is first prompted with a math problem and several rollouts are generated. From them, the correct and most common incorrect response are filtered, and then provided to the model in context to produce a more robust, step-by-step explanation with a verified final answer. This pipeline automatically curates a paired teacher-student training set from raw problem-answer data, without any human intervention. This generation process also produces a sequence of logits, which is what the student model tries to match in the training phase just from the bare question alone. In our experiment, Qwen2.5-3B-Instruct on GSM8K dataset via parameter-efficient fine-tuning. We then tested its accuracy on MATH500, and AIME2024 benchmarks. Our experiments show a jump of 10.6%, and 10% improvements in accuracy, respectively, over group relative policy optimization (GRPO), which is a commonly used RLVR algorithm. Our code is available at this https URL, and the model, curated dataset is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-12-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-05?abs=True",
        "arxiv_id": "2512.05112",
        "abs_url": "https://arxiv.org/abs/2512.05112",
        "pdf_url": "https://arxiv.org/pdf/2512.05112",
        "title": "DraCo: Draft as CoT for Text-to-Image Preview and Rare Concept Generation",
        "authors": [
            "Dongzhi Jiang",
            "Renrui Zhang",
            "Haodong Li",
            "Zhuofan Zong",
            "Ziyu Guo",
            "Jun He",
            "Claire Guo",
            "Junyan Ye",
            "Rongyao Fang",
            "Weijia Li",
            "Rui Liu",
            "Hongsheng Li"
        ],
        "comments": "Project Page: this https URL",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Recent unified multimodal large language models (MLLMs) have shown impressive capabilities, incorporating chain-of-thought (CoT) reasoning for enhanced text-to-image generation. However, existing approaches remain limited, either treating the model merely as a standalone generator or relying on abstract textual planning. To this end, we propose Draft-as-CoT (DraCo), a novel interleaved reasoning paradigm that fully leverages both textual and visual contents in CoT for better planning and verification. Our method first generates a low-resolution draft image as preview, providing more concrete and structural visual planning and guidance. Then, we employ the model's inherent understanding capability to verify potential semantic misalignments between the draft and input prompt, and performs refinement through selective corrections with super-resolution. In this way, our approach addresses two fundamental challenges: the coarse-grained nature of textual planning and the difficulty in generating rare attribute combinations. To support training, we curate DraCo-240K, aiming to enhance three atomic capabilities spanning general correction, instance manipulation, and layout reorganization. Supported by DraCo-CFG, a specialized classifier-free guidance (CFG) strategy for interleaved reasoning, DraCo achieves a tremendous increase on GenEval (+8%), Imagine-Bench (+0.91), and GenEval++ (+3%), significantly outperforming direct generation and other generation methods empowered by CoT.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]