[
    {
        "order": 1,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08650",
        "abs_url": "https://arxiv.org/abs/2511.08650",
        "pdf_url": "https://arxiv.org/pdf/2511.08650",
        "title": "A Lightweight CNN-Attention-BiLSTM Architecture for Multi-Class Arrhythmia Classification on Standard and Wearable ECGs",
        "authors": [
            "Vamsikrishna Thota",
            "Hardik Prajapati",
            "Yuvraj Joshi",
            "Shubhangi Rathi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Early and accurate detection of cardiac arrhythmias is vital for timely diagnosis and intervention. We propose a lightweight deep learning model combining 1D Convolutional Neural Networks (CNN), attention mechanisms, and Bidirectional Long Short-Term Memory (BiLSTM) for classifying arrhythmias from both 12-lead and single-lead ECGs. Evaluated on the CPSC 2018 dataset, the model addresses class imbalance using a class-weighted loss and demonstrates superior accuracy and F1- scores over baseline models. With only 0.945 million parameters, our model is well-suited for real-time deployment in wearable health monitoring systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08653",
        "abs_url": "https://arxiv.org/abs/2511.08653",
        "pdf_url": "https://arxiv.org/pdf/2511.08653",
        "title": "Accelerating Training Speed of Tiny Recursive Models via Curriculum Guided Adaptive Recursion",
        "authors": [
            "Kaleem Ullah Qasim",
            "Jiashu Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Recursive reasoning models achieve remarkable performance on complex reasoning tasks through iterative refinement, enabling tiny networks to match large language models thousands of times their size. However, training remains computationally expensive, prior work reporting approximately 36 GPU-hours per dataset, limiting broader adoption and research. We propose CGAR, a novel training methodology that applies curriculum learning to architectural depth rather than traditional data ordering. CGAR introduces two synergistic components: Progressive Depth Curriculum dynamically adjusts recursion depth from shallow to deep configurations during training, preventing early overfitting while reducing computational cost, and Hierarchical Supervision Weighting applies exponentially decaying importance to supervision steps, aligning loss weighting with observed gradient magnitude decay. On Sudoku-Extreme with 423,168 test puzzles, CGAR achieves 1.71x training speedup (10.93 to 6.38 hours, 42% cost reduction) with only 0.63% accuracy drop (86.65% to 86.02%). Systematic ablations reveal Progressive Depth Curriculum alone achieves 2.26x speedup with 85.47% accuracy, demonstrating a rare Pareto improvement where architectural curriculum simultaneously enhances training efficiency and solution quality. CGAR-trained models exhibit superior inference efficiency with 100% halting accuracy and 11% fewer reasoning steps. Our work demonstrates that principled curriculum on architectural depth enables efficient training of recursive reasoning models on modest hardware. Code and models: this https URL and this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08667",
        "abs_url": "https://arxiv.org/abs/2511.08667",
        "pdf_url": "https://arxiv.org/pdf/2511.08667",
        "title": "TabPFN-2.5: Advancing the State of the Art in Tabular Foundation Models",
        "authors": [
            "Léo Grinsztajn",
            "Klemens Flöge",
            "Oscar Key",
            "Felix Birkel",
            "Philipp Jund",
            "Brendan Roof",
            "Benjamin Jäger",
            "Dominik Safaric",
            "Simone Alessi",
            "Adrian Hayler",
            "Mihir Manium",
            "Rosen Yu",
            "Felix Jablonski",
            "Shi Bin Hoo",
            "Anurag Garg",
            "Jake Robertson",
            "Magnus Bühler",
            "Vladyslav Moroshan",
            "Lennart Purucker",
            "Clara Cornu",
            "Lilly Charlotte Wehrhahn",
            "Alessandro Bonetto",
            "Bernhard Schölkopf",
            "Sauraj Gambhir",
            "Noah Hollmann",
            "Frank Hutter"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "The first tabular foundation model, TabPFN, and its successor TabPFNv2 have impacted tabular AI substantially, with dozens of methods building on it and hundreds of applications across different use cases. This report introduces TabPFN-2.5, the next generation of our tabular foundation model, built for datasets with up to 50,000 data points and 2,000 features, a 20x increase in data cells compared to TabPFNv2. TabPFN-2.5 is now the leading method for the industry standard benchmark TabArena (which contains datasets with up to 100,000 training data points), substantially outperforming tuned tree-based models and matching the accuracy of AutoGluon 1.4, a complex four-hour tuned ensemble that even includes the previous TabPFNv2. Remarkably, default TabPFN-2.5 has a 100% win rate against default XGBoost on small to medium-sized classification datasets (<=10,000 data points, 500 features) and a 87% win rate on larger datasets up to 100K samples and 2K features (85% for regression). For production use cases, we introduce a new distillation engine that converts TabPFN-2.5 into a compact MLP or tree ensemble, preserving most of its accuracy while delivering orders-of-magnitude lower latency and plug-and-play deployment. This new release will immediately strengthen the performance of the many applications and methods already built on the TabPFN ecosystem.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08697",
        "abs_url": "https://arxiv.org/abs/2511.08697",
        "pdf_url": "https://arxiv.org/pdf/2511.08697",
        "title": "PEGNet: A Physics-Embedded Graph Network for Long-Term Stable Multiphysics Simulation",
        "authors": [
            "Can Yang",
            "Zhenzhong Wang",
            "Junyuan Liu",
            "Yunpeng Gong",
            "Min Jiang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate and efficient simulations of physical phenomena governed by partial differential equations (PDEs) are important for scientific and engineering progress. While traditional numerical solvers are powerful, they are often computationally expensive. Recently, data-driven methods have emerged as alternatives, but they frequently suffer from error accumulation and limited physical consistency, especially in multiphysics and complex geometries. To address these challenges, we propose PEGNet, a Physics-Embedded Graph Network that incorporates PDE-guided message passing to redesign the graph neural network architecture. By embedding key PDE dynamics like convection, viscosity, and diffusion into distinct message functions, the model naturally integrates physical constraints into its forward propagation, producing more stable and physically consistent solutions. Additionally, a hierarchical architecture is employed to capture multi-scale features, and physical regularization is integrated into the loss function to further enforce adherence to governing physics. We evaluated PEGNet on benchmarks, including custom datasets for respiratory airflow and drug delivery, showing significant improvements in long-term prediction accuracy and physical consistency over existing methods. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08702",
        "abs_url": "https://arxiv.org/abs/2511.08702",
        "pdf_url": "https://arxiv.org/pdf/2511.08702",
        "title": "FAIRPLAI: A Human-in-the-Loop Approach to Fair and Private Machine Learning",
        "authors": [
            "David Sanchez Jr.",
            "Holly Lopez",
            "Michelle Buraczyk",
            "Anantaa Kotal"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Cryptography and Security (cs.CR); Computers and Society (cs.CY)",
        "abstract": "As machine learning systems move from theory to practice, they are increasingly tasked with decisions that affect healthcare access, financial opportunities, hiring, and public services. In these contexts, accuracy is only one piece of the puzzle - models must also be fair to different groups, protect individual privacy, and remain accountable to stakeholders. Achieving all three is difficult: differential privacy can unintentionally worsen disparities, fairness interventions often rely on sensitive data that privacy restricts, and automated pipelines ignore that fairness is ultimately a human and contextual judgment. We introduce FAIRPLAI (Fair and Private Learning with Active Human Influence), a practical framework that integrates human oversight into the design and deployment of machine learning systems. FAIRPLAI works in three ways: (1) it constructs privacy-fairness frontiers that make trade-offs between accuracy, privacy guarantees, and group outcomes transparent; (2) it enables interactive stakeholder input, allowing decision-makers to select fairness criteria and operating points that reflect their domain needs; and (3) it embeds a differentially private auditing loop, giving humans the ability to review explanations and edge cases without compromising individual data security. Applied to benchmark datasets, FAIRPLAI consistently preserves strong privacy protections while reducing fairness disparities relative to automated baselines. More importantly, it provides a straightforward, interpretable process for practitioners to manage competing demands of accuracy, privacy, and fairness in socially impactful applications. By embedding human judgment where it matters most, FAIRPLAI offers a pathway to machine learning systems that are effective, responsible, and trustworthy in practice. GitHub: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08722",
        "abs_url": "https://arxiv.org/abs/2511.08722",
        "pdf_url": "https://arxiv.org/pdf/2511.08722",
        "title": "Macroscopic Emission Modeling of Urban Traffic Using Probe Vehicle Data: A Machine Learning Approach",
        "authors": [
            "Mohammed Ali El Adlouni",
            "Ling Jin",
            "Xiaodan Xu",
            "C. Anna Spurlock",
            "Alina Lazar",
            "Kaveh Farokhi Sadabadi",
            "Mahyar Amirgholy",
            "Mona Asudegi"
        ],
        "comments": "3 pages, 5 figures, IEEE Big Data 2024 conference",
        "subjects": "Machine Learning (cs.LG); Computers and Society (cs.CY)",
        "abstract": "Urban congestions cause inefficient movement of vehicles and exacerbate greenhouse gas emissions and urban air pollution. Macroscopic emission fundamental diagram (eMFD)captures an orderly relationship among emission and aggregated traffic variables at the network level, allowing for real-time monitoring of region-wide emissions and optimal allocation of travel demand to existing networks, reducing urban congestion and associated emissions. However, empirically derived eMFD models are sparse due to historical data limitation. Leveraging a large-scale and granular traffic and emission data derived from probe vehicles, this study is the first to apply machine learning methods to predict the network wide emission rate to traffic relationship in U.S. urban areas at a large scale. The analysis framework and insights developed in this work generate data-driven eMFDs and a deeper understanding of their location dependence on network, infrastructure, land use, and vehicle characteristics, enabling transportation authorities to measure carbon emissions from urban transport of given travel demand and optimize location specific traffic management and planning decisions to mitigate network-wide emissions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08733",
        "abs_url": "https://arxiv.org/abs/2511.08733",
        "pdf_url": "https://arxiv.org/pdf/2511.08733",
        "title": "Gromov-Wasserstein Graph Coarsening",
        "authors": [
            "Carlos A. Taveras",
            "Santiago Segarra",
            "César A. Uribe"
        ],
        "comments": "11 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study the problem of graph coarsening within the Gromov-Wasserstein geometry. Specifically, we propose two algorithms that leverage a novel representation of the distortion induced by merging pairs of nodes. The first method, termed Greedy Pair Coarsening (GPC), iteratively merges pairs of nodes that locally minimize a measure of distortion until the desired size is achieved. The second method, termed $k$-means Greedy Pair Coarsening (KGPC), leverages clustering based on pairwise distortion metrics to directly merge clusters of nodes. We provide conditions guaranteeing optimal coarsening for our methods and validate their performance on six large-scale datasets and a downstream clustering task. Results show that the proposed methods outperform existing approaches on a wide range of parameters and scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08789",
        "abs_url": "https://arxiv.org/abs/2511.08789",
        "pdf_url": "https://arxiv.org/pdf/2511.08789",
        "title": "A Generalized Bias-Variance Decomposition for Bregman Divergences",
        "authors": [
            "David Pfau"
        ],
        "comments": "Extended version of notes previously posted here: this http URL",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "The bias-variance decomposition is a central result in statistics and machine learning, but is typically presented only for the squared error. We present a generalization of the bias-variance decomposition where the prediction error is a Bregman divergence, which is relevant to maximum likelihood estimation with exponential families. While the result is already known, there was not previously a clear, standalone derivation, so we provide one for pedagogical purposes. A version of this note previously appeared on the author's personal website without context. Here we provide additional discussion and references to the relevant prior literature.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08831",
        "abs_url": "https://arxiv.org/abs/2511.08831",
        "pdf_url": "https://arxiv.org/pdf/2511.08831",
        "title": "Physics-Informed Machine Learning for Characterizing System Stability",
        "authors": [
            "Tomoki Koike",
            "Elizabeth Qian"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Numerical Analysis (math.NA)",
        "abstract": "In the design and operation of complex dynamical systems, it is essential to ensure that all state trajectories of the dynamical system converge to a desired equilibrium within a guaranteed stability region. Yet, for many practical systems -- especially in aerospace -- this region cannot be determined a priori and is often challenging to compute. One of the most common methods for computing the stability region is to identify a Lyapunov function. A Lyapunov function is a positive function whose time derivative along system trajectories is non-positive, which provides a sufficient condition for stability and characterizes an estimated stability region. However, existing methods of characterizing a stability region via a Lyapunov function often rely on explicit knowledge of the system governing equations. In this work, we present a new physics-informed machine learning method of characterizing an estimated stability region by inferring a Lyapunov function from system trajectory data that treats the dynamical system as a black box and does not require explicit knowledge of the system governing equations. In our presented Lyapunov function Inference method (LyapInf), we propose a quadratic form for the unknown Lyapunov function and fit the unknown quadratic operator to system trajectory data by minimizing the average residual of the Zubov equation, a first-order partial differential equation whose solution yields a Lyapunov function. The inferred quadratic Lyapunov function can then characterize an ellipsoidal estimate of the stability region. Numerical results on benchmark examples demonstrate that our physics-informed stability analysis method successfully characterizes a near-maximal ellipsoid of the system stability region associated with the inferred Lyapunov function without requiring knowledge of the system governing equations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08832",
        "abs_url": "https://arxiv.org/abs/2511.08832",
        "pdf_url": "https://arxiv.org/pdf/2511.08832",
        "title": "TIGER-MARL: Enhancing Multi-Agent Reinforcement Learning with Temporal Information through Graph-based Embeddings and Representations",
        "authors": [
            "Nikunj Gupta",
            "Ludwika Twardecka",
            "James Zachary Hare",
            "Jesse Milzman",
            "Rajgopal Kannan",
            "Viktor Prasanna"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "In this paper, we propose capturing and utilizing \\textit{Temporal Information through Graph-based Embeddings and Representations} or \\textbf{TIGER} to enhance multi-agent reinforcement learning (MARL). We explicitly model how inter-agent coordination structures evolve over time. While most MARL approaches rely on static or per-step relational graphs, they overlook the temporal evolution of interactions that naturally arise as agents adapt, move, or reorganize cooperation strategies. Capturing such evolving dependencies is key to achieving robust and adaptive coordination. To this end, TIGER constructs dynamic temporal graphs of MARL agents, connecting their current and historical interactions. It then employs a temporal attention-based encoder to aggregate information across these structural and temporal neighborhoods, yielding time-aware agent embeddings that guide cooperative policy learning. Through extensive experiments on two coordination-intensive benchmarks, we show that TIGER consistently outperforms diverse value-decomposition and graph-based MARL baselines in task performance and sample efficiency. Furthermore, we conduct comprehensive ablation studies to isolate the impact of key design parameters in TIGER, revealing how structural and temporal factors can jointly shape effective policy learning in MARL. All codes can be found here: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08846",
        "abs_url": "https://arxiv.org/abs/2511.08846",
        "pdf_url": "https://arxiv.org/pdf/2511.08846",
        "title": "On topological descriptors for graph products",
        "authors": [
            "Mattie Ji",
            "Amauri H. Souza",
            "Vikas Garg"
        ],
        "comments": "26 pages, 4 tables, 5 figures. Accepted at NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Algebraic Topology (math.AT); Machine Learning (stat.ML)",
        "abstract": "Topological descriptors have been increasingly utilized for capturing multiscale structural information in relational data. In this work, we consider various filtrations on the (box) product of graphs and the effect on their outputs on the topological descriptors - the Euler characteristic (EC) and persistent homology (PH). In particular, we establish a complete characterization of the expressive power of EC on general color-based filtrations. We also show that the PH descriptors of (virtual) graph products contain strictly more information than the computation on individual graphs, whereas EC does not. Additionally, we provide algorithms to compute the PH diagrams of the product of vertex- and edge-level filtrations on the graph product. We also substantiate our theoretical analysis with empirical investigations on runtime analysis, expressivity, and graph classification performance. Overall, this work paves way for powerful graph persistent descriptors via product filtrations. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08854",
        "abs_url": "https://arxiv.org/abs/2511.08854",
        "pdf_url": "https://arxiv.org/pdf/2511.08854",
        "title": "Decomposition of Small Transformer Models",
        "authors": [
            "Casper L. Christensen",
            "Logan Riggs"
        ],
        "comments": "Accepted at Neurips 2025 Workshop on Mechanistic Interpretability",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent work in mechanistic interpretability has shown that decomposing models in parameter space may yield clean handles for analysis and intervention. Previous methods have demonstrated successful applications on a wide range of toy models, but the gap to \"real models\" has not yet been bridged. In this work, we extend Stochastic Parameter Decomposition (SPD) to Transformer models, proposing an updated causal importance function suited for sequential data and a new loss function. We demonstrate that SPD can successfully decompose a toy induction-head model and recover the expected 2-step circuit. We also show that applying SPD to GPT-2-small can successfully locate subcomponents corresponding to interpretable concepts like \"golf\" and \"basketball\". These results take the first step in the direction of extending SPD to modern models, and show that we can use the method to surface interpretable parameter-space mechanisms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08856",
        "abs_url": "https://arxiv.org/abs/2511.08856",
        "pdf_url": "https://arxiv.org/pdf/2511.08856",
        "title": "ForeSWE: Forecasting Snow-Water Equivalent with an Uncertainty-Aware Attention Model",
        "authors": [
            "Krishu K Thapa",
            "Supriya Savalkar",
            "Bhupinderjeet Singh",
            "Trong Nghia Hoang",
            "Kirti Rajagopalan",
            "Ananth Kalyanaraman"
        ],
        "comments": "Accepted for publication at the 2026 AAAI conference",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "Various complex water management decisions are made in snow-dominant watersheds with the knowledge of Snow-Water Equivalent (SWE) -- a key measure widely used to estimate the water content of a snowpack. However, forecasting SWE is challenging because SWE is influenced by various factors including topography and an array of environmental conditions, and has therefore been observed to be spatio-temporally variable. Classical approaches to SWE forecasting have not adequately utilized these spatial/temporal correlations, nor do they provide uncertainty estimates -- which can be of significant value to the decision maker. In this paper, we present ForeSWE, a new probabilistic spatio-temporal forecasting model that integrates deep learning and classical probabilistic techniques. The resulting model features a combination of an attention mechanism to integrate spatiotemporal features and interactions, alongside a Gaussian process module that provides principled quantification of prediction uncertainty. We evaluate the model on data from 512 Snow Telemetry (SNOTEL) stations in the Western US. The results show significant improvements in both forecasting accuracy and prediction interval compared to existing approaches. The results also serve to highlight the efficacy in uncertainty estimates between different approaches. Collectively, these findings have provided a platform for deployment and feedback by the water management community.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08861",
        "abs_url": "https://arxiv.org/abs/2511.08861",
        "pdf_url": "https://arxiv.org/pdf/2511.08861",
        "title": "EEG-X: Device-Agnostic and Noise-Robust Foundation Model for EEG",
        "authors": [
            "Navid Mohammadi Foumani",
            "Soheila Ghane",
            "Nam Nguyen",
            "Mahsa Salehi",
            "Geoffrey I. Webb",
            "Geoffrey Mackellar"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Human-Computer Interaction (cs.HC)",
        "abstract": "Foundation models for EEG analysis are still in their infancy, limited by two key challenges: (1) variability across datasets caused by differences in recording devices and configurations, and (2) the low signal-to-noise ratio (SNR) of EEG, where brain signals are often buried under artifacts and non-brain sources. To address these challenges, we present EEG-X, a device-agnostic and noise-robust foundation model for EEG representation learning. EEG-X introduces a novel location-based channel embedding that encodes spatial information and improves generalization across domains and tasks by allowing the model to handle varying channel numbers, combinations, and recording lengths. To enhance robustness against noise, EEG-X employs a noise-aware masking and reconstruction strategy in both raw and latent spaces. Unlike previous models that mask and reconstruct raw noisy EEG signals, EEG-X is trained to reconstruct denoised signals obtained through an artifact removal process, ensuring that the learned representations focus on neural activity rather than noise. To further enhance reconstruction-based pretraining, EEG-X introduces a dictionary-inspired convolutional transformation (DiCT) layer that projects signals into a structured feature space before computing reconstruction (MSE) loss, reducing noise sensitivity and capturing frequency- and shape-aware similarities. Experiments on datasets collected from diverse devices show that EEG-X outperforms state-of-the-art methods across multiple downstream EEG tasks and excels in cross-domain settings where pre-trained and downstream datasets differ in electrode layouts. The models and code are available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08878",
        "abs_url": "https://arxiv.org/abs/2511.08878",
        "pdf_url": "https://arxiv.org/pdf/2511.08878",
        "title": "Covariance Scattering Transforms",
        "authors": [
            "Andrea Cavallo",
            "Ayushman Raghuvanshi",
            "Sundeep Prabhakar Chepuri",
            "Elvin Isufi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Machine learning and data processing techniques relying on covariance information are widespread as they identify meaningful patterns in unsupervised and unlabeled settings. As a prominent example, Principal Component Analysis (PCA) projects data points onto the eigenvectors of their covariance matrix, capturing the directions of maximum variance. This mapping, however, falls short in two directions: it fails to capture information in low-variance directions, relevant when, e.g., the data contains high-variance noise; and it provides unstable results in low-sample regimes, especially when covariance eigenvalues are close. CoVariance Neural Networks (VNNs), i.e., graph neural networks using the covariance matrix as a graph, show improved stability to estimation errors and learn more expressive functions in the covariance spectrum than PCA, but require training and operate in a labeled setup. To get the benefits of both worlds, we propose Covariance Scattering Transforms (CSTs), deep untrained networks that sequentially apply filters localized in the covariance spectrum to the input data and produce expressive hierarchical representations via nonlinearities. We define the filters as covariance wavelets that capture specific and detailed covariance spectral patterns. We improve CSTs' computational and memory efficiency via a pruning mechanism, and we prove that their error due to finite-sample covariance estimations is less sensitive to close covariance eigenvalues compared to PCA, improving their stability. Our experiments on age prediction from cortical thickness measurements on 4 datasets collecting patients with neurodegenerative diseases show that CSTs produce stable representations in low-data settings, as VNNs but without any training, and lead to comparable or better predictions w.r.t. more complex learning models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08884",
        "abs_url": "https://arxiv.org/abs/2511.08884",
        "pdf_url": "https://arxiv.org/pdf/2511.08884",
        "title": "Spectral Predictability as a Fast Reliability Indicator for Time Series Forecasting Model Selection",
        "authors": [
            "Oliver Wang",
            "Pengrui Quan",
            "Kang Yang",
            "Mani Srivastava"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Practitioners deploying time series forecasting models face a dilemma: exhaustively validating dozens of models is computationally prohibitive, yet choosing the wrong model risks poor performance. We show that spectral predictability~$\\Omega$ -- a simple signal processing metric -- systematically stratifies model family performance, enabling fast model selection. We conduct controlled experiments in four different domains, then further expand our analysis to 51 models and 28 datasets from the GIFT-Eval benchmark. We find that large time series foundation models (TSFMs) systematically outperform lightweight task-trained baselines when $\\Omega$ is high, while their advantage vanishes as $\\Omega$ drops. Computing $\\Omega$ takes seconds per dataset, enabling practitioners to quickly assess whether their data suits TSFM approaches or whether simpler, cheaper models suffice. We demonstrate that $\\Omega$ stratifies model performance predictably, offering a practical first-pass filter that reduces validation costs while highlighting the need for models that excel on genuinely difficult (low-$\\Omega$) problems rather than merely optimizing easy ones.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08888",
        "abs_url": "https://arxiv.org/abs/2511.08888",
        "pdf_url": "https://arxiv.org/pdf/2511.08888",
        "title": "Weaver: Kronecker Product Approximations of Spatiotemporal Attention for Traffic Network Forecasting",
        "authors": [
            "Christopher Cheong",
            "Gary Davis",
            "Seongjin Choi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Spatiotemporal forecasting on transportation networks is a complex task that requires understanding how traffic nodes interact within a dynamic, evolving system dictated by traffic flow dynamics and social behavioral patterns. The importance of transportation networks and ITS for modern mobility and commerce necessitates forecasting models that are not only accurate but also interpretable, efficient, and robust under structural or temporal perturbations. Recent approaches, particularly Transformer-based architectures, have improved predictive performance but often at the cost of high computational overhead and diminished architectural interpretability. In this work, we introduce Weaver, a novel attention-based model that applies Kronecker product approximations (KPA) to decompose the PN X PN spatiotemporal attention of O(P^2N^2) complexity into local P X P temporal and N X N spatial attention maps. This Kronecker attention map enables our Parallel-Kronecker Matrix-Vector product (P2-KMV) for efficient spatiotemporal message passing with O(P^2N + N^2P) complexity. To capture real-world traffic dynamics, we address the importance of negative edges in modeling traffic behavior by introducing Valence Attention using the continuous Tanimoto coefficient (CTC), which provides properties conducive to precise latent graph generation and training stability. To fully utilize the model's learning capacity, we introduce the Traffic Phase Dictionary for self-conditioning. Evaluations on PEMS-BAY and METR-LA show that Weaver achieves competitive performance across model categories while training more efficiently.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08921",
        "abs_url": "https://arxiv.org/abs/2511.08921",
        "pdf_url": "https://arxiv.org/pdf/2511.08921",
        "title": "DeepDR: an integrated deep-learning model web server for drug repositioning",
        "authors": [
            "Shuting Jin",
            "Yi Jiang",
            "Yimin Liu",
            "Tengfei Ma",
            "Dongsheng Cao",
            "Leyi Wei",
            "Xiangrong Liu",
            "Xiangxiang Zeng"
        ],
        "comments": "13 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Background: Identifying new indications for approved drugs is a complex and time-consuming process that requires extensive knowledge of pharmacology, clinical data, and advanced computational methods. Recently, deep learning (DL) methods have shown their capability for the accurate prediction of drug repositioning. However, implementing DL-based modeling requires in-depth domain knowledge and proficient programming skills. Results: In this application, we introduce DeepDR, the first integrated platform that combines a variety of established DL-based models for disease- and target-specific drug repositioning tasks. DeepDR leverages invaluable experience to recommend candidate drugs, which covers more than 15 networks and a comprehensive knowledge graph that includes 5.9 million edges across 107 types of relationships connecting drugs, diseases, proteins/genes, pathways, and expression from six existing databases and a large scientific corpus of 24 million PubMed publications. Additionally, the recommended results include detailed descriptions of the recommended drugs and visualize key patterns with interpretability through a knowledge graph. Conclusion: DeepDR is free and open to all users without the requirement of registration. We believe it can provide an easy-to-use, systematic, highly accurate, and computationally automated platform for both experimental and computational scientists.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08939",
        "abs_url": "https://arxiv.org/abs/2511.08939",
        "pdf_url": "https://arxiv.org/pdf/2511.08939",
        "title": "TransactionGPT",
        "authors": [
            "Yingtong Dou",
            "Zhimeng Jiang",
            "Tianyi Zhang",
            "Mingzhi Hu",
            "Zhichao Xu",
            "Shubham Jain",
            "Uday Singh Saini",
            "Xiran Fan",
            "Jiarui Sun",
            "Menghai Pan",
            "Junpeng Wang",
            "Xin Dai",
            "Liang Wang",
            "Chin-Chia Michael Yeh",
            "Yujie Fan",
            "Vineeth Rakesh",
            "Huiyuan Chen",
            "Mangesh Bendre",
            "Zhongfang Zhuang",
            "Xiaoting Li",
            "Prince Aboagye",
            "Vivian Lai",
            "Minghua Xu",
            "Hao Yang",
            "Yiwei Cai",
            "Mahashweta Das",
            "Yuzhong Chen"
        ],
        "comments": "Technical Report",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "We present TransactionGPT (TGPT), a foundation model for consumer transaction data within one of world's largest payment networks. TGPT is designed to understand and generate transaction trajectories while simultaneously supporting a variety of downstream prediction and classification tasks. We introduce a novel 3D-Transformer architecture specifically tailored for capturing the complex dynamics in payment transaction data. This architecture incorporates design innovations that enhance modality fusion and computational efficiency, while seamlessly enabling joint optimization with downstream objectives. Trained on billion-scale real-world transactions, TGPT significantly improves downstream classification performance against a competitive production model and exhibits advantages over baselines in generating future transactions. We conduct extensive empirical evaluations utilizing a diverse collection of company transaction datasets spanning multiple downstream tasks, thereby enabling a thorough assessment of TGPT's effectiveness and efficiency in comparison to established methodologies. Furthermore, we examine the incorporation of LLM-derived embeddings within TGPT and benchmark its performance against fine-tuned LLMs, demonstrating that TGPT achieves superior predictive accuracy as well as faster training and inference. We anticipate that the architectural innovations and practical guidelines from this work will advance foundation models for transaction-like data and catalyze future research in this emerging field.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08940",
        "abs_url": "https://arxiv.org/abs/2511.08940",
        "pdf_url": "https://arxiv.org/pdf/2511.08940",
        "title": "QIBONN: A Quantum-Inspired Bilevel Optimizer for Neural Networks on Tabular Classification",
        "authors": [
            "Pedro Chumpitaz-Flores",
            "My Duong",
            "Ying Mao",
            "Kaixun Hua"
        ],
        "comments": "6 pages, 3 figures, 3 tables. Accepted at IEEE International Conference on Big Data 2025",
        "subjects": "Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Hyperparameter optimization (HPO) for neural networks on tabular data is critical to a wide range of applications, yet it remains challenging due to large, non-convex search spaces and the cost of exhaustive tuning. We introduce the Quantum-Inspired Bilevel Optimizer for Neural Networks (QIBONN), a bilevel framework that encodes feature selection, architectural hyperparameters, and regularization in a unified qubit-based representation. By combining deterministic quantum-inspired rotations with stochastic qubit mutations guided by a global attractor, QIBONN balances exploration and exploitation under a fixed evaluation budget. We conduct systematic experiments under single-qubit bit-flip noise (0.1\\%--1\\%) emulated by an IBM-Q backend. Results on 13 real-world datasets indicate that QIBONN is competitive with established methods, including classical tree-based methods and both classical/quantum-inspired HPO algorithms under the same tuning budget.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08944",
        "abs_url": "https://arxiv.org/abs/2511.08944",
        "pdf_url": "https://arxiv.org/pdf/2511.08944",
        "title": "Robust Backdoor Removal by Reconstructing Trigger-Activated Changes in Latent Representation",
        "authors": [
            "Kazuki Iwahana",
            "Yusuke Yamasaki",
            "Akira Ito",
            "Takayuki Miura",
            "Toshiki Shibahara"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Backdoor attacks pose a critical threat to machine learning models, causing them to behave normally on clean data but misclassify poisoned data into a poisoned class. Existing defenses often attempt to identify and remove backdoor neurons based on Trigger-Activated Changes (TAC) which is the activation differences between clean and poisoned data. These methods suffer from low precision in identifying true backdoor neurons due to inaccurate estimation of TAC values. In this work, we propose a novel backdoor removal method by accurately reconstructing TAC values in the latent representation. Specifically, we formulate the minimal perturbation that forces clean data to be classified into a specific class as a convex quadratic optimization problem, whose optimal solution serves as a surrogate for TAC. We then identify the poisoned class by detecting statistically small $L^2$ norms of perturbations and leverage the perturbation of the poisoned class in fine-tuning to remove backdoors. Experiments on CIFAR-10, GTSRB, and TinyImageNet demonstrated that our approach consistently achieves superior backdoor suppression with high clean accuracy across different attack types, datasets, and architectures, outperforming existing defense methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08946",
        "abs_url": "https://arxiv.org/abs/2511.08946",
        "pdf_url": "https://arxiv.org/pdf/2511.08946",
        "title": "Improving Conditional VAE with approximation using Normalizing Flows",
        "authors": [
            "Tuhin Subhra De"
        ],
        "comments": "Independent Work",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Variational Autoencoders and Generative Adversarial Networks remained the state-of-the-art (SOTA) generative models until 2022. Now they are superseded by diffusion based models. Efforts to improve traditional models have stagnated as a result. In old-school fashion, we explore image generation with conditional Variational Autoencoders (CVAE) to incorporate desired attributes within the images. VAEs are known to produce blurry images with less diversity, we refer a method that solve this issue by leveraging the variance of the gaussian decoder as a learnable parameter during training. Previous works on CVAEs assumed that the conditional distribution of the latent space given the labels is equal to the prior distribution, which is not the case in reality. We show that estimating it using normalizing flows results in better image generation than existing methods by reducing the FID by 5% and increasing log likelihood by 7.7% than the previous case.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08968",
        "abs_url": "https://arxiv.org/abs/2511.08968",
        "pdf_url": "https://arxiv.org/pdf/2511.08968",
        "title": "Bayesian Mixture of Experts For Large Language Models",
        "authors": [
            "Maryam Dialameh",
            "Hossein Rajabzadeh",
            "Weiwei Zhang",
            "Walid Ahmed",
            "Hyock Ju Kwon"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "We present Bayesian Mixture of Experts (Bayesian-MoE), a post-hoc uncertainty estimation framework for fine-tuned large language models (LLMs) based on Mixture-of-Experts architectures. Our method applies a structured Laplace approximation to the second linear layer of each expert, enabling calibrated uncertainty estimation without modifying the original training procedure or introducing new parameters. Unlike prior approaches, which apply Bayesian inference to added adapter modules, Bayesian-MoE directly targets the expert pathways already present in MoE models, leveraging their modular design for tractable block-wise posterior estimation. We use Kronecker-factored low-rank approximations to model curvature and derive scalable estimates of predictive uncertainty and marginal likelihood. Experiments on common-sense reasoning benchmarks with Qwen1.5-MoE and DeepSeek-MoE demonstrate that Bayesian-MoE improves both expected calibration error (ECE) and negative log-likelihood (NLL) over baselines, confirming its effectiveness for reliable downstream decision-making.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08972",
        "abs_url": "https://arxiv.org/abs/2511.08972",
        "pdf_url": "https://arxiv.org/pdf/2511.08972",
        "title": "Selective Sinkhorn Routing for Improved Sparse Mixture of Experts",
        "authors": [
            "Duc Anh Nguyen",
            "Huu Binh Ta",
            "Nhuan Le Duc",
            "Tan M. Nguyen",
            "Toan Tran"
        ],
        "comments": "14 pages, 6 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Sparse Mixture-of-Experts (SMoE) has gained prominence as a scalable and computationally efficient architecture, enabling significant growth in model capacity without incurring additional inference costs. However, existing SMoE models often rely on auxiliary losses (e.g., z-loss, load balancing) and additional trainable parameters (e.g., noisy gating) to encourage expert diversity, leading to objective misalignment and increased model complexity. Moreover, existing Sinkhorn-based methods suffer from significant training overhead due to their heavy reliance on the computationally expensive Sinkhorn algorithm. In this work, we formulate token-to-expert assignment as an optimal transport problem, incorporating constraints to ensure balanced expert utilization. We demonstrate that introducing a minimal degree of optimal transport-based routing enhances SMoE performance without requiring auxiliary balancing losses. Unlike previous methods, our approach derives gating scores directly from the transport map, enabling more effective token-to-expert balancing, supported by both theoretical analysis and empirical results. Building on these insights, we propose Selective Sinkhorn Routing (SSR), a routing mechanism that replaces auxiliary loss with lightweight Sinkhorn-based routing. SSR promotes balanced token assignments while preserving flexibility in expert selection. Across both language modeling and image classification tasks, SSR achieves faster training, higher accuracy, and greater robustness to input corruption.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08986",
        "abs_url": "https://arxiv.org/abs/2511.08986",
        "pdf_url": "https://arxiv.org/pdf/2511.08986",
        "title": "Data reuse enables cost-efficient randomized trials of medical AI models",
        "authors": [
            "Michael Nercessian",
            "Wenxin Zhang",
            "Alexander Schubert",
            "Daphne Yang",
            "Maggie Chung",
            "Ahmed Alaa",
            "Adam Yala"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP); Methodology (stat.ME)",
        "abstract": "Randomized controlled trials (RCTs) are indispensable for establishing the clinical value of medical artificial-intelligence (AI) tools, yet their high cost and long timelines hinder timely validation as new models emerge rapidly. Here, we propose BRIDGE, a data-reuse RCT design for AI-based risk models. AI risk models support a broad range of interventions, including screening, treatment selection, and clinical alerts. BRIDGE trials recycle participant-level data from completed trials of AI models when legacy and updated models make concordant predictions, thereby reducing the enrollment requirement for subsequent trials. We provide a practical checklist for investigators to assess whether reusing data from previous trials allows for valid causal inference and preserves type I error. Using real-world datasets across breast cancer, cardiovascular disease, and sepsis, we demonstrate concordance between successive AI models, with up to 64.8% overlap in top 5% high-risk cohorts. We then simulate a series of breast cancer screening studies, where our design reduced required enrollment by 46.6%--saving over US$2.8 million--while maintaining 80% power. By transforming trials into adaptive, modular studies, our proposed design makes Level I evidence generation feasible for every model iteration, thereby accelerating cost-effective translation of AI into routine care.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09025",
        "abs_url": "https://arxiv.org/abs/2511.09025",
        "pdf_url": "https://arxiv.org/pdf/2511.09025",
        "title": "FLAD: Federated Learning for LLM-based Autonomous Driving in Vehicle-Edge-Cloud Networks",
        "authors": [
            "Tianao Xiang",
            "Mingjian Zhi",
            "Yuanguo Bi",
            "Lin Cai",
            "Yuhao Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) have impressive data fusion and reasoning capabilities for autonomous driving (AD). However, training LLMs for AD faces significant challenges including high computation transmission costs, and privacy concerns associated with sensitive driving data. Federated Learning (FL) is promising for enabling autonomous vehicles (AVs) to collaboratively train models without sharing raw data. We present Federated LLM-based Autonomous Driving (FLAD), an FL framework that leverages distributed multimodal sensory data across AVs in heterogeneous environment. FLAD has three key innovations: (1) a cloud-edge-vehicle collaborative architecture that reduces communication delay and preserving data privacy; (2) an intelligent parallelized collaborative training with a communication scheduling mechanism that optimizes training efficiency, leveraging end-devices otherwise having insufficient resources for model training; and (3) a knowledge distillation method that personalizes LLM according to heterogeneous edge data. In addition, we prototype FLAD in a testbed with NVIDIA Jetsons, overcoming practical implementation challenges including CPU/GPU memory sharing in resource-constrained devices, dynamic model partitions, and fault-tolerant this http URL experimental evaluation demonstrates that FLAD achieves superior end-to-end AD performance while efficiently utilizing distributed vehicular resources, opening up new possibilities for future collaborative AD model training and knowledge sharing.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09039",
        "abs_url": "https://arxiv.org/abs/2511.09039",
        "pdf_url": "https://arxiv.org/pdf/2511.09039",
        "title": "Fairness-Aware Few-Shot Learning for Audio-Visual Stress Detection",
        "authors": [
            "Anushka Sanjay Shelke",
            "Aditya Sneh",
            "Arya Adyasha",
            "Haroon R. Lone"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computers and Society (cs.CY); Human-Computer Interaction (cs.HC)",
        "abstract": "Fairness in AI-driven stress detection is critical for equitable mental healthcare, yet existing models frequently exhibit gender bias, particularly in data-scarce scenarios. To address this, we propose FairM2S, a fairness-aware meta-learning framework for stress detection leveraging audio-visual data. FairM2S integrates Equalized Odds constraints during both meta-training and adaptation phases, employing adversarial gradient masking and fairness-constrained meta-updates to effectively mitigate bias. Evaluated against five state-of-the-art baselines, FairM2S achieves 78.1% accuracy while reducing the Equal Opportunity to 0.06, demonstrating substantial fairness gains. We also release SAVSD, a smartphone-captured dataset with gender annotations, designed to support fairness research in low-resource, real-world contexts. Together, these contributions position FairM2S as a state-of-the-art approach for equitable and scalable few-shot stress detection in mental health AI. We release our dataset and FairM2S publicly with this paper.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09042",
        "abs_url": "https://arxiv.org/abs/2511.09042",
        "pdf_url": "https://arxiv.org/pdf/2511.09042",
        "title": "GeoGNN: Quantifying and Mitigating Semantic Drift in Text-Attributed Graphs",
        "authors": [
            "Liangwei Yang",
            "Jing Ma",
            "Jianguo Zhang",
            "Zhiwei Liu",
            "Jielin Qiu",
            "Shirley Kokane",
            "Shiyu Wang",
            "Haolin Chen",
            "Rithesh Murthy",
            "Ming Zhu",
            "Huan Wang",
            "Weiran Yao",
            "Caiming Xiong",
            "Shelby Heinecke"
        ],
        "comments": "10 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph neural networks (GNNs) on text--attributed graphs (TAGs) typically encode node texts using pretrained language models (PLMs) and propagate these embeddings through linear neighborhood aggregation. However, the representation spaces of modern PLMs are highly non--linear and geometrically structured, where textual embeddings reside on curved semantic manifolds rather than flat Euclidean spaces. Linear aggregation on such manifolds inevitably distorts geometry and causes semantic drift--a phenomenon where aggregated representations deviate from the intrinsic manifold, losing semantic fidelity and expressive power. To quantitatively investigate this problem, this work introduces a local PCA--based metric that measures the degree of semantic drift and provides the first quantitative framework to analyze how different aggregation mechanisms affect manifold structure. Building upon these insights, we propose Geodesic Aggregation, a manifold--aware mechanism that aggregates neighbor information along geodesics via log--exp mappings on the unit sphere, ensuring that representations remain faithful to the semantic manifold during message passing. We further develop GeoGNN, a practical instantiation that integrates spherical attention with manifold interpolation. Extensive experiments across four benchmark datasets and multiple text encoders show that GeoGNN substantially mitigates semantic drift and consistently outperforms strong baselines, establishing the importance of manifold--aware aggregation in text--attributed graph learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09047",
        "abs_url": "https://arxiv.org/abs/2511.09047",
        "pdf_url": "https://arxiv.org/pdf/2511.09047",
        "title": "Preference is More Than Comparisons: Rethinking Dueling Bandits with Augmented Human Feedback",
        "authors": [
            "Shengbo Wang",
            "Hong Sun",
            "Ke Li"
        ],
        "comments": "Extended version of our AAAI 2026 paper",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Interactive preference elicitation (IPE) aims to substantially reduce human effort while acquiring human preferences in wide personalization systems. Dueling bandit (DB) algorithms enable optimal decision-making in IPE building on pairwise comparisons. However, they remain inefficient when human feedback is sparse. Existing methods address sparsity by heavily relying on parametric reward models, whose rigid assumptions are vulnerable to misspecification. In contrast, we explore an alternative perspective based on feedback augmentation, and introduce critical improvements to the model-free DB framework. Specifically, we introduce augmented confidence bounds to integrate augmented human feedback under generalized concentration properties, and analyze the multi-factored performance trade-off via regret analysis. Our prototype algorithm achieves competitive performance across several IPE benchmarks, including recommendation, multi-objective optimization, and response optimization for large language models, demonstrating the potential of our approach for provably efficient IPE in broader applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09048",
        "abs_url": "https://arxiv.org/abs/2511.09048",
        "pdf_url": "https://arxiv.org/pdf/2511.09048",
        "title": "Guaranteeing Conservation of Integrals with Projection in Physics-Informed Neural Networks",
        "authors": [
            "Anthony Baez",
            "Wang Zhang",
            "Ziwen Ma",
            "Lam Nguyen",
            "Subhro Das",
            "Luca Daniel"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose a novel projection method that guarantees the conservation of integral quantities in Physics-Informed Neural Networks (PINNs). While the soft constraint that PINNs use to enforce the structure of partial differential equations (PDEs) enables necessary flexibility during training, it also permits the discovered solution to violate physical laws. To address this, we introduce a projection method that guarantees the conservation of the linear and quadratic integrals, both separately and jointly. We derived the projection formulae by solving constrained non-linear optimization problems and found that our PINN modified with the projection, which we call PINN-Proj, reduced the error in the conservation of these quantities by three to four orders of magnitude compared to the soft constraint and marginally reduced the PDE solution error. We also found evidence that the projection improved convergence through improving the conditioning of the loss landscape. Our method holds promise as a general framework to guarantee the conservation of any integral quantity in a PINN if a tractable solution exists.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09063",
        "abs_url": "https://arxiv.org/abs/2511.09063",
        "pdf_url": "https://arxiv.org/pdf/2511.09063",
        "title": "Human-Corrected Labels Learning: Enhancing Labels Quality via Human Correction of VLMs Discrepancies",
        "authors": [
            "Zhongnian Li",
            "Lan Chen",
            "Yixin Xu",
            "Shi Xu",
            "Xinzheng Xu"
        ],
        "comments": "11 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Vision-Language Models (VLMs), with their powerful content generation capabilities, have been successfully applied to data annotation processes. However, the VLM-generated labels exhibit dual limitations: low quality (i.e., label noise) and absence of error correction mechanisms. To enhance label quality, we propose Human-Corrected Labels (HCLs), a novel setting that efficient human correction for VLM-generated noisy labels. As shown in Figure 1(b), HCL strategically deploys human correction only for instances with VLM discrepancies, achieving both higher-quality annotations and reduced labor costs. Specifically, we theoretically derive a risk-consistent estimator that incorporates both human-corrected labels and VLM predictions to train classifiers. Besides, we further propose a conditional probability method to estimate the label distribution using a combination of VLM outputs and model predictions. Extensive experiments demonstrate that our approach achieves superior classification performance and is robust to label noise, validating the effectiveness of HCL in practical weak supervision scenarios. Code this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09100",
        "abs_url": "https://arxiv.org/abs/2511.09100",
        "pdf_url": "https://arxiv.org/pdf/2511.09100",
        "title": "FedPM: Federated Learning Using Second-order Optimization with Preconditioned Mixing of Local Parameters",
        "authors": [
            "Hiro Ishii",
            "Kenta Niwa",
            "Hiroshi Sawada",
            "Akinori Fujino",
            "Noboru Harada",
            "Rio Yokota"
        ],
        "comments": "18 pages, 7 figures. Accepted for publication in the Proceedings of the AAAI Conference on Artificial Intelligence (AAAI-26)",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "We propose Federated Preconditioned Mixing (FedPM), a novel Federated Learning (FL) method that leverages second-order optimization. Prior methods--such as LocalNewton, LTDA, and FedSophia--have incorporated second-order optimization in FL by performing iterative local updates on clients and applying simple mixing of local parameters on the server. However, these methods often suffer from drift in local preconditioners, which significantly disrupts the convergence of parameter training, particularly in heterogeneous data settings. To overcome this issue, we refine the update rules by decomposing the ideal second-order update--computed using globally preconditioned global gradients--into parameter mixing on the server and local parameter updates on clients. As a result, our FedPM introduces preconditioned mixing of local parameters on the server, effectively mitigating drift in local preconditioners. We provide a theoretical convergence analysis demonstrating a superlinear rate for strongly convex objectives in scenarios involving a single local update. To demonstrate the practical benefits of FedPM, we conducted extensive experiments. The results showed significant improvements with FedPM in the test accuracy compared to conventional methods incorporating simple mixing, fully leveraging the potential of second-order optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09114",
        "abs_url": "https://arxiv.org/abs/2511.09114",
        "pdf_url": "https://arxiv.org/pdf/2511.09114",
        "title": "Towards a Generalisable Cyber Defence Agent for Real-World Computer Networks",
        "authors": [
            "Tim Dudman",
            "Martyn Bull"
        ],
        "comments": "CAMLIS 2025. To be published in the Proceedings of Machine Learning Research (PMLR)",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Recent advances in deep reinforcement learning for autonomous cyber defence have resulted in agents that can successfully defend simulated computer networks against cyber-attacks. However, many of these agents would need retraining to defend networks with differing topology or size, making them poorly suited to real-world networks where topology and size can vary over time. In this research we introduce a novel set of Topological Extensions for Reinforcement Learning Agents (TERLA) that provide generalisability for the defence of networks with differing topology and size, without the need for retraining. Our approach involves the use of heterogeneous graph neural network layers to produce a fixed-size latent embedding representing the observed network state. This representation learning stage is coupled with a reduced, fixed-size, semantically meaningful and interpretable action space. We apply TERLA to a standard deep reinforcement learning Proximal Policy Optimisation (PPO) agent model, and to reduce the sim-to-real gap, conduct our research using Cyber Autonomy Gym for Experimentation (CAGE) Challenge 4. This Cyber Operations Research Gym environment has many of the features of a real-world network, such as realistic Intrusion Detection System (IDS) events and multiple agents defending network segments of differing topology and size. TERLA agents retain the defensive performance of vanilla PPO agents whilst showing improved action efficiency. Generalisability has been demonstrated by showing that all TERLA agents have the same network-agnostic neural network architecture, and by deploying a single TERLA agent multiple times to defend network segments with differing topology and size, showing improved defensive performance and efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09138",
        "abs_url": "https://arxiv.org/abs/2511.09138",
        "pdf_url": "https://arxiv.org/pdf/2511.09138",
        "title": "Trusted Multi-view Learning for Long-tailed Classification",
        "authors": [
            "Chuanqing Tang",
            "Yifei Shi",
            "Guanghao Lin",
            "Lei Xing",
            "Long Shi"
        ],
        "comments": "This paper has been accepted to AAAI2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Class imbalance has been extensively studied in single-view scenarios; however, addressing this challenge in multi-view contexts remains an open problem, with even scarcer research focusing on trustworthy solutions. In this paper, we tackle a particularly challenging class imbalance problem in multi-view scenarios: long-tailed classification. We propose TMLC, a Trusted Multi-view Long-tailed Classification framework, which makes contributions on two critical aspects: opinion aggregation and pseudo-data generation. Specifically, inspired by Social Identity Theory, we design a group consensus opinion aggregation mechanism that guides decision making toward the direction favored by the majority of the group. In terms of pseudo-data generation, we introduce a novel distance metric to adapt SMOTE for multi-view scenarios and develop an uncertainty-guided data generation module that produces high-quality pseudo-data, effectively mitigating the adverse effects of class imbalance. Extensive experiments on long-tailed multi-view datasets demonstrate that our model is capable of achieving superior performance. The code is released at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09144",
        "abs_url": "https://arxiv.org/abs/2511.09144",
        "pdf_url": "https://arxiv.org/pdf/2511.09144",
        "title": "Practical Global and Local Bounds in Gaussian Process Regression via Chaining",
        "authors": [
            "Junyi Liu",
            "Stanley Kok"
        ],
        "comments": "Accepted as a conference paper at AAAI2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Gaussian process regression (GPR) is a popular nonparametric Bayesian method that provides predictive uncertainty estimates and is widely used in safety-critical applications. While prior research has introduced various uncertainty bounds, most existing approaches require access to specific input features and rely on posterior mean and variance estimates or tuning hyperparameters. These limitations hinder robustness and fail to capture the model's global behavior in expectation. To address these limitations, we propose a chaining-based framework for estimating upper and lower bounds on the expected extreme values over unseen data, without requiring access to specific input locations. We provide kernel-specific refinements for commonly used kernels such as RBF and Matérn, in which our bounds are tighter than generic constructions. We further improve numerical tightness by avoiding analytical relaxations. In addition to global estimation, we also develop a novel method for local uncertainty quantification at specified inputs. This approach leverages chaining geometry through partition diameters, adapting to local structure without relying on posterior variance scaling. Our experimental results validate the theoretical findings and demonstrate that our method outperforms existing approaches on both synthetic and real-world datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09166",
        "abs_url": "https://arxiv.org/abs/2511.09166",
        "pdf_url": "https://arxiv.org/pdf/2511.09166",
        "title": "Unsupervised Feature Selection Through Group Discovery",
        "authors": [
            "Shira Lifshitz",
            "Ofir Lindenbaum",
            "Gal Mishne",
            "Ron Meir",
            "Hadas Benisty"
        ],
        "comments": "Accepted to AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Unsupervised feature selection (FS) is essential for high-dimensional learning tasks where labels are not available. It helps reduce noise, improve generalization, and enhance interpretability. However, most existing unsupervised FS methods evaluate features in isolation, even though informative signals often emerge from groups of related features. For example, adjacent pixels, functionally connected brain regions, or correlated financial indicators tend to act together, making independent evaluation suboptimal. Although some methods attempt to capture group structure, they typically rely on predefined partitions or label supervision, limiting their applicability. We propose GroupFS, an end-to-end, fully differentiable framework that jointly discovers latent feature groups and selects the most informative groups among them, without relying on fixed a priori groups or label supervision. GroupFS enforces Laplacian smoothness on both feature and sample graphs and applies a group sparsity regularizer to learn a compact, structured representation. Across nine benchmarks spanning images, tabular data, and biological datasets, GroupFS consistently outperforms state-of-the-art unsupervised FS in clustering and selects groups of features that align with meaningful patterns.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09167",
        "abs_url": "https://arxiv.org/abs/2511.09167",
        "pdf_url": "https://arxiv.org/pdf/2511.09167",
        "title": "Compact Memory for Continual Logistic Regression",
        "authors": [
            "Yohan Jung",
            "Hyungi Lee",
            "Wenlong Chen",
            "Thomas Möllenhoff",
            "Yingzhen Li",
            "Juho Lee",
            "Mohammad Emtiyaz Khan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Despite recent progress, continual learning still does not match the performance of batch training. To avoid catastrophic forgetting, we need to build compact memory of essential past knowledge, but no clear solution has yet emerged, even for shallow neural networks with just one or two layers. In this paper, we present a new method to build compact memory for logistic regression. Our method is based on a result by Khan and Swaroop [2021] who show the existence of optimal memory for such models. We formulate the search for the optimal memory as Hessian-matching and propose a probabilistic PCA method to estimate them. Our approach can drastically improve accuracy compared to Experience Replay. For instance, on Split-ImageNet, we get 60% accuracy compared to 30% obtained by replay with memory-size equivalent to 0.3% of the data size. Increasing the memory size to 2% further boosts the accuracy to 74%, closing the gap to the batch accuracy of 77.6% on this task. Our work opens a new direction for building compact memory that can also be useful in the future for continual deep learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09180",
        "abs_url": "https://arxiv.org/abs/2511.09180",
        "pdf_url": "https://arxiv.org/pdf/2511.09180",
        "title": "FSampler: Training Free Acceleration of Diffusion Sampling via Epsilon Extrapolation",
        "authors": [
            "Michael A. Vladimir"
        ],
        "comments": "10 pages; diffusion models; accelerated sampling; ODE solvers; epsilon extrapolation; training free inference",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "FSampler is a training free, sampler agnostic execution layer that accelerates diffusion sampling by reducing the number of function evaluations (NFE). FSampler maintains a short history of denoising signals (epsilon) from recent real model calls and extrapolates the next epsilon using finite difference predictors at second order, third order, or fourth order, falling back to lower order when history is insufficient. On selected steps the predicted epsilon substitutes the model call while keeping each sampler's update rule unchanged. Predicted epsilons are validated for finiteness and magnitude; a learning stabilizer rescales predictions on skipped steps to correct drift, and an optional gradient estimation stabilizer compensates local curvature. Protected windows, periodic anchors, and a cap on consecutive skips bound deviation over the trajectory. Operating at the sampler level, FSampler integrates with Euler/DDIM, DPM++ 2M/2S, LMS/AB2, and RES family exponential multistep methods and drops into standard workflows. FLUX.1 dev, Qwen Image, and Wan 2.2, FSampler reduces time by 8 to 22% and model calls by 15 to 25% at high fidelity (Structural Similarity Index (SSIM) 0.95 to 0.99), without altering sampler formulas. With an aggressive adaptive gate, reductions can reach 45 to 50% fewer model calls at lower fidelity (SSIM 0.73 to 0.74).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09190",
        "abs_url": "https://arxiv.org/abs/2511.09190",
        "pdf_url": "https://arxiv.org/pdf/2511.09190",
        "title": "Iterated Population Based Training with Task-Agnostic Restarts",
        "authors": [
            "Alexander Chebykin",
            "Tanja Alderliesten",
            "Peter A. N. Bosman"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Hyperparameter Optimization (HPO) can lift the burden of tuning hyperparameters (HPs) of neural networks. HPO algorithms from the Population Based Training (PBT) family are efficient thanks to dynamically adjusting HPs every few steps of the weight optimization. Recent results indicate that the number of steps between HP updates is an important meta-HP of all PBT variants that can substantially affect their performance. Yet, no method or intuition is available for efficiently setting its value. We introduce Iterated Population Based Training (IPBT), a novel PBT variant that automatically adjusts this HP via restarts that reuse weight information in a task-agnostic way and leverage time-varying Bayesian optimization to reinitialize HPs. Evaluation on 8 image classification and reinforcement learning tasks shows that, on average, our algorithm matches or outperforms 5 previous PBT variants and other HPO algorithms (random search, ASHA, SMAC3), without requiring a budget increase or any changes to its HPs. The source code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09200",
        "abs_url": "https://arxiv.org/abs/2511.09200",
        "pdf_url": "https://arxiv.org/pdf/2511.09200",
        "title": "Sure! Here's a short and concise title for your paper: \"Contamination in Generated Text Detection Benchmarks\"",
        "authors": [
            "Philipp Dingfelder",
            "Christian Riess"
        ],
        "comments": "published at CSCML 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large language models are increasingly used for many applications. To prevent illicit use, it is desirable to be able to detect AI-generated text. Training and evaluation of such detectors critically depend on suitable benchmark datasets. Several groups took on the tedious work of collecting, curating, and publishing large and diverse datasets for this task. However, it remains an open challenge to ensure high quality in all relevant aspects of such a dataset. For example, the DetectRL benchmark exhibits relatively simple patterns of AI-generation in 98.5% of the Claude-LLM data. These patterns may include introductory words such as \"Sure! Here is the academic article abstract:\", or instances where the LLM rejects the prompted task. In this work, we demonstrate that detectors trained on such data use such patterns as shortcuts, which facilitates spoofing attacks on the trained detectors. We consequently reprocessed the DetectRL dataset with several cleansing operations. Experiments show that such data cleansing makes direct attacks more difficult. The reprocessed dataset is publicly available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09202",
        "abs_url": "https://arxiv.org/abs/2511.09202",
        "pdf_url": "https://arxiv.org/pdf/2511.09202",
        "title": "Stochastic Mean-Shift Clustering",
        "authors": [
            "Itshak Lapidot",
            "Yann Sepulcre",
            "Tom Trigano"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present a stochastic version of the mean-shift clustering algorithm. In this stochastic version a randomly chosen sequence of data points move according to partial gradient ascent steps of the objective function. Theoretical results illustrating the convergence of the proposed approach, and its relative performances is evaluated on synthesized 2-dimensional samples generated by a Gaussian mixture distribution and compared with state-of-the-art methods. It can be observed that in most cases the stochastic mean-shift clustering outperforms the standard mean-shift. We also illustrate as a practical application the use of the presented method for speaker clustering.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09209",
        "abs_url": "https://arxiv.org/abs/2511.09209",
        "pdf_url": "https://arxiv.org/pdf/2511.09209",
        "title": "CoCo-MILP: Inter-Variable Contrastive and Intra-Constraint Competitive MILP Solution Prediction",
        "authors": [
            "Tianle Pu",
            "Jianing Li",
            "Yingying Gao",
            "Shixuan Liu",
            "Zijie Geng",
            "Haoyang Liu",
            "Chao Chen",
            "Changjun Fan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Mixed-Integer Linear Programming (MILP) is a cornerstone of combinatorial optimization, yet solving large-scale instances remains a significant computational challenge. Recently, Graph Neural Networks (GNNs) have shown promise in accelerating MILP solvers by predicting high-quality solutions. However, we identify that existing methods misalign with the intrinsic structure of MILP problems at two levels. At the leaning objective level, the Binary Cross-Entropy (BCE) loss treats variables independently, neglecting their relative priority and yielding plausible logits. At the model architecture level, standard GNN message passing inherently smooths the representations across variables, missing the natural competitive relationships within constraints. To address these challenges, we propose CoCo-MILP, which explicitly models inter-variable Contrast and intra-constraint Competition for advanced MILP solution prediction. At the objective level, CoCo-MILP introduces the Inter-Variable Contrastive Loss (VCL), which explicitly maximizes the embedding margin between variables assigned one versus zero. At the architectural level, we design an Intra-Constraint Competitive GNN layer that, instead of homogenizing features, learns to differentiate representations of competing variables within a constraint, capturing their exclusionary nature. Experimental results on standard benchmarks demonstrate that CoCo-MILP significantly outperforms existing learning-based approaches, reducing the solution gap by up to 68.12% compared to traditional solvers. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09211",
        "abs_url": "https://arxiv.org/abs/2511.09211",
        "pdf_url": "https://arxiv.org/pdf/2511.09211",
        "title": "Parameter-Free Clustering via Self-Supervised Consensus Maximization (Extended Version)",
        "authors": [
            "Lijun Zhang",
            "Suyuan Liu",
            "Siwei Wang",
            "Shengju Yu",
            "Xueling Zhu",
            "Miaomiao Li",
            "Xinwang Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Clustering is a fundamental task in unsupervised learning, but most existing methods heavily rely on hyperparameters such as the number of clusters or other sensitive settings, limiting their applicability in real-world scenarios. To address this long-standing challenge, we propose a novel and fully parameter-free clustering framework via Self-supervised Consensus Maximization, named SCMax. Our framework performs hierarchical agglomerative clustering and cluster evaluation in a single, integrated process. At each step of agglomeration, it creates a new, structure-aware data representation through a self-supervised learning task guided by the current clustering structure. We then introduce a nearest neighbor consensus score, which measures the agreement between the nearest neighbor-based merge decisions suggested by the original representation and the self-supervised one. The moment at which consensus maximization occurs can serve as a criterion for determining the optimal number of clusters. Extensive experiments on multiple datasets demonstrate that the proposed framework outperforms existing clustering approaches designed for scenarios with an unknown number of clusters.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09216",
        "abs_url": "https://arxiv.org/abs/2511.09216",
        "pdf_url": "https://arxiv.org/pdf/2511.09216",
        "title": "Controllable protein design through Feynman-Kac steering",
        "authors": [
            "Erik Hartman",
            "Jonas Wallin",
            "Johan Malmström",
            "Jimmy Olsson"
        ],
        "comments": "15 pages, 6 figures",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM); Machine Learning (stat.ML)",
        "abstract": "Diffusion-based models have recently enabled the generation of realistic and diverse protein structures, yet they remain limited in their ability to steer outcomes toward specific functional or biochemical objectives, such as binding affinity or sequence composition. Here we extend the Feynman-Kac (FK) steering framework, an inference-time control approach, to diffusion-based protein design. By coupling FK steering with structure generation, the method guides sampling toward desirable structural or energetic features while maintaining the diversity of the underlying diffusion process. To enable simultaneous generation of both sequence and structure properties, rewards are computed on models refined through ProteinMPNN and all-atom relaxation. Applied to binder design, FK steering consistently improves predicted interface energetics across diverse targets with minimal computational overhead. More broadly, this work demonstrates that inference-time FK control generalizes diffusion-based protein design to arbitrary, non-differentiable, and reward-agnostic objectives, providing a unified and model-independent framework for guided molecular generation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09219",
        "abs_url": "https://arxiv.org/abs/2511.09219",
        "pdf_url": "https://arxiv.org/pdf/2511.09219",
        "title": "Planning in Branch-and-Bound: Model-Based Reinforcement Learning for Exact Combinatorial Optimization",
        "authors": [
            "Paul Strang",
            "Zacharie Alès",
            "Côme Bissuel",
            "Safia Kedad-Sidhoum",
            "Emmanuel Rachelson"
        ],
        "comments": "arXiv admin note: text overlap with arXiv:2510.19348",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Mixed-Integer Linear Programming (MILP) lies at the core of many real-world combinatorial optimization (CO) problems, traditionally solved by branch-and-bound (B&B). A key driver influencing B&B solvers efficiency is the variable selection heuristic that guides branching decisions. Looking to move beyond static, hand-crafted heuristics, recent work has explored adapting traditional reinforcement learning (RL) algorithms to the B&B setting, aiming to learn branching strategies tailored to specific MILP distributions. In parallel, RL agents have achieved remarkable success in board games, a very specific type of combinatorial problems, by leveraging environment simulators to plan via Monte Carlo Tree Search (MCTS). Building on these developments, we introduce Plan-and-Branch-and-Bound (PlanB&B), a model-based reinforcement learning (MBRL) agent that leverages a learned internal model of the B&B dynamics to discover improved branching strategies. Computational experiments empirically validate our approach, with our MBRL branching agent outperforming previous state-of-the-art RL methods across four standard MILP benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09261",
        "abs_url": "https://arxiv.org/abs/2511.09261",
        "pdf_url": "https://arxiv.org/pdf/2511.09261",
        "title": "A Distributed Training Architecture For Combinatorial Optimization",
        "authors": [
            "Yuyao Long"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In recent years, graph neural networks (GNNs) have been widely applied in tackling combinatorial optimization problems. However, existing methods still suffer from limited accuracy when addressing that on complex graphs and exhibit poor scalability, since full training requires loading the whole adjacent matrix and all embeddings at a time, the it may results in out of memory of a single machine. This limitation significantly restricts their applicability to large-scale scenarios. To address these challenges, we propose a distributed GNN-based training framework for combinatorial optimization. In details, firstly, large graph is partition into several small subgraphs. Then the individual subgraphs are full trained, providing a foundation for efficient local optimization. Finally, reinforcement learning (RL) are employed to take actions according to GNN output, to make sure the restrictions between cross nodes can be learned. Extensive experiments are conducted on both real large-scale social network datasets (e.g., Facebook, Youtube) and synthetically generated high-complexity graphs, which demonstrate that our framework outperforms state-of-the-art approaches in both solution quality and computational efficiency. Moreover, the experiments on large graph instances also validate the scalability of the model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09290",
        "abs_url": "https://arxiv.org/abs/2511.09290",
        "pdf_url": "https://arxiv.org/pdf/2511.09290",
        "title": "Multi-step Predictive Coding Leads To Simplicity Bias",
        "authors": [
            "Aviv Ratzon",
            "Omri Barak"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Neurons and Cognition (q-bio.NC)",
        "abstract": "Predictive coding is a framework for understanding the formation of low-dimensional internal representations mirroring the environment's latent structure. The conditions under which such representations emerge remain unclear. In this work, we investigate how the prediction horizon and network depth shape the solutions of predictive coding tasks. Using a minimal abstract setting inspired by prior work, we show empirically and theoretically that sufficiently deep networks trained with multi-step prediction horizons consistently recover the underlying latent structure, a phenomenon explained through the Ordinary Least Squares estimator structure and biases in learning dynamics. We then extend these insights to nonlinear networks and complex datasets, including piecewise linear functions, MNIST, multiple latent states and higher dimensional state geometries. Our results provide a principled understanding of when and why predictive coding induces structured representations, bridging the gap between empirical observations and theoretical foundations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09299",
        "abs_url": "https://arxiv.org/abs/2511.09299",
        "pdf_url": "https://arxiv.org/pdf/2511.09299",
        "title": "Efficiently Transforming Neural Networks into Decision Trees: A Path to Ground Truth Explanations with RENTT",
        "authors": [
            "Helena Monke",
            "Benjamin Fresz",
            "Marco Bernreuther",
            "Yilin Chen",
            "Marco F. Huber"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Although neural networks are a powerful tool, their widespread use is hindered by the opacity of their decisions and their black-box nature, which result in a lack of trustworthiness. To alleviate this problem, methods in the field of explainable Artificial Intelligence try to unveil how such automated decisions are made. But explainable AI methods are often plagued by missing faithfulness/correctness, meaning that they sometimes provide explanations that do not align with the neural network's decision and logic. Recently, transformations to decision trees have been proposed to overcome such problems. Unfortunately, they typically lack exactness, scalability, or interpretability as the size of the neural network grows. Thus, we generalize these previous results, especially by considering convolutional neural networks, recurrent neural networks, non-ReLU activation functions, and bias terms. Our findings are accompanied by rigorous proofs and we present a novel algorithm RENTT (Runtime Efficient Network to Tree Transformation) designed to compute an exact equivalent decision tree representation of neural networks in a manner that is both runtime and memory efficient. The resulting decision trees are multivariate and thus, possibly too complex to understand. To alleviate this problem, we also provide a method to calculate the ground truth feature importance for neural networks via the equivalent decision trees - for entire models (global), specific input regions (regional), or single decisions (local). All theoretical results are supported by detailed numerical experiments that emphasize two key aspects: the computational efficiency and scalability of our algorithm, and that only RENTT succeeds in uncovering ground truth explanations compared to conventional approximation methods like LIME and SHAP. All code is available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09315",
        "abs_url": "https://arxiv.org/abs/2511.09315",
        "pdf_url": "https://arxiv.org/pdf/2511.09315",
        "title": "A Tensor Residual Circuit Neural Network Factorized with Matrix Product Operation",
        "authors": [
            "Andi Chen"
        ],
        "comments": "This is the supplementary material link: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "It is challenging to reduce the complexity of neural networks while maintaining their generalization ability and robustness, especially for practical applications. Conventional solutions for this problem incorporate quantum-inspired neural networks with Kronecker products and hybrid tensor neural networks with MPO factorization and fully-connected layers. Nonetheless, the generalization power and robustness of the fully-connected layers are not as outstanding as circuit models in quantum computing. In this paper, we propose a novel tensor circuit neural network (TCNN) that takes advantage of the characteristics of tensor neural networks and residual circuit models to achieve generalization ability and robustness with low complexity. The proposed activation operation and parallelism of the circuit in complex number field improves its non-linearity and efficiency for feature learning. Moreover, since the feature information exists in the parameters in both the real and imaginary parts in TCNN, an information fusion layer is proposed for merging features stored in those parameters to enhance the generalization capability. Experimental results confirm that TCNN showcases more outstanding generalization and robustness with its average accuracies on various datasets 2\\%-3\\% higher than those of the state-of-the-art compared models. More significantly, while other models fail to learn features under noise parameter attacking, TCNN still showcases prominent learning capability owing to its ability to prevent gradient explosion. Furthermore, it is comparable to the compared models on the number of trainable parameters and the CPU running time. An ablation study also indicates the advantage of the activation operation, the parallelism architecture and the information fusion layer.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09323",
        "abs_url": "https://arxiv.org/abs/2511.09323",
        "pdf_url": "https://arxiv.org/pdf/2511.09323",
        "title": "Mixture-of-Channels: Exploiting Sparse FFNs for Efficient LLMs Pre-Training and Inference",
        "authors": [
            "Tong Wu",
            "Yutong He",
            "Bin Wang",
            "Kun Yuan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) have demonstrated remarkable success across diverse artificial intelligence tasks, driven by scaling laws that correlate model size and training data with performance improvements. However, this scaling paradigm incurs substantial memory overhead, creating significant challenges for both training and inference. While existing research has primarily addressed parameter and optimizer state memory reduction, activation memory-particularly from feed-forward networks (FFNs)-has become the critical bottleneck, especially when FlashAttention is implemented. In this work, we conduct a detailed memory profiling of LLMs and identify FFN activations as the predominant source to activation memory overhead. Motivated by this, we introduce Mixture-of-Channels (MoC), a novel FFN architecture that selectively activates only the Top-K most relevant channels per token determined by SwiGLU's native gating mechanism. MoC substantially reduces activation memory during pre-training and improves inference efficiency by reducing memory access through partial weight loading into GPU SRAM. Extensive experiments validate that MoC delivers significant memory savings and throughput gains while maintaining competitive model performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09324",
        "abs_url": "https://arxiv.org/abs/2511.09324",
        "pdf_url": "https://arxiv.org/pdf/2511.09324",
        "title": "MARBLE: Multi-Armed Restless Bandits in Latent Markovian Environment",
        "authors": [
            "Mohsen Amiri",
            "Konstantin Avrachenkov",
            "Ibtihal El Mimouni",
            "Sindri Magnússon"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Restless Multi-Armed Bandits (RMABs) are powerful models for decision-making under uncertainty, yet classical formulations typically assume fixed dynamics, an assumption often violated in nonstationary environments. We introduce MARBLE (Multi-Armed Restless Bandits in a Latent Markovian Environment), which augments RMABs with a latent Markov state that induces nonstationary behavior. In MARBLE, each arm evolves according to a latent environment state that switches over time, making policy learning substantially more challenging. We further introduce the Markov-Averaged Indexability (MAI) criterion as a relaxed indexability assumption and prove that, despite unobserved regime switches, under the MAI criterion, synchronous Q-learning with Whittle Indices (QWI) converges almost surely to the optimal Q-function and the corresponding Whittle indices. We validate MARBLE on a calibrated simulator-embedded (digital twin) recommender system, where QWI consistently adapts to a shifting latent state and converges to an optimal policy, empirically corroborating our theoretical findings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09326",
        "abs_url": "https://arxiv.org/abs/2511.09326",
        "pdf_url": "https://arxiv.org/pdf/2511.09326",
        "title": "GAMMA_FLOW: Guided Analysis of Multi-label spectra by MAtrix Factorization for Lightweight Operational Workflows",
        "authors": [
            "Viola Rädle",
            "Tilman Hartwig",
            "Benjamin Oesen",
            "Emily Alice Kröger",
            "Julius Vogt",
            "Eike Gericke",
            "Martin Baron"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "GAMMA_FLOW is an open-source Python package for real-time analysis of spectral data. It supports classification, denoising, decomposition, and outlier detection of both single- and multi-component spectra. Instead of relying on large, computationally intensive models, it employs a supervised approach to non-negative matrix factorization (NMF) for dimensionality reduction. This ensures a fast, efficient, and adaptable analysis while reducing computational costs. gamma_flow achieves classification accuracies above 90% and enables reliable automated spectral interpretation. Originally developed for gamma-ray spectra, it is applicable to any type of one-dimensional spectral data. As an open and flexible alternative to proprietary software, it supports various applications in research and industry.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09376",
        "abs_url": "https://arxiv.org/abs/2511.09376",
        "pdf_url": "https://arxiv.org/pdf/2511.09376",
        "title": "From Decision Trees to Boolean Logic: A Fast and Unified SHAP Algorithm",
        "authors": [
            "Alexander Nadel",
            "Ron Wettenstein"
        ],
        "comments": "Accepted to AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "SHapley Additive exPlanations (SHAP) is a key tool for interpreting decision tree ensembles by assigning contribution values to features. It is widely used in finance, advertising, medicine, and other domains. Two main approaches to SHAP calculation exist: Path-Dependent SHAP, which leverages the tree structure for efficiency, and Background SHAP, which uses a background dataset to estimate feature distributions. We introduce WOODELF, a SHAP algorithm that integrates decision trees, game theory, and Boolean logic into a unified framework. For each consumer, WOODELF constructs a pseudo-Boolean formula that captures their feature values, the structure of the decision tree ensemble, and the entire background dataset. It then leverages this representation to compute Background SHAP in linear time. WOODELF can also compute Path-Dependent SHAP, Shapley interaction values, Banzhaf values, and Banzhaf interaction values. WOODELF is designed to run efficiently on CPU and GPU hardware alike. Available via the WOODELF Python package, it is implemented using NumPy, SciPy, and CuPy without relying on custom C++ or CUDA code. This design enables fast performance and seamless integration into existing frameworks, supporting large-scale computation of SHAP and other game-theoretic values in practice. For example, on a dataset with 3,000,000 rows, 5,000,000 background samples, and 127 features, WOODELF computed all Background Shapley values in 162 seconds on CPU and 16 seconds on GPU - compared to 44 minutes required by the best method on any hardware platform, representing 16x and 165x speedups, respectively.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09383",
        "abs_url": "https://arxiv.org/abs/2511.09383",
        "pdf_url": "https://arxiv.org/pdf/2511.09383",
        "title": "Diffusion-based Sinogram Interpolation for Limited Angle PET",
        "authors": [
            "Rüveyda Yilmaz",
            "Julian Thull",
            "Johannes Stegmaier",
            "Volkmar Schulz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate PET imaging increasingly requires methods that support unconstrained detector layouts from walk-through designs to long-axial rings where gaps and open sides lead to severely undersampled sinograms. Instead of constraining the hardware to form complete cylinders, we propose treating the missing lines-of-responses as a learnable prior. Data-driven approaches, particularly generative models, offer a promising pathway to recover this missing information. In this work, we explore the use of conditional diffusion models to interpolate sparsely sampled sinograms, paving the way for novel, cost-efficient, and patient-friendly PET geometries in real clinical settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09400",
        "abs_url": "https://arxiv.org/abs/2511.09400",
        "pdf_url": "https://arxiv.org/pdf/2511.09400",
        "title": "Abstract Gradient Training: A Unified Certification Framework for Data Poisoning, Unlearning, and Differential Privacy",
        "authors": [
            "Philip Sosnin",
            "Matthew Wicker",
            "Josh Collyer",
            "Calvin Tsay"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The impact of inference-time data perturbation (e.g., adversarial attacks) has been extensively studied in machine learning, leading to well-established certification techniques for adversarial robustness. In contrast, certifying models against training data perturbations remains a relatively under-explored area. These perturbations can arise in three critical contexts: adversarial data poisoning, where an adversary manipulates training samples to corrupt model performance; machine unlearning, which requires certifying model behavior under the removal of specific training data; and differential privacy, where guarantees must be given with respect to substituting individual data points. This work introduces Abstract Gradient Training (AGT), a unified framework for certifying robustness of a given model and training procedure to training data perturbations, including bounded perturbations, the removal of data points, and the addition of new samples. By bounding the reachable set of parameters, i.e., establishing provable parameter-space bounds, AGT provides a formal approach to analyzing the behavior of models trained via first-order optimization methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09414",
        "abs_url": "https://arxiv.org/abs/2511.09414",
        "pdf_url": "https://arxiv.org/pdf/2511.09414",
        "title": "Probing then Editing: A Push-Pull Framework for Retain-Free Machine Unlearning in Industrial IoT",
        "authors": [
            "Jiao Chen",
            "Weihua Li",
            "Jianhua Tang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In dynamic Industrial Internet of Things (IIoT) environments, models need the ability to selectively forget outdated or erroneous knowledge. However, existing methods typically rely on retain data to constrain model behavior, which increases computational and energy burdens and conflicts with industrial data silos and privacy compliance requirements. To address this, we propose a novel retain-free unlearning framework, referred to as Probing then Editing (PTE). PTE frames unlearning as a probe-edit process: first, it probes the decision boundary neighborhood of the model on the to-be-forgotten class via gradient ascent and generates corresponding editing instructions using the model's own predictions. Subsequently, a push-pull collaborative optimization is performed: the push branch actively dismantles the decision region of the target class using the editing instructions, while the pull branch applies masked knowledge distillation to anchor the model's knowledge on retained classes to their original states. Benefiting from this mechanism, PTE achieves efficient and balanced knowledge editing using only the to-be-forgotten data and the original model. Experimental results demonstrate that PTE achieves an excellent balance between unlearning effectiveness and model utility across multiple general and industrial benchmarks such as CWRU and SCUT-FD.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09416",
        "abs_url": "https://arxiv.org/abs/2511.09416",
        "pdf_url": "https://arxiv.org/pdf/2511.09416",
        "title": "Transformer Semantic Genetic Programming for d-dimensional Symbolic Regression Problems",
        "authors": [
            "Philipp Anthes",
            "Dominik Sobania",
            "Franz Rothlauf"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Transformer Semantic Genetic Programming (TSGP) is a semantic search approach that uses a pre-trained transformer model as a variation operator to generate offspring programs with controlled semantic similarity to a given parent. Unlike other semantic GP approaches that rely on fixed syntactic transformations, TSGP aims to learn diverse structural variations that lead to solutions with similar semantics. We find that a single transformer model trained on millions of programs is able to generalize across symbolic regression problems of varying dimension. Evaluated on 24 real-world and synthetic datasets, TSGP significantly outperforms standard GP, SLIM_GSGP, Deep Symbolic Regression, and Denoising Autoencoder GP, achieving an average rank of 1.58 across all benchmarks. Moreover, TSGP produces more compact solutions than SLIM_GSGP, despite its higher accuracy. In addition, the target semantic distance $\\mathrm{SD}_t$ is able to control the step size in the semantic space: small values of $\\mathrm{SD}_t$ enable consistent improvement in fitness but often lead to larger programs, while larger values promote faster convergence and compactness. Thus, $\\mathrm{SD}_t$ provides an effective mechanism for balancing exploration and exploitation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09425",
        "abs_url": "https://arxiv.org/abs/2511.09425",
        "pdf_url": "https://arxiv.org/pdf/2511.09425",
        "title": "Several Supporting Evidences for the Adaptive Feature Program",
        "authors": [
            "Yicheng Li",
            "Qian Lin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Theoretically exploring the advantages of neural networks might be one of the most challenging problems in the AI era. An adaptive feature program has recently been proposed to analyze the feature learning characteristic property of neural networks in a more abstract way. Motivated by the celebrated Le Cam equivalence, we advocate the over-parametrized sequence models to further simplify the analysis of the training dynamics of adaptive feature program and present several supporting evidences for the adaptive feature program. More precisely, after having introduced the feature error measure (FEM) to characterize the quality of the learned feature, we show that the FEM is decreasing during the training process of several concrete adaptive feature models including linear regression, single/multiple index models, etc. We believe that this hints at the potential successes of the adaptive feature program.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09432",
        "abs_url": "https://arxiv.org/abs/2511.09432",
        "pdf_url": "https://arxiv.org/pdf/2511.09432",
        "title": "Group Equivariance Meets Mechanistic Interpretability: Equivariant Sparse Autoencoders",
        "authors": [
            "Ege Erdogan",
            "Ana Lucic"
        ],
        "comments": "NeurIPS 2025 Mechanistic Interpretability and UniReps workshops",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Sparse autoencoders (SAEs) have proven useful in disentangling the opaque activations of neural networks, primarily large language models, into sets of interpretable features. However, adapting them to domains beyond language, such as scientific data with group symmetries, introduces challenges that can hinder their effectiveness. We show that incorporating such group symmetries into the SAEs yields features more useful in downstream tasks. More specifically, we train autoencoders on synthetic images and find that a single matrix can explain how their activations transform as the images are rotated. Building on this, we develop adaptively equivariant SAEs that can adapt to the base model's level of equivariance. These adaptive SAEs discover features that lead to superior probing performance compared to regular SAEs, demonstrating the value of incorporating symmetries in mechanistic interpretability tools.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09450",
        "abs_url": "https://arxiv.org/abs/2511.09450",
        "pdf_url": "https://arxiv.org/pdf/2511.09450",
        "title": "How does the Performance of the Data-driven Traffic Flow Forecasting Models deteriorate with Increasing Forecasting Horizon? An Extensive Approach Considering Statistical, Machine Learning and Deep Learning Models",
        "authors": [
            "Amanta Sherfenaz",
            "Nazmul Haque",
            "Protiva Sadhukhan Prova",
            "Md Asif Raihan",
            "Md. Hadiuzzaman"
        ],
        "comments": "6,227 words text + 2*250 (2 tables) = 6,727 words",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "With rapid urbanization in recent decades, traffic congestion has intensified due to increased movement of people and goods. As planning shifts from demand-based to supply-oriented strategies, Intelligent Transportation Systems (ITS) have become essential for managing traffic within existing infrastructure. A core ITS function is traffic forecasting, enabling proactive measures like ramp metering, signal control, and dynamic routing through platforms such as Google Maps. This study assesses the performance of statistical, machine learning (ML), and deep learning (DL) models in forecasting traffic speed and flow using real-world data from California's Harbor Freeway, sourced from the Caltrans Performance Measurement System (PeMS). Each model was evaluated over 20 forecasting windows (up to 1 hour 40 minutes) using RMSE, MAE, and R-Square metrics. Results show ANFIS-GP performs best at early windows with RMSE of 0.038, MAE of 0.0276, and R-Square of 0.9983, while Bi-LSTM is more robust for medium-term prediction due to its capacity to model long-range temporal dependencies, achieving RMSE of 0.1863, MAE of 0.0833, and R-Square of 0.987 at a forecasting of 20. The degradation in model performance was quantified using logarithmic transformation, with slope values used to measure robustness. Among DL models, Bi-LSTM had the flattest slope (0.0454 RMSE, 0.0545 MAE for flow), whereas ANFIS-GP had 0.1058 for RMSE and 0.1037 for flow MAE. The study concludes by identifying hybrid models as a promising future direction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09475",
        "abs_url": "https://arxiv.org/abs/2511.09475",
        "pdf_url": "https://arxiv.org/pdf/2511.09475",
        "title": "Enhancing Explainability in Solar Energetic Particle Event Prediction: A Global Feature Mapping Approach",
        "authors": [
            "Anli Ji",
            "Pranjal Patil",
            "Chetraj Pandey",
            "Manolis K. Georgoulis",
            "Berkay Aydin"
        ],
        "comments": "10 pages, 3 Figures. This is a pre-print of an accepted paper at ICDMW: SABID 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Solar energetic particle (SEP) events, as one of the most prominent manifestations of solar activity, can generate severe hazardous radiation when accelerated by solar flares or shock waves formed aside from coronal mass ejections (CMEs). However, most existing data-driven methods used for SEP predictions are operated as black-box models, making it challenging for solar physicists to interpret the results and understand the underlying physical causes of such events rather than just obtain a prediction. To address this challenge, we propose a novel framework that integrates global explanations and ad-hoc feature mapping to enhance model transparency and provide deeper insights into the decision-making process. We validate our approach using a dataset of 341 SEP events, including 244 significant (>=10 MeV) proton events exceeding the Space Weather Prediction Center S1 threshold, spanning solar cycles 22, 23, and 24. Furthermore, we present an explainability-focused case study of major SEP events, demonstrating how our method improves explainability and facilitates a more physics-informed understanding of SEP event prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09477",
        "abs_url": "https://arxiv.org/abs/2511.09477",
        "pdf_url": "https://arxiv.org/pdf/2511.09477",
        "title": "Latent Planning via Embedding Arithmetic: A Contrastive Approach to Strategic Reasoning",
        "authors": [
            "Andrew Hamara",
            "Greg Hamerly",
            "Pablo Rivas",
            "Andrew C. Freeman"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Planning in high-dimensional decision spaces is increasingly being studied through the lens of learned representations. Rather than training policies or value heads, we investigate whether planning can be carried out directly in an evaluation-aligned embedding space. We introduce SOLIS, which learns such a space using supervised contrastive learning. In this representation, outcome similarity is captured by proximity, and a single global advantage vector orients the space from losing to winning regions. Candidate actions are then ranked according to their alignment with this direction, reducing planning to vector operations in latent space. We demonstrate this approach in chess, where SOLIS uses only a shallow search guided by the learned embedding to reach competitive strength under constrained conditions. More broadly, our results suggest that evaluation-aligned latent planning offers a lightweight alternative to traditional dynamics models or policy learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09487",
        "abs_url": "https://arxiv.org/abs/2511.09487",
        "pdf_url": "https://arxiv.org/pdf/2511.09487",
        "title": "PDAC: Efficient Coreset Selection for Continual Learning via Probability Density Awareness",
        "authors": [
            "Junqi Gao",
            "Zhichang Guo",
            "Dazhi Zhang",
            "Yao Li",
            "Yi Ran",
            "Biqing Qi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Rehearsal-based Continual Learning (CL) maintains a limited memory buffer to store replay samples for knowledge retention, making these approaches heavily reliant on the quality of the stored samples. Current Rehearsal-based CL methods typically construct the memory buffer by selecting a representative subset (referred to as coresets), aiming to approximate the training efficacy of the full dataset with minimal storage overhead. However, mainstream Coreset Selection (CS) methods generally formulate the CS problem as a bi-level optimization problem that relies on numerous inner and outer iterations to solve, leading to substantial computational cost thus limiting their practical efficiency. In this paper, we aim to provide a more efficient selection logic and scheme for coreset construction. To this end, we first analyze the Mean Squared Error (MSE) between the buffer-trained model and the Bayes-optimal model through the perspective of localized error decomposition to investigate the contribution of samples from different regions to MSE suppression. Further theoretical and experimental analyses demonstrate that samples with high probability density play a dominant role in error suppression. Inspired by this, we propose the Probability Density-Aware Coreset (PDAC) method. PDAC leverages the Projected Gaussian Mixture (PGM) model to estimate each sample's joint density, enabling efficient density-prioritized buffer selection. Finally, we introduce the streaming Expectation Maximization (EM) algorithm to enhance the adaptability of PGM parameters to streaming data, yielding Streaming PDAC (SPDAC) for streaming scenarios. Extensive comparative experiments show that our methods outperforms other baselines across various CL settings while ensuring favorable efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09488",
        "abs_url": "https://arxiv.org/abs/2511.09488",
        "pdf_url": "https://arxiv.org/pdf/2511.09488",
        "title": "AutoSynth: Automated Workflow Optimization for High-Quality Synthetic Dataset Generation via Monte Carlo Tree Search",
        "authors": [
            "Shuzhen Bi",
            "Chang Song",
            "Siyu Song",
            "Jinze Lv",
            "Jian Chen",
            "Xinyun Wang",
            "Aimin Zhou",
            "Hao Hao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Supervised fine-tuning (SFT) of large language models (LLMs) for specialized tasks requires high-quality datasets, but manual curation is prohibitively expensive. Synthetic data generation offers scalability, but its effectiveness relies on complex, multi-stage workflows, integrating prompt engineering and model orchestration. Existing automated workflow methods face a cold start problem: they require labeled datasets for reward modeling, which is especially problematic for subjective, open-ended tasks with no objective ground truth. We introduce AutoSynth, a framework that automates workflow discovery and optimization without reference datasets by reframing the problem as a Monte Carlo Tree Search guided by a novel dataset-free hybrid reward. This reward enables meta-learning through two LLM-as-judge components: one evaluates sample quality using dynamically generated task-specific metrics, and another assesses workflow code and prompt quality. Experiments on subjective educational tasks show that while expert-designed workflows achieve higher human preference rates (96-99% win rates vs. AutoSynth's 40-51%), models trained on AutoSynth-generated data dramatically outperform baselines (40-51% vs. 2-5%) and match or surpass expert workflows on certain metrics, suggesting discovery of quality dimensions beyond human intuition. These results are achieved while reducing human effort from 5-7 hours to just 30 minutes (>90% reduction). AutoSynth tackles the cold start issue in data-centric AI, offering a scalable, cost-effective method for subjective LLM tasks. Code: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09509",
        "abs_url": "https://arxiv.org/abs/2511.09509",
        "pdf_url": "https://arxiv.org/pdf/2511.09509",
        "title": "Quasi-Newton Compatible Actor-Critic for Deterministic Policies",
        "authors": [
            "Arash Bahari Kordabad",
            "Dean Brandner",
            "Sebastien Gros",
            "Sergio Lucia",
            "Sadegh Soudjani"
        ],
        "comments": "8 pages, 9 figs",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Optimization and Control (math.OC)",
        "abstract": "In this paper, we propose a second-order deterministic actor-critic framework in reinforcement learning that extends the classical deterministic policy gradient method to exploit curvature information of the performance function. Building on the concept of compatible function approximation for the critic, we introduce a quadratic critic that simultaneously preserves the true policy gradient and an approximation of the performance Hessian. A least-squares temporal difference learning scheme is then developed to estimate the quadratic critic parameters efficiently. This construction enables a quasi-Newton actor update using information learned by the critic, yielding faster convergence compared to first-order methods. The proposed approach is general and applicable to any differentiable policy class. Numerical examples demonstrate that the method achieves improved convergence and performance over standard deterministic actor-critic baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09512",
        "abs_url": "https://arxiv.org/abs/2511.09512",
        "pdf_url": "https://arxiv.org/pdf/2511.09512",
        "title": "GenePheno: Interpretable Gene Knockout-Induced Phenotype Abnormality Prediction from Gene Sequences",
        "authors": [
            "Jingquan Yan",
            "Yuwei Miao",
            "Lei Yu",
            "Yuzhi Guo",
            "Xue Xiao",
            "Lin Xu",
            "Junzhou Huang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Exploring how genetic sequences shape phenotypes is a fundamental challenge in biology and a key step toward scalable, hypothesis-driven experimentation. The task is complicated by the large modality gap between sequences and phenotypes, as well as the pleiotropic nature of gene-phenotype relationships. Existing sequence-based efforts focus on the degree to which variants of specific genes alter a limited set of phenotypes, while general gene knockout induced phenotype abnormality prediction methods heavily rely on curated genetic information as inputs, which limits scalability and generalizability. As a result, the task of broadly predicting the presence of multiple phenotype abnormalities under gene knockout directly from gene sequences remains underexplored. We introduce GenePheno, the first interpretable multi-label prediction framework that predicts knockout induced phenotypic abnormalities from gene sequences. GenePheno employs a contrastive multi-label learning objective that captures inter-phenotype correlations, complemented by an exclusive regularization that enforces biological consistency. It further incorporates a gene function bottleneck layer, offering human interpretable concepts that reflect functional mechanisms behind phenotype formation. To support progress in this area, we curate four datasets with canonical gene sequences as input and multi-label phenotypic abnormalities induced by gene knockouts as targets. Across these datasets, GenePheno achieves state-of-the-art gene-centric Fmax and phenotype-centric AUC, and case studies demonstrate its ability to reveal gene functional mechanisms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09527",
        "abs_url": "https://arxiv.org/abs/2511.09527",
        "pdf_url": "https://arxiv.org/pdf/2511.09527",
        "title": "Event-Driven Digital-Time-Domain Inference Architectures for Tsetlin Machines",
        "authors": [
            "Tian Lan",
            "Rishad Shafik",
            "Alex Yakovlev"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine learning fits model parameters to approximate input-output mappings, predicting unknown samples. However, these models often require extensive arithmetic computations during inference, increasing latency and power consumption. This paper proposes a digital-time-domain computing approach for Tsetlin machine (TM) inference process to address these challenges. This approach leverages a delay accumulation mechanism to mitigate the costly arithmetic sums of classes and employs a Winner-Takes-All scheme to replace conventional magnitude comparators. Specifically, a Hamming distance-driven time-domain scheme is implemented for multi-class TMs. Furthermore, differential delay paths, combined with a leading-ones-detector logarithmic delay compression digital-time-domain scheme, are utilised for the coalesced TMs, accommodating both binary-signed and exponential-scale delay accumulation issues. Compared to the functionally equivalent, post-implementation digital TM architecture baseline, the proposed architecture demonstrates orders-of-magnitude improvements in energy efficiency and throughput.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09529",
        "abs_url": "https://arxiv.org/abs/2511.09529",
        "pdf_url": "https://arxiv.org/pdf/2511.09529",
        "title": "SiDGen: Structure-informed Diffusion for Generative modeling of Ligands for Proteins",
        "authors": [
            "Samyak Sanghvi",
            "Nishant Ranjan",
            "Tarak Karmakar"
        ],
        "comments": "10 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Designing ligands that are both chemically valid and structurally compatible with protein binding pockets is a key bottleneck in computational drug discovery. Existing approaches either ignore structural context or rely on expensive, memory-intensive encoding that limits throughput and scalability. We present SiDGen (Structure-informed Diffusion Generator), a protein-conditioned diffusion framework that integrates masked SMILES generation with lightweight folding-derived features for pocket awareness. To balance expressivity with efficiency, SiDGen supports two conditioning pathways: a streamlined mode that pools coarse structural signals from protein embeddings and a full mode that injects localized pairwise biases for stronger coupling. A coarse-stride folding mechanism with nearest-neighbor upsampling alleviates the quadratic memory costs of pair tensors, enabling training on realistic sequence lengths. Learning stability is maintained through in-loop chemical validity checks and an invalidity penalty, while large-scale training efficiency is restored \\textit{via} selective compilation, dataloader tuning, and gradient accumulation. In automated benchmarks, SiDGen generates ligands with high validity, uniqueness, and novelty, while achieving competitive performance in docking-based evaluations and maintaining reasonable molecular properties. These results demonstrate that SiDGen can deliver scalable, pocket-aware molecular design, providing a practical route to conditional generation for high-throughput drug discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09537",
        "abs_url": "https://arxiv.org/abs/2511.09537",
        "pdf_url": "https://arxiv.org/pdf/2511.09537",
        "title": "NSL-MT: Linguistically Informed Negative Samples for Efficient Machine Translation in Low-Resource Languages",
        "authors": [
            "Mamadou K. Keita",
            "Christopher Homan",
            "Huy Le"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce Negative Space Learning MT (NSL-MT), a training method that teaches models what not to generate by encoding linguistic constraints as severity-weighted penalties in the loss function. NSL-MT increases limited parallel data with synthetically generated violations of target language grammar, explicitly penalizing the model when it assigns high probability to these linguistically invalid outputs. We demonstrate that NSL-MT delivers improvements across all architectures: 3-12\\% BLEU gains for well-performing models and 56-89\\% gains for models lacking descent initial support. Furthermore, NSL-MT provides a 5x data efficiency multiplier -- training with 1,000 examples matches or exceeds normal training with 5,000 examples. Thus, NSL-MT provides a data-efficient alternative training method for settings where there is limited annotated parallel corporas.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2510.18411",
        "abs_url": "https://arxiv.org/abs/2510.18411",
        "pdf_url": "https://arxiv.org/pdf/2510.18411",
        "title": "A machine learning approach to automation and uncertainty evaluation for self-validating thermocouples",
        "authors": [
            "Samuel Bilson",
            "Andrew Thompson",
            "Declan Tucker",
            "Jonathan Pearce"
        ],
        "comments": "6 pages, 7 figures. TEMPERATURE: ITS MEASUREMENT AND CONTROL IN SCIENCE AND INDUSTRY, VOLUME 9: Proceedings of the Tenth International Temperature Symposium 3-7 April 2023 Anaheim, USA",
        "subjects": "Instrumentation and Detectors (physics.ins-det); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Thermocouples are in widespread use in industry, but they are particularly susceptible to calibration drift in harsh environments. Self-validating thermocouples aim to address this issue by using a miniature phase-change cell (fixed-point) in close proximity to the measurement junction (tip) of the thermocouple. The fixed point is a crucible containing an ingot of metal with a known melting temperature. When the process temperature being monitored passes through the melting temperature of the ingot, the thermocouple output exhibits a \"plateau\" during melting. Since the melting temperature of the ingot is known, the thermocouple can be recalibrated in situ. Identifying the melting plateau to determine the onset of melting is reasonably well established but requires manual intervention involving zooming in on the region around the actual melting temperature, a process which can depend on the shape of the melting plateau. For the first time, we present a novel machine learning approach to recognize and identify the characteristic shape of the melting plateau and once identified, to quantity the point at which melting begins, along with its associated uncertainty. This removes the need for human intervention in locating and characterizing the melting point. Results from test data provided by CCPI Europe show 100% accuracy of melting plateau detection. They also show a cross-validated R2 of 0.99 on predictions of calibration drift.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.05061",
        "abs_url": "https://arxiv.org/abs/2511.05061",
        "pdf_url": "https://arxiv.org/pdf/2511.05061",
        "title": "Extrapolation to infinite model space of no-core shell model calculations using machine learning",
        "authors": [
            "Aleksandr Mazur",
            "Roman Sharypov",
            "Andrey Shirokov"
        ],
        "comments": "9 pages, 3 figures",
        "subjects": "Nuclear Theory (nucl-th); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "An ensemble of neural networks is employed to extrapolate no-core shell model (NCSM) results to infinite model space for light nuclei. We present a review of our neural network extrapolations of the NCSM results obtained with the Daejeon16 NN interaction in different model spaces and with different values of the NCSM basis parameter $\\hbar\\Omega$ for energies of nuclear states and root-mean-square (rms) radii of proton, neutron and matter distributions in light nuclei. The method yields convergent predictions with quantifiable uncertainties. Ground-state energies for $^{6}$Li, $^{6}$He, and the unbound $^{6}$Be, as well as the excited $(3^{+},0)$ and $(0^{+},1)$ states of $^{6}$Li, are obtained within a few hundred keV of experiment. The extrapolated radii of bound states converge well. In contrast, radii of unbound states in $^{6}$Be and $^{6}$Li do not stabilize.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08588",
        "abs_url": "https://arxiv.org/abs/2511.08588",
        "pdf_url": "https://arxiv.org/pdf/2511.08588",
        "title": "Explainable Federated Learning for U.S. State-Level Financial Distress Modeling",
        "authors": [
            "Lorenzo Carta",
            "Fernando Spadea",
            "Oshani Seneviratne"
        ],
        "comments": "",
        "subjects": "Statistical Finance (q-fin.ST); Machine Learning (cs.LG)",
        "abstract": "We present the first application of federated learning (FL) to the U.S. National Financial Capability Study, introducing an interpretable framework for predicting consumer financial distress across all 50 states and the District of Columbia without centralizing sensitive data. Our cross-silo FL setup treats each state as a distinct data silo, simulating real-world governance in nationwide financial systems. Unlike prior work, our approach integrates two complementary explainable AI techniques to identify both global (nationwide) and local (state-specific) predictors of financial hardship, such as contact from debt collection agencies. We develop a machine learning model specifically suited for highly categorical, imbalanced survey data. This work delivers a scalable, regulation-compliant blueprint for early warning systems in finance, demonstrating how FL can power socially responsible AI applications in consumer credit risk and financial inclusion.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08590",
        "abs_url": "https://arxiv.org/abs/2511.08590",
        "pdf_url": "https://arxiv.org/pdf/2511.08590",
        "title": "GMTRouter: Personalized LLM Router over Multi-turn User Interactions",
        "authors": [
            "Encheng Xie",
            "Yihang Sun",
            "Tao Feng",
            "Jiaxuan You"
        ],
        "comments": "Preprint",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Large Language Model (LLM) routing has demonstrated strong capability in balancing response quality with computational cost. As users exhibit diverse preferences, personalization has attracted increasing attention in LLM routing, since even identical queries may require different models to generate responses tailored to individual needs. However, existing approaches are not fully personalized and often fail to capture the complex interactions between specific users and LLMs. Moreover, user preference data is typically scarce, noisy, and inconsistent in format, which limits the effectiveness of methods that rely solely on user-specific data. To address these challenges, we propose GMTRouter, which represents multi-turn user-LLM interactions as a heterogeneous graph with four node types: user, LLM, query, and response, thereby preserving the rich relational structure of the interaction. Through a tailored message-passing mechanism, GMTRouter learns to capture user preferences from few-shot data within a lightweight inductive graph learning framework, enabling effective personalization. Extensive experiments demonstrate that GMTRouter consistently outperforms strong baselines, achieving 0.9 to 21.6 percent higher accuracy and 0.006 to 0.309 higher AUC across multiple datasets. More importantly, we demonstrate that GMTRouter can adapt to new users and evolving preferences using only few-shot data, without extensive fine-tuning. The code for GMTRouter is publicly available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08610",
        "abs_url": "https://arxiv.org/abs/2511.08610",
        "pdf_url": "https://arxiv.org/pdf/2511.08610",
        "title": "MoE-GraphSAGE-Based Integrated Evaluation of Transient Rotor Angle and Voltage Stability in Power Systems",
        "authors": [
            "Kunyu Zhang",
            "Guang Yang",
            "Fashun Shi",
            "Shaoying He",
            "Yuchi Zhang"
        ],
        "comments": "",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "The large-scale integration of renewable energy and power electronic devices has increased the complexity of power system stability, making transient stability assessment more challenging. Conventional methods are limited in both accuracy and computational efficiency. To address these challenges, this paper proposes MoE-GraphSAGE, a graph neural network framework based on the MoE for unified TAS and TVS assessment. The framework leverages GraphSAGE to capture the power grid's spatiotemporal topological features and employs multi-expert networks with a gating mechanism to model distinct instability modes jointly. Experimental results on the IEEE 39-bus system demonstrate that MoE-GraphSAGE achieves superior accuracy and efficiency, offering an effective solution for online multi-task transient stability assessment in complex power systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08612",
        "abs_url": "https://arxiv.org/abs/2511.08612",
        "pdf_url": "https://arxiv.org/pdf/2511.08612",
        "title": "Learning based Modelling of Throttleable Engine Dynamics for Lunar Landing Mission",
        "authors": [
            "Suraj Kumar",
            "Aditya Rallapalli",
            "Bharat Kumar GVP"
        ],
        "comments": "5 pages, 9 figures, Global Space Exploration Conference 2025",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "Typical lunar landing missions involve multiple phases of braking to achieve soft-landing. The propulsion system configuration for these missions consists of throttleable engines. This configuration involves complex interconnected hydraulic, mechanical, and pneumatic components each exhibiting non-linear dynamic characteristics. Accurate modelling of the propulsion dynamics is essential for analyzing closed-loop guidance and control schemes during descent. This paper presents a learning-based system identification approach for modelling of throttleable engine dynamics using data obtained from high-fidelity propulsion model. The developed model is validated with experimental results and used for closed-loop guidance and control simulations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08616",
        "abs_url": "https://arxiv.org/abs/2511.08616",
        "pdf_url": "https://arxiv.org/pdf/2511.08616",
        "title": "Reasoning on Time-Series for Financial Technical Analysis",
        "authors": [
            "Kelvin J.L. Koa",
            "Jan Chen",
            "Yunshan Ma",
            "Huanhuan Zheng",
            "Tat-Seng Chua"
        ],
        "comments": "ICAIF 2025 Workshop (Best Paper)",
        "subjects": "Statistical Finance (q-fin.ST); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Computational Finance (q-fin.CP)",
        "abstract": "While Large Language Models have been used to produce interpretable stock forecasts, they mainly focus on analyzing textual reports but not historical price data, also known as Technical Analysis. This task is challenging as it switches between domains: the stock price inputs and outputs lie in the time-series domain, while the reasoning step should be in natural language. In this work, we introduce Verbal Technical Analysis (VTA), a novel framework that combine verbal and latent reasoning to produce stock time-series forecasts that are both accurate and interpretable. To reason over time-series, we convert stock price data into textual annotations and optimize the reasoning trace using an inverse Mean Squared Error (MSE) reward objective. To produce time-series outputs from textual reasoning, we condition the outputs of a time-series backbone model on the reasoning-based attributes. Experiments on stock datasets across U.S., Chinese, and European markets show that VTA achieves state-of-the-art forecasting accuracy, while the reasoning traces also perform well on evaluation by industry experts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08622",
        "abs_url": "https://arxiv.org/abs/2511.08622",
        "pdf_url": "https://arxiv.org/pdf/2511.08622",
        "title": "Multi-period Learning for Financial Time Series Forecasting",
        "authors": [
            "Xu Zhang",
            "Zhengang Huang",
            "Yunzhi Wu",
            "Xun Lu",
            "Erpeng Qi",
            "Yunkai Chen",
            "Zhongya Xue",
            "Qitong Wang",
            "Peng Wang",
            "Wei Wang"
        ],
        "comments": "The codes are available at this https URL",
        "subjects": "Statistical Finance (q-fin.ST); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Time series forecasting is important in finance domain. Financial time series (TS) patterns are influenced by both short-term public opinions and medium-/long-term policy and market trends. Hence, processing multi-period inputs becomes crucial for accurate financial time series forecasting (TSF). However, current TSF models either use only single-period input, or lack customized designs for addressing multi-period characteristics. In this paper, we propose a Multi-period Learning Framework (MLF) to enhance financial TSF performance. MLF considers both TSF's accuracy and efficiency requirements. Specifically, we design three new modules to better integrate the multi-period inputs for improving accuracy: (i) Inter-period Redundancy Filtering (IRF), that removes the information redundancy between periods for accurate self-attention modeling, (ii) Learnable Weighted-average Integration (LWI), that effectively integrates multi-period forecasts, (iii) Multi-period self-Adaptive Patching (MAP), that mitigates the bias towards certain periods by setting the same number of patches across all periods. Furthermore, we propose a Patch Squeeze module to reduce the number of patches in self-attention modeling for maximized efficiency. MLF incorporates multiple inputs with varying lengths (periods) to achieve better accuracy and reduces the costs of selecting input lengths during training. The codes and datasets are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08633",
        "abs_url": "https://arxiv.org/abs/2511.08633",
        "pdf_url": "https://arxiv.org/pdf/2511.08633",
        "title": "Time-to-Move: Training-Free Motion Controlled Video Generation via Dual-Clock Denoising",
        "authors": [
            "Assaf Singer",
            "Noam Rotstein",
            "Amir Mann",
            "Ron Kimmel",
            "Or Litany"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Graphics (cs.GR); Machine Learning (cs.LG); Multimedia (cs.MM)",
        "abstract": "Diffusion-based video generation can create realistic videos, yet existing image- and text-based conditioning fails to offer precise motion control. Prior methods for motion-conditioned synthesis typically require model-specific fine-tuning, which is computationally expensive and restrictive. We introduce Time-to-Move (TTM), a training-free, plug-and-play framework for motion- and appearance-controlled video generation with image-to-video (I2V) diffusion models. Our key insight is to use crude reference animations obtained through user-friendly manipulations such as cut-and-drag or depth-based reprojection. Motivated by SDEdit's use of coarse layout cues for image editing, we treat the crude animations as coarse motion cues and adapt the mechanism to the video domain. We preserve appearance with image conditioning and introduce dual-clock denoising, a region-dependent strategy that enforces strong alignment in motion-specified regions while allowing flexibility elsewhere, balancing fidelity to user intent with natural dynamics. This lightweight modification of the sampling process incurs no additional training or runtime cost and is compatible with any backbone. Extensive experiments on object and camera motion benchmarks show that TTM matches or exceeds existing training-based baselines in realism and motion control. Beyond this, TTM introduces a unique capability: precise appearance control through pixel-level conditioning, exceeding the limits of text-only prompting. Visit our project page for video examples and code: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08638",
        "abs_url": "https://arxiv.org/abs/2511.08638",
        "pdf_url": "https://arxiv.org/pdf/2511.08638",
        "title": "Pattern Recognition of Scrap Plastic Misclassification in Global Trade Data",
        "authors": [
            "Muhammad Sukri Bin Ramli"
        ],
        "comments": "",
        "subjects": "General Economics (econ.GN); Machine Learning (cs.LG)",
        "abstract": "We propose an interpretable machine learning framework to help identify trade data discrepancies that are challenging to detect with traditional methods. Our system analyzes trade data to find a novel inverse price-volume signature, a pattern where reported volumes increase as average unit prices decrease. The model achieves 0.9375 accuracy and was validated by comparing large-scale UN data with detailed firm-level data, confirming that the risk signatures are consistent. This scalable tool provides customs authorities with a transparent, data-driven method to shift from conventional to priority-based inspection protocols, translating complex data into actionable intelligence to support international environmental policies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08648",
        "abs_url": "https://arxiv.org/abs/2511.08648",
        "pdf_url": "https://arxiv.org/pdf/2511.08648",
        "title": "Compact Artificial Neural Network Models for Predicting Protein Residue - RNA Base Binding",
        "authors": [
            "Stanislav Selitskiy"
        ],
        "comments": "",
        "subjects": "Biomolecules (q-bio.BM); Machine Learning (cs.LG)",
        "abstract": "Large Artificial Neural Network (ANN) models have demonstrated success in various domains, including general text and image generation, drug discovery, and protein-RNA (ribonucleic acid) binding tasks. However, these models typically demand substantial computational resources, time, and data for effective training. Given that such extensive resources are often inaccessible to many researchers and that life sciences data sets are frequently limited, we investigated whether small ANN models could achieve acceptable accuracy in protein-RNA prediction. We experimented with shallow feed-forward ANNs comprising two hidden layers and various non-linearities. These models did not utilize explicit structural information; instead, a sliding window approach was employed to implicitly consider the context of neighboring residues and bases. We explored different training techniques to address the issue of highly unbalanced data. Among the seven most popular non-linearities for feed-forward ANNs, only three: Rectified Linear Unit (ReLU), Gated Linear Unit (GLU), and Hyperbolic Tangent (Tanh) yielded converging models. Common re-balancing techniques, such as under- and over-sampling of training sets, proved ineffective, whereas increasing the volume of training data and using model ensembles significantly improved performance. The optimal context window size, balancing both false negative and false positive errors, was found to be approximately 30 residues and bases. Our findings indicate that high-accuracy protein-RNA binding prediction is achievable using computing hardware accessible to most educational and research institutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08658",
        "abs_url": "https://arxiv.org/abs/2511.08658",
        "pdf_url": "https://arxiv.org/pdf/2511.08658",
        "title": "\"It Looks All the Same to Me\": Cross-index Training for Long-term Financial Series Prediction",
        "authors": [
            "Stanislav Selitskiy"
        ],
        "comments": "",
        "subjects": "Statistical Finance (q-fin.ST); Machine Learning (cs.LG)",
        "abstract": "We investigate a number of Artificial Neural Network architectures (well-known and more ``exotic'') in application to the long-term financial time-series forecasts of indexes on different global markets. The particular area of interest of this research is to examine the correlation of these indexes' behaviour in terms of Machine Learning algorithms cross-training. Would training an algorithm on an index from one global market produce similar or even better accuracy when such a model is applied for predicting another index from a different market? The demonstrated predominately positive answer to this question is another argument in favour of the long-debated Efficient Market Hypothesis of Eugene Fama.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08694",
        "abs_url": "https://arxiv.org/abs/2511.08694",
        "pdf_url": "https://arxiv.org/pdf/2511.08694",
        "title": "Practical and Performant Enhancements for Maximization of Algebraic Connectivity",
        "authors": [
            "Leonard Jung",
            "Alan Papalia",
            "Kevin Doherty",
            "Michael Everett"
        ],
        "comments": "Submitted to ICRA 2026",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Long-term state estimation over graphs remains challenging as current graph estimation methods scale poorly on large, long-term graphs. To address this, our work advances a current state-of-the-art graph sparsification algorithm, maximizing algebraic connectivity (MAC). MAC is a sparsification method that preserves estimation performance by maximizing the algebraic connectivity, a spectral graph property that is directly connected to the estimation error. Unfortunately, MAC remains computationally prohibitive for online use and requires users to manually pre-specify a connectivity-preserving edge set. Our contributions close these gaps along three complementary fronts: we develop a specialized solver for algebraic connectivity that yields an average 2x runtime speedup; we investigate advanced step size strategies for MAC's optimization procedure to enhance both convergence speed and solution quality; and we propose automatic schemes that guarantee graph connectivity without requiring manual specification of edges. Together, these contributions make MAC more scalable, reliable, and suitable for real-time estimation applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08703",
        "abs_url": "https://arxiv.org/abs/2511.08703",
        "pdf_url": "https://arxiv.org/pdf/2511.08703",
        "title": "Automated Hardware Trojan Insertion in Industrial-Scale Designs",
        "authors": [
            "Yaroslav Popryho",
            "Debjit Pal",
            "Inna Partin-Vaisband"
        ],
        "comments": "Accepted in DATE 2026",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Industrial Systems-on-Chips (SoCs) often comprise hundreds of thousands to millions of nets and millions to tens of millions of connectivity edges, making empirical evaluation of hardware-Trojan (HT) detectors on realistic designs both necessary and difficult. Public benchmarks remain significantly smaller and hand-crafted, while releasing truly malicious RTL raises ethical and operational risks. This work presents an automated and scalable methodology for generating HT-like patterns in industry-scale netlists whose purpose is to stress-test detection tools without altering user-visible functionality. The pipeline (i) parses large gate-level designs into connectivity graphs, (ii) explores rare regions using SCOAP testability metrics, and (iii) applies parameterized, function-preserving graph transformations to synthesize trigger-payload pairs that mimic the statistical footprint of stealthy HTs. When evaluated on the benchmarks generated in this work, representative state-of-the-art graph-learning models fail to detect Trojans. The framework closes the evaluation gap between academic circuits and modern SoCs by providing reproducible challenge instances that advance security research without sharing step-by-step attack instructions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08717",
        "abs_url": "https://arxiv.org/abs/2511.08717",
        "pdf_url": "https://arxiv.org/pdf/2511.08717",
        "title": "Optimal Control of the Future via Prospective Foraging",
        "authors": [
            "Yuxin Bai",
            "Aranyak Acharyya",
            "Ashwin De Silva",
            "Zeyu Shen",
            "James Hassett",
            "Joshua T. Vogelstein"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Optimal control of the future is the next frontier for AI. Current approaches to this problem are typically rooted in either reinforcement learning or online learning. While powerful, these frameworks for learning are mathematically distinct from Probably Approximately Correct (PAC) learning, which has been the workhorse for the recent technological achievements in AI. We therefore build on the prior work of prospective learning, an extension of PAC learning (without control) in non-stationary environments (De Silva et al., 2023; Silva et al., 2024; Bai et al., 2026). Here, we further extend the PAC learning framework to address learning and control in non-stationary environments. Using this framework, called ''Prospective Control'', we prove that under certain fairly general assumptions, empirical risk minimization (ERM) asymptotically achieves the Bayes optimal policy. We then consider a specific instance of prospective control, foraging, which is a canonical task for any mobile agent, be it natural or artificial. We illustrate that existing reinforcement learning algorithms fail to learn in these non-stationary environments, and even with modifications, they are orders of magnitude less efficient than our prospective foraging agents. Code is available at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08719",
        "abs_url": "https://arxiv.org/abs/2511.08719",
        "pdf_url": "https://arxiv.org/pdf/2511.08719",
        "title": "Practical considerations when designing an online learning algorithm for an app-based mHealth intervention",
        "authors": [
            "Rachel T Gonzalez",
            "Madeline R Abbott",
            "Brahmajee Nallamothu",
            "Scott Hummel",
            "Michael Dorsch",
            "Walter Dempsey"
        ],
        "comments": "",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG); Applications (stat.AP); Machine Learning (stat.ML)",
        "abstract": "The ubiquitous nature of mobile health (mHealth) technology has expanded opportunities for the integration of reinforcement learning into traditional clinical trial designs, allowing researchers to learn individualized treatment policies during the study. LowSalt4Life 2 (LS4L2) is a recent trial aimed at reducing sodium intake among hypertensive individuals through an app-based intervention. A reinforcement learning algorithm, which was deployed in one of the trial arms, was designed to send reminder notifications to promote app engagement in contexts where the notification would be effective, i.e., when a participant is likely to open the app in the next 30-minute and not when prior data suggested reduced effectiveness. Such an algorithm can improve app-based mHealth interventions by reducing participant burden and more effectively promoting behavior change. We encountered various challenges during the implementation of the learning algorithm, which we present as a template to solving challenges in future trials that deploy reinforcement learning algorithms. We provide template solutions based on LS4L2 for solving the key challenges of (i) defining a relevant reward, (ii) determining a meaningful timescale for optimization, (iii) specifying a robust statistical model that allows for automation, (iv) balancing model flexibility with computational cost, and (v) addressing missing values in gradually collected data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08735",
        "abs_url": "https://arxiv.org/abs/2511.08735",
        "pdf_url": "https://arxiv.org/pdf/2511.08735",
        "title": "A Deep Learning-Based Method for Fully Coupled Non-Markovian FBSDEs with Applications",
        "authors": [
            "Hasib Uddin Molla",
            "Ankit Banarjee",
            "Matthew Backhouse",
            "Jinniao Qiu"
        ],
        "comments": "",
        "subjects": "Mathematical Finance (q-fin.MF); Machine Learning (cs.LG)",
        "abstract": "In this work, we extend deep learning-based numerical methods to fully coupled forward-backward stochastic differential equations (FBSDEs) within a non-Markovian framework. Error estimates and convergence are provided. In contrast to the existing literature, our approach not only analyzes the non-Markovian framework but also addresses fully coupled settings, in which both the drift and diffusion coefficients of the forward process may be random and depend on the backward components $Y$ and $Z$. Furthermore, we illustrate the practical applicability of our framework by addressing utility maximization problems under rough volatility, which are solved numerically with the proposed deep learning-based methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08768",
        "abs_url": "https://arxiv.org/abs/2511.08768",
        "pdf_url": "https://arxiv.org/pdf/2511.08768",
        "title": "WATSON-Net: Vetting, Validation, and Analysis of Transits from Space Observations with Neural Networks",
        "authors": [
            "M. Dévora-Pajares",
            "F.J. Pozuelos",
            "J.C. Suárez",
            "M. González-Penedo",
            "C. Dafonte"
        ],
        "comments": "Submitted, Open to comments",
        "subjects": "Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)",
        "abstract": "Context. As the number of detected transiting exoplanet candidates continues to grow, the need for robust and scalable automated tools to prioritize or validate them has become increasingly critical. Among the most promising solutions, deep learning models offer the ability to interpret complex diagnostic metrics traditionally used in the vetting process. Aims. In this work, we present WATSON-Net, a new open-source neural network classifier and data preparation package designed to compete with current state-of-the-art tools for vetting and validation of transiting exoplanet signals from space-based missions. Methods. Trained on Kepler Q1-Q17 DR25 data using 10-fold cross-validation, WATSON-Net produces ten independent models, each evaluated on dedicated validation and test sets. The ten models are calibrated and prepared to be extensible for TESS data by standardizing the input pipeline, allowing for performance assessment across different space missions. Results. For Kepler targets, WATSON-Net achieves a recall-at-precision of 0.99 (R@P0.99) of 0.903, ranking second, with only the ExoMiner network performing better (R@P0.99 = 0.936). For TESS signals, WATSON-Net emerges as the best-performing non-fine-tuned machine learning classifier, achieving a precision of 0.93 and a recall of 0.76 on a test set comprising confirmed planets and false positives. Both the model and its data preparation tools are publicly available in the dearwatson Python package, fully open-source and integrated into the vetting engine of the SHERLOCK pipeline.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08791",
        "abs_url": "https://arxiv.org/abs/2511.08791",
        "pdf_url": "https://arxiv.org/pdf/2511.08791",
        "title": "The Probably Approximately Correct Learning Model in Computational Learning Theory",
        "authors": [
            "Rocco A. Servedio"
        ],
        "comments": "45 pages, 4 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "This survey paper gives an overview of various known results on learning classes of Boolean functions in Valiant's Probably Approximately Correct (PAC) learning model and its commonly studied variants.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08808",
        "abs_url": "https://arxiv.org/abs/2511.08808",
        "pdf_url": "https://arxiv.org/pdf/2511.08808",
        "title": "Effects of label noise on the classification of outlier observations",
        "authors": [
            "Matheus Vinícius Barreto de Farias",
            "Mario de Castro"
        ],
        "comments": "10 pages, 8 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "This study investigates the impact of adding noise to the training set classes in classification tasks using the BCOPS algorithm (Balanced and Conformal Optimized Prediction Sets), proposed by Guan & Tibshirani (2022). The BCOPS algorithm is an application of conformal prediction combined with a machine learning method to construct prediction sets such that the probability of the true class being included in the prediction set for a test observation meets a specified coverage guarantee. An observation is considered an outlier if its true class is not present in the training set. The study employs both synthetic and real datasets and conducts experiments to evaluate the prediction abstention rate for outlier observations and the model's robustness in this previously untested scenario. The results indicate that the addition of noise, even in small amounts, can have a significant effect on model performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08811",
        "abs_url": "https://arxiv.org/abs/2511.08811",
        "pdf_url": "https://arxiv.org/pdf/2511.08811",
        "title": "A Neural-Operator Preconditioned Newton Method for Accelerated Nonlinear Solvers",
        "authors": [
            "Youngkyu Lee",
            "Shanqing Liu",
            "Jerome Darbon",
            "George Em Karniadakis"
        ],
        "comments": "14 pages, 5 figures, 7 tables",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "We propose a novel neural preconditioned Newton (NP-Newton) method for solving parametric nonlinear systems of equations. To overcome the stagnation or instability of Newton iterations caused by unbalanced nonlinearities, we introduce a fixed-point neural operator (FPNO) that learns the direct mapping from the current iterate to the solution by emulating fixed-point iterations. Unlike traditional line-search or trust-region algorithms, the proposed FPNO adaptively employs negative step sizes to effectively mitigate the effects of unbalanced nonlinearities. Through numerical experiments we demonstrate the computational efficiency and robustness of the proposed NP-Newton method across multiple real-world applications, especially for very strong nonlinearities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08851",
        "abs_url": "https://arxiv.org/abs/2511.08851",
        "pdf_url": "https://arxiv.org/pdf/2511.08851",
        "title": "Learning-based Radio Link Failure Prediction Based on Measurement Dataset in Railway Environments",
        "authors": [
            "Po-Heng Chou",
            "Da-Chih Lin",
            "Hung-Yu Wei",
            "Walid Saad",
            "Yu Tsao"
        ],
        "comments": "7 pages, 3 figures, 2 tables, and submitted to IEEE ICC 2026",
        "subjects": "Networking and Internet Architecture (cs.NI); Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "In this paper, a measurement-driven framework is proposed for early radio link failure (RLF) prediction in 5G non-standalone (NSA) railway environments. Using 10 Hz metro-train traces with serving and neighbor-cell indicators, we benchmark six models, namely CNN, LSTM, XGBoost, Anomaly Transformer, PatchTST, and TimesNet, under varied observation windows and prediction horizons. When the observation window is three seconds, TimesNet attains the highest F1 score with a three-second prediction horizon, while CNN provides a favorable accuracy-latency tradeoff with a two-second horizon, enabling proactive actions such as redundancy and adaptive handovers. The results indicate that deep temporal models can anticipate reliability degradations several seconds in advance using lightweight features available on commercial devices, offering a practical path to early-warning control in 5G-based railway systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08852",
        "abs_url": "https://arxiv.org/abs/2511.08852",
        "pdf_url": "https://arxiv.org/pdf/2511.08852",
        "title": "DRL-Based Beam Positioning for LEO Satellite Constellations with Weighted Least Squares",
        "authors": [
            "Po-Heng Chou",
            "Chiapin Wang",
            "Kuan-Hao Chen",
            "Wei-Chen Hsiao"
        ],
        "comments": "6 pages, 2 figures, 1 table, and submitted to IEEE ICC 2026",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "In this paper, we propose a reinforcement learning based beam weighting framework that couples a policy network with an augmented weighted least squares (WLS) estimator for accurate and low-complexity positioning in multi-beam LEO constellations. Unlike conventional geometry or CSI-dependent approaches, the policy learns directly from uplink pilot responses and geometry features, enabling robust localization without explicit CSI estimation. An augmented WLS jointly estimates position and receiver clock bias, improving numerical stability under dynamic beam geometry. Across representative scenarios, the proposed method reduces the mean positioning error by 99.3% compared with the geometry-based baseline, achieving 0.395 m RMSE with near real-time inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08896",
        "abs_url": "https://arxiv.org/abs/2511.08896",
        "pdf_url": "https://arxiv.org/pdf/2511.08896",
        "title": "Classifying Histopathologic Glioblastoma Sub-regions with EfficientNet",
        "authors": [
            "Sanyukta Adap",
            "Ujjwal Baid",
            "Spyridon Bakas"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Glioblastoma (GBM) is the most common aggressive, fast-growing brain tumor, with a grim prognosis. Despite clinical diagnostic advancements, there have not been any substantial improvements to patient prognosis. Histopathological assessment of excised tumors is the first line of clinical diagnostic routine. We hypothesize that automated, robust, and accurate identification of distinct histological sub-regions within GBM could contribute to morphologically understanding this disease at scale. In this study, we designed a four-step deep learning approach to classify six (6) histopathological regions and quantitatively evaluated it on the BraTS-Path 2024 challenge dataset, which includes digitized Hematoxylin \\& Eosin (H\\&E) stained GBM tissue sections annotated for six distinct regions. We used the challenge's publicly available training dataset to develop and evaluate the effectiveness of several variants of EfficientNet architectures (i.e., B0, B1, B2, B3, B4). EfficientNet-B1 and EfficientNet-B4 achieved the best performance, achieving an F1 score of 0.98 in a 5-fold cross-validation configuration using the BraTS-Path training set. The quantitative performance evaluation of our proposed approach with EfficientNet-B1 on the BraTS-Path hold-out validation data and the final hidden testing data yielded F1 scores of 0.546 and 0.517, respectively, for the associated 6-class classification task. The difference in the performance on training, validation, and testing data highlights the challenge of developing models that generalize well to new data, which is crucial for clinical applications. The source code of the proposed approach can be found at the GitHub repository of Indiana University Division of Computational Pathology: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08955",
        "abs_url": "https://arxiv.org/abs/2511.08955",
        "pdf_url": "https://arxiv.org/pdf/2511.08955",
        "title": "MicroEvoEval: A Systematic Evaluation Framework for Image-Based Microstructure Evolution Prediction",
        "authors": [
            "Qinyi Zhang",
            "Duanyu Feng",
            "Ronghui Han",
            "Yangshuai Wang",
            "Hao Wang"
        ],
        "comments": "Accepted by AAAI 2026",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Simulating microstructure evolution (MicroEvo) is vital for materials design but demands high numerical accuracy, efficiency, and physical fidelity. Although recent studies on deep learning (DL) offer a promising alternative to traditional solvers, the field lacks standardized benchmarks. Existing studies are flawed due to a lack of comparing specialized MicroEvo DL models with state-of-the-art spatio-temporal architectures, an overemphasis on numerical accuracy over physical fidelity, and a failure to analyze error propagation over time. To address these gaps, we introduce MicroEvoEval, the first comprehensive benchmark for image-based microstructure evolution prediction. We evaluate 14 models, encompassing both domain-specific and general-purpose architectures, across four representative MicroEvo tasks with datasets specifically structured for both short- and long-term assessment. Our multi-faceted evaluation framework goes beyond numerical accuracy and computational cost, incorporating a curated set of structure-preserving metrics to assess physical fidelity. Our extensive evaluations yield several key insights. Notably, we find that modern architectures (e.g., VMamba), not only achieve superior long-term stability and physical fidelity but also operate with an order-of-magnitude greater computational efficiency. The results highlight the necessity of holistic evaluation and identify these modern architectures as a highly promising direction for developing efficient and reliable surrogate models in data-driven materials science.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08985",
        "abs_url": "https://arxiv.org/abs/2511.08985",
        "pdf_url": "https://arxiv.org/pdf/2511.08985",
        "title": "DeepTracer: Tracing Stolen Model via Deep Coupled Watermarks",
        "authors": [
            "Yunfei Yang",
            "Xiaojun Chen",
            "Yuexin Xuan",
            "Zhendong Zhao",
            "Xin Zhao",
            "He Li"
        ],
        "comments": "Extended version of the paper accepted by AAAI 2026",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Model watermarking techniques can embed watermark information into the protected model for ownership declaration by constructing specific input-output pairs. However, existing watermarks are easily removed when facing model stealing attacks, and make it difficult for model owners to effectively verify the copyright of stolen models. In this paper, we analyze the root cause of the failure of current watermarking methods under model stealing scenarios and then explore potential solutions. Specifically, we introduce a robust watermarking framework, DeepTracer, which leverages a novel watermark samples construction method and a same-class coupling loss constraint. DeepTracer can incur a high-coupling model between watermark task and primary task that makes adversaries inevitably learn the hidden watermark task when stealing the primary task functionality. Furthermore, we propose an effective watermark samples filtering mechanism that elaborately select watermark key samples used in model ownership verification to enhance the reliability of watermarks. Extensive experiments across multiple datasets and models demonstrate that our method surpasses existing approaches in defending against various model stealing attacks, as well as watermark attacks, and achieves new state-of-the-art effectiveness and robustness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08991",
        "abs_url": "https://arxiv.org/abs/2511.08991",
        "pdf_url": "https://arxiv.org/pdf/2511.08991",
        "title": "Robust Sampling for Active Statistical Inference",
        "authors": [
            "Puheng Li",
            "Tijana Zrnic",
            "Emmanuel Candès"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Active statistical inference is a new method for inference with AI-assisted data collection. Given a budget on the number of labeled data points that can be collected and assuming access to an AI predictive model, the basic idea is to improve estimation accuracy by prioritizing the collection of labels where the model is most uncertain. The drawback, however, is that inaccurate uncertainty estimates can make active sampling produce highly noisy results, potentially worse than those from naive uniform sampling. In this work, we present robust sampling strategies for active statistical inference. Robust sampling ensures that the resulting estimator is never worse than the estimator using uniform sampling. Furthermore, with reliable uncertainty estimates, the estimator usually outperforms standard active inference. This is achieved by optimally interpolating between uniform and active sampling, depending on the quality of the uncertainty scores, and by using ideas from robust optimization. We demonstrate the utility of the method on a series of real datasets from computational social science and survey research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.08994",
        "abs_url": "https://arxiv.org/abs/2511.08994",
        "pdf_url": "https://arxiv.org/pdf/2511.08994",
        "title": "Generalisable prediction model of surgical case duration: multicentre development and temporal validation",
        "authors": [
            "Daijiro Kabata",
            "Mari Ito",
            "Tokito Koga",
            "Kazuma Yunoki"
        ],
        "comments": "20 pages, 2 tables, and 5 figures",
        "subjects": "Applications (stat.AP); Machine Learning (cs.LG)",
        "abstract": "Background: Accurate prediction of surgical case duration underpins operating room (OR) scheduling, yet existing models often depend on site- or surgeon-specific inputs and rarely undergo external validation, limiting generalisability. Methods: We undertook a retrospective multicentre study using routinely collected perioperative data from two general hospitals in Japan (development: 1 January 2021-31 December 2023; temporal test: 1 January-31 December 2024). Elective weekday procedures with American Society of Anesthesiologists (ASA) Physical Status 1-4 were included. Pre-specified preoperative predictors comprised surgical context (year, month, weekday, scheduled duration, general anaesthesia indicator, body position) and patient factors (sex, age, body mass index, allergy, infection, comorbidity, ASA). Missing data were addressed by multiple imputation by chained equations. Four learners (elastic-net, generalised additive models, random forest, gradient-boosted trees) were tuned within internal-external cross-validation (IECV; leave-one-cluster-out by centre-year) and combined by stacked generalisation to predict log-transformed duration. Results: We analysed 63,206 procedures (development 45,647; temporal test 17,559). Cluster-specific and pooled errors and calibrations from IECV are provided with consistent performance across centres and years. In the 2024 temporal test cohort, calibration was good (intercept 0.423, 95%CI 0.372 to 0.474; slope 0.921, 95%CI 0.911 to 0.932). Conclusions: A stacked machine-learning model using only widely available preoperative variables achieved accurate, well-calibrated predictions in temporal external validation, supporting transportability across sites and over time. Such general-purpose tools may improve OR scheduling without relying on idiosyncratic inputs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09002",
        "abs_url": "https://arxiv.org/abs/2511.09002",
        "pdf_url": "https://arxiv.org/pdf/2511.09002",
        "title": "Convergence and Stability Analysis of Self-Consuming Generative Models with Heterogeneous Human Curation",
        "authors": [
            "Hongru Zhao",
            "Jinwen Fu",
            "Tuan Pham"
        ],
        "comments": "41 pages, 2 tables",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Self-consuming generative models have received significant attention over the last few years. In this paper, we study a self-consuming generative model with heterogeneous preferences that is a generalization of the model in Ferbach et al. (2024). The model is retrained round by round using real data and its previous-round synthetic outputs. The asymptotic behavior of the retraining dynamics is investigated across four regimes using different techniques including the nonlinear Perron--Frobenius theory. Our analyses improve upon that of Ferbach et al. (2024) and provide convergence results in settings where the well-known Banach contraction mapping arguments do not apply. Stability and non-stability results regarding the retraining dynamics are also given.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09016",
        "abs_url": "https://arxiv.org/abs/2511.09016",
        "pdf_url": "https://arxiv.org/pdf/2511.09016",
        "title": "Assumed Density Filtering and Smoothing with Neural Network Surrogate Models",
        "authors": [
            "Simon Kuang",
            "Xinfan Lin"
        ],
        "comments": "",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "The Kalman filter and Rauch-Tung-Striebel (RTS) smoother are optimal for state estimation in linear dynamic systems. With nonlinear systems, the challenge consists in how to propagate uncertainty through the state transitions and output function. For the case of a neural network model, we enable accurate uncertainty propagation using a recent state-of-the-art analytic formula for computing the mean and covariance of a deep neural network with Gaussian input. We argue that cross entropy is a more appropriate performance metric than RMSE for evaluating the accuracy of filters and smoothers. We demonstrate the superiority of our method for state estimation on a stochastic Lorenz system and a Wiener system, and find that our method enables more optimal linear quadratic regulation when the state estimate is used for feedback.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09026",
        "abs_url": "https://arxiv.org/abs/2511.09026",
        "pdf_url": "https://arxiv.org/pdf/2511.09026",
        "title": "DeepVRegulome: DNABERT-based deep-learning framework for predicting the functional impact of short genomic variants on the human regulome",
        "authors": [
            "Pratik Dutta",
            "Matthew Obusan",
            "Rekha Sathian",
            "Max Chao",
            "Pallavi Surana",
            "Nimisha Papineni",
            "Yanrong Ji",
            "Zhihan Zhou",
            "Han Liu",
            "Alisa Yurovsky",
            "Ramana V Davuluri"
        ],
        "comments": "",
        "subjects": "Genomics (q-bio.GN); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Whole-genome sequencing (WGS) has revealed numerous non-coding short variants whose functional impacts remain poorly understood. Despite recent advances in deep-learning genomic approaches, accurately predicting and prioritizing clinically relevant mutations in gene regulatory regions remains a major challenge. Here we introduce Deep VRegulome, a deep-learning method for prediction and interpretation of functionally disruptive variants in the human regulome, which combines 700 DNABERT fine-tuned models, trained on vast amounts of ENCODE gene regulatory regions, with variant scoring, motif analysis, attention-based visualization, and survival analysis. We showcase its application on TCGA glioblastoma WGS dataset in prioritizing survival-associated mutations and regulatory regions. The analysis identified 572 splice-disrupting and 9,837 transcription-factor binding site altering mutations occurring in greater than 10% of glioblastoma samples. Survival analysis linked 1352 mutations and 563 disrupted regulatory regions to patient outcomes, enabling stratification via non-coding mutation signatures. All the code, fine-tuned models, and an interactive data portal are publicly available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09060",
        "abs_url": "https://arxiv.org/abs/2511.09060",
        "pdf_url": "https://arxiv.org/pdf/2511.09060",
        "title": "VAE-Based Synthetic EMG Generation with Mix-Consistency Loss for Recognizing Unseen Motion Combinations",
        "authors": [
            "Itsuki Yazawa",
            "Akira Furui"
        ],
        "comments": "6 pages, 5 figures, accepted at IEEE SII 2026",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "Electromyogram (EMG)-based motion classification using machine learning has been widely employed in applications such as prosthesis control. While previous studies have explored generating synthetic patterns of combined motions to reduce training data requirements, these methods assume that combined motions can be represented as linear combinations of basic motions. However, this assumption often fails due to complex neuromuscular phenomena such as muscle co-contraction, resulting in low-fidelity synthetic signals and degraded classification performance. To address this limitation, we propose a novel method that learns to synthesize combined motion patterns in a structured latent space. Specifically, we employ a variational autoencoder (VAE) to encode EMG signals into a low-dimensional representation and introduce a mixconsistency loss that structures the latent space such that combined motions are embedded between their constituent basic motions. Synthetic patterns are then generated within this structured latent space and used to train classifiers for recognizing unseen combined motions. We validated our approach through upper-limb motion classification experiments with eight healthy participants. The results demonstrate that our method outperforms input-space synthesis approaches, achieving approximately 30% improvement in accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09118",
        "abs_url": "https://arxiv.org/abs/2511.09118",
        "pdf_url": "https://arxiv.org/pdf/2511.09118",
        "title": "Learning to Validate Generative Models: a Goodness-of-Fit Approach",
        "authors": [
            "Pietro Cappelli",
            "Gaia Grosso",
            "Marco Letizia",
            "Humberto Reyes-González",
            "Marco Zanetti"
        ],
        "comments": "16 pages, 6 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); High Energy Physics - Experiment (hep-ex); High Energy Physics - Phenomenology (hep-ph)",
        "abstract": "Generative models are increasingly central to scientific workflows, yet their systematic use and interpretation require a proper understanding of their limitations through rigorous validation. Classic approaches struggle with scalability, statistical power, or interpretability when applied to high-dimensional data, making it difficult to certify the reliability of these models in realistic, high-dimensional scientific settings. Here, we propose the use of the New Physics Learning Machine (NPLM), a learning based approach to goodness-of-fit testing inspired by the Neyman-Pearson construction, to test generative networks trained on high-dimensional scientific data. We demonstrate the performance of NPLM for validation in two benchmark cases: generative models trained on mixtures of Gaussian models with increasing dimensionality, and a public end-to-end generator for the Large Hadron Collider called FlashSim, trained on jet data, typical in the field of high-energy physics. We demonstrate that the NPLM can serve as a powerful validation method while also providing a means to diagnose sub-optimally modeled regions of the data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09148",
        "abs_url": "https://arxiv.org/abs/2511.09148",
        "pdf_url": "https://arxiv.org/pdf/2511.09148",
        "title": "LoopTool: Closing the Data-Training Loop for Robust LLM Tool Calls",
        "authors": [
            "Kangning Zhang",
            "Wenxiang Jiao",
            "Kounianhua Du",
            "Yuan Lu",
            "Weiwen Liu",
            "Weinan Zhang",
            "Lei Zhang",
            "Yong Yu"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Augmenting Large Language Models (LLMs) with external tools enables them to execute complex, multi-step tasks. However, tool learning is hampered by the static synthetic data pipelines where data generation and model training are executed as two separate, non-interactive processes. This approach fails to adaptively focus on a model's specific weaknesses and allows noisy labels to persist, degrading training efficiency. We introduce LoopTool, a fully automated, model-aware data evolution framework that closes this loop by tightly integrating data synthesis and model training. LoopTool iteratively refines both the data and the model through three synergistic modules: (1) Greedy Capability Probing (GCP) diagnoses the model's mastered and failed capabilities; (2) Judgement-Guided Label Verification (JGLV) uses an open-source judge model to find and correct annotation errors, progressively purifying the dataset; and (3) Error-Driven Data Expansion (EDDE) generates new, challenging samples based on identified failures. This closed-loop process operates within a cost-effective, open-source ecosystem, eliminating dependence on expensive closed-source APIs. Experiments show that our 8B model trained with LoopTool significantly surpasses its 32B data generator and achieves new state-of-the-art results on the BFCL-v3 and ACEBench benchmarks for its scale. Our work demonstrates that closed-loop, self-refining data pipelines can dramatically enhance the tool-use capabilities of LLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09186",
        "abs_url": "https://arxiv.org/abs/2511.09186",
        "pdf_url": "https://arxiv.org/pdf/2511.09186",
        "title": "Scalable Mixed-Integer Optimization with Neural Constraints via Dual Decomposition",
        "authors": [
            "Shuli Zeng",
            "Sijia Zhang",
            "Feng Wu",
            "Shaojie Tang",
            "Xiang-Yang Li"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "Embedding deep neural networks (NNs) into mixed-integer programs (MIPs) is attractive for decision making with learned constraints, yet state-of-the-art monolithic linearisations blow up in size and quickly become intractable. In this paper, we introduce a novel dual-decomposition framework that relaxes the single coupling equality u=x with an augmented Lagrange multiplier and splits the problem into a vanilla MIP and a constrained NN block. Each part is tackled by the solver that suits it best-branch and cut for the MIP subproblem, first-order optimisation for the NN subproblem-so the model remains modular, the number of integer variables never grows with network depth, and the per-iteration cost scales only linearly with the NN size. On the public \\textsc{SurrogateLIB} benchmark, our method proves \\textbf{scalable}, \\textbf{modular}, and \\textbf{adaptable}: it runs \\(120\\times\\) faster than an exact Big-M formulation on the largest test case; the NN sub-solver can be swapped from a log-barrier interior step to a projected-gradient routine with no code changes and identical objective value; and swapping the MLP for an LSTM backbone still completes the full optimisation in 47s without any bespoke adaptation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09204",
        "abs_url": "https://arxiv.org/abs/2511.09204",
        "pdf_url": "https://arxiv.org/pdf/2511.09204",
        "title": "Resource-Efficient Variational Quantum Classifier",
        "authors": [
            "Petr Ptáček",
            "Paulina Lewandowska",
            "Ryszard Kukulski"
        ],
        "comments": "20 pages, 9 figures, 2 tables",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "Quantum computing promises a revolution in information processing, with significant potential for machine learning and classification tasks. However, achieving this potential requires overcoming several fundamental challenges. One key limitation arises at the prediction stage, where the intrinsic randomness of quantum model outputs necessitates repeated executions, resulting in substantial overhead. To overcome this, we propose a novel measurement strategy for a variational quantum classifier that allows us to define the unambiguous quantum classifier. This strategy achieves near-deterministic predictions while maintaining competitive classification accuracy in noisy environments, all with significantly fewer quantum circuit executions. Although this approach entails a slight reduction in performance, it represents a favorable trade-off for improved resource efficiency. We further validate our theoretical model with supporting experimental results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09242",
        "abs_url": "https://arxiv.org/abs/2511.09242",
        "pdf_url": "https://arxiv.org/pdf/2511.09242",
        "title": "Robust Least-Squares Optimization for Data-Driven Predictive Control: A Geometric Approach",
        "authors": [
            "Shreyas Bharadwaj",
            "Bamdev Mishra",
            "Cyrus Mostajeran",
            "Alberto Padoan",
            "Jeremy Coulson",
            "Ravi N. Banavar"
        ],
        "comments": "Submitted to the 8th Annual Learning for Dynamics & Control Conference June 17-19 2026, USC, Los Angeles, USA",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "The paper studies a geometrically robust least-squares problem that extends classical and norm-based robust formulations. Rather than minimizing residual error for fixed or perturbed data, we interpret least-squares as enforcing approximate subspace inclusion between measured and true data spaces. The uncertainty in this geometric relation is modeled as a metric ball on the Grassmannian manifold, leading to a min-max problem over Euclidean and manifold variables. The inner maximization admits a closed-form solution, enabling an efficient algorithm with a transparent geometric interpretation. Applied to robust finite-horizon linear-quadratic tracking in data-enabled predictive control, the method improves upon existing robust least-squares formulations, achieving stronger robustness and favorable scaling under small uncertainty.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09316",
        "abs_url": "https://arxiv.org/abs/2511.09316",
        "pdf_url": "https://arxiv.org/pdf/2511.09316",
        "title": "AdaptDel: Adaptable Deletion Rate Randomized Smoothing for Certified Robustness",
        "authors": [
            "Zhuoqun Huang",
            "Neil G. Marchant",
            "Olga Ohrimenko",
            "Benjamin I. P. Rubinstein"
        ],
        "comments": "33 pages, 7 figures, camera ready version for NeurIPS 2025",
        "subjects": "Computation and Language (cs.CL); Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "We consider the problem of certified robustness for sequence classification against edit distance perturbations. Naturally occurring inputs of varying lengths (e.g., sentences in natural language processing tasks) present a challenge to current methods that employ fixed-rate deletion mechanisms and lead to suboptimal performance. To this end, we introduce AdaptDel methods with adaptable deletion rates that dynamically adjust based on input properties. We extend the theoretical framework of randomized smoothing to variable-rate deletion, ensuring sound certification with respect to edit distance. We achieve strong empirical results in natural language tasks, observing up to 30 orders of magnitude improvement to median cardinality of the certified region, over state-of-the-art certifications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09373",
        "abs_url": "https://arxiv.org/abs/2511.09373",
        "pdf_url": "https://arxiv.org/pdf/2511.09373",
        "title": "Routesplain: Towards Faithful and Intervenable Routing for Software-related Tasks",
        "authors": [
            "Adam Štorek",
            "Vikas Upadhyay",
            "Marianne Menglin Liu",
            "Daniel W. Peterson",
            "Anshul Mittal",
            "Sujeeth Bharadwaj",
            "Fahad Shah",
            "Dan Roth"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "LLMs now tackle a wide range of software-related tasks, yet we show that their performance varies markedly both across and within these tasks. Routing user queries to the appropriate LLMs can therefore help improve response quality while reducing cost. Prior work, however, has focused mainly on general-purpose LLM routing via black-box models. We introduce Routesplain, the first LLM router for software-related tasks, including multilingual code generation and repair, input/output prediction, and computer science QA. Unlike existing routing approaches, Routesplain first extracts human-interpretable concepts from each query (e.g., task, domain, reasoning complexity) and only routes based on these concepts, thereby providing intelligible, faithful rationales. We evaluate Routesplain on 16 state-of-the-art LLMs across eight software-related tasks; Routesplain outperforms individual models both in terms of accuracy and cost, and equals or surpasses all black-box baselines, with concept-level intervention highlighting avenues for further router improvements.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09426",
        "abs_url": "https://arxiv.org/abs/2511.09426",
        "pdf_url": "https://arxiv.org/pdf/2511.09426",
        "title": "BIG5-TPoT: Predicting BIG Five Personality Traits, Facets, and Items Through Targeted Preselection of Texts",
        "authors": [
            "Triet M. Le",
            "Arjun Chandra",
            "C. Anton Rytting",
            "Valerie P. Karuzis",
            "Vladimir Rife",
            "William A. Simpson"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Predicting an individual's personalities from their generated texts is a challenging task, especially when the text volume is large. In this paper, we introduce a straightforward yet effective novel strategy called targeted preselection of texts (TPoT). This method semantically filters the texts as input to a deep learning model, specifically designed to predict a Big Five personality trait, facet, or item, referred to as the BIG5-TPoT model. By selecting texts that are semantically relevant to a particular trait, facet, or item, this strategy not only addresses the issue of input text limits in large language models but also improves the Mean Absolute Error and accuracy metrics in predictions for the Stream of Consciousness Essays dataset.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09427",
        "abs_url": "https://arxiv.org/abs/2511.09427",
        "pdf_url": "https://arxiv.org/pdf/2511.09427",
        "title": "Adversarially and Distributionally Robust Virtual Energy Storage Systems via the Scenario Approach",
        "authors": [
            "Georgios Pantazis",
            "Nicola Mignoni",
            "Raffaele Carli",
            "Mariagrazia Dotoli",
            "Sergio Grammatico"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "We propose an optimization model where a parking lot manager (PLM) can aggregate parked EV batteries to provide virtual energy storage services that are provably robust under uncertain EV departures and state-of-charge caps. Our formulation yields a data-driven convex optimization problem where a prosumer community agrees on a contract with the PLM for the provision of storage services over a finite horizon. Leveraging recent results in the scenario approach, we certify out-of-sample constraint safety. Furthermore, we enable a tunable profit-risk trade-off through scenario relaxation and extend our model to account for robustness to adversarial perturbations and distributional shifts over Wasserstein-based ambiguity sets. All the approaches are accompanied by tight finite-sample certificates. Numerical studies demonstrate the out-of-sample and out-of-distribution constraint satisfaction of our proposed model compared to the developed theoretical guarantees, showing their effectiveness and potential in robust and efficient virtual energy services.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09448",
        "abs_url": "https://arxiv.org/abs/2511.09448",
        "pdf_url": "https://arxiv.org/pdf/2511.09448",
        "title": "MCAD: Multimodal Context-Aware Audio Description Generation For Soccer",
        "authors": [
            "Lipisha Chaudhary",
            "Trisha Mittal",
            "Subhadra Gopalakrishnan",
            "Ifeoma Nwogu",
            "Jaclyn Pytlarz"
        ],
        "comments": "",
        "subjects": "Multimedia (cs.MM); Machine Learning (cs.LG)",
        "abstract": "Audio Descriptions (AD) are essential for making visual content accessible to individuals with visual impairments. Recent works have shown a promising step towards automating AD, but they have been limited to describing high-quality movie content using human-annotated ground truth AD in the process. In this work, we present an end-to-end pipeline, MCAD, that extends AD generation beyond movies to the domain of sports, with a focus on soccer games, without relying on ground truth AD. To address the absence of domain-specific AD datasets, we fine-tune a Video Large Language Model on publicly available movie AD datasets so that it learns the narrative structure and conventions of AD. During inference, MCAD incorporates multimodal contextual cues such as player identities, soccer events and actions, and commentary from the game. These cues, combined with input prompts to the fine-tuned VideoLLM, allow the system to produce complete AD text for each video segment. We further introduce a new evaluation metric, ARGE-AD, designed to accurately assess the quality of generated AD. ARGE-AD evaluates the generated AD for the presence of five characteristics: (i) usage of people's names, (ii) mention of actions and events, (iii) appropriate length of AD, (iv) absence of pronouns, and (v) overlap from commentary or subtitles. We present an in-depth analysis of our approach on both movie and soccer datasets. We also validate the use of this metric to quantitatively comment on the quality of generated AD using our metric across domains. Additionally, we contribute audio descriptions for 100 soccer game clips annotated by two AD experts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09465",
        "abs_url": "https://arxiv.org/abs/2511.09465",
        "pdf_url": "https://arxiv.org/pdf/2511.09465",
        "title": "Branching Flows: Discrete, Continuous, and Manifold Flow Matching with Splits and Deletions",
        "authors": [
            "Hedwig Nora Nordlinder",
            "Lukas Billera",
            "Jack Collier Ryder",
            "Anton Oresten",
            "Aron Stålmarck",
            "Theodor Mosetti Björk",
            "Ben Murrell"
        ],
        "comments": "30 pages, 10 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Diffusion and flow matching approaches to generative modeling have shown promise in domains where the state space is continuous, such as image generation or protein folding & design, and discrete, exemplified by diffusion large language models. They offer a natural fit when the number of elements in a state is fixed in advance (e.g. images), but require ad hoc solutions when, for example, the length of a response from a large language model, or the number of amino acids in a protein chain is not known a priori. Here we propose Branching Flows, a generative modeling framework that, like diffusion and flow matching approaches, transports a simple distribution to the data distribution. But in Branching Flows, the elements in the state evolve over a forest of binary trees, branching and dying stochastically with rates that are learned by the model. This allows the model to control, during generation, the number of elements in the sequence. We also show that Branching Flows can compose with any flow matching base process on discrete sets, continuous Euclidean spaces, smooth manifolds, and `multimodal' product spaces that mix these components. We demonstrate this in three domains: small molecule generation (multimodal), antibody sequence generation (discrete), and protein backbone generation (multimodal), and show that Branching Flows is a capable distribution learner with a stable learning objective, and that it enables new capabilities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 113,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09493",
        "abs_url": "https://arxiv.org/abs/2511.09493",
        "pdf_url": "https://arxiv.org/pdf/2511.09493",
        "title": "Consensus Sampling for Safer Generative AI",
        "authors": [
            "Adam Tauman Kalai",
            "Yael Tauman Kalai",
            "Or Zamir"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Many approaches to AI safety rely on inspecting model outputs or activations, yet certain risks are inherently undetectable by inspection alone. We propose a complementary, architecture-agnostic approach that enhances safety through the aggregation of multiple generative models, with the aggregated model inheriting its safety from the safest subset of a given size among them. Specifically, we present a consensus sampling algorithm that, given $k$ models and a prompt, achieves risk competitive with the average risk of the safest $s$ of the $k$ models, where $s$ is a chosen parameter, while abstaining when there is insufficient agreement between them. The approach leverages the models' ability to compute output probabilities, and we bound the probability of abstention when sufficiently many models are safe and exhibit adequate agreement. The algorithm is inspired by the provable copyright protection algorithm of Vyas et al. (2023). It requires some overlap among safe models, offers no protection when all models are unsafe, and may accumulate risk over repeated use. Nonetheless, our results provide a new, model-agnostic approach for AI safety by amplifying safety guarantees from an unknown subset of models within a collection to that of a single reliable model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 114,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09500",
        "abs_url": "https://arxiv.org/abs/2511.09500",
        "pdf_url": "https://arxiv.org/pdf/2511.09500",
        "title": "Distributional Shrinkage I: Universal Denoisers in Multi-Dimensions",
        "authors": [
            "Tengyuan Liang"
        ],
        "comments": "26 pages, 5 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "We revisit the problem of denoising from noisy measurements where only the noise level is known, not the noise distribution. In multi-dimensions, independent noise $Z$ corrupts the signal $X$, resulting in the noisy measurement $Y = X + \\sigma Z$, where $\\sigma \\in (0, 1)$ is a known noise level. Our goal is to recover the underlying signal distribution $P_X$ from denoising $P_Y$. We propose and analyze universal denoisers that are agnostic to a wide range of signal and noise distributions. Our distributional denoisers offer order-of-magnitude improvements over the Bayes-optimal denoiser derived from Tweedie's formula, if the focus is on the entire distribution $P_X$ rather than on individual realizations of $X$. Our denoisers shrink $P_Y$ toward $P_X$ optimally, achieving $O(\\sigma^4)$ and $O(\\sigma^6)$ accuracy in matching generalized moments and density functions. Inspired by optimal transport theory, the proposed denoisers are optimal in approximating the Monge-Ampère equation with higher-order accuracy, and can be implemented efficiently via score matching. Let $q$ represent the density of $P_Y$; for optimal distributional denoising, we recommend replacing the Bayes-optimal denoiser, \\[ \\mathbf{T}^*(y) = y + \\sigma^2 \\nabla \\log q(y), \\] with denoisers exhibiting less aggressive distributional shrinkage, \\[ \\mathbf{T}_1(y) = y + \\frac{\\sigma^2}{2} \\nabla \\log q(y), \\] \\[ \\mathbf{T}_2(y) = y + \\frac{\\sigma^2}{2} \\nabla \\log q(y) - \\frac{\\sigma^4}{8} \\nabla \\left( \\frac{1}{2} \\| \\nabla \\log q(y) \\|^2 + \\nabla \\cdot \\nabla \\log q(y) \\right) . \\]",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 115,
        "date": "2025-11-13",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-13?abs=True",
        "arxiv_id": "2511.09557",
        "abs_url": "https://arxiv.org/abs/2511.09557",
        "pdf_url": "https://arxiv.org/pdf/2511.09557",
        "title": "LLM Inference Beyond a Single Node: From Bottlenecks to Mitigations with Fast All-Reduce Communication",
        "authors": [
            "Prajwal Singhania",
            "Siddharth Singh",
            "Lannie Dalton Hough",
            "Akarsh Srivastava",
            "Harshitha Menon",
            "Charles Fredrick Jekel",
            "Abhinav Bhatele"
        ],
        "comments": "12 Figures",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "As large language models (LLMs) continue to grow in size, distributed inference has become increasingly important. Model-parallel strategies must now efficiently scale not only across multiple GPUs but also across multiple nodes. In this work, we present a detailed performance study of multi-node distributed inference using LLMs on GPU-based supercomputers. We conduct experiments with several state-of-the-art inference engines alongside YALIS, a research-oriented prototype engine designed for controlled experimentation. We analyze the strong-scaling behavior of different model-parallel schemes and identify key bottlenecks. Since all-reduce operations are a common performance bottleneck, we develop NVRAR, a hierarchical all-reduce algorithm based on recursive doubling with NVSHMEM. NVRAR achieves up to 1.9x-3.6x lower latency than NCCL for message sizes between 128 KB and 2 MB on HPE Slingshot and InfiniBand interconnects. Integrated into YALIS, NVRAR achieves up to a 1.72x reduction in end-to-end batch latency for the Llama 3.1 405B model in multi-node decode-heavy workloads using tensor parallelism.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]