[
    {
        "order": 1,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19470",
        "abs_url": "https://arxiv.org/abs/2511.19470",
        "pdf_url": "https://arxiv.org/pdf/2511.19470",
        "title": "Quantifying Modality Contributions via Disentangling Multimodal Representations",
        "authors": [
            "Padegal Amit",
            "Omkar Mahesh Kashyap",
            "Namitha Rayasam",
            "Nidhi Shekhar",
            "Surabhi Narayan"
        ],
        "comments": "16 pages, 11 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Quantifying modality contributions in multimodal models remains a challenge, as existing approaches conflate the notion of contribution itself. Prior work relies on accuracy-based approaches, interpreting performance drops after removing a modality as indicative of its influence. However, such outcome-driven metrics fail to distinguish whether a modality is inherently informative or whether its value arises only through interaction with other modalities. This distinction is particularly important in cross-attention architectures, where modalities influence each other's representations. In this work, we propose a framework based on Partial Information Decomposition (PID) that quantifies modality contributions by decomposing predictive information in internal embeddings into unique, redundant, and synergistic components. To enable scalable, inference-only analysis, we develop an algorithm based on the Iterative Proportional Fitting Procedure (IPFP) that computes layer and dataset-level contributions without retraining. This provides a principled, representation-level view of multimodal behavior, offering clearer and more interpretable insights than outcome-based metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19472",
        "abs_url": "https://arxiv.org/abs/2511.19472",
        "pdf_url": "https://arxiv.org/pdf/2511.19472",
        "title": "PrefixGPT: Prefix Adder Optimization by a Generative Pre-trained Transformer",
        "authors": [
            "Ruogu Ding",
            "Xin Ning",
            "Ulf Schlichtmann",
            "Weikang Qian"
        ],
        "comments": "An extended version that has been accepted by AAAI-2026 conference",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Hardware Architecture (cs.AR)",
        "abstract": "Prefix adders are widely used in compute-intensive applications for their high speed. However, designing optimized prefix adders is challenging due to strict design rules and an exponentially large design space. We introduce PrefixGPT, a generative pre-trained Transformer (GPT) that directly generates optimized prefix adders from scratch. Our approach represents an adder's topology as a two-dimensional coordinate sequence and applies a legality mask during generation, ensuring every design is valid by construction. PrefixGPT features a customized decoder-only Transformer architecture. The model is first pre-trained on a corpus of randomly synthesized valid prefix adders to learn design rules and then fine-tuned to navigate the design space for optimized design quality. Compared with existing works, PrefixGPT not only finds a new optimal design with a 7.7% improved area-delay product (ADP) but exhibits superior exploration quality, lowering the average ADP by up to 79.1%. This demonstrates the potential of GPT-style models to first master complex hardware design principles and then apply them for more efficient design optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19480",
        "abs_url": "https://arxiv.org/abs/2511.19480",
        "pdf_url": "https://arxiv.org/pdf/2511.19480",
        "title": "Exploiting the Experts: Unauthorized Compression in MoE-LLMs",
        "authors": [
            "Pinaki Prasad Guha Neogi",
            "Ahmad Mohammadshirazi",
            "Dheeraj Kulshrestha",
            "Rajiv Ramnath"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Mixture-of-Experts (MoE) architectures are increasingly adopted in large language models (LLMs) for their scalability and efficiency. However, their modular structure introduces a unique vulnerability: adversaries can attempt to compress or repurpose models by pruning experts and cheaply fine-tuning the remainder, effectively bypassing licensing and security constraints. In this paper, we systematically study the prunability of MoE-LLMs under task-specific usage. We first develop an expert attribution framework that identifies the subset of experts most responsible for a given task, then evaluate the performance trade-offs of pruning and re-aligning these experts using active learning-driven fine-tuning. Our findings reveal a critical knowledge loss--recovery trade-off: while certain experts can be isolated to retain task accuracy, significant degradation occurs without targeted re-alignment. Based on this analysis, we propose defense strategies that aim to make MoE models harder to compress and fine-tune without authorization, including entangled expert training and selective fine-tuning protocols that resist unauthorized adaptation. By positioning expert pruning as both a threat vector and a defense target, this work highlights the dual-use nature of MoE modularity and provides the first systematic evaluation framework for secure specialization of MoE-LLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19481",
        "abs_url": "https://arxiv.org/abs/2511.19481",
        "pdf_url": "https://arxiv.org/pdf/2511.19481",
        "title": "Quality analysis and evaluation prediction of RAG retrieval based on machine learning algorithms",
        "authors": [
            "Ruoxin Zhang",
            "Zhizhao Wen",
            "Chao Wang",
            "Chenchen Tang",
            "Puyang Xu",
            "Yifan Jiang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "With the rapid evolution of large language models, retrieval enhanced generation technology has been widely used due to its ability to integrate external knowledge to improve output accuracy. However, the performance of the system is highly dependent on the quality of the retrieval module. If the retrieval results have low relevance to user needs or contain noisy information, it will directly lead to distortion of the generated content. In response to the performance bottleneck of existing models in processing tabular features, this paper proposes an XGBoost machine learning regression model based on feature engineering and particle swarm optimization. Correlation analysis shows that answer_quality is positively correlated with doc_delevance by 0.66, indicating that document relevance has a significant positive effect on answer quality, and improving document relevance may enhance answer quality; The strong negative correlations between semantic similarity, redundancy, and diversity were -0.89 and -0.88, respectively, indicating a trade- off between semantic similarity, redundancy, and diversity. In other words, as the former two increased, diversity significantly decreased. The experimental results comparing decision trees, AdaBoost, etc. show that the VMD PSO BiLSTM model is superior in all evaluation indicators, with significantly lower MSE, RMSE, MAE, and MAPE compared to the comparison model. The R2 value is higher, indicating that its prediction accuracy, stability, and data interpretation ability are more outstanding. This achievement provides an effective path for optimizing the retrieval quality and improving the generation effect of RAG system, and has important value in promoting the implementation and application of related technologies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19485",
        "abs_url": "https://arxiv.org/abs/2511.19485",
        "pdf_url": "https://arxiv.org/pdf/2511.19485",
        "title": "OmniTFT: Omni Target Forecasting for Vital Signs and Laboratory Result Trajectories in Multi Center ICU Data",
        "authors": [
            "Wanzhe Xu",
            "Yutong Dai",
            "Yitao Yang",
            "Martin Loza",
            "Weihang Zhang",
            "Yang Cui",
            "Xin Zeng",
            "Sung Joon Park",
            "Kenta Nakai"
        ],
        "comments": "23 pages, 5 figures, 2 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate multivariate time-series prediction of vital signs and laboratory results is crucial for early intervention and precision medicine in intensive care units (ICUs). However, vital signs are often noisy and exhibit rapid fluctuations, while laboratory tests suffer from missing values, measurement lags, and device-specific bias, making integrative forecasting highly challenging. To address these issues, we propose OmniTFT, a deep learning framework that jointly learns and forecasts high-frequency vital signs and sparsely sampled laboratory results based on the Temporal Fusion Transformer (TFT). Specifically, OmniTFT implements four novel strategies to enhance performance: sliding window equalized sampling to balance physiological states, frequency-aware embedding shrinkage to stabilize rare-class representations, hierarchical variable selection to guide model attention toward informative feature clusters, and influence-aligned attention calibration to enhance robustness during abrupt physiological changes. By reducing the reliance on target-specific architectures and extensive feature engineering, OmniTFT enables unified modeling of multiple heterogeneous clinical targets while preserving cross-institutional generalizability. Across forecasting tasks, OmniTFT achieves substantial performance improvement for both vital signs and laboratory results on the MIMIC-III, MIMIC-IV, and eICU datasets. Its attention patterns are interpretable and consistent with known pathophysiology, underscoring its potential utility for quantitative decision support in clinical care.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19487",
        "abs_url": "https://arxiv.org/abs/2511.19487",
        "pdf_url": "https://arxiv.org/pdf/2511.19487",
        "title": "The Generalized Proximity Forest",
        "authors": [
            "Ben Shaw",
            "Adam Rustad",
            "Sofia Pelagalli Maia",
            "Jake S. Rhodes",
            "Kevin R. Moon"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Recent work has demonstrated the utility of Random Forest (RF) proximities for various supervised machine learning tasks, including outlier detection, missing data imputation, and visualization. However, the utility of the RF proximities depends upon the success of the RF model, which itself is not the ideal model in all contexts. RF proximities have recently been extended to time series by means of the distance-based Proximity Forest (PF) model, among others, affording time series analysis with the benefits of RF proximities. In this work, we introduce the generalized PF model, thereby extending RF proximities to all contexts in which supervised distance-based machine learning can occur. Additionally, we introduce a variant of the PF model for regression tasks. We also introduce the notion of using the generalized PF model as a meta-learning framework, extending supervised imputation capability to any pre-trained classifier. We experimentally demonstrate the unique advantages of the generalized PF model compared with both the RF model and the $k$-nearest neighbors model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19491",
        "abs_url": "https://arxiv.org/abs/2511.19491",
        "pdf_url": "https://arxiv.org/pdf/2511.19491",
        "title": "OpenCML: End-to-End Framework of Open-world Machine Learning to Learn Unknown Classes Incrementally",
        "authors": [
            "Jitendra Parmar",
            "Praveen Singh Thakur"
        ],
        "comments": "Introduces an open-world machine learning model for continual and adaptive learning Discovers unknown classes and dynamically creates new class this http URL class-incremental learning to retain and extend prior knowledge. Enables continuous model improvement across multiple learning iterations. Achieved superior performance with an average accuracy of 82.54",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Open-world machine learning is an emerging technique in artificial intelligence, where conventional machine learning models often follow closed-world assumptions, which can hinder their ability to retain previously learned knowledge for future tasks. However, automated intelligence systems must learn about novel classes and previously known tasks. The proposed model offers novel learning classes in an open and continuous learning environment. It consists of two different but connected tasks. First, it discovers unknown classes in the data and creates novel classes; next, it learns how to perform class incrementally for each new class. Together, they enable continual learning, allowing the system to expand its understanding of the data and improve over time. The proposed model also outperformed existing approaches in open-world learning. Furthermore, it demonstrated strong performance in continuous learning, achieving a highest average accuracy of 82.54% over four iterations and a minimum accuracy of 65.87%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19493",
        "abs_url": "https://arxiv.org/abs/2511.19493",
        "pdf_url": "https://arxiv.org/pdf/2511.19493",
        "title": "RFX: High-Performance Random Forests with GPU Acceleration and QLORA Compression",
        "authors": [
            "Chris Kuchar"
        ],
        "comments": "39 pages, 9 tables, 4 figures",
        "subjects": "Machine Learning (cs.LG); Methodology (stat.ME); Machine Learning (stat.ML)",
        "abstract": "RFX (Random Forests X), where X stands for compression or quantization, presents a production-ready implementation of Breiman and Cutler's Random Forest classification methodology in Python. RFX v1.0 provides complete classification: out-of-bag error estimation, overall and local importance measures, proximity matrices with QLORA compression, case-wise analysis, and interactive visualization (rfviz)--all with CPU and GPU acceleration. Regression, unsupervised learning, CLIQUE importance, and RF-GAP proximity are planned for v2.0. This work introduces four solutions addressing the proximity matrix memory bottleneck limiting Random Forest analysis to ~60,000 samples: (1) QLORA (Quantized Low-Rank Adaptation) compression for GPU proximity matrices, reducing memory from 80GB to 6.4MB for 100k samples (12,500x compression with INT8 quantization) while maintaining 99% geometric structure preservation, (2) CPU TriBlock proximity--combining upper-triangle storage with block-sparse thresholding--achieving 2.7x memory reduction with lossless quality, (3) SM-aware GPU batch sizing achieving 95% GPU utilization, and (4) GPU-accelerated 3D MDS visualization computing embeddings directly from low-rank factors using power iteration. Validation across four implementation modes (GPU/CPU x case-wise/non-case-wise) demonstrates correct implementation. GPU achieves 1.4x speedup over CPU for overall importance with 500+ trees. Proximity computation scales from 1,000 to 200,000+ samples (requiring GPU QLORA), with CPU TriBlock filling the gap for medium-scale datasets (10K-50K samples). RFX v1.0 eliminates the proximity memory bottleneck, enabling proximity-based Random Forest analysis on datasets orders of magnitude larger than previously feasible. Open-source production-ready classification following Breiman and Cutler's original methodology.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19496",
        "abs_url": "https://arxiv.org/abs/2511.19496",
        "pdf_url": "https://arxiv.org/pdf/2511.19496",
        "title": "Xmodel-2.5: 1.3B Data-Efficient Reasoning SLM",
        "authors": [
            "Yang Liu",
            "Xiaolong Zhong",
            "Ling Jiang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Large language models deliver strong reasoning and tool-use skills, yet their computational demands make them impractical for edge or cost-sensitive deployments. We present \\textbf{Xmodel-2.5}, a 1.3-billion-parameter small language model designed as a \\emph{drop-in agent core}. Training with maximal-update parameterization ($\\mu$P) allows hyper-parameters tuned on a 20M-parameter proxy to transfer directly to the full model, even under the parameter-tied \\emph{tie-word-embedding} architecture. A 1.4T-token Warmup--Stable--Decay curriculum is used, and we further show that \\textbf{switching from AdamW to Muon during the decay phase} improves the 13-task reasoning average by 4.58\\,\\% while keeping every other hyper-parameter fixed, verifying that early AdamW stability can be paired with late Muon sharpening for better downstream performance. FP8-mixed-precision training balances accuracy and throughput. All checkpoints, recipes, and evaluation code are released under the Apache-2.0 license.\\footnote{this https URL and this https URL (training checkpoints).} Training code and evaluation harness: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19498",
        "abs_url": "https://arxiv.org/abs/2511.19498",
        "pdf_url": "https://arxiv.org/pdf/2511.19498",
        "title": "Hierarchical Dual-Strategy Unlearning for Biomedical and Healthcare Intelligence Using Imperfect and Privacy-Sensitive Medical Data",
        "authors": [
            "Yi Zhang",
            "Tianxiang Xu",
            "Zijian Li",
            "Chao Zhang",
            "Kunyu Zhang",
            "Zhan Gao",
            "Meinuo Li",
            "Xiaohan Zhang",
            "Qichao Qi",
            "Bing Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Cryptography and Security (cs.CR)",
        "abstract": "Large language models (LLMs) exhibit exceptional performance but pose substantial privacy risks due to training data memorization, particularly within healthcare contexts involving imperfect or privacy-sensitive patient information. We present a hierarchical dual-strategy framework for selective knowledge unlearning that precisely removes specialized knowledge while preserving fundamental medical competencies. Our approach synergistically integrates geometric-constrained gradient updates to selectively modulate target parameters with concept-aware token-level interventions that distinguish between preservation-critical and unlearning-targeted tokens via a unified four-level medical concept hierarchy. Comprehensive evaluations on the MedMCQA (surgical) and MHQA (anxiety, depression, trauma) datasets demonstrate superior performance, achieving an 82.7% forgetting rate and 88.5% knowledge preservation. Notably, our framework maintains robust privacy guarantees while requiring modification of only 0.1% of parameters, addressing critical needs for regulatory compliance, auditability, and ethical standards in clinical research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19504",
        "abs_url": "https://arxiv.org/abs/2511.19504",
        "pdf_url": "https://arxiv.org/pdf/2511.19504",
        "title": "Position: The Complexity of Perfect AI Alignment -- Formalizing the RLHF Trilemma",
        "authors": [
            "Subramanyam Sahoo",
            "Aman Chadha",
            "Vinija Jain",
            "Divya Chaudhary"
        ],
        "comments": "Accepted at NeurIPS 2025 Workshop on Socially Responsible and Trustworthy Foundation Models (ResponsibleFM)",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Reinforcement Learning from Human Feedback (RLHF) is widely used for aligning large language models, yet practitioners face a persistent puzzle: improving safety often reduces fairness, scaling to diverse populations becomes computationally intractable, and making systems robust often amplifies majority biases. We formalize this tension as the Alignment Trilemma: no RLHF system can simultaneously achieve (i) epsilon-representativeness across diverse human values, (ii) polynomial tractability in sample and compute complexity, and (iii) delta-robustness against adversarial perturbations and distribution shift. Through a complexity-theoretic analysis integrating statistical learning theory and robust optimization, we prove that achieving both representativeness (epsilon <= 0.01) and robustness (delta <= 0.001) for global-scale populations requires Omega(2^{d_context}) operations, which is super-polynomial in the context dimensionality. We show that current RLHF implementations resolve this trilemma by sacrificing representativeness: they collect only 10^3--10^4 samples from homogeneous annotator pools while 10^7--10^8 samples are needed for true global representation. Our framework provides a unified explanation for documented RLHF pathologies including preference collapse, sycophancy, and systematic bias amplification. We conclude with concrete directions for navigating these fundamental trade-offs through strategic relaxations of alignment requirements.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19506",
        "abs_url": "https://arxiv.org/abs/2511.19506",
        "pdf_url": "https://arxiv.org/pdf/2511.19506",
        "title": "Profile Generators: A Link between the Narrative and the Binary Matrix Representation",
        "authors": [
            "Raoul H. Kutil",
            "Georg Zimmermann",
            "Barbara Strasser-Kirchweger",
            "Christian Borgelt"
        ],
        "comments": "31 pages, 8 figures, 4 tables",
        "subjects": "Machine Learning (cs.LG); Logic in Computer Science (cs.LO)",
        "abstract": "Mental health disorders, particularly cognitive disorders defined by deficits in cognitive abilities, are described in detail in the DSM-5, which includes definitions and examples of signs and symptoms. A simplified, machine-actionable representation was developed to assess the similarity and separability of these disorders, but it is not suited for the most complex cases. Generating or applying a full binary matrix for similarity calculations is infeasible due to the vast number of symptom combinations. This research develops an alternative representation that links the narrative form of the DSM-5 with the binary matrix representation and enables automated generation of valid symptom combinations. Using a strict pre-defined format of lists, sets, and numbers with slight variations, complex diagnostic pathways involving numerous symptom combinations can be represented. This format, called the symptom profile generator (or simply generator), provides a readable, adaptable, and comprehensive alternative to a binary matrix while enabling easy generation of symptom combinations (profiles). Cognitive disorders, which typically involve multiple diagnostic criteria with several symptoms, can thus be expressed as lists of generators. Representing several psychotic disorders in generator form and generating all symptom combinations showed that matrix representations of complex disorders become too large to manage. The MPCS (maximum pairwise cosine similarity) algorithm cannot handle matrices of this size, prompting the development of a profile reduction method using targeted generator manipulation to find specific MPCS values between disorders. The generators allow easier creation of binary representations for large matrices and make it possible to calculate specific MPCS cases between complex disorders through conditional generators.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19509",
        "abs_url": "https://arxiv.org/abs/2511.19509",
        "pdf_url": "https://arxiv.org/pdf/2511.19509",
        "title": "TouchFormer: A Robust Transformer-based Framework for Multimodal Material Perception",
        "authors": [
            "Kailin Lyu",
            "Long Xiao",
            "Jianing Zeng",
            "Junhao Dong",
            "Xuexin Liu",
            "Zhuojun Zou",
            "Haoyue Yang",
            "Lin Shu",
            "Jie Hao"
        ],
        "comments": "9 pages, 7 figures, Accepted by AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Traditional vision-based material perception methods often experience substantial performance degradation under visually impaired conditions, thereby motivating the shift toward non-visual multimodal material perception. Despite this, existing approaches frequently perform naive fusion of multimodal inputs, overlooking key challenges such as modality-specific noise, missing modalities common in real-world scenarios, and the dynamically varying importance of each modality depending on the task. These limitations lead to suboptimal performance across several benchmark tasks. In this paper, we propose a robust multimodal fusion framework, TouchFormer. Specifically, we employ a Modality-Adaptive Gating (MAG) mechanism and intra- and inter-modality attention mechanisms to adaptively integrate cross-modal features, enhancing model robustness. Additionally, we introduce a Cross-Instance Embedding Regularization(CER) strategy, which significantly improves classification accuracy in fine-grained subcategory material recognition tasks. Experimental results demonstrate that, compared to existing non-visual methods, the proposed TouchFormer framework achieves classification accuracy improvements of 2.48% and 6.83% on SSMC and USMC tasks, respectively. Furthermore, real-world robotic experiments validate TouchFormer's effectiveness in enabling robots to better perceive and interpret their environment, paving the way for its deployment in safety-critical applications such as emergency response and industrial automation. The code and datasets will be open-source, and the videos are available in the supplementary materials.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19513",
        "abs_url": "https://arxiv.org/abs/2511.19513",
        "pdf_url": "https://arxiv.org/pdf/2511.19513",
        "title": "Row-stochastic matrices can provably outperform doubly stochastic matrices in decentralized learning",
        "authors": [
            "Bing Liu",
            "Boao Kong",
            "Limin Lu",
            "Kun Yuan",
            "Chengcheng Zhao"
        ],
        "comments": "41 pages, 38 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Decentralized learning often involves a weighted global loss with heterogeneous node weights $\\lambda$. We revisit two natural strategies for incorporating these weights: (i) embedding them into the local losses to retain a uniform weight (and thus a doubly stochastic matrix), and (ii) keeping the original losses while employing a $\\lambda$-induced row-stochastic matrix. Although prior work shows that both strategies yield the same expected descent direction for the global loss, it remains unclear whether the Euclidean-space guarantees are tight and what fundamentally differentiates their behaviors. To clarify this, we develop a weighted Hilbert-space framework $L^2(\\lambda;\\mathbb{R}^d)$ and obtain convergence rates that are strictly tighter than those from Euclidean analysis. In this geometry, the row-stochastic matrix becomes self-adjoint whereas the doubly stochastic one does not, creating additional penalty terms that amplify consensus error, thereby slowing convergence. Consequently, the difference in convergence arises not only from spectral gaps but also from these penalty terms. We then derive sufficient conditions under which the row-stochastic design converges faster even with a smaller spectral gap. Finally, by using a Rayleigh-quotient and Loewner-order eigenvalue comparison, we further obtain topology conditions that guarantee this advantage and yield practical topology-design guidelines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19517",
        "abs_url": "https://arxiv.org/abs/2511.19517",
        "pdf_url": "https://arxiv.org/pdf/2511.19517",
        "title": "Automating Deception: Scalable Multi-Turn LLM Jailbreaks",
        "authors": [
            "Adarsh Kumarappan",
            "Ananya Mujoo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multi-turn conversational attacks, which leverage psychological principles like Foot-in-the-Door (FITD), where a small initial request paves the way for a more significant one, to bypass safety alignments, pose a persistent threat to Large Language Models (LLMs). Progress in defending against these attacks is hindered by a reliance on manual, hard-to-scale dataset creation. This paper introduces a novel, automated pipeline for generating large-scale, psychologically-grounded multi-turn jailbreak datasets. We systematically operationalize FITD techniques into reproducible templates, creating a benchmark of 1,500 scenarios across illegal activities and offensive content. We evaluate seven models from three major LLM families under both multi-turn (with history) and single-turn (without history) conditions. Our results reveal stark differences in contextual robustness: models in the GPT family demonstrate a significant vulnerability to conversational history, with Attack Success Rates (ASR) increasing by as much as 32 percentage points. In contrast, Google's Gemini 2.5 Flash exhibits exceptional resilience, proving nearly immune to these attacks, while Anthropic's Claude 3 Haiku shows strong but imperfect resistance. These findings highlight a critical divergence in how current safety architectures handle conversational context and underscore the need for defenses that can resist narrative-based manipulation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19544",
        "abs_url": "https://arxiv.org/abs/2511.19544",
        "pdf_url": "https://arxiv.org/pdf/2511.19544",
        "title": "Learning to Solve Weighted Maximum Satisfiability with a Co-Training Architecture",
        "authors": [
            "Kaidi Wan",
            "Minghao Liu",
            "Yong Lai"
        ],
        "comments": "10 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Wepropose SplitGNN, a graph neural network (GNN)-based approach that learns to solve weighted maximum satisfiabil ity (MaxSAT) problem. SplitGNN incorporates a co-training architecture consisting of supervised message passing mech anism and unsupervised solution boosting layer. A new graph representation called edge-splitting factor graph is proposed to provide more structural information for learning, which is based on spanning tree generation and edge classification. To improve the solutions on challenging and weighted instances, we implement a GPU-accelerated layer applying efficient score calculation and relaxation-based optimization. Exper iments show that SplitGNN achieves 3* faster convergence and better predictions compared with other GNN-based ar chitectures. More notably, SplitGNN successfully finds solu tions that outperform modern heuristic MaxSAT solvers on much larger and harder weighted MaxSAT benchmarks, and demonstrates exceptional generalization abilities on diverse structural instances.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19548",
        "abs_url": "https://arxiv.org/abs/2511.19548",
        "pdf_url": "https://arxiv.org/pdf/2511.19548",
        "title": "When Should Neural Data Inform Welfare? A Critical Framework for Policy Uses of Neuroeconomics",
        "authors": [
            "Yiven"
        ],
        "comments": "Durham Economic Journal 2025",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computers and Society (cs.CY); General Economics (econ.GN); Neurons and Cognition (q-bio.NC)",
        "abstract": "Neuroeconomics promises to ground welfare analysis in neural and computational evidence about how people value outcomes, learn from experience and exercise self-control. At the same time, policy and commercial actors increasingly invoke neural data to justify paternalistic regulation, \"brain-based\" interventions and new welfare measures. This paper asks under what conditions neural data can legitimately inform welfare judgements for policy rather than merely describing behaviour. I develop a non-empirical, model-based framework that links three levels: neural signals, computational decision models and normative welfare criteria. Within an actor-critic reinforcement-learning model, I formalise the inference path from neural activity to latent values and prediction errors and then to welfare claims. I show that neural evidence constrains welfare judgements only when the neural-computational mapping is well validated, the decision model identifies \"true\" interests versus context-dependent mistakes, and the welfare criterion is explicitly specified and defended. Applying the framework to addiction, neuromarketing and environmental policy, I derive a Neuroeconomic Welfare Inference Checklist for regulators and for designers of NeuroAI systems. The analysis treats brains and artificial agents as value-learning systems while showing that internal reward signals, whether biological or artificial, are computational quantities and cannot be treated as welfare measures without an explicit normative model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19561",
        "abs_url": "https://arxiv.org/abs/2511.19561",
        "pdf_url": "https://arxiv.org/pdf/2511.19561",
        "title": "Merging without Forgetting: Continual Fusion of Task-Specific Models via Optimal Transport",
        "authors": [
            "Zecheng Pan",
            "Zhikang Chen",
            "Ding Li",
            "Min Zhang",
            "Sen Cui",
            "Hongshuo Jin",
            "Luqi Tao",
            "Yi Yang",
            "Deheng Ye",
            "Yu Zhang",
            "Tingting Zhu",
            "Tianling Ren"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "Merging models fine-tuned for different tasks into a single unified model has become an increasingly important direction for building versatile, efficient multi-task systems. Existing approaches predominantly rely on parameter interpolation in weight space, which we show introduces significant distribution shift in the feature space and undermines task-specific knowledge. In this paper, we propose OTMF (Optimal Transport-based Masked Fusion), a novel model merging framework rooted in optimal transport theory to address the distribution shift that arises from naive parameter interpolation. Instead of directly aggregating features or weights, OTMF aligns the semantic geometry of task-specific models by discovering common masks applied to task vectors through optimal transport plans. These masks selectively extract transferable and task-agnostic components while preserving the unique structural identities of each task. To ensure scalability in real-world settings, OTMF further supports a continual fusion paradigm that incrementally integrates each new task vector without revisiting previous ones, maintaining a bounded memory footprint and enabling efficient fusion across a growing number of tasks. We conduct comprehensive experiments on multiple vision and language benchmarks, and results show that OTMF achieves state-of-the-art performance in terms of both accuracy and efficiency. These findings highlight the practical and theoretical value of our approach to model merging.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19566",
        "abs_url": "https://arxiv.org/abs/2511.19566",
        "pdf_url": "https://arxiv.org/pdf/2511.19566",
        "title": "ModHiFi: Identifying High Fidelity predictive components for Model Modification",
        "authors": [
            "Dhruva Kashyap",
            "Chaitanya Murti",
            "Pranav K Nayak",
            "Tanay Narshana",
            "Chiranjib Bhattacharyya"
        ],
        "comments": "NeurIPS 2025 (Spotlight). Our code is available at this https URL",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Open weight models, which are ubiquitous, rarely provide access to their training data or loss function. This makes modifying such models for tasks such as pruning or unlearning constrained by this unavailability an active area of research. Existing techniques typically require gradients or ground-truth labels, rendering them infeasible in settings with limited computational resources. In this work, we investigate the fundamental question of identifying components that are critical to the model's predictive performance, without access to either gradients or the loss function, and with only distributional access such as synthetic data. We theoretically demonstrate that the global reconstruction error is linearly bounded by local reconstruction errors for Lipschitz-continuous networks such as CNNs and well-trained Transformers (which, contrary to existing literature, we find exhibit Lipschitz continuity). This motivates using the locally reconstructive behavior of component subsets to quantify their global importance, via a metric that we term Subset Fidelity. In the uncorrelated features setting, selecting individual components via their Subset Fidelity scores is optimal, which we use to propose ModHiFi, an algorithm for model modification that requires no training data or loss function access. ModHiFi-P, for structured pruning, achieves an 11% speedup over the current state of the art on ImageNet models and competitive performance on language models. ModHiFi-U, for classwise unlearning, achieves complete unlearning on CIFAR-10 without fine-tuning and demonstrates competitive performance on Swin Transformers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19569",
        "abs_url": "https://arxiv.org/abs/2511.19569",
        "pdf_url": "https://arxiv.org/pdf/2511.19569",
        "title": "An Invariant Latent Space Perspective on Language Model Inversion",
        "authors": [
            "Wentao Ye",
            "Jiaqi Hu",
            "Haobo Wang",
            "Xinpeng Ti",
            "Zhiqing Xiao",
            "Hao Chen",
            "Liyao Li",
            "Lei Feng",
            "Sai Wu",
            "Junbo Zhao"
        ],
        "comments": "The Fortieth AAAI Conference on Artificial Intelligence (AAAI-26)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Language model inversion (LMI), i.e., recovering hidden prompts from outputs, emerges as a concrete threat to user privacy and system security. We recast LMI as reusing the LLM's own latent space and propose the Invariant Latent Space Hypothesis (ILSH): (1) diverse outputs from the same source prompt should preserve consistent semantics (source invariance), and (2) input<->output cyclic mappings should be self-consistent within a shared latent space (cyclic invariance). Accordingly, we present Inv^2A, which treats the LLM as an invariant decoder and learns only a lightweight inverse encoder that maps outputs to a denoised pseudo-representation. When multiple outputs are available, they are sparsely concatenated at the representation layer to increase information density. Training proceeds in two stages: contrastive alignment (source invariance) and supervised reinforcement (cyclic invariance). An optional training-free neighborhood search can refine local performance. Across 9 datasets covering user and system prompt scenarios, Inv^2A outperforms baselines by an average of 4.77% BLEU score while reducing dependence on large inverse corpora. Our analysis further shows that prevalent defenses provide limited protection, underscoring the need for stronger strategies. The source code and data involved in this paper can be found in this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19573",
        "abs_url": "https://arxiv.org/abs/2511.19573",
        "pdf_url": "https://arxiv.org/pdf/2511.19573",
        "title": "Neural Tractability via Structure: Learning-Augmented Algorithms for Graph Combinatorial Optimization",
        "authors": [
            "Jialiang Li",
            "Weitong Chen",
            "Mingyu Guo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Neural models have shown promise in solving NP-hard graph combinatorial optimization (CO) problems. Once trained, they offer fast inference and reasonably high-quality solutions for in-distribution testing instances, but they generally fall short in terms of absolute solution quality compared to classical search-based algorithms that are admittedly slower but offer optimality guarantee once search finishes. We propose a novel framework that combines the inference efficiency and exploratory power of neural models with the solution quality guarantee of search-based algorithms. In particular, we use parameterized algorithms (PAs) as the search component. PAs are dedicated to identifying easy instances of generally NP-hard problems, and allow for practically efficient search by exploiting structural simplicity (of the identified easy instances). Under our framework, we use parameterized analysis to identify the structurally hard parts of a CO instance. The neural model handles the hard parts by generating advisory signals based on its data-driven understanding. The PA-based search component then integrates the advisory signals to systematically and efficiently searches through the remaining structurally easy parts. Notably, our framework is agnostic to the choice of neural model and produces strictly better solutions than neural solvers alone. We examine our framework on multiple CO tasks. Empirical results show that it achieves superior solution quality, competitive with that of commercial solvers. Furthermore, by using the neural model only for exploratory advisory signals, our framework exhibits improved out-of-distribution generalization, addressing a key limitation of existing neural CO solvers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19636",
        "abs_url": "https://arxiv.org/abs/2511.19636",
        "pdf_url": "https://arxiv.org/pdf/2511.19636",
        "title": "Many Ways to be Right: Rashomon Sets for Concept-Based Neural Networks",
        "authors": [
            "Shihan Feng",
            "Cheng Zhang",
            "Michael Xi",
            "Ethan Hsu",
            "Lesia Semenova",
            "Chudi Zhong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Modern neural networks rarely have a single way to be right. For many tasks, multiple models can achieve identical performance while relying on different features or reasoning patterns, a property known as the Rashomon Effect. However, uncovering this diversity in deep architectures is challenging as their continuous parameter spaces contain countless near-optimal solutions that are numerically distinct but often behaviorally similar. We introduce Rashomon Concept Bottleneck Models, a framework that learns multiple neural networks which are all accurate yet reason through distinct human-understandable concepts. By combining lightweight adapter modules with a diversity-regularized training objective, our method constructs a diverse set of deep concept-based models efficiently without retraining from scratch. The resulting networks provide fundamentally different reasoning processes for the same predictions, revealing how concept reliance and decision making vary across equally performing solutions. Our framework enables systematic exploration of data-driven reasoning diversity in deep models, offering a new mechanism for auditing, comparison, and alignment across equally accurate solutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19656",
        "abs_url": "https://arxiv.org/abs/2511.19656",
        "pdf_url": "https://arxiv.org/pdf/2511.19656",
        "title": "Lower Complexity Bounds for Nonconvex-Strongly-Convex Bilevel Optimization with First-Order Oracles",
        "authors": [
            "Kaiyi Ji"
        ],
        "comments": "24 pages, 1 figure",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "Although upper bound guarantees for bilevel optimization have been widely studied, progress on lower bounds has been limited due to the complexity of the bilevel structure. In this work, we focus on the smooth nonconvex-strongly-convex setting and develop new hard instances that yield nontrivial lower bounds under deterministic and stochastic first-order oracle models. In the deterministic case, we prove that any first-order zero-respecting algorithm requires at least $\\Omega(\\kappa^{3/2}\\epsilon^{-2})$ oracle calls to find an $\\epsilon$-accurate stationary point, improving the optimal lower bounds known for single-level nonconvex optimization and for nonconvex-strongly-convex min-max problems. In the stochastic case, we show that at least $\\Omega(\\kappa^{5/2}\\epsilon^{-4})$ stochastic oracle calls are necessary, again strengthening the best known bounds in related settings. Our results expose substantial gaps between current upper and lower bounds for bilevel optimization and suggest that even simplified regimes, such as those with quadratic lower-level objectives, warrant further investigation toward understanding the optimal complexity of bilevel optimization under standard first-order oracles.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19657",
        "abs_url": "https://arxiv.org/abs/2511.19657",
        "pdf_url": "https://arxiv.org/pdf/2511.19657",
        "title": "Structured Noise Modeling for Enhanced Time-Series Forecasting",
        "authors": [
            "Sepideh Koohfar"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time-series forecasting remains difficult in real-world settings because temporal patterns operate at multiple scales, from broad contextual trends to fast, fine-grained fluctuations that drive critical decisions. Existing neural models often struggle to represent these interacting dynamics, leading to unstable predictions and reduced reliability in downstream applications. This work introduces a forecast-blur-denoise framework that improves temporal fidelity through structured noise modeling. The approach incorporates a learnable Gaussian Process module that generates smooth, correlated perturbations, encouraging the forecasting backbone to capture long-range structure while a dedicated refinement model restores high-resolution temporal detail. Training the components jointly enables natural competence division and avoids the artifacts commonly produced by isotropic corruption methods. Experiments across electricity, traffic, and solar datasets show consistent gains in multi-horizon accuracy and stability. The modular design also allows the blur-denoise layer to operate as a lightweight enhancement for pretrained models, supporting efficient adaptation in limited-data scenarios. By strengthening the reliability and interpretability of fine-scale temporal predictions, this framework contributes to more trustworthy AI systems used in forecasting-driven decision support across energy, infrastructure, and other time-critical domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19664",
        "abs_url": "https://arxiv.org/abs/2511.19664",
        "pdf_url": "https://arxiv.org/pdf/2511.19664",
        "title": "Demystifying Diffusion Objectives: Reweighted Losses are Better Variational Bounds",
        "authors": [
            "Jiaxin Shi",
            "Michalis K. Titsias"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We derive a new theoretical interpretation of the reweighted losses that are widely used for training diffusion models. Our method is based on constructing a cascade of time-dependent variational lower bounds on the data log-likelihood, that provably improves upon the standard evidence lower bound and results in reduced data-model KL-divergences. Combining such bounds gives rise to reweighted objectives that can be applied to any generative diffusion model including both continuous Gaussian diffusion and masked (discrete) diffusion models. Then, we showcase this framework in masked diffusion and report significant improvements over previous training losses in pixel-space image modeling, approaching sample quality comparable to continuous diffusion models. Our results also provide a theoretical justification for the simple weighting scheme widely used in masked image models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19693",
        "abs_url": "https://arxiv.org/abs/2511.19693",
        "pdf_url": "https://arxiv.org/pdf/2511.19693",
        "title": "TREASURE: A Transformer-Based Foundation Model for High-Volume Transaction Understanding",
        "authors": [
            "Chin-Chia Michael Yeh",
            "Uday Singh Saini",
            "Xin Dai",
            "Xiran Fan",
            "Shubham Jain",
            "Yujie Fan",
            "Jiarui Sun",
            "Junpeng Wang",
            "Menghai Pan",
            "Yingtong Dou",
            "Yuzhong Chen",
            "Vineeth Rakesh",
            "Liang Wang",
            "Yan Zheng",
            "Mahashweta Das"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Payment networks form the backbone of modern commerce, generating high volumes of transaction records from daily activities. Properly modeling this data can enable applications such as abnormal behavior detection and consumer-level insights for hyper-personalized experiences, ultimately improving people's lives. In this paper, we present TREASURE, TRansformer Engine As Scalable Universal transaction Representation Encoder, a multipurpose transformer-based foundation model specifically designed for transaction data. The model simultaneously captures both consumer behavior and payment network signals (such as response codes and system flags), providing comprehensive information necessary for applications like accurate recommendation systems and abnormal behavior detection. Verified with industry-grade datasets, TREASURE features three key capabilities: 1) an input module with dedicated sub-modules for static and dynamic attributes, enabling more efficient training and inference; 2) an efficient and effective training paradigm for predicting high-cardinality categorical attributes; and 3) demonstrated effectiveness as both a standalone model that increases abnormal behavior detection performance by 111% over production systems and an embedding provider that enhances recommendation models by 104%. We present key insights from extensive ablation studies, benchmarks against production models, and case studies, highlighting valuable knowledge gained from developing TREASURE.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19705",
        "abs_url": "https://arxiv.org/abs/2511.19705",
        "pdf_url": "https://arxiv.org/pdf/2511.19705",
        "title": "CafeQ: Calibration-free Quantization via Learned Transformations and Adaptive Rounding",
        "authors": [
            "Ziteng Sun",
            "Adrian Benton",
            "Samuel Kushnir",
            "Asher Trockman",
            "Vikas Singh",
            "Suhas Diggavi",
            "Ananda Theertha Suresh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Post-training quantization is an effective method for reducing the serving cost of large language models, where the standard approach is to use a round-to-nearest quantization level scheme. However, this often introduces large errors due to outliers in the weights. Proposed mitigation mechanisms include applying adaptive rounding, random rotation transformations or committing to a post-training target using calibration data. Unfortunately, this reliance on calibration data can be severely limiting in some real-world scenarios as such data may be unavailable or subject to privacy regulations. In this paper, we propose algorithms to optimize transformations and adaptive rounding without access to any calibration data. The optimization is achieved by designing a suitable proxy function for the quantization loss without calibration data. To maintain inference efficiency, we perform structured matrix transformations for single matrices. For paired weights that interact directly in the computation graph, we use dual matrix transformations and adaptive rounding methods. We conduct experiments on Gemma 2 models, and observe consistent improvement over the baselines. For Gemma 2 9B quantization, our method improves the average benchmark score from 61.9 to 62.4 for 4-bit quantization and from 52.0 to 60.6 for 3-bit quantization, while adding less than 3% of computation overhead. Furthermore, our method achieves performance comparable to the commonly used GPTQ method, which requires calibration data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19730",
        "abs_url": "https://arxiv.org/abs/2511.19730",
        "pdf_url": "https://arxiv.org/pdf/2511.19730",
        "title": "Training-Free Active Learning Framework in Materials Science with Large Language Models",
        "authors": [
            "Hongchen Wang",
            "Rafael Espinosa Castaeda",
            "Jay R. Werber",
            "Yao Fehlis",
            "Edward Kim",
            "Jason Hattrick-Simpers"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Active learning (AL) accelerates scientific discovery by prioritizing the most informative experiments, but traditional machine learning (ML) models used in AL suffer from cold-start limitations and domain-specific feature engineering, restricting their generalizability. Large language models (LLMs) offer a new paradigm by leveraging their pretrained knowledge and universal token-based representations to propose experiments directly from text-based descriptions. Here, we introduce an LLM-based active learning framework (LLM-AL) that operates in an iterative few-shot setting and benchmark it against conventional ML models across four diverse materials science datasets. We explored two prompting strategies: one using concise numerical inputs suited for datasets with more compositional and structured features, and another using expanded descriptive text suited for datasets with more experimental and procedural features to provide additional context. Across all datasets, LLM-AL could reduce the number of experiments needed to reach top-performing candidates by over 70% and consistently outperformed traditional ML models. We found that LLM-AL performs broader and more exploratory searches while still reaching the optima with fewer iterations. We further examined the stability boundaries of LLM-AL given the inherent non-determinism of LLMs and found its performance to be broadly consistent across runs, within the variability range typically observed for traditional ML approaches. These results demonstrate that LLM-AL can serve as a generalizable alternative to conventional AL pipelines for more efficient and interpretable experiment selection and potential LLM-driven autonomous discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19750",
        "abs_url": "https://arxiv.org/abs/2511.19750",
        "pdf_url": "https://arxiv.org/pdf/2511.19750",
        "title": "DISCO: A Browser-Based Privacy-Preserving Framework for Distributed Collaborative Learning",
        "authors": [
            "Julien T. T. Vignoud",
            "Valrian Rousset",
            "Hugo El Guedj",
            "Ignacio Aleman",
            "Walid Bennaceur",
            "Batuhan Faik Derinbay",
            "Eduard urech",
            "Damien Gengler",
            "Lucas Giordano",
            "Felix Grimberg",
            "Franziska Lippoldt",
            "Christina Kopidaki",
            "Jiafan Liu",
            "Lauris Lopata",
            "Nathan Maire",
            "Paul Mansat",
            "Martin Milenkoski",
            "Emmanuel Omont",
            "Gne zgn",
            "Mina Petrovi",
            "Francesco Posa",
            "Morgan Ridel",
            "Giorgio Savini",
            "Marcel Torne",
            "Lucas Trognon",
            "Alyssa Unell",
            "Olena Zavertiaieva",
            "Sai Praneeth Karimireddy",
            "Tahseen Rabbani",
            "Mary-Anne Hartley",
            "Martin Jaggi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Data is often impractical to share for a range of well considered reasons, such as concerns over privacy, intellectual property, and legal constraints. This not only fragments the statistical power of predictive models, but creates an accessibility bias, where accuracy becomes inequitably distributed to those who have the resources to overcome these concerns. We present DISCO: an open-source DIStributed COllaborative learning platform accessible to non-technical users, offering a means to collaboratively build machine learning models without sharing any original data or requiring any programming knowledge. DISCO's web application trains models locally directly in the browser, making our tool cross-platform out-of-the-box, including smartphones. The modular design of \\disco offers choices between federated and decentralized paradigms, various levels of privacy guarantees and several approaches to weight aggregation strategies that allow for model personalization and bias resilience in the collaborative training. Code repository is available at this https URL and a showcase web interface at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19794",
        "abs_url": "https://arxiv.org/abs/2511.19794",
        "pdf_url": "https://arxiv.org/pdf/2511.19794",
        "title": "When +1% Is Not Enough: A Paired Bootstrap Protocol for Evaluating Small Improvements",
        "authors": [
            "Wenzhang Du"
        ],
        "comments": "13 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Recent machine learning papers often report 1-2 percentage point improvements from a single run on a benchmark. These gains are highly sensitive to random seeds, data ordering, and implementation details, yet are rarely accompanied by uncertainty estimates or significance tests. It is therefore unclear when a reported +1-2% reflects a real algorithmic advance versus noise. We revisit this problem under realistic compute budgets, where only a few runs are affordable. We propose a simple, PC-friendly evaluation protocol based on paired multi-seed runs, bias-corrected and accelerated (BCa) bootstrap confidence intervals, and a sign-flip permutation test on per-seed deltas. The protocol is intentionally conservative and is meant as a guardrail against over-claiming. We instantiate it on CIFAR-10, CIFAR-10N, and AG News using synthetic no-improvement, small-gain, and medium-gain scenarios. Single runs and unpaired t-tests often suggest significant gains for 0.6-2.0 point improvements, especially on text. With only three seeds, our paired protocol never declares significance in these settings. We argue that such conservative evaluation is a safer default for small gains under tight budgets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19803",
        "abs_url": "https://arxiv.org/abs/2511.19803",
        "pdf_url": "https://arxiv.org/pdf/2511.19803",
        "title": "Scalable Data Attribution via Forward-Only Test-Time Inference",
        "authors": [
            "Sibo Ma",
            "Julian Nyarko"
        ],
        "comments": "8 pages. Work in progress",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Data attribution seeks to trace model behavior back to the training examples that shaped it, enabling debugging, auditing, and data valuation at scale. Classical influence-function methods offer a principled foundation but remain impractical for modern networks because they require expensive backpropagation or Hessian inversion at inference. We propose a data attribution method that preserves the same first-order counterfactual target while eliminating per-query backward passes. Our approach simulates each training example's parameter influence through short-horizon gradient propagation during training and later reads out attributions for any query using only forward evaluations. This design shifts computation from inference to simulation, reflecting real deployment regimes where a model may serve billions of user queries but originate from a fixed, finite set of data sources (for example, a large language model trained on diverse corpora while compensating a specific publisher such as the New York Times). Empirically, on standard MLP benchmarks, our estimator matches or surpasses state-of-the-art baselines such as TRAK on standard attribution metrics (LOO and LDS) while offering orders-of-magnitude lower inference cost. By combining influence-function fidelity with first-order scalability, our method provides a theoretical framework for practical, real-time data attribution in large pretrained models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19808",
        "abs_url": "https://arxiv.org/abs/2511.19808",
        "pdf_url": "https://arxiv.org/pdf/2511.19808",
        "title": "Learning to Clean: Reinforcement Learning for Noisy Label Correction",
        "authors": [
            "Marzi Heidari",
            "Hanping Zhang",
            "Yuhong Guo"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "The challenge of learning with noisy labels is significant in machine learning, as it can severely degrade the performance of prediction models if not addressed properly. This paper introduces a novel framework that conceptualizes noisy label correction as a reinforcement learning (RL) problem. The proposed approach, Reinforcement Learning for Noisy Label Correction (RLNLC), defines a comprehensive state space representing data and their associated labels, an action space that indicates possible label corrections, and a reward mechanism that evaluates the efficacy of label corrections. RLNLC learns a deep feature representation based policy network to perform label correction through reinforcement learning, utilizing an actor-critic method. The learned policy is subsequently deployed to iteratively correct noisy training labels and facilitate the training of the prediction model. The effectiveness of RLNLC is demonstrated through extensive experiments on multiple benchmark datasets, where it consistently outperforms existing state-of-the-art techniques for learning with noisy labels.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19810",
        "abs_url": "https://arxiv.org/abs/2511.19810",
        "pdf_url": "https://arxiv.org/pdf/2511.19810",
        "title": "Provably Outlier-resistant Semi-parametric Regression for Transferable Calibration of Low-cost Air-quality Sensors",
        "authors": [
            "Divyansh Chaurasia",
            "Manoj Daram",
            "Roshan Kumar",
            "Nihal Thukarama Rao",
            "Vipul Sangode",
            "Pranjal Srivastava",
            "Avnish Tripathi",
            "Shoubhik Chakraborty",
            "Akanksha",
            "Ambasht Kumar",
            "Davender Sethi",
            "Sachchida Nand Tripathi",
            "Purushottam Kar"
        ],
        "comments": "20 pages, 14 figures, under peer review",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We present a case study for the calibration of Low-cost air-quality (LCAQ) CO sensors from one of the largest multi-site-multi-season-multi-sensor-multi-pollutant mobile air-quality monitoring network deployments in India. LCAQ sensors have been shown to play a critical role in the establishment of dense, expansive air-quality monitoring networks and combating elevated pollution levels. The calibration of LCAQ sensors against regulatory-grade monitors is an expensive, laborious and time-consuming process, especially when a large number of sensors are to be deployed in a geographically diverse layout. In this work, we present the RESPIRE technique to calibrate LCAQ sensors to detect ambient CO (Carbon Monoxide) levels. RESPIRE offers specific advantages over baseline calibration methods popular in literature, such as improved prediction in cross-site, cross-season, and cross-sensor settings. RESPIRE offers a training algorithm that is provably resistant to outliers and an explainable model with the ability to flag instances of model overfitting. Empirical results are presented based on data collected during an extensive deployment spanning four sites, two seasons and six sensor packages. RESPIRE code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19822",
        "abs_url": "https://arxiv.org/abs/2511.19822",
        "pdf_url": "https://arxiv.org/pdf/2511.19822",
        "title": "Mosaic Pruning: A Hierarchical Framework for Generalizable Pruning of Mixture-of-Experts Models",
        "authors": [
            "Wentao Hu",
            "Mingkuan Zhao",
            "Shuangyong Song",
            "Xiaoyan Zhu",
            "Xin Lai",
            "Jiayin Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Sparse Mixture-of-Experts (SMoE) architectures have enabled a new frontier in scaling Large Language Models (LLMs), offering superior performance by activating only a fraction of their total parameters during inference. However, their practical deployment is severely hampered by substantial static memory overhead, as all experts must be loaded into memory. Existing post-training pruning methods, while reducing model size, often derive their pruning criteria from a single, general-purpose corpus. This leads to a critical limitation: a catastrophic performance degradation when the pruned model is applied to other domains, necessitating a costly re-pruning for each new domain. To address this generalization gap, we introduce Mosaic Pruning (MoP). The core idea of MoP is to construct a functionally comprehensive set of experts through a structured ``cluster-then-select\" process. This process leverages a similarity metric that captures expert performance across different task domains to functionally cluster the experts, and subsequently selects the most representative expert from each cluster based on our proposed Activation Variability Score. Unlike methods that optimize for a single corpus, our proposed Mosaic Pruning ensures that the pruned model retains a functionally complementary set of experts, much like the tiles of a mosaic that together form a complete picture of the original model's capabilities, enabling it to handle diverse downstream this http URL experiments on various MoE models demonstrate the superiority of our approach. MoP significantly outperforms prior work, achieving a 7.24\\% gain on general tasks and 8.92\\% on specialized tasks like math reasoning and code generation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19837",
        "abs_url": "https://arxiv.org/abs/2511.19837",
        "pdf_url": "https://arxiv.org/pdf/2511.19837",
        "title": "GED-Consistent Disentanglement of Aligned and Unaligned Substructures for Graph Similarity Learning",
        "authors": [
            "Zhentao Zhan",
            "Xiaoliang Xu",
            "Jingjing Wang",
            "Junmei Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Databases (cs.DB)",
        "abstract": "Graph Similarity Computation (GSC) is a fundamental graph related task where Graph Edit Distance (GED) serves as a prevalent metric. GED is determined by an optimal alignment between a pair of graphs that partitions each into aligned (zero-cost) and unaligned (cost-incurring) substructures. Due to NP-hard nature of exact GED computation, GED approximations based on Graph Neural Network(GNN) have emerged. Existing GNN-based GED approaches typically learn node embeddings for each graph and then aggregate pairwise node similarities to estimate the final similarity. Despite their effectiveness, we identify a mismatch between this prevalent node-centric matching paradigm and the core principles of GED. This discrepancy leads to two critical limitations: (1) a failure to capture the global structural correspondence for optimal alignment, and (2) a misattribution of edit costs driven by spurious node level signals. To address these limitations, we propose GCGSim, a GED-consistent graph similarity learning framework centering on graph-level matching and substructure-level edit costs. Specifically, we make three core technical contributions. Extensive experiments on four benchmark datasets show that GCGSim achieves state-of-the-art performance. Our comprehensive analyses further validate that the framework effectively learns disentangled and semantically meaningful substructure representations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19845",
        "abs_url": "https://arxiv.org/abs/2511.19845",
        "pdf_url": "https://arxiv.org/pdf/2511.19845",
        "title": "SX-GeoTree: Self-eXplaining Geospatial Regression Tree Incorporating the Spatial Similarity of Feature Attributions",
        "authors": [
            "Chaogui Kang",
            "Lijian Luo",
            "Qingfeng Guan",
            "Yu Liu"
        ],
        "comments": "41 pages, 7 figures, 12 tables",
        "subjects": "Machine Learning (cs.LG); Computers and Society (cs.CY); Machine Learning (stat.ML)",
        "abstract": "Decision trees remain central for tabular prediction but struggle with (i) capturing spatial dependence and (ii) producing locally stable (robust) explanations. We present SX-GeoTree, a self-explaining geospatial regression tree that integrates three coupled objectives during recursive splitting: impurity reduction (MSE), spatial residual control (global Moran's I), and explanation robustness via modularity maximization on a consensus similarity network formed from (a) geographically weighted regression (GWR) coefficient distances (stimulus-response similarity) and (b) SHAP attribution distances (explanatory similarity). We recast local Lipschitz continuity of feature attributions as a network community preservation problem, enabling scalable enforcement of spatially coherent explanations without per-sample neighborhood searches. Experiments on two exemplar tasks (county-level GDP in Fujian, n=83; point-wise housing prices in Seattle, n=21,613) show SX-GeoTree maintains competitive predictive accuracy (within 0.01 $R^{2}$ of decision trees) while improving residual spatial evenness and doubling attribution consensus (modularity: Fujian 0.19 vs 0.09; Seattle 0.10 vs 0.05). Ablation confirms Moran's I and modularity terms are complementary; removing either degrades both spatial residual structure and explanation stability. The framework demonstrates how spatial similarity - extended beyond geometric proximity through GWR-derived local relationships - can be embedded in interpretable models, advancing trustworthy geospatial machine learning and offering a transferable template for domain-aware explainability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19851",
        "abs_url": "https://arxiv.org/abs/2511.19851",
        "pdf_url": "https://arxiv.org/pdf/2511.19851",
        "title": "Accelerating Wireless Distributed Learning via Hybrid Split and Federated Learning Optimization",
        "authors": [
            "Kun Guo",
            "Xuefei Li",
            "Xijun Wang",
            "Howard H. Yang",
            "Wei Feng",
            "Tony Q. S. Quek"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Federated learning (FL) and split learning (SL) are two effective distributed learning paradigms in wireless networks, enabling collaborative model training across mobile devices without sharing raw data. While FL supports low-latency parallel training, it may converge to less accurate model. In contrast, SL achieves higher accuracy through sequential training but suffers from increased delay. To leverage the advantages of both, hybrid split and federated learning (HSFL) allows some devices to operate in FL mode and others in SL mode. This paper aims to accelerate HSFL by addressing three key questions: 1) How does learning mode selection affect overall learning performance? 2) How does it interact with batch size? 3) How can these hyperparameters be jointly optimized alongside communication and computational resources to reduce overall learning delay? We first analyze convergence, revealing the interplay between learning mode and batch size. Next, we formulate a delay minimization problem and propose a two-stage solution: a block coordinate descent method for a relaxed problem to obtain a locally optimal solution, followed by a rounding algorithm to recover integer batch sizes with near-optimal performance. Experimental results demonstrate that our approach significantly accelerates convergence to the target accuracy compared to existing methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19893",
        "abs_url": "https://arxiv.org/abs/2511.19893",
        "pdf_url": "https://arxiv.org/pdf/2511.19893",
        "title": "Frailty-Aware Transformer for Recurrent Survival Modeling of Driver Retention in Ride-Hailing Platforms",
        "authors": [
            "Shuoyan Xu",
            "Yu Zhang",
            "Eric J. Miller"
        ],
        "comments": "13 pages, 6 figures, under review, Accepted by KDD Workshop 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Ride-hailing platforms are characterized by high-frequency, behavior-driven environments. Although survival analysis has been applied to recurrent events in other domains, its use in modeling ride-hailing driver behavior remains largely unexplored. This study formulates idle behavior as a recurrent survival process using large-scale platform data and proposes a Transformer-based framework that captures long-term temporal dependencies with causal masking and incorporates driver-specific embeddings to model latent heterogeneity. Results on Toronto ride-hailing data demonstrate that the proposed Frailty-Aware Cox Transformer (FACT) achieves the highest time-dependent C-indices and lowest Brier Scores, outperforming classical and deep learning survival models. This approach enables more accurate risk estimation, supports platform retention strategies, and provides policy-relevant insights.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19935",
        "abs_url": "https://arxiv.org/abs/2511.19935",
        "pdf_url": "https://arxiv.org/pdf/2511.19935",
        "title": "EfficientXpert: Efficient Domain Adaptation for Large Language Models via Propagation-Aware Pruning",
        "authors": [
            "Songlin Zhao",
            "Michael Pitts",
            "Zhuwei Qin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "The rapid advancement of large language models (LLMs) has increased the demand for domain-specialized variants in areas such as law, healthcare, and finance. However, their large size remains a barrier to deployment in resource-constrained environments, and existing compression methods either generalize poorly across domains or incur high overhead. In this work, we propose \\textbf{EfficientXpert}, a lightweight domain-pruning framework that combines a propagation-aware pruning criterion (Foresight Mask) with an efficient adapter-update algorithm (Partial Brain Surgeon). Integrated into the LoRA fine-tuning process, EfficientXpert enables a one-step transformation of general pretrained models into sparse, domain-adapted experts. Across health and legal tasks, it retains up to 98% of dense-model performance at 40% sparsity, outperforming state-of-the-art methods. Further analysis reveals substantial domain-dependent structural shifts that degrade the effectiveness of general pruning masks, underscoring the need for adaptive, domain-aware pruning strategies tailored to each domain.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19937",
        "abs_url": "https://arxiv.org/abs/2511.19937",
        "pdf_url": "https://arxiv.org/pdf/2511.19937",
        "title": "Adaptivity and Universality: Problem-dependent Universal Regret for Online Convex Optimization",
        "authors": [
            "Peng Zhao",
            "Yu-Hu Yan",
            "Hang Yu",
            "Zhi-Hua Zhou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "Universal online learning aims to achieve optimal regret guarantees without requiring prior knowledge of the curvature of online functions. Existing methods have established minimax-optimal regret bounds for universal online learning, where a single algorithm can simultaneously attain $\\mathcal{O}(\\sqrt{T})$ regret for convex functions, $\\mathcal{O}(d \\log T)$ for exp-concave functions, and $\\mathcal{O}(\\log T)$ for strongly convex functions, where $T$ is the number of rounds and $d$ is the dimension of the feasible domain. However, these methods still lack problem-dependent adaptivity. In particular, no universal method provides regret bounds that scale with the gradient variation $V_T$, a key quantity that plays a crucial role in applications such as stochastic optimization and fast-rate convergence in games. In this work, we introduce UniGrad, a novel approach that achieves both universality and adaptivity, with two distinct realizations: this http URL and this http URL. Both methods achieve universal regret guarantees that adapt to gradient variation, simultaneously attaining $\\mathcal{O}(\\log V_T)$ regret for strongly convex functions and $\\mathcal{O}(d \\log V_T)$ regret for exp-concave functions. For convex functions, the regret bounds differ: this http URL achieves an $\\mathcal{O}(\\sqrt{V_T \\log V_T})$ bound while preserving the RVU property that is crucial for fast convergence in online games, whereas this http URL achieves the optimal $\\mathcal{O}(\\sqrt{V_T})$ regret bound through a novel design. Both methods employ a meta algorithm with $\\mathcal{O}(\\log T)$ base learners, which naturally requires $\\mathcal{O}(\\log T)$ gradient queries per round. To enhance computational efficiency, we introduce UniGrad++, which retains the regret while reducing the gradient query to just $1$ per round via surrogate optimization. We further provide various implications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19942",
        "abs_url": "https://arxiv.org/abs/2511.19942",
        "pdf_url": "https://arxiv.org/pdf/2511.19942",
        "title": "Differential Smoothing Mitigates Sharpening and Improves LLM Reasoning",
        "authors": [
            "Jingchu Gai",
            "Guanning Zeng",
            "Huaqing Zhang",
            "Aditi Raghunathan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "It is widely recognized that reinforcement learning (RL) fine-tuning of large language models often leads to \\textit{diversity collapse}, where outputs lack variety. Prior work has proposed a range of heuristics to counteract this effect, but these methods are ad hoc: they frequently trade off correctness for diversity, their effectiveness varies across tasks, and in some cases they even contradict one another. In this work, we place these observations on a rigorous foundation. We first provide a formal proof of why RL fine-tuning exhibits diversity collapse via a selection and reinforcement bias. Next, we make a key observation that any reward modification to address diversity collapse only needs to be applied on the correct trajectories. Building directly on this analysis, we introduce a principled method -- \\textit{differential smoothing} -- that provably improves both correctness and diversity, outperforming vanilla RL as well as widely used entropy-based heuristics. Our theory precisely characterizes when existing heuristics help and why they fail, while showing that differential smoothing is universally superior. Extensive experiments with models from 1B to 7B parameters, across domains including CountDown and real-world mathematical reasoning, demonstrate consistent gains. Differential smoothing improves both Pass@1 and Pass@k, with up to 6.7\\% improvements on AIME24 dataset.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19952",
        "abs_url": "https://arxiv.org/abs/2511.19952",
        "pdf_url": "https://arxiv.org/pdf/2511.19952",
        "title": "Hierarchical Spatio-Temporal Attention Network with Adaptive Risk-Aware Decision for Forward Collision Warning in Complex Scenarios",
        "authors": [
            "Haoran Hu",
            "Junren Shi",
            "Shuo Jiang",
            "Kun Cheng",
            "Xia Yang",
            "Changhao Piao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Forward Collision Warning systems are crucial for vehicle safety and autonomous driving, yet current methods often fail to balance precise multi-agent interaction modeling with real-time decision adaptability, evidenced by the high computational cost for edge deployment and the unreliability stemming from simplified interaction this http URL overcome these dual challenges-computational complexity and modeling insufficiency-along with the high false alarm rates of traditional static-threshold warnings, this paper introduces an integrated FCW framework that pairs a Hierarchical Spatio-Temporal Attention Network with a Dynamic Risk Threshold Adjustment algorithm. HSTAN employs a decoupled architecture (Graph Attention Network for spatial, cascaded GRU with self-attention for temporal) to achieve superior performance and efficiency, requiring only 12.3 ms inference time (73% faster than Transformer methods) and reducing the Average Displacement Error (ADE) to 0.73m (42.2% better than Social_LSTM) on the NGSIM dataset. Furthermore, Conformalized Quantile Regression enhances reliability by generating prediction intervals (91.3% coverage at 90% confidence), which the DTRA module then converts into timely warnings via a physics-informed risk potential function and an adaptive threshold mechanism inspired by statistical process this http URL across multi-scenario datasets, the complete system demonstrates high efficacy, achieving an F1 score of 0.912, a low false alarm rate of 8.2%, and an ample warning lead time of 2.8 seconds, validating the framework's superior performance and practical deployment feasibility in complex environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19956",
        "abs_url": "https://arxiv.org/abs/2511.19956",
        "pdf_url": "https://arxiv.org/pdf/2511.19956",
        "title": "Prompt Fairness: Sub-group Disparities in LLMs",
        "authors": [
            "Meiyu Zhong",
            "Noel Teku",
            "Ravi Tandon"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Information Theory (cs.IT)",
        "abstract": "Large Language Models (LLMs), though shown to be effective in many applications, can vary significantly in their response quality. In this paper, we investigate this problem of prompt fairness: specifically, the phrasing of a prompt by different users/styles, despite the same question being asked in principle, may elicit different responses from an LLM. To quantify this disparity, we propose to use information-theoretic metrics that can capture two dimensions of bias: subgroup sensitivity, the variability of responses within a subgroup and cross group consistency, the variability of responses across subgroups. Our analysis reveals that certain subgroups exhibit both higher internal variability and greater divergence from others. Our empirical analysis reveals that certain demographic sub groups experience both higher internal variability and greater divergence from others, indicating structural inequities in model behavior. To mitigate these disparities, we propose practical interventions, including majority voting across multiple generations and prompt neutralization, which together improve response stability and enhance fairness across user populations. In the experiments, we observe clear prompt sensitivity disparities across demographic subgroups: before mitigation, cross-group divergence values reach 0.28 and typically fall in the from 0.14 to 0.22 range. After applying our neutralization and multi generation strategy, these divergences consistently decrease, with the largest gap reduced to 0.22 and many distances falling to 0.17 or below, indicating more stable and consistent outputs across subgroups.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19959",
        "abs_url": "https://arxiv.org/abs/2511.19959",
        "pdf_url": "https://arxiv.org/pdf/2511.19959",
        "title": "ParaBlock: Communication-Computation Parallel Block Coordinate Federated Learning for Large Language Models",
        "authors": [
            "Yujia Wang",
            "Yuanpu Cao",
            "Jinghui Chen"
        ],
        "comments": "32 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Federated learning (FL) has been extensively studied as a privacy-preserving training paradigm. Recently, federated block coordinate descent scheme has become a popular option in training large-scale models, as it allows clients to train only a subset of the model locally instead of the entire model. However, in the era of large language models (LLMs), even a single block can contain a significant number of parameters, posing substantial communication latency, particularly for resource-constrained clients. To address this challenge in federated training/fine-tuning LLMs, we propose ParaBlock, a novel approach that establishes two parallel threads for communication and computation to enhance communication efficiency. We theoretically prove that the proposed ParaBlock achieves the same convergence rate as the standard federated block coordinate descent methods. Empirical evaluations on fine-tuning LLMs on general instruction following and mathematical reasoning confirm that ParaBlock not only maintains strong performance but also significantly improves communication efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19966",
        "abs_url": "https://arxiv.org/abs/2511.19966",
        "pdf_url": "https://arxiv.org/pdf/2511.19966",
        "title": "Stragglers Can Contribute More: Uncertainty-Aware Distillation for Asynchronous Federated Learning",
        "authors": [
            "Yujia Wang",
            "Fenglong Ma",
            "Jinghui Chen"
        ],
        "comments": "28 pages",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Asynchronous federated learning (FL) has recently gained attention for its enhanced efficiency and scalability, enabling local clients to send model updates to the server at their own pace without waiting for slower participants. However, such a design encounters significant challenges, such as the risk of outdated updates from straggler clients degrading the overall model performance and the potential bias introduced by faster clients dominating the learning process, especially under heterogeneous data distributions. Existing methods typically address only one of these issues, creating a conflict where mitigating the impact of outdated updates can exacerbate the bias created by faster clients, and vice versa. To address these challenges, we propose FedEcho, a novel framework that incorporates uncertainty-aware distillation to enhance the asynchronous FL performances under large asynchronous delays and data heterogeneity. Specifically, uncertainty-aware distillation enables the server to assess the reliability of predictions made by straggler clients, dynamically adjusting the influence of these predictions based on their estimated uncertainty. By prioritizing more certain predictions while still leveraging the diverse information from all clients, FedEcho effectively mitigates the negative impacts of outdated updates and data heterogeneity. Through extensive experiments, we demonstrate that FedEcho consistently outperforms existing asynchronous federated learning baselines, achieving robust performance without requiring access to private client data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19976",
        "abs_url": "https://arxiv.org/abs/2511.19976",
        "pdf_url": "https://arxiv.org/pdf/2511.19976",
        "title": "Rethinking Semi-Supervised Node Classification with Self-Supervised Graph Clustering",
        "authors": [
            "Songbo Wang",
            "Renchi Yang",
            "Yurui Lai",
            "Xiaoyang Lin",
            "Tsz Nam Chan"
        ],
        "comments": "14 pages",
        "subjects": "Machine Learning (cs.LG); Social and Information Networks (cs.SI)",
        "abstract": "The emergence of graph neural networks (GNNs) has offered a powerful tool for semi-supervised node classification tasks. Subsequent studies have achieved further improvements through refining the message passing schemes in GNN models or exploiting various data augmentation techniques to mitigate limited supervision. In real graphs, nodes often tend to form tightly-knit communities/clusters, which embody abundant signals for compensating label scarcity in semi-supervised node classification but are not explored in prior methods. Inspired by this, this paper presents NCGC that integrates self-supervised graph clustering and semi-supervised classification into a unified framework. Firstly, we theoretically unify the optimization objectives of GNNs and spectral graph clustering, and based on that, develop soft orthogonal GNNs (SOGNs) that leverage a refined message passing paradigm to generate node representations for both classification and clustering. On top of that, NCGC includes a self-supervised graph clustering module that enables the training of SOGNs for learning representations of unlabeled nodes in a self-supervised manner. Particularly, this component comprises two non-trivial clustering objectives and a Sinkhorn-Knopp normalization that transforms predicted cluster assignments into balanced soft pseudo-labels. Through combining the foregoing clustering module with the classification model using a multi-task objective containing the supervised classification loss on labeled data and self-supervised clustering loss on unlabeled data, NCGC promotes synergy between them and achieves enhanced model capacity. Our extensive experiments showcase that the proposed NCGC framework consistently and considerably outperforms popular GNN models and recent baselines for semi-supervised node classification on seven real graphs, when working with various classic GNN backbones.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19980",
        "abs_url": "https://arxiv.org/abs/2511.19980",
        "pdf_url": "https://arxiv.org/pdf/2511.19980",
        "title": "Operator Learning at Machine Precision",
        "authors": [
            "Aras Bacho",
            "Aleksei G. Sorokin",
            "Xianjin Yang",
            "Tho Bourdais",
            "Edoardo Calvello",
            "Matthieu Darcy",
            "Alexander Hsu",
            "Bamdad Hosseini",
            "Houman Owhadi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "Neural operator learning methods have garnered significant attention in scientific computing for their ability to approximate infinite-dimensional operators. However, increasing their complexity often fails to substantially improve their accuracy, leaving them on par with much simpler approaches such as kernel methods and more traditional reduced-order models. In this article, we set out to address this shortcoming and introduce CHONKNORIS (Cholesky Newton--Kantorovich Neural Operator Residual Iterative System), an operator learning paradigm that can achieve machine precision. CHONKNORIS draws on numerical analysis: many nonlinear forward and inverse PDE problems are solvable by Newton-type methods. Rather than regressing the solution operator itself, our method regresses the Cholesky factors of the elliptic operator associated with Tikhonov-regularized Newton--Kantorovich updates. The resulting unrolled iteration yields a neural architecture whose machine-precision behavior follows from achieving a contractive map, requiring far lower accuracy than end-to-end approximation of the solution operator. We benchmark CHONKNORIS on a range of nonlinear forward and inverse problems, including a nonlinear elliptic equation, Burgers' equation, a nonlinear Darcy flow problem, the Caldern problem, an inverse wave scattering problem, and a problem from seismic imaging. We also present theoretical guarantees for the convergence of CHONKNORIS in terms of the accuracy of the emulated Cholesky factors. Additionally, we introduce a foundation model variant, FONKNORIS (Foundation Newton--Kantorovich Neural Operator Residual Iterative System), which aggregates multiple pre-trained CHONKNORIS experts for diverse PDEs to emulate the solution map of a novel nonlinear PDE. Our FONKNORIS model is able to accurately solve unseen nonlinear PDEs such as the Klein--Gordon and Sine--Gordon equations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19984",
        "abs_url": "https://arxiv.org/abs/2511.19984",
        "pdf_url": "https://arxiv.org/pdf/2511.19984",
        "title": "Rethinking Message Passing Neural Networks with Diffusion Distance-guided Stress Majorization",
        "authors": [
            "Haoran Zheng",
            "Renchi Yang",
            "Yubo Zhou",
            "Jianliang Xu"
        ],
        "comments": "Accepted by SIGKDD 2026. The code is available at this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Message passing neural networks (MPNNs) have emerged as go-to models for learning on graph-structured data in the past decade. Despite their effectiveness, most of such models still incur severe issues such as over-smoothing and -correlation, due to their underlying objective of minimizing the Dirichlet energy and the derived neighborhood aggregation operations. In this paper, we propose the DDSM, a new MPNN model built on an optimization framework that includes the stress majorization and orthogonal regularization for overcoming the above issues. Further, we introduce the diffusion distances for nodes into the framework to guide the new message passing operations and develop efficient algorithms for distance approximations, both backed by rigorous theoretical analyses. Our comprehensive experiments showcase that DDSM consistently and considerably outperforms 15 strong baselines on both homophilic and heterophilic graphs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19996",
        "abs_url": "https://arxiv.org/abs/2511.19996",
        "pdf_url": "https://arxiv.org/pdf/2511.19996",
        "title": "RankOOD - Class Ranking-based Out-of-Distribution Detection",
        "authors": [
            "Dishanika Denipitiyage",
            "Naveen Karunanayake",
            "Suranga Seneviratne",
            "Sanjay Chawla"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose RankOOD, a rank-based Out-of-Distribution (OOD) detection approach based on training a model with the Placket-Luce loss, which is now extensively used for preference alignment tasks in foundational models. Our approach is based on the insight that with a deep learning model trained using the Cross Entropy Loss, in-distribution (ID) class prediction induces a ranking pattern for each ID class prediction. The RankOOD framework formalizes the insight by first extracting a rank list for each class using an initial classifier and then uses another round of training with the Plackett-Luce loss, where the class rank, a fixed permutation for each class, is the predicted variable. An OOD example may get assigned with high probability to an ID example, but the probability of it respecting the ranking classification is likely to be small. RankOOD, achieves SOTA performance on the near-ODD TinyImageNet evaluation benchmark, reducing FPR95 by 4.3%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19998",
        "abs_url": "https://arxiv.org/abs/2511.19998",
        "pdf_url": "https://arxiv.org/pdf/2511.19998",
        "title": "REWA: Witness-Overlap Theory -- Foundations for Composable Binary Similarity Systems",
        "authors": [
            "Nikit Phadke"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Data Structures and Algorithms (cs.DS); Information Retrieval (cs.IR)",
        "abstract": "REWA introduces a general theory of similarity based on witness-overlap structures. We show that whenever similarity between concepts can be expressed as monotone witness overlap -- whether arising from graph neighborhoods, causal relations, temporal structure, topological features, symbolic patterns, or embedding-based neighborhoods -- it admits a reduction to compact encodings with provable ranking preservation guarantees. REWA systems consist of: (1) finite witness sets $W(v)$, (2) semi-random bit assignments generated from each witness, and (3) monotonicity of expected similarity in the overlap $\\Delta(u, v) = |W(u) \\cap W(v)|$. We prove that under an overlap-gap condition on the final witness sets -- independent of how they were constructed -- top-$k$ rankings are preserved using $m = O(\\log(|V|/\\delta))$ bits. The witness-set formulation is compositional: any sequence of structural, temporal, causal, topological, information-theoretic, or learned transformations can be combined into pipelines that terminate in discrete witness sets. The theory applies to the final witness overlap, enabling modular construction of similarity systems from reusable primitives. This yields a vast design space: millions of composable similarity definitions inherit logarithmic encoding complexity. REWA subsumes and unifies Bloom filters, minhash, LSH bitmaps, random projections, sketches, and hierarchical filters as special cases. It provides a principled foundation for similarity systems whose behavior is governed by witness overlap rather than hash-function engineering. This manuscript presents the axioms, the main reducibility theorem, complete proofs with explicit constants, and a detailed discussion of compositional design, limitations, and future extensions including multi-bit encodings, weighted witnesses, and non-set representations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20015",
        "abs_url": "https://arxiv.org/abs/2511.20015",
        "pdf_url": "https://arxiv.org/pdf/2511.20015",
        "title": "iRadioDiff: Physics-Informed Diffusion Model for Indoor Radio Map Construction and Localization",
        "authors": [
            "Xiucheng Wang",
            "Tingwei Yuan",
            "Yang Cao",
            "Nan Cheng",
            "Ruijin Sun",
            "Weihua Zhuang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Radio maps (RMs) serve as environment-aware electromagnetic (EM) representations that connect scenario geometry and material properties to the spatial distribution of signal strength, enabling localization without costly in-situ measurements. However, constructing high-fidelity indoor RMs remains challenging due to the prohibitive latency of EM solvers and the limitations of learning-based methods, which often rely on sparse measurements or assumptions of homogeneous material, which are misaligned with the heterogeneous and multipath-rich nature of indoor environments. To overcome these challenges, we propose iRadioDiff, a sampling-free diffusion-based framework for indoor RM construction. iRadioDiff is conditioned on access point (AP) positions, and physics-informed prompt encoded by material reflection and transmission coefficients. It further incorporates multipath-critical priors, including diffraction points, strong transmission boundaries, and line-of-sight (LoS) contours, to guide the generative process via conditional channels and boundary-weighted objectives. This design enables accurate modeling of nonstationary field discontinuities and efficient construction of physically consistent RMs. Experiments demonstrate that iRadioDiff achieves state-of-the-art performance in indoor RM construction and received signal strength based indoor localization, which offers effective generalization across layouts and material configurations. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20030",
        "abs_url": "https://arxiv.org/abs/2511.20030",
        "pdf_url": "https://arxiv.org/pdf/2511.20030",
        "title": "Cross-Contrastive Clustering for Multimodal Attributed Graphs with Dual Graph Filtering",
        "authors": [
            "Haoran Zheng",
            "Renchi Yang",
            "Hongtao Wang",
            "Jianliang Xu"
        ],
        "comments": "Accepted by SIGKDD 2026. The code is available at this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multimodal Attributed Graphs (MMAGs) are an expressive data model for representing the complex interconnections among entities that associate attributes from multiple data modalities (text, images, etc.). Clustering over such data finds numerous practical applications in real scenarios, including social community detection, medical data analytics, etc. However, as revealed by our empirical studies, existing multi-view clustering solutions largely rely on the high correlation between attributes across various views and overlook the unique characteristics (e.g., low modality-wise correlation and intense feature-wise noise) of multimodal attributes output by large pre-trained language and vision models in MMAGs, leading to suboptimal clustering performance. Inspired by foregoing empirical observations and our theoretical analyses with graph signal processing, we propose the Dual Graph Filtering (DGF) scheme, which innovatively incorporates a feature-wise denoising component into node representation learning, thereby effectively overcoming the limitations of traditional graph filters adopted in the extant multi-view graph clustering approaches. On top of that, DGF includes a tri-cross contrastive training strategy that employs instance-level contrastive learning across modalities, neighborhoods, and communities for learning robust and discriminative node representations. Our comprehensive experiments on eight benchmark MMAG datasets exhibit that DGF is able to outperform a wide range of state-of-the-art baselines consistently and significantly in terms of clustering quality measured against ground-truth labels.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20044",
        "abs_url": "https://arxiv.org/abs/2511.20044",
        "pdf_url": "https://arxiv.org/pdf/2511.20044",
        "title": "RED-F: Reconstruction-Elimination based Dual-stream Contrastive Forecasting for Multivariate Time Series Anomaly Prediction",
        "authors": [
            "PengYu Chen",
            "Xiaohou Shi",
            "Yuan Chang",
            "Yan Sun",
            "Sajal K. Das"
        ],
        "comments": "13 pages, 12 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The proactive prediction of anomalies (AP) in mul- tivariate time series (MTS) is a critical challenge to ensure system dependability. The difficulty lies in identifying subtle anomaly precursors concealed within normal signals. However, existing unsupervised methods, trained exclusively on normal data, demonstrate a fundamental propensity to reconstruct normal patterns. Consequently, when confronted with weak precursors, their predictions are dominated by the normal pattern, submerging the very signal required for prediction. To contend with the limitation, we propose RED-F, a Reconstruction- Elimination based Dual-stream Contrastive Forecasting frame- work, comprising the Reconstruction-Elimination Model (REM) and the Dual-stream Contrastive Forecasting Model (DFM). The REM utilizes a hybrid time-frequency mechanism to mitigate the precursor, generating a purified, normal-pattern baseline. The DFM then receives this purified baseline and the original sequence which retains the precursor as parallel inputs. At the core of our framework, RED-F employs a contrastive forecast that transforms the difficult task of absolute signal detection into a simpler, more robust task of relative trajectory comparison by computing the divergence between these two predictive streams. This contrastive mechanism serves to amplify the faint precursor signal. Furthermore, the DFM is trained with a novel Multi-Series Prediction (MSP) objective, which leverages distant future con- text to enhance its predictive sensitivity. Extensive experiments on six real-world datasets demonstrate the superior capability of RED-F in anomaly prediction tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20066",
        "abs_url": "https://arxiv.org/abs/2511.20066",
        "pdf_url": "https://arxiv.org/pdf/2511.20066",
        "title": "SOMBRL: Scalable and Optimistic Model-Based RL",
        "authors": [
            "Bhavya Sukhija",
            "Lenart Treven",
            "Carmelo Sferrazza",
            "Florian Drfler",
            "Pieter Abbeel",
            "Andreas Krause"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We address the challenge of efficient exploration in model-based reinforcement learning (MBRL), where the system dynamics are unknown and the RL agent must learn directly from online interactions. We propose Scalable and Optimistic MBRL (SOMBRL), an approach based on the principle of optimism in the face of uncertainty. SOMBRL learns an uncertainty-aware dynamics model and greedily maximizes a weighted sum of the extrinsic reward and the agent's epistemic uncertainty. SOMBRL is compatible with any policy optimizers or planners, and under common regularity assumptions on the system, we show that SOMBRL has sublinear regret for nonlinear dynamics in the (i) finite-horizon, (ii) discounted infinite-horizon, and (iii) non-episodic settings. Additionally, SOMBRL offers a flexible and scalable solution for principled exploration. We evaluate SOMBRL on state-based and visual-control environments, where it displays strong performance across all tasks and baselines. We also evaluate SOMBRL on a dynamic RC car hardware and show SOMBRL outperforms the state-of-the-art, illustrating the benefits of principled exploration for MBRL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20099",
        "abs_url": "https://arxiv.org/abs/2511.20099",
        "pdf_url": "https://arxiv.org/pdf/2511.20099",
        "title": "QiMeng-CRUX: Narrowing the Gap between Natural Language and Verilog via Core Refined Understanding eXpression",
        "authors": [
            "Lei Huang",
            "Rui Zhang",
            "Jiaming Guo",
            "Yang Zhang",
            "Di Huang",
            "Shuyao Cheng",
            "Pengwei Jin",
            "Chongxiao Li",
            "Zidong Du",
            "Xing Hu",
            "Qi Guo",
            "Yunji Chen"
        ],
        "comments": "Accepted by the AAAI26 Conference Main Track",
        "subjects": "Machine Learning (cs.LG); Hardware Architecture (cs.AR); Programming Languages (cs.PL)",
        "abstract": "Large language models (LLMs) have shown promising capabilities in hardware description language (HDL) generation. However, existing approaches often rely on free-form natural language descriptions that are often ambiguous, redundant, and unstructured, which poses significant challenges for downstream Verilog code generation. We treat hardware code generation as a complex transformation from an open-ended natural language space to a domain-specific, highly constrained target space. To bridge this gap, we introduce Core Refined Understanding eXpression (CRUX), a structured intermediate space that captures the essential semantics of user intent while organizing the expression for precise Verilog code generation. We further design a two-stage training framework, comprising Joint Expression Modeling and Dual-Space Optimization, to enhance the quality of both CRUX and Verilog code. Experiments across multiple Verilog generation benchmarks demonstrate that our model, CRUX-V, achieves state-of-the-art performance among general models, particularly under challenging design tasks. Furthermore, the CRUX space proves transferable and beneficial when used as input prompts for other code models, highlighting its effectiveness in narrowing the gap between free-form natural language descriptions and precise Verilog generation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20105",
        "abs_url": "https://arxiv.org/abs/2511.20105",
        "pdf_url": "https://arxiv.org/pdf/2511.20105",
        "title": "Multivariate Forecasting of Bitcoin Volatility with Gradient Boosting: Deterministic, Probabilistic, and Feature Importance Perspectives",
        "authors": [
            "Grzegorz Dudek",
            "Mateusz Kasprzyk",
            "Pawe Peka"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This study investigates the application of the Light Gradient Boosting Machine (LGBM) model for both deterministic and probabilistic forecasting of Bitcoin realized volatility. Utilizing a comprehensive set of 69 predictors -- encompassing market, behavioral, and macroeconomic indicators -- we evaluate the performance of LGBM-based models and compare them with both econometric and machine learning baselines. For probabilistic forecasting, we explore two quantile-based approaches: direct quantile regression using the pinball loss function, and a residual simulation method that transforms point forecasts into predictive distributions. To identify the main drivers of volatility, we employ gain-based and permutation feature importance techniques, consistently highlighting the significance of trading volume, lagged volatility measures, investor attention, and market capitalization. The results demonstrate that LGBM models effectively capture the nonlinear and high-variance characteristics of cryptocurrency markets while providing interpretable insights into the underlying volatility dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20109",
        "abs_url": "https://arxiv.org/abs/2511.20109",
        "pdf_url": "https://arxiv.org/pdf/2511.20109",
        "title": "CLIMATEAGENT: Multi-Agent Orchestration for Complex Climate Data Science Workflows",
        "authors": [
            "Hyeonjae Kim",
            "Chenyue Li",
            "Wen Deng",
            "Mengxi Jin",
            "Wen Huang",
            "Mengqian Lu",
            "Binhang Yuan"
        ],
        "comments": "30 pages, 6 figures, 3 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Climate science demands automated workflows to transform comprehensive questions into data-driven statements across massive, heterogeneous datasets. However, generic LLM agents and static scripting pipelines lack climate-specific context and flexibility, thus, perform poorly in practice. We present ClimateAgent, an autonomous multi-agent framework that orchestrates end-to-end climate data analytic workflows. ClimateAgent decomposes user questions into executable sub-tasks coordinated by an Orchestrate-Agent and a Plan-Agent; acquires data via specialized Data-Agents that dynamically introspect APIs to synthesize robust download scripts; and completes analysis and reporting with a Coding-Agent that generates Python code, visualizations, and a final report with a built-in self-correction loop. To enable systematic evaluation, we introduce Climate-Agent-Bench-85, a benchmark of 85 real-world tasks spanning atmospheric rivers, drought, extreme precipitation, heat waves, sea surface temperature, and tropical cyclones. On Climate-Agent-Bench-85, ClimateAgent achieves 100% task completion and a report quality score of 8.32, outperforming GitHub-Copilot (6.27) and a GPT-5 baseline (3.26). These results demonstrate that our multi-agent orchestration with dynamic API awareness and self-correcting execution substantially advances reliable, end-to-end automation for climate science analytic tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20168",
        "abs_url": "https://arxiv.org/abs/2511.20168",
        "pdf_url": "https://arxiv.org/pdf/2511.20168",
        "title": "On the Limits of Momentum in Decentralized and Federated Optimization",
        "authors": [
            "Riccardo Zaccone",
            "Sai Praneeth Karimireddy",
            "Carlo Masone"
        ],
        "comments": "Accepted at the 17th Workshop on Optimization for Machine Learning (OPT@NeurIPS2025)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Recent works have explored the use of momentum in local methods to enhance distributed SGD. This is particularly appealing in Federated Learning (FL), where momentum intuitively appears as a solution to mitigate the effects of statistical heterogeneity. Despite recent progress in this direction, it is still unclear if momentum can guarantee convergence under unbounded heterogeneity in decentralized scenarios, where only some workers participate at each round. In this work we analyze momentum under cyclic client participation, and theoretically prove that it remains inevitably affected by statistical heterogeneity. Similarly to SGD, we prove that decreasing step-sizes do not help either: in fact, any schedule decreasing faster than $\\Theta\\left(1/t\\right)$ leads to convergence to a constant value that depends on the initialization and the heterogeneity bound. Numerical results corroborate the theory, and deep learning experiments confirm its relevance for realistic settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20170",
        "abs_url": "https://arxiv.org/abs/2511.20170",
        "pdf_url": "https://arxiv.org/pdf/2511.20170",
        "title": "AdaCap: An Adaptive Contrastive Approach for Small-Data Neural Networks",
        "authors": [
            "Bruno Belucci",
            "Karim Lounici",
            "Katia Meziani"
        ],
        "comments": "Submitted to ESANN 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Neural networks struggle on small tabular datasets, where tree-based models remain dominant. We introduce Adaptive Contrastive Approach (AdaCap), a training scheme that combines a permutation-based contrastive loss with a Tikhonov-based closed-form output mapping. Across 85 real-world regression datasets and multiple architectures, AdaCap yields consistent and statistically significant improvements in the small-sample regime, particularly for residual models. A meta-predictor trained on dataset characteristics (size, skewness, noise) accurately anticipates when AdaCap is beneficial. These results show that AdaCap acts as a targeted regularization mechanism, strengthening neural networks precisely where they are most fragile. All results and code are publicly available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20189",
        "abs_url": "https://arxiv.org/abs/2511.20189",
        "pdf_url": "https://arxiv.org/pdf/2511.20189",
        "title": "Learning Subgroups with Maximum Treatment Effects without Causal Heuristics",
        "authors": [
            "Lincen Yang",
            "Zhong Li",
            "Matthijs van Leeuwen",
            "Saber Salehkaleybar"
        ],
        "comments": "The full version (including the Appendix). Accepted at AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Discovering subgroups with the maximum average treatment effect is crucial for targeted decision making in domains such as precision medicine, public policy, and education. While most prior work is formulated in the potential outcome framework, the corresponding structural causal model (SCM) for this task has been largely overlooked. In practice, two approaches dominate. The first estimates pointwise conditional treatment effects and then fits a tree on those estimates, effectively turning subgroup estimation into the harder problem of accurate pointwise estimation. The second constructs decision trees or rule sets with ad-hoc 'causal' heuristics, typically without rigorous justification for why a given heuristic may be used or whether such heuristics are necessary at all. We address these issues by studying the problem directly under the SCM framework. Under the assumption of a partition-based model, we show that optimal subgroup discovery reduces to recovering the data-generating models and hence a standard supervised learning problem (regression or classification). This allows us to adopt any partition-based methods to learn the subgroup from data. We instantiate the approach with CART, arguably one of the most widely used tree-based methods, to learn the subgroup with maximum treatment effect. Finally, on a large collection of synthetic and semi-synthetic datasets, we compare our method against a wide range of baselines and find that our approach, which avoids such causal heuristics, more accurately identifies subgroups with maximum treatment effect. Our source code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20194",
        "abs_url": "https://arxiv.org/abs/2511.20194",
        "pdf_url": "https://arxiv.org/pdf/2511.20194",
        "title": "In-Context Compositional Learning via Sparse Coding Transformer",
        "authors": [
            "Wei Chen",
            "Jingxi Yu",
            "Zichen Miao",
            "Qiang Qiu"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Transformer architectures have achieved remarkable success across language, vision, and multimodal tasks, and there is growing demand for them to address in-context compositional learning tasks. In these tasks, models solve the target problems by inferring compositional rules from context examples, which are composed of basic components structured by underlying rules. However, some of these tasks remain challenging for Transformers, which are not inherently designed to handle compositional tasks and offer limited structural inductive bias. In this work, inspired by the principle of sparse coding, we propose a reformulation of the attention to enhance its capability for compositional tasks. In sparse coding, data are represented as sparse combinations of dictionary atoms with coefficients that capture their compositional rules. Specifically, we reinterpret the attention block as a mapping of inputs into outputs through projections onto two sets of learned dictionary atoms: an encoding dictionary and a decoding dictionary. The encoding dictionary decomposes the input into a set of coefficients, which represent the compositional structure of the input. To enhance structured representations, we impose sparsity on these coefficients. The sparse coefficients are then used to linearly combine the decoding dictionary atoms to generate the output. Furthermore, to assist compositional generalization tasks, we propose estimating the coefficients of the target problem as a linear combination of the coefficients obtained from the context examples. We demonstrate the effectiveness of our approach on the S-RAVEN and RAVEN datasets. For certain compositional generalization tasks, our method maintains performance even when standard Transformers fail, owing to its ability to learn and apply compositional rules.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20220",
        "abs_url": "https://arxiv.org/abs/2511.20220",
        "pdf_url": "https://arxiv.org/pdf/2511.20220",
        "title": "Communication-Efficient Learning for Satellite Constellations",
        "authors": [
            "Ruxandra-Stefania Tudose",
            "Moritz H.W. Grss",
            "Grace Ra Kim",
            "Karl H. Johansson",
            "Nicola Bastianello"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Optimization and Control (math.OC)",
        "abstract": "Satellite constellations in low-Earth orbit are now widespread, enabling positioning, Earth imaging, and communications. In this paper we address the solution of learning problems using these satellite constellations. In particular, we focus on a federated approach, where satellites collect and locally process data, with the ground station aggregating local models. We focus on designing a novel, communication-efficient algorithm that still yields accurate trained models. To this end, we employ several mechanisms to reduce the number of communications with the ground station (local training) and their size (compression). We then propose an error feedback mechanism that enhances accuracy, which yields, as a byproduct, an algorithm-agnostic error feedback scheme that can be more broadly applied. We analyze the convergence of the resulting algorithm, and compare it with the state of the art through simulations in a realistic space scenario, showcasing superior performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20222",
        "abs_url": "https://arxiv.org/abs/2511.20222",
        "pdf_url": "https://arxiv.org/pdf/2511.20222",
        "title": "Decoupling and Damping: Structurally-Regularized Gradient Matching for Multimodal Graph Condensation",
        "authors": [
            "Lian Shen",
            "Zhendan Chen",
            "Yinhui jiang",
            "Meijia Song",
            "Ziming Su",
            "Juan Liu",
            "Xiangrong Liu"
        ],
        "comments": "11pages,5 figures,6 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In critical web applications such as e-commerce and recommendation systems, multimodal graphs integrating rich visual and textual attributes are increasingly central, yet their large scale introduces substantial computational burdens for training Graph Neural Networks (GNNs). While Graph Condensation (GC) offers a promising solution by synthesizing smaller datasets, existing methods falter in the multimodal setting. We identify a dual challenge causing this failure: (1) conflicting gradients arising from semantic misalignments between modalities, and (2) the GNN's message-passing architecture pathologically amplifying this gradient noise across the graph structure. To address this, we propose Structurally-Regularized Gradient Matching (SR-GM), a novel condensation framework tailored for multimodal graphs. SR-GM introduces two synergistic components: first, a gradient decoupling mechanism that resolves inter-modality conflicts at their source via orthogonal projection; and second, a structural damping regularizer that acts directly on the gradient field. By leveraging the graph's Dirichlet energy, this regularizer transforms the topology from a noise amplifier into a stabilizing force during optimization. Extensive experiments demonstrate that SR-GM significantly improves accuracy and accelerates convergence compared to baseline methods. Ablation studies confirm that addressing both gradient conflict and structural amplification in tandem is essential for achieving superior performance. Moreover, the condensed multimodal graphs exhibit strong cross-architecture generalization and promise to accelerate applications like Neural Architecture Search. This research provides a scalable methodology for multimodal graph-based learning in resource-constrained environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20225",
        "abs_url": "https://arxiv.org/abs/2511.20225",
        "pdf_url": "https://arxiv.org/pdf/2511.20225",
        "title": "DiCaP: Distribution-Calibrated Pseudo-labeling for Semi-Supervised Multi-Label Learning",
        "authors": [
            "Bo Han",
            "Zhuoming Li",
            "Xiaoyu Wang",
            "Yaxin Hou",
            "Hui Liu",
            "Junhui Hou",
            "Yuheng Jia"
        ],
        "comments": "Accepted by AAAI-26",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Semi-supervised multi-label learning (SSMLL) aims to address the challenge of limited labeled data in multi-label learning (MLL) by leveraging unlabeled data to improve the model's performance. While pseudo-labeling has become a dominant strategy in SSMLL, most existing methods assign equal weights to all pseudo-labels regardless of their quality, which can amplify the impact of noisy or uncertain predictions and degrade the overall performance. In this paper, we theoretically verify that the optimal weight for a pseudo-label should reflect its correctness likelihood. Empirically, we observe that on the same dataset, the correctness likelihood distribution of unlabeled data remains stable, even as the number of labeled training samples varies. Building on this insight, we propose Distribution-Calibrated Pseudo-labeling (DiCaP), a correctness-aware framework that estimates posterior precision to calibrate pseudo-label weights. We further introduce a dual-thresholding mechanism to separate confident and ambiguous regions: confident samples are pseudo-labeled and weighted accordingly, while ambiguous ones are explored by unsupervised contrastive learning. Experiments conducted on multiple benchmark datasets verify that our method achieves consistent improvements, surpassing state-of-the-art methods by up to 4.27%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20257",
        "abs_url": "https://arxiv.org/abs/2511.20257",
        "pdf_url": "https://arxiv.org/pdf/2511.20257",
        "title": "Interpretable Air Pollution Forecasting by Physics-Guided Spatiotemporal Decoupling",
        "authors": [
            "Zhiguo Zhang",
            "Xiaoliang Ma",
            "Daniel Schlesinger"
        ],
        "comments": "Accepted to 2025 IEEE International Conference on Big Data",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Accurate and interpretable air pollution forecasting is crucial for public health, but most models face a trade-off between performance and interpretability. This study proposes a physics-guided, interpretable-by-design spatiotemporal learning framework. The model decomposes the spatiotemporal behavior of air pollutant concentrations into two transparent, additive modules. The first is a physics-guided transport kernel with directed weights conditioned on wind and geography (advection). The second is an explainable attention mechanism that learns local responses and attributes future concentrations to specific historical lags and exogenous drivers. Evaluated on a comprehensive dataset from the Stockholm region, our model consistently outperforms state-of-the-art baselines across multiple forecasting horizons. Our model's integration of high predictive performance and spatiotemporal interpretability provides a more reliable foundation for operational air-quality management in real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20277",
        "abs_url": "https://arxiv.org/abs/2511.20277",
        "pdf_url": "https://arxiv.org/pdf/2511.20277",
        "title": "HVAdam: A Full-Dimension Adaptive Optimizer",
        "authors": [
            "Yiheng Zhang",
            "Shaowu Wu",
            "Yuanzhuo Xu",
            "Jiajun Wu",
            "Shang Xu",
            "Steve Drew",
            "Xiaoguang Niu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Adaptive optimizers such as Adam have achieved great success in training large-scale models like large language models and diffusion models. However, they often generalize worse than non-adaptive methods, such as SGD on classical architectures like CNNs. We identify a key cause of this performance gap: adaptivity in pre-conditioners, which limits the optimizer's ability to adapt to diverse optimization landscapes. To address this, we propose Anon (Adaptivity Non-restricted Optimizer with Novel convergence technique), a novel optimizer with continuously tunable adaptivity , allowing it to interpolate between SGD-like and Adam-like behaviors and even extrapolate beyond both. To ensure convergence across the entire adaptivity spectrum, we introduce incremental delay update (IDU), a novel mechanism that is more flexible than AMSGrad's hard max-tracking strategy and enhances robustness to gradient noise. We theoretically establish convergence guarantees under both convex and non-convex settings. Empirically, Anon consistently outperforms state-of-the-art optimizers on representative image classification, diffusion, and language modeling tasks. These results demonstrate that adaptivity can serve as a valuable tunable design principle, and Anon provides the first unified and reliable framework capable of bridging the gap between classical and modern optimizers and surpassing their advantageous properties.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20327",
        "abs_url": "https://arxiv.org/abs/2511.20327",
        "pdf_url": "https://arxiv.org/pdf/2511.20327",
        "title": "MXtalTools: A Toolkit for Machine Learning on Molecular Crystals",
        "authors": [
            "Michael Kilgour",
            "Mark E. Tuckerman",
            "Jutta Rogal"
        ],
        "comments": "16 pages, 11 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present MXtalTools, a flexible Python package for the data-driven modelling of molecular crystals, facilitating machine learning studies of the molecular solid state. MXtalTools comprises several classes of utilities: (1) synthesis, collation, and curation of molecule and crystal datasets, (2) integrated workflows for model training and inference, (3) crystal parameterization and representation, (4) crystal structure sampling and optimization, (5) end-to-end differentiable crystal sampling, construction and analysis. Our modular functions can be integrated into existing workflows or combined and used to build novel modelling pipelines. MXtalTools leverages CUDA acceleration to enable high-throughput crystal modelling. The Python code is available open-source on our GitHub page, with detailed documentation on ReadTheDocs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20347",
        "abs_url": "https://arxiv.org/abs/2511.20347",
        "pdf_url": "https://arxiv.org/pdf/2511.20347",
        "title": "Soft Adaptive Policy Optimization",
        "authors": [
            "Chang Gao",
            "Chujie Zheng",
            "Xiong-Hui Chen",
            "Kai Dang",
            "Shixuan Liu",
            "Bowen Yu",
            "An Yang",
            "Shuai Bai",
            "Jingren Zhou",
            "Junyang Lin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Reinforcement learning (RL) plays an increasingly important role in enhancing the reasoning capabilities of large language models (LLMs), yet stable and performant policy optimization remains challenging. Token-level importance ratios often exhibit high variance-a phenomenon exacerbated in Mixture-of-Experts models-leading to unstable updates. Existing group-based policy optimization methods, such as GSPO and GRPO, alleviate this problem via hard clipping, making it difficult to maintain both stability and effective learning. We propose Soft Adaptive Policy Optimization (SAPO), which replaces hard clipping with a smooth, temperature-controlled gate that adaptively attenuates off-policy updates while preserving useful learning signals. Compared with GSPO and GRPO, SAPO is both sequence-coherent and token-adaptive. Like GSPO, SAPO maintains sequence-level coherence, but its soft gating forms a continuous trust region that avoids the brittle hard clipping band used in GSPO. When a sequence contains a few highly off-policy tokens, GSPO suppresses all gradients for that sequence, whereas SAPO selectively down-weights only the offending tokens and preserves the learning signal from the near-on-policy ones, improving sample efficiency. Relative to GRPO, SAPO replaces hard token-level clipping with smooth, temperature-controlled scaling, enabling more informative and stable updates. Empirical results on mathematical reasoning benchmarks indicate that SAPO exhibits improved training stability and higher Pass@1 performance under comparable training budgets. Moreover, we employ SAPO to train the Qwen3-VL model series, demonstrating that SAPO yields consistent performance gains across diverse tasks and different model sizes. Overall, SAPO provides a more reliable, scalable, and effective optimization strategy for RL training of LLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20349",
        "abs_url": "https://arxiv.org/abs/2511.20349",
        "pdf_url": "https://arxiv.org/pdf/2511.20349",
        "title": "Complexity Reduction Study Based on RD Costs Approximation for VVC Intra Partitioning",
        "authors": [
            "M.E.A. Kherchouche",
            "F. Galpin",
            "T. Dumas",
            "F. Schnitzler",
            "D. Menard",
            "L. Zhang"
        ],
        "comments": "2025 Data Compression Conference (DCC)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In this paper, a complexity study is conducted for Versatile Video Codec (VVC) intra partitioning to accelerate the exhaustive search involved in Rate-Distortion Optimization (RDO) process. To address this problem, two main machine learning techniques are proposed and compared. Unlike existing methods, the proposed approaches are size independent and incorporate the Rate-Distortion (RD) costs of neighboring blocks as input features. The first method is a regression based technique that predicts normalized RD costs of a given Coding Unit (CU). As partitioning possesses the Markov property, the associated decision-making problem can be modeled as a Markov Decision Process (MDP) and solved by Reinforcement Learning (RL). The second approach is a RL agent learned from trajectories of CU decision across two depths with Deep Q-Network (DQN) algorithm. Then a pre-determined thresholds are applied for both methods to select a suitable split for the current CU.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20362",
        "abs_url": "https://arxiv.org/abs/2511.20362",
        "pdf_url": "https://arxiv.org/pdf/2511.20362",
        "title": "PRISM: Periodic Representation with multIscale and Similarity graph Modelling for enhanced crystal structure property prediction",
        "authors": [
            "lex Sol",
            "Albert Mosella-Montoro",
            "Joan Cardona",
            "Daniel Aravena",
            "Silvia Gmez-Coca",
            "Eliseo Ruiz",
            "Javier Ruiz-Hidalgo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Crystal structures are characterised by repeating atomic patterns within unit cells across three-dimensional space, posing unique challenges for graph-based representation learning. Current methods often overlook essential periodic boundary conditions and multiscale interactions inherent to crystalline structures. In this paper, we introduce PRISM, a graph neural network framework that explicitly integrates multiscale representations and periodic feature encoding by employing a set of expert modules, each specialised in encoding distinct structural and chemical aspects of periodic systems. Extensive experiments across crystal structure-based benchmarks demonstrate that PRISM improves state-of-the-art predictive accuracy, significantly enhancing crystal property prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20382",
        "abs_url": "https://arxiv.org/abs/2511.20382",
        "pdf_url": "https://arxiv.org/pdf/2511.20382",
        "title": "MoRE: Batch-Robust Multi-Omics Representations from Frozen Pre-trained Transformers",
        "authors": [
            "Audrey Pei-Hsuan Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Genomics (q-bio.GN)",
        "abstract": "Representation learning on multi-omics data is challenging due to extreme dimensionality, modality heterogeneity, and cohort-specific batch effects. While pre-trained transformer backbones have shown broad generalization capabilities in biological sequence modeling, their application to multi-omics integration remains underexplored. We present MoRE (Multi-Omics Representation Embedding), a framework that repurposes frozen pre-trained transformers to align heterogeneous assays into a shared latent space. Unlike purely generative approaches, MoRE employs a parameter-efficient fine-tuning (PEFT) strategy, prioritizing cross-sample and cross-modality alignment over simple sequence reconstruction. Specifically, MoRE attaches lightweight, modality-specific adapters and a task-adaptive fusion layer to the frozen backbone. It optimizes a masked modeling objective jointly with supervised contrastive and batch-invariant alignment losses, yielding structure-preserving embeddings that generalize across unseen cell types and platforms. We benchmark MoRE against established baselines, including scGPT, scVI, and Harmony with scArches, evaluating integration fidelity, rare population detection, and modality transfer. Our results demonstrate that MoRE achieves competitive batch robustness and biological conservation while significantly reducing trainable parameters compared to fully fine-tuned models. This work positions MoRE as a practical step toward general-purpose omics foundation models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20395",
        "abs_url": "https://arxiv.org/abs/2511.20395",
        "pdf_url": "https://arxiv.org/pdf/2511.20395",
        "title": "Identifying environmental factors associated with tetrodotoxin contamination in bivalve mollusks using eXplainable AI",
        "authors": [
            "M.C. Schoppema",
            "B.H.M. van der Velden",
            "A. Hrriyetolu",
            "M.D. Klijnstra",
            "E.J. Faassen",
            "A. Gerssen",
            "H.J. van der Fels-Klerx"
        ],
        "comments": "18 pages, 6 figures, submitted to Nature Food",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Since 2012, tetrodotoxin (TTX) has been found in seafoods such as bivalve mollusks in temperate European waters. TTX contamination leads to food safety risks and economic losses, making early prediction of TTX contamination vital to the food industry and competent authorities. Recent studies have pointed to shallow habitats and water temperature as main drivers to TTX contamination in bivalve mollusks. However, the temporal relationships between abiotic factors, biotic factors, and TTX contamination remain unexplored. We have developed an explainable, deep learning-based model to predict TTX contamination in the Dutch Zeeland estuary. Inputs for the model were meteorological and hydrological features; output was the presence or absence of TTX contamination. Results showed that the time of sunrise, time of sunset, global radiation, water temperature, and chloride concentration contributed most to TTX contamination. Thus, the effective number of sun hours, represented by day length and global radiation, was an important driver for tetrodotoxin contamination in bivalve mollusks. To conclude, our explainable deep learning model identified the aforementioned environmental factors (number of sun hours, global radiation, water temperature, and water chloride concentration) to be associated with tetrodotoxin contamination in bivalve mollusks; making our approach a valuable tool to mitigate marine toxin risks for food industry and competent authorities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20397",
        "abs_url": "https://arxiv.org/abs/2511.20397",
        "pdf_url": "https://arxiv.org/pdf/2511.20397",
        "title": "Model-Based Learning of Whittle indices",
        "authors": [
            "Jol Charles-Rebuff",
            "Nicolas Gast",
            "Bruno Gaujal"
        ],
        "comments": "31 pages, 8 figures, submitted to TOMPECS",
        "subjects": "Machine Learning (cs.LG); Data Structures and Algorithms (cs.DS); Numerical Analysis (math.NA)",
        "abstract": "We present BLINQ, a new model-based algorithm that learns the Whittle indices of an indexable, communicating and unichain Markov Decision Process (MDP). Our approach relies on building an empirical estimate of the MDP and then computing its Whittle indices using an extended version of a state-of-the-art existing algorithm. We provide a proof of convergence to the Whittle indices we want to learn as well as a bound on the time needed to learn them with arbitrary precision. Moreover, we investigate its computational complexity. Our numerical experiments suggest that BLINQ significantly outperforms existing Q-learning approaches in terms of the number of samples needed to get an accurate approximation. In addition, it has a total computational cost even lower than Q-learning for any reasonably high number of samples. These observations persist even when the Q-learning algorithms are speeded up using pre-trained neural networks to predict Q-values.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20407",
        "abs_url": "https://arxiv.org/abs/2511.20407",
        "pdf_url": "https://arxiv.org/pdf/2511.20407",
        "title": "Tight Margin-Based Generalization Bounds for Voting Classifiers over Finite Hypothesis Sets",
        "authors": [
            "Kasper Green Larsen",
            "Natascha Schalburg"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "We prove the first margin-based generalization bound for voting classifiers, that is asymptotically tight in the tradeoff between the size of the hypothesis set, the margin, the fraction of training points with the given margin, the number of training samples and the failure probability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20445",
        "abs_url": "https://arxiv.org/abs/2511.20445",
        "pdf_url": "https://arxiv.org/pdf/2511.20445",
        "title": "Diffusion for Fusion: Designing Stellarators with Generative AI",
        "authors": [
            "Misha Padidar",
            "Teresa Huang",
            "Andrew Giuliani",
            "Marina Spivak"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Plasma Physics (physics.plasm-ph)",
        "abstract": "Stellarators are a prospective class of fusion-based power plants that confine a hot plasma with three-dimensional magnetic fields. Typically framed as a PDE-constrained optimization problem, stellarator design is a time-consuming process that can take hours to solve on a computing cluster. Developing fast methods for designing stellarators is crucial for advancing fusion research. Given the recent development of large datasets of optimized stellarators, machine learning approaches have emerged as a potential candidate. Motivated by this, we present an open inverse problem to the machine learning community: to rapidly generate high-quality stellarator designs which have a set of desirable characteristics. As a case study in the problem space, we train a conditional diffusion model on data from the QUASR database to generate quasisymmetric stellarator designs with desirable characteristics (aspect ratio and mean rotational transform). The diffusion model is applied to design stellarators with characteristics not seen during training. We provide evaluation protocols and show that many of the generated stellarators exhibit solid performance: less than 5% deviation from quasisymmetry and the target characteristics. The modest deviation from quasisymmetry highlights an opportunity to reach the sub 1% target. Beyond the case study, we share multiple promising avenues for generative modeling to advance stellarator design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20456",
        "abs_url": "https://arxiv.org/abs/2511.20456",
        "pdf_url": "https://arxiv.org/pdf/2511.20456",
        "title": "Towards Trustworthy Wi-Fi Sensing: Systematic Evaluation of Deep Learning Model Robustness to Adversarial Attacks",
        "authors": [
            "Shreevanth Krishnaa Gopalakrishnan",
            "Stephen Hailes"
        ],
        "comments": "19 pages, 8 figures, 7 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine learning has become integral to Channel State Information (CSI)-based human sensing systems and is expected to power applications such as device-free activity recognition and identity detection in future cellular and Wi-Fi generations. However, these systems rely on models whose decisions can be subtly perturbed, raising concerns for security and reliability in ubiquitous sensing. Quantifying and understanding the robustness of such models, defined as their ability to maintain accurate predictions under adversarial perturbations, is therefore critical before wireless sensing can be safely deployed in real-world environments. This work presents a systematic evaluation of the robustness of CSI deep learning models under diverse threat models (white-box, black-box/transfer, and universal perturbations) and varying degrees of attack realism. We establish a framework to compare compact temporal autoencoder models with larger deep architectures across three public datasets, quantifying how model scale, training regime, and physical constraints influence robustness. Our experiments show that smaller models, while efficient and equally performant on clean data, are markedly less robust. We further confirm that physically realizable signal-space perturbations, designed to be feasible in real wireless channels, significantly reduce attack success compared to unconstrained feature-space attacks. Adversarial training mitigates these vulnerabilities, improving mean robust accuracy with only moderate degradation in clean performance across both model classes. As wireless sensing advances towards reliable, cross-domain operation, these findings provide quantitative baselines for robustness estimation and inform design principles for secure and trustworthy human-centered sensing systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20478",
        "abs_url": "https://arxiv.org/abs/2511.20478",
        "pdf_url": "https://arxiv.org/pdf/2511.20478",
        "title": "NVIDIA Nemotron Parse 1.1",
        "authors": [
            "Kateryna Chumachenko",
            "Amala Sanjay Deshmukh",
            "Jarno Seppanen",
            "Ilia Karmanov",
            "Chia-Chih Chen",
            "Lukas Voegtle",
            "Philipp Fischer",
            "Marek Wawrzos",
            "Saeid Motiian",
            "Roman Ageev",
            "Kedi Wu",
            "Alexandre Milesi",
            "Maryam Moosaei",
            "Krzysztof Pawelec",
            "Padmavathy Subramanian",
            "Mehrzad Samadi",
            "Xin Yu",
            "Celina Dear",
            "Sarah Stoddard",
            "Jenna Diamond",
            "Jesse Oliver",
            "Leanna Chraghchian",
            "Patrick Skelly",
            "Tom Balough",
            "Yao Xu",
            "Jane Polak Scowcroft",
            "Daniel Korzekwa",
            "Darragh Hanley",
            "Sandip Bhaskar",
            "Timo Roman",
            "Karan Sapra",
            "Andrew Tao",
            "Bryan Catanzaro"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce Nemotron-Parse-1.1, a lightweight document parsing and OCR model that advances the capabilities of its predecessor, Nemoretriever-Parse-1.0. Nemotron-Parse-1.1 delivers improved capabilities across general OCR, markdown formatting, structured table parsing, and text extraction from pictures, charts, and diagrams. It also supports a longer output sequence length for visually dense documents. As with its predecessor, it extracts bounding boxes of text segments, as well as corresponding semantic classes. Nemotron-Parse-1.1 follows an encoder-decoder architecture with 885M parameters, including a compact 256M-parameter language decoder. It achieves competitive accuracy on public benchmarks making it a strong lightweight OCR solution. We release the model weights publicly on Huggingface, as well as an optimized NIM container, along with a subset of the training data as part of the broader Nemotron-VLM-v2 dataset. Additionally, we release Nemotron-Parse-1.1-TC which operates on a reduced vision token length, offering a 20% speed improvement with minimal quality degradation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20490",
        "abs_url": "https://arxiv.org/abs/2511.20490",
        "pdf_url": "https://arxiv.org/pdf/2511.20490",
        "title": "MTBBench: A Multimodal Sequential Clinical Decision-Making Benchmark in Oncology",
        "authors": [
            "Kiril Vasilev",
            "Alexandre Misrahi",
            "Eeshaan Jain",
            "Phil F Cheng",
            "Petros Liakopoulos",
            "Olivier Michielin",
            "Michael Moor",
            "Charlotte Bunne"
        ],
        "comments": "Accepted to NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Multimodal Large Language Models (LLMs) hold promise for biomedical reasoning, but current benchmarks fail to capture the complexity of real-world clinical workflows. Existing evaluations primarily assess unimodal, decontextualized question-answering, overlooking multi-agent decision-making environments such as Molecular Tumor Boards (MTBs). MTBs bring together diverse experts in oncology, where diagnostic and prognostic tasks require integrating heterogeneous data and evolving insights over time. Current benchmarks lack this longitudinal and multimodal complexity. We introduce MTBBench, an agentic benchmark simulating MTB-style decision-making through clinically challenging, multimodal, and longitudinal oncology questions. Ground truth annotations are validated by clinicians via a co-developed app, ensuring clinical relevance. We benchmark multiple open and closed-source LLMs and show that, even at scale, they lack reliability -- frequently hallucinating, struggling with reasoning from time-resolved data, and failing to reconcile conflicting evidence or different modalities. To address these limitations, MTBBench goes beyond benchmarking by providing an agentic framework with foundation model-based tools that enhance multi-modal and longitudinal reasoning, leading to task-level performance gains of up to 9.0% and 11.2%, respectively. Overall, MTBBench offers a challenging and realistic testbed for advancing multimodal LLM reasoning, reliability, and tool-use with a focus on MTB environments in precision oncology.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20509",
        "abs_url": "https://arxiv.org/abs/2511.20509",
        "pdf_url": "https://arxiv.org/pdf/2511.20509",
        "title": "DP-MicroAdam: Private and Frugal Algorithm for Training and Fine-tuning",
        "authors": [
            "Mihaela Huditeanu",
            "Edwige Cyffers",
            "Nikita P. Kalinin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Adaptive optimizers are the de facto standard in non-private training as they often enable faster convergence and improved performance. In contrast, differentially private (DP) training is still predominantly performed with DP-SGD, typically requiring extensive compute and hyperparameter tuning. We propose DP-MicroAdam, a memory-efficient and sparsity-aware adaptive DP optimizer. We prove that DP-MicroAdam converges in stochastic non-convex optimization at the optimal $\\mathcal{O}(1/\\sqrt{T})$ rate, up to privacy-dependent constants. Empirically, DP-MicroAdam outperforms existing adaptive DP optimizers and achieves competitive or superior accuracy compared to DP-SGD across a range of benchmarks, including CIFAR-10, large-scale ImageNet training, and private fine-tuning of pretrained transformers. These results demonstrate that adaptive optimization can improve both performance and stability under differential privacy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20516",
        "abs_url": "https://arxiv.org/abs/2511.20516",
        "pdf_url": "https://arxiv.org/pdf/2511.20516",
        "title": "Adam Simplified: Bias Correction Simplified",
        "authors": [
            "Sam Laing",
            "Antonio Orvieto"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The Adam optimizer is a cornerstone of modern deep learning, yet the empirical necessity of each of its individual components is often taken for granted. This paper presents a focused investigation into the role of bias-correction, a feature whose contribution remains poorly understood. Through a series of systematic ablations on vision and language modelling tasks, we demonstrate that the conventional wisdom surrounding bias correction is misleading. In particular, we demonstrate that in the optimal hyper-parameter configuration, the inclusion of bias correction leads to no improvement in final test performance. Moreover, unless appropriate learning rate scheduling is implemented, the inclusion of bias correction can sometimes be detrimental to performance. We further reinterpret bias correction as a form of implicit learning rate scheduling whose behaviour is strongly dependent on the choice of smoothing hyper-parameters $\\beta_1, \\beta_2 \\in [0,1)$. Our findings challenge the universal inclusion of this component.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20543",
        "abs_url": "https://arxiv.org/abs/2511.20543",
        "pdf_url": "https://arxiv.org/pdf/2511.20543",
        "title": "Feature-Modulated UFNO for Improved Prediction of Multiphase Flow in Porous Media",
        "authors": [
            "Alhasan Abdellatif",
            "Hannah P. Menke",
            "Ahmed H. Elsheikh",
            "Florian Doster",
            "Kamaljit Singh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The UNet-enhanced Fourier Neural Operator (UFNO) extends the Fourier Neural Operator (FNO) by incorporating a parallel UNet pathway, enabling the retention of both high- and low-frequency components. While UFNO improves predictive accuracy over FNO, it inefficiently treats scalar inputs (e.g., temperature, injection rate) as spatially distributed fields by duplicating their values across the domain. This forces the model to process redundant constant signals within the frequency domain. Additionally, its standard loss function does not account for spatial variations in error sensitivity, limiting performance in regions of high physical importance. We introduce UFNO-FiLM, an enhanced architecture that incorporates two key innovations. First, we decouple scalar inputs from spatial features using a Feature-wise Linear Modulation (FiLM) layer, allowing the model to modulate spatial feature maps without introducing constant signals into the Fourier transform. Second, we employ a spatially weighted loss function that prioritizes learning in critical regions. Our experiments on subsurface multiphase flow demonstrate a 21\\% reduction in gas saturation Mean Absolute Error (MAE) compared to UFNO, highlighting the effectiveness of our approach in improving predictive accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20564",
        "abs_url": "https://arxiv.org/abs/2511.20564",
        "pdf_url": "https://arxiv.org/pdf/2511.20564",
        "title": "E2E-GRec: An End-to-End Joint Training Framework for Graph Neural Networks and Recommender Systems",
        "authors": [
            "Rui Xue",
            "Shichao Zhu",
            "Liang Qin",
            "Guangmou Pan",
            "Yang Song",
            "Tianfu Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph Neural Networks (GNNs) have emerged as powerful tools for modeling graph-structured data and have been widely used in recommender systems, such as for capturing complex user-item and item-item relations. However, most industrial deployments adopt a two-stage pipeline: GNNs are first pre-trained offline to generate node embeddings, which are then used as static features for downstream recommender systems. This decoupled paradigm leads to two key limitations: (1) high computational overhead, since large-scale GNN inference must be repeatedly executed to refresh embeddings; and (2) lack of joint optimization, as the gradient from the recommender system cannot directly influence the GNN learning process, causing the GNN to be suboptimally informative for the recommendation task. In this paper, we propose E2E-GRec, a novel end-to-end training framework that unifies GNN training with the recommender system. Our framework is characterized by three key components: (i) efficient subgraph sampling from a large-scale cross-domain heterogeneous graph to ensure training scalability and efficiency; (ii) a Graph Feature Auto-Encoder (GFAE) serving as an auxiliary self-supervised task to guide the GNN to learn structurally meaningful embeddings; and (iii) a two-level feature fusion mechanism combined with Gradnorm-based dynamic loss balancing, which stabilizes graph-aware multi-task end-to-end training. Extensive offline evaluations, online A/B tests (e.g., a +0.133% relative improvement in stay duration, a 0.3171% reduction in the average number of videos a user skips) on large-scale production data, together with theoretical analysis, demonstrate that E2E-GRec consistently surpasses traditional approaches, yielding significant gains across multiple recommendation metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20577",
        "abs_url": "https://arxiv.org/abs/2511.20577",
        "pdf_url": "https://arxiv.org/pdf/2511.20577",
        "title": "MSTN: Fast and Efficient Multivariate Time Series Model",
        "authors": [
            "Sumit S Shevtekar",
            "Chandresh K Maurya",
            "Gourab Sil"
        ],
        "comments": "21 pages, 1 figure, 5 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Real-world time-series data is highly non stationary and complex in dynamics that operate across multiple timescales, ranging from fast, short-term changes to slow, long-term trends. Most existing models rely on fixed-scale structural priors, such as patch-based tokenization, fixed frequency transformations, or frozen backbone architectures. This often leads to over-regularization of temporal dynamics, which limits their ability to adaptively model the full spectrum of temporal variations and impairs their performance on unpredictable, Sudden, high-magnitude events. To address this, we introduce the Multi-scale Temporal Network (MSTN), a novel deep learning architecture founded on a hierarchical multi-scale and sequence modeling principle. The MSTN framework integrates: (i) a multi-scale convolutional encoder that constructs a hierarchical feature pyramid for local patterns (ii) a sequence modeling component for long-range temporal dependencies. We empirically validate this with BiLSTM and Transformer variants, establishing a flexible foundation for future architectural advancements. and (iii) a gated fusion mechanism augmented with squeeze-and-excitation (SE) and multi-head temporal attention (MHTA) for dynamic, context-aware feature integration. This design enables MSTN to adaptively model temporal patterns from milliseconds to long-range dependencies within a unified framework. Extensive evaluations across time-series long-horizon forecasting, imputation, classification and generalizability study demonstrate that MSTN achieves competitive state-of-the-art (SOTA) performance, showing improvements over contemporary approaches including EMTSF, LLM4TS, HiMTM, TIME-LLM, MTST, SOFTS, iTransformer, TimesNet, and PatchTST. In total, MSTN establishes new SOTA performance on 24 of 32 benchmark datasets, demonstrating its consistent performance across diverse temporal tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20584",
        "abs_url": "https://arxiv.org/abs/2511.20584",
        "pdf_url": "https://arxiv.org/pdf/2511.20584",
        "title": "A Tale of Two Geometries: Adaptive Optimizers and Non-Euclidean Descent",
        "authors": [
            "Shuo Xie",
            "Tianhao Wang",
            "Beining Wu",
            "Zhiyuan Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Adaptive optimizers can reduce to normalized steepest descent (NSD) when only adapting to the current gradient, suggesting a close connection between the two algorithmic families. A key distinction between their analyses, however, lies in the geometries, e.g., smoothness notions, they rely on. In the convex setting, adaptive optimizers are governed by a stronger adaptive smoothness condition, while NSD relies on the standard notion of smoothness. We extend the theory of adaptive smoothness to the nonconvex setting and show that it precisely characterizes the convergence of adaptive optimizers. Moreover, we establish that adaptive smoothness enables acceleration of adaptive optimizers with Nesterov momentum in the convex setting, a guarantee unattainable under standard smoothness for certain non-Euclidean geometry. We further develop an analogous comparison for stochastic optimization by introducing adaptive gradient variance, which parallels adaptive smoothness and leads to dimension-free convergence guarantees that cannot be achieved under standard gradient variance for certain non-Euclidean geometry.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20587",
        "abs_url": "https://arxiv.org/abs/2511.20587",
        "pdf_url": "https://arxiv.org/pdf/2511.20587",
        "title": "Anatomica: Localized Control over Geometric and Topological Properties for Anatomical Diffusion Models",
        "authors": [
            "Karim Kadry",
            "Abdallah Abdelwahed",
            "Shoaib Goraya",
            "Ajay Manicka",
            "Naravich Chutisilp",
            "Farhad Nezami",
            "Elazer Edelman"
        ],
        "comments": "8 pages, 10 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present Anatomica: an inference-time framework for generating multi-class anatomical voxel maps with localized geo-topological control. During generation, we use cuboidal control domains of varying dimensionality, location, and shape to slice out relevant substructures. These local substructures are used to compute differentiable penalty functions that steer the sample towards target constraints. We control geometric features such as size, shape, and position through voxel-wise moments, while topological features such as connected components, loops, and voids are enforced through persistent homology. Lastly, we implement Anatomica for latent diffusion models, where neural field decoders partially extract substructures, enabling the efficient control of anatomical properties. Anatomica applies flexibly across diverse anatomical systems, composing constraints to control complex structures over arbitrary dimensions and coordinate systems, thereby enabling the rational design of synthetic datasets for virtual trials or machine learning workflows.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20591",
        "abs_url": "https://arxiv.org/abs/2511.20591",
        "pdf_url": "https://arxiv.org/pdf/2511.20591",
        "title": "Attention Trajectories as a Diagnostic Axis for Deep Reinforcement Learning",
        "authors": [
            "Charlotte Beylier",
            "Hannah Selder",
            "Arthur Fleig",
            "Simon M. Hofmann",
            "Nico Scherf"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The learning process of a reinforcement learning (RL) agent remains poorly understood beyond the mathematical formulation of its learning algorithm. To address this gap, we introduce attention-oriented metrics (ATOMs) to investigate the development of an RL agent's attention during training. In a controlled experiment, we tested ATOMs on three variations of a Pong game, each designed to teach the agent distinct behaviours, complemented by a behavioural assessment. ATOMs successfully delineate the attention patterns of an agent trained on each game variation, and that these differences in attention patterns translate into differences in the agent's behaviour. Through continuous monitoring of ATOMs during training, we observed that the agent's attention developed in phases, and that these phases were consistent across game variations. Overall, we believe that ATOM could help improve our understanding of the learning processes of RL agents and better understand the relationship between attention and learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20597",
        "abs_url": "https://arxiv.org/abs/2511.20597",
        "pdf_url": "https://arxiv.org/pdf/2511.20597",
        "title": "BrowseSafe: Understanding and Preventing Prompt Injection Within AI Browser Agents",
        "authors": [
            "Kaiyuan Zhang",
            "Mark Tenenholtz",
            "Kyle Polley",
            "Jerry Ma",
            "Denis Yarats",
            "Ninghui Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Cryptography and Security (cs.CR)",
        "abstract": "The integration of artificial intelligence (AI) agents into web browsers introduces security challenges that go beyond traditional web application threat models. Prior work has identified prompt injection as a new attack vector for web agents, yet the resulting impact within real-world environments remains insufficiently understood. In this work, we examine the landscape of prompt injection attacks and synthesize a benchmark of attacks embedded in realistic HTML payloads. Our benchmark goes beyond prior work by emphasizing injections that can influence real-world actions rather than mere text outputs, and by presenting attack payloads with complexity and distractor frequency similar to what real-world agents encounter. We leverage this benchmark to conduct a comprehensive empirical evaluation of existing defenses, assessing their effectiveness across a suite of frontier AI models. We propose a multi-layered defense strategy comprising both architectural and model-based defenses to protect against evolving prompt injection attacks. Our work offers a blueprint for designing practical, secure web agents through a defense-in-depth approach.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20605",
        "abs_url": "https://arxiv.org/abs/2511.20605",
        "pdf_url": "https://arxiv.org/pdf/2511.20605",
        "title": "How to Purchase Labels? A Cost-Effective Approach Using Active Learning Markets",
        "authors": [
            "Xiwen Huang",
            "Pierre Pinson"
        ],
        "comments": "Submitted as a preprint. 34 pages, 14 figures, 4 tables",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We introduce and analyse active learning markets as a way to purchase labels, in situations where analysts aim to acquire additional data to improve model fitting, or to better train models for predictive analytics applications. This comes in contrast to the many proposals that already exist to purchase features and examples. By originally formalising the market clearing as an optimisation problem, we integrate budget constraints and improvement thresholds into the label acquisition process. We focus on a single-buyer-multiple-seller setup and propose the use of two active learning strategies (variance based and query-by-committee based), paired with distinct pricing mechanisms. They are compared to a benchmark random sampling approach. The proposed strategies are validated on real-world datasets from two critical application domains: real estate pricing and energy forecasting. Results demonstrate the robustness of our approach, consistently achieving superior performance with fewer labels acquired compared to conventional methods. Our proposal comprises an easy-to-implement practical solution for optimising data acquisition in resource-constrained environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20609",
        "abs_url": "https://arxiv.org/abs/2511.20609",
        "pdf_url": "https://arxiv.org/pdf/2511.20609",
        "title": "Adaptive Hopfield Network: Rethinking Similarities in Associative Memory",
        "authors": [
            "Shurong Wang",
            "Yuqi Pan",
            "Zhuoyang Shen",
            "Meng Zhang",
            "Hongwei Wang",
            "Guoqi Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Associative memory models are content-addressable memory systems fundamental to biological intelligence and are notable for their high interpretability. However, existing models evaluate the quality of retrieval based on proximity, which cannot guarantee that the retrieved pattern has the strongest association with the query, failing correctness. We reframe this problem by proposing that a query is a generative variant of a stored memory pattern, and define a variant distribution to model this subtle context-dependent generative process. Consequently, correct retrieval should return the memory pattern with the maximum a posteriori probability of being the query's origin. This perspective reveals that an ideal similarity measure should approximate the likelihood of each stored pattern generating the query in accordance with variant distribution, which is impossible for fixed and pre-defined similarities used by existing associative memories. To this end, we develop adaptive similarity, a novel mechanism that learns to approximate this insightful but unknown likelihood from samples drawn from context, aiming for correct retrieval. We theoretically prove that our proposed adaptive similarity achieves optimal correct retrieval under three canonical and widely applicable types of variants: noisy, masked, and biased. We integrate this mechanism into a novel adaptive Hopfield network (A-Hop), and empirical results show that it achieves state-of-the-art performance across diverse tasks, including memory retrieval, tabular classification, image classification, and multiple instance learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20612",
        "abs_url": "https://arxiv.org/abs/2511.20612",
        "pdf_url": "https://arxiv.org/pdf/2511.20612",
        "title": "Sparse-to-Field Reconstruction via Stochastic Neural Dynamic Mode Decomposition",
        "authors": [
            "Yujin Kim",
            "Sarah Dean"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Many consequential real-world systems, like wind fields and ocean currents, are dynamic and hard to model. Learning their governing dynamics remains a central challenge in scientific machine learning. Dynamic Mode Decomposition (DMD) provides a simple, data-driven approximation, but practical use is limited by sparse/noisy observations from continuous fields, reliance on linear approximations, and the lack of principled uncertainty quantification. To address these issues, we introduce Stochastic NODE-DMD, a probabilistic extension of DMD that models continuous-time, nonlinear dynamics while remaining interpretable. Our approach enables continuous spatiotemporal reconstruction at arbitrary coordinates and quantifies predictive uncertainty. Across four benchmarks, a synthetic setting and three physics-based flows, it surpasses a baseline in reconstruction accuracy when trained from only 10% observation density. It further recovers the dynamical structure by aligning learned modes and continuous-time eigenvalues with ground truth. Finally, on datasets with multiple realizations, our method learns a calibrated distribution over latent dynamics that preserves ensemble variability rather than averaging across regimes. Our code is available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20621",
        "abs_url": "https://arxiv.org/abs/2511.20621",
        "pdf_url": "https://arxiv.org/pdf/2511.20621",
        "title": "DiFR: Inference Verification Despite Nondeterminism",
        "authors": [
            "Adam Karvonen",
            "Daniel Reuter",
            "Roy Rinberg",
            "Luke Marks",
            "Adri Garriga-Alonso",
            "Keri Warr"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "As demand for LLM inference grows, it is becoming increasingly important that providers and their customers can verify that inference processes are performed correctly, without errors or tampering. However, re-running the same inference process twice often leads to different results due to benign numerical noise, making it difficult to distinguish legitimate variation from actual problems. To address this problem, we introduce Token-DiFR (Token-Divergence-From-Reference), a method for verifying inference outputs by comparing generated tokens against predictions made by a trusted reference implementation conditioned on the same random seed. Sampling seed synchronization tightly constrains valid outputs, leaving providers minimal room to deviate from correct inference, which allows output tokens themselves to serve as auditable evidence of correctness at zero additional cost to the provider. Token-DiFR reliably identifies sampling errors, simulated bugs, and model quantization, detecting 4-bit quantization with AUC $>$ 0.999 within 300 output tokens. For applications requiring sample-efficient forward-pass verification, we additionally introduce Activation-DiFR, a scheme that uses random orthogonal projections to compress activations into compact fingerprints for subsequent verification. Activation-DiFR detects 4-bit quantization with AUC $>$ 0.999 using just 2 output tokens, while reducing communication overhead by 25-75% relative to existing methods. We release an open-source integration with vLLM to accelerate practical deployment of verifiable inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20636",
        "abs_url": "https://arxiv.org/abs/2511.20636",
        "pdf_url": "https://arxiv.org/pdf/2511.20636",
        "title": "Image2Gcode: Image-to-G-code Generation for Additive Manufacturing Using Diffusion-Transformer Model",
        "authors": [
            "Ziyue Wang",
            "Yayati Jadhav",
            "Peter Pak",
            "Amir Barati Farimani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Mechanical design and manufacturing workflows conventionally begin with conceptual design, followed by the creation of a computer-aided design (CAD) model and fabrication through material-extrusion (MEX) printing. This process requires converting CAD geometry into machine-readable G-code through slicing and path planning. While each step is well established, dependence on CAD modeling remains a major bottleneck: constructing object-specific 3D geometry is slow and poorly suited to rapid prototyping. Even minor design variations typically necessitate manual updates in CAD software, making iteration time-consuming and difficult to scale. To address this limitation, we introduce Image2Gcode, an end-to-end data-driven framework that bypasses the CAD stage and generates printer-ready G-code directly from images and part drawings. Instead of relying on an explicit 3D model, a hand-drawn or captured 2D image serves as the sole input. The framework first extracts slice-wise structural cues from the image and then employs a denoising diffusion probabilistic model (DDPM) over G-code sequences. Through iterative denoising, the model transforms Gaussian noise into executable print-move trajectories with corresponding extrusion parameters, establishing a direct mapping from visual input to native toolpaths. By producing structured G-code directly from 2D imagery, Image2Gcode eliminates the need for CAD or STL intermediates, lowering the entry barrier for additive manufacturing and accelerating the design-to-fabrication cycle. This approach supports on-demand prototyping from simple sketches or visual references and integrates with upstream 2D-to-3D reconstruction modules to enable an automated pipeline from concept to physical artifact. The result is a flexible, computationally efficient framework that advances accessibility in design iteration, repair workflows, and distributed manufacturing.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19464",
        "abs_url": "https://arxiv.org/abs/2511.19464",
        "pdf_url": "https://arxiv.org/pdf/2511.19464",
        "title": "Temperature in SLMs: Impact on Incident Categorization in On-Premises Environments",
        "authors": [
            "Marcio Pohlmann",
            "Alex Severo",
            "Geft Almeida",
            "Diego Kreutz",
            "Tiago Heinrich",
            "Loureno Pereira"
        ],
        "comments": "5 pages, 3 figures, 2 tables, submitted to ERRC/WRSeg 2025",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Artificial Intelligence (cs.AI); Cryptography and Security (cs.CR); Machine Learning (cs.LG); Performance (cs.PF)",
        "abstract": "SOCs and CSIRTs face increasing pressure to automate incident categorization, yet the use of cloud-based LLMs introduces costs, latency, and confidentiality risks. We investigate whether locally executed SLMs can meet this challenge. We evaluated 21 models ranging from 1B to 20B parameters, varying the temperature hyperparameter and measuring execution time and precision across two distinct architectures. The results indicate that temperature has little influence on performance, whereas the number of parameters and GPU capacity are decisive factors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19468",
        "abs_url": "https://arxiv.org/abs/2511.19468",
        "pdf_url": "https://arxiv.org/pdf/2511.19468",
        "title": "Towards a future space-based, highly scalable AI infrastructure system design",
        "authors": [
            "Blaise Agera y Arcas",
            "Travis Beals",
            "Maria Biggs",
            "Jessica V. Bloom",
            "Thomas Fischbacher",
            "Konstantin Gromov",
            "Urs Kster",
            "Rishiraj Pravahan",
            "James Manyika"
        ],
        "comments": "19 pages, 4 figures",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "If AI is a foundational general-purpose technology, we should anticipate that demand for AI compute -- and energy -- will continue to grow. The Sun is by far the largest energy source in our solar system, and thus it warrants consideration how future AI infrastructure could most efficiently tap into that power. This work explores a scalable compute system for machine learning in space, using fleets of satellites equipped with solar arrays, inter-satellite links using free-space optics, and Google tensor processing unit (TPU) accelerator chips. To facilitate high-bandwidth, low-latency inter-satellite communication, the satellites would be flown in close proximity. We illustrate the basic approach to formation flight via a 81-satellite cluster of 1 km radius, and describe an approach for using high-precision ML-based models to control large-scale constellations. Trillium TPUs are radiation tested. They survive a total ionizing dose equivalent to a 5 year mission life without permanent failures, and are characterized for bit-flip errors. Launch costs are a critical part of overall system cost; a learning curve analysis suggests launch to low-Earth orbit (LEO) may reach $\\lesssim$\\$200/kg by the mid-2030s.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19478",
        "abs_url": "https://arxiv.org/abs/2511.19478",
        "pdf_url": "https://arxiv.org/pdf/2511.19478",
        "title": "A Multi-Stage Deep Learning Framework with PKCP-MixUp Augmentation for Pediatric Liver Tumor Diagnosis Using Multi-Phase Contrast-Enhanced CT",
        "authors": [
            "Wanqi Wang",
            "Chun Yang",
            "Jianbo Shao",
            "Yaokai Zhang",
            "Xuehua Peng",
            "Jin Sun",
            "Chao Xiong",
            "Long Lu",
            "Lianting Hu"
        ],
        "comments": "",
        "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Pediatric liver tumors are one of the most common solid tumors in pediatrics, with differentiation of benign or malignant status and pathological classification critical for clinical treatment. While pathological examination is the gold standard, the invasive biopsy has notable limitations: the highly vascular pediatric liver and fragile tumor tissue raise complication risks such as bleeding; additionally, young children with poor compliance require anesthesia for biopsy, increasing medical costs or psychological trauma. Although many efforts have been made to utilize AI in clinical settings, most researchers have overlooked its importance in pediatric liver tumors. To establish a non-invasive examination procedure, we developed a multi-stage deep learning (DL) framework for automated pediatric liver tumor diagnosis using multi-phase contrast-enhanced CT. Two retrospective and prospective cohorts were enrolled. We established a novel PKCP-MixUp data augmentation method to address data scarcity and class imbalance. We also trained a tumor detection model to extract ROIs, and then set a two-stage diagnosis pipeline with three backbones with ROI-masked images. Our tumor detection model has achieved high performance (mAP=0.871), and the first stage classification model between benign and malignant tumors reached an excellent performance (AUC=0.989). Final diagnosis models also exhibited robustness, including benign subtype classification (AUC=0.915) and malignant subtype classification (AUC=0.979). We also conducted multi-level comparative analyses, such as ablation studies on data and training pipelines, as well as Shapley-Value and CAM interpretability analyses. This framework fills the pediatric-specific DL diagnostic gap, provides actionable insights for CT phase selection and model design, and paves the way for precise, accessible pediatric liver tumor diagnosis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19479",
        "abs_url": "https://arxiv.org/abs/2511.19479",
        "pdf_url": "https://arxiv.org/pdf/2511.19479",
        "title": "Federated Learning Framework for Scalable AI in Heterogeneous HPC and Cloud Environments",
        "authors": [
            "Sangam Ghimire",
            "Paribartan Timalsina",
            "Nirjal Bhurtel",
            "Bishal Neupane",
            "Bigyan Byanju Shrestha",
            "Subarna Bhattarai",
            "Prajwal Gaire",
            "Jessica Thapa",
            "Sudan Jha"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "As the demand grows for scalable and privacy-aware AI systems, Federated Learning (FL) has emerged as a promising solution, allowing decentralized model training without moving raw data. At the same time, the combination of high- performance computing (HPC) and cloud infrastructure offers vast computing power but introduces new complexities, especially when dealing with heteroge- neous hardware, communication limits, and non-uniform data. In this work, we present a federated learning framework built to run efficiently across mixed HPC and cloud environments. Our system addresses key challenges such as system het- erogeneity, communication overhead, and resource scheduling, while maintaining model accuracy and data privacy. Through experiments on a hybrid testbed, we demonstrate strong performance in terms of scalability, fault tolerance, and convergence, even under non-Independent and Identically Distributed (non-IID) data distributions and varied hardware. These results highlight the potential of federated learning as a practical approach to building scalable Artificial Intelligence (AI) systems in modern, distributed computing settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19484",
        "abs_url": "https://arxiv.org/abs/2511.19484",
        "pdf_url": "https://arxiv.org/pdf/2511.19484",
        "title": "stable-pretraining-v1: Foundation Model Research Made Simple",
        "authors": [
            "Randall Balestriero",
            "Hugues Van Assel",
            "Sami BuGhanem",
            "Lucas Maes"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Foundation models and self-supervised learning (SSL) have become central to modern AI, yet research in this area remains hindered by complex codebases, redundant re-implementations, and the heavy engineering burden of scaling experiments. We present stable-pretraining, a modular, extensible, and performance-optimized library built on top of PyTorch, Lightning, Hugging Face, and TorchMetrics. Unlike prior toolkits focused narrowly on reproducing state-of-the-art results, stable-pretraining is designed for flexibility and iteration speed: it unifies essential SSL utilities--including probes, collapse detection metrics, augmentation pipelines, and extensible evaluation routines--within a coherent and reliable framework. A central design principle is logging everything, enabling fine-grained visibility into training dynamics that makes debugging, monitoring, and reproducibility seamless. We validate the library by demonstrating its ability to generate new research insights with minimal overhead, including depthwise representation probing and the analysis of CLIP degradation under synthetic data finetuning. By lowering barriers to entry while remaining scalable to large experiments, stable-pretraining aims to accelerate discovery and expand the possibilities of foundation model research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19500",
        "abs_url": "https://arxiv.org/abs/2511.19500",
        "pdf_url": "https://arxiv.org/pdf/2511.19500",
        "title": "CycleChemist: A Dual-Pronged Machine Learning Framework for Organic Photovoltaic Discovery",
        "authors": [
            "Hou Hei Lam",
            "Jiangjie Qiu",
            "Xiuyuan Hu",
            "Wentao Li",
            "Fankun Zeng",
            "Siwei Fu",
            "Hao Zhang",
            "Xiaonan Wang"
        ],
        "comments": "",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Organic photovoltaic (OPV) materials offer a promising path toward sustainable energy generation, but their development is limited by the difficulty of identifying high performance donor and acceptor pairs with strong power conversion efficiencies (PCEs). Existing design strategies typically focus on either the donor or the acceptor alone, rather than using a unified approach capable of modeling both components. In this work, we introduce a dual machine learning framework for OPV discovery that combines predictive modeling with generative molecular design. We present the Organic Photovoltaic Donor Acceptor Dataset (OPV2D), the largest curated dataset of its kind, containing 2000 experimentally characterized donor acceptor pairs. Using this dataset, we develop the Organic Photovoltaic Classifier (OPVC) to predict whether a material exhibits OPV behavior, and a hierarchical graph neural network that incorporates multi task learning and donor acceptor interaction modeling. This framework includes the Molecular Orbital Energy Estimator (MOE2) for predicting HOMO and LUMO energy levels, and the Photovoltaic Performance Predictor (P3) for estimating PCE. In addition, we introduce the Material Generative Pretrained Transformer (MatGPT) to produce synthetically accessible organic semiconductors, guided by a reinforcement learning strategy with three objective policy optimization. By linking molecular representation learning with performance prediction, our framework advances data driven discovery of high performance OPV materials.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19519",
        "abs_url": "https://arxiv.org/abs/2511.19519",
        "pdf_url": "https://arxiv.org/pdf/2511.19519",
        "title": "Blinking Beyond EAR: A Stable Eyelid Angle Metric for Driver Drowsiness Detection and Data Augmentation",
        "authors": [
            "Mathis Wolter",
            "Julie Stephany Berrio Perez",
            "Mao Shan"
        ],
        "comments": "8 pages, 5 figures, 3 tables",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Image and Video Processing (eess.IV)",
        "abstract": "Detecting driver drowsiness reliably is crucial for enhancing road safety and supporting advanced driver assistance systems (ADAS). We introduce the Eyelid Angle (ELA), a novel, reproducible metric of eye openness derived from 3D facial landmarks. Unlike conventional binary eye state estimators or 2D measures, such as the Eye Aspect Ratio (EAR), the ELA provides a stable geometric description of eyelid motion that is robust to variations in camera angle. Using the ELA, we design a blink detection framework that extracts temporal characteristics, including the closing, closed, and reopening durations, which are shown to correlate with drowsiness levels. To address the scarcity and risk of collecting natural drowsiness data, we further leverage ELA signals to animate rigged avatars in Blender 3D, enabling the creation of realistic synthetic datasets with controllable noise, camera viewpoints, and blink dynamics. Experimental results in public driver monitoring datasets demonstrate that the ELA offers lower variance under viewpoint changes compared to EAR and achieves accurate blink detection. At the same time, synthetic augmentation expands the diversity of training data for drowsiness recognition. Our findings highlight the ELA as both a reliable biometric measure and a powerful tool for generating scalable datasets in driver state monitoring.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19535",
        "abs_url": "https://arxiv.org/abs/2511.19535",
        "pdf_url": "https://arxiv.org/pdf/2511.19535",
        "title": "Masked Autoencoder Joint Learning for Robust Spitzoid Tumor Classification",
        "authors": [
            "Iln Carretero",
            "Roshni Mahtani",
            "Silvia Perez-Deben",
            "Jos Francisco Gonzlez-Muoz",
            "Carlos Monteagudo",
            "Valery Naranjo",
            "Roco del Amor"
        ],
        "comments": "Accepted in CASEIB 2025",
        "subjects": "Quantitative Methods (q-bio.QM); Machine Learning (cs.LG)",
        "abstract": "Accurate diagnosis of spitzoid tumors (ST) is critical to ensure a favorable prognosis and to avoid both under- and over-treatment. Epigenetic data, particularly DNA methylation, provide a valuable source of information for this task. However, prior studies assume complete data, an unrealistic setting as methylation profiles frequently contain missing entries due to limited coverage and experimental artifacts. Our work challenges these favorable scenarios and introduces ReMAC, an extension of ReMasker designed to tackle classification tasks on high-dimensional data under complete and incomplete regimes. Evaluation on real clinical data demonstrates that ReMAC achieves strong and robust performance compared to competing classification methods in the stratification of ST. Code is available: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19557",
        "abs_url": "https://arxiv.org/abs/2511.19557",
        "pdf_url": "https://arxiv.org/pdf/2511.19557",
        "title": "Think First, Assign Next (ThiFAN-VQA): A Two-stage Chain-of-Thought Framework for Post-Disaster Damage Assessment",
        "authors": [
            "Ehsan Karimi",
            "Nhut Le",
            "Maryam Rahnemoonfar"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Timely and accurate assessment of damages following natural disasters is essential for effective emergency response and recovery. Recent AI-based frameworks have been developed to analyze large volumes of aerial imagery collected by Unmanned Aerial Vehicles, providing actionable insights rapidly. However, creating and annotating data for training these models is costly and time-consuming, resulting in datasets that are limited in size and diversity. Furthermore, most existing approaches rely on traditional classification-based frameworks with fixed answer spaces, restricting their ability to provide new information without additional data collection or model retraining. Using pre-trained generative models built on in-context learning (ICL) allows for flexible and open-ended answer spaces. However, these models often generate hallucinated outputs or produce generic responses that lack domain-specific relevance. To address these limitations, we propose ThiFAN-VQA, a two-stage reasoning-based framework for visual question answering (VQA) in disaster scenarios. ThiFAN-VQA first generates structured reasoning traces using chain-of-thought (CoT) prompting and ICL to enable interpretable reasoning under limited supervision. A subsequent answer selection module evaluates the generated responses and assigns the most coherent and contextually accurate answer, effectively improve the model performance. By integrating a custom information retrieval system, domain-specific prompting, and reasoning-guided answer selection, ThiFAN-VQA bridges the gap between zero-shot and supervised methods, combining flexibility with consistency. Experiments on FloodNet and RescueNet-VQA, UAV-based datasets from flood- and hurricane-affected regions, demonstrate that ThiFAN-VQA achieves superior accuracy, interpretability, and adaptability for real-world post-disaster damage assessment tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19628",
        "abs_url": "https://arxiv.org/abs/2511.19628",
        "pdf_url": "https://arxiv.org/pdf/2511.19628",
        "title": "Optimization and Regularization Under Arbitrary Objectives",
        "authors": [
            "Jared N. Lakhani",
            "Etienne Pienaar"
        ],
        "comments": "46 pages, 28 figures, 16 tables",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Computation (stat.CO)",
        "abstract": "This study investigates the limitations of applying Markov Chain Monte Carlo (MCMC) methods to arbitrary objective functions, focusing on a two-block MCMC framework which alternates between Metropolis-Hastings and Gibbs sampling. While such approaches are often considered advantageous for enabling data-driven regularization, we show that their performance critically depends on the sharpness of the employed likelihood form. By introducing a sharpness parameter and exploring alternative likelihood formulations proportional to the target objective function, we demonstrate how likelihood curvature governs both in-sample performance and the degree of regularization inferred by the training data. Empirical applications are conducted on reinforcement learning tasks: including a navigation problem and the game of tic-tac-toe. The study concludes with a separate analysis examining the implications of extreme likelihood sharpness on arbitrary objective functions stemming from the classic game of blackjack, where the first block of the two-block MCMC framework is replaced with an iterative optimization step. The resulting hybrid approach achieves performance nearly identical to the original MCMC framework, indicating that excessive likelihood sharpness effectively collapses posterior mass onto a single dominant mode.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19635",
        "abs_url": "https://arxiv.org/abs/2511.19635",
        "pdf_url": "https://arxiv.org/pdf/2511.19635",
        "title": "Agint: Agentic Graph Compilation for Software Engineering Agents",
        "authors": [
            "Abhi Chivukula",
            "Jay Somasundaram",
            "Vijay Somasundaram"
        ],
        "comments": "18 pages, 5 figures, NeurIPS 2025: Deep Learning for Code in the Agentic Era",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "LLM-based coding agents are increasingly common but still face challenges in context management, latency, reliability, reproducibility, and scalability. We present Agint, an agentic graph compiler, interpreter, and runtime that incrementally and hierarchically converts natural-language instructions into typed, effect-aware code DAGs. Agint introduces explicit type floors (text to data to spec to code) grounded in semantic graph transformations and a hybrid LLM and function-based JIT runtime. This enables dynamic graph refinement, reproducible and optimizable execution, speculative evaluation, and interoperability with existing developer tools. Agint's typed graph bindings improve reliability and allow concurrent composition of concurrent codebases by construction, supporting accelerated development with smaller and faster models, lower latency, efficient context utilization, and higher throughput. Hierarchical compilation allows scalable graph edits, while the graph structure supports reproducibility and efficient parallel generation. Agint provides a composable unix-style toolchain: dagify (DAG compiler), dagent (hybrid JIT runtime), schemagin (schema generator), and datagin (data transformer) for realtime, low-latency code and dataflow creation. Human developers and coding agents refine graphs through the Agint CLI, while non-technical users use Agint Flow GUI for visual editing, conversational refinement, and debugging to promote prototype agentic workflows to production code. This continuous co-creation model allows teams to prototype quickly, refine seamlessly, and deploy reliably, bridging natural language, compiler methods, and developer tooling to enable a new generation of composable, team-centric coding agents at scale.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19703",
        "abs_url": "https://arxiv.org/abs/2511.19703",
        "pdf_url": "https://arxiv.org/pdf/2511.19703",
        "title": "The Alexander-Hirschowitz theorem for neurovarieties",
        "authors": [
            "A. Massarenti",
            "M. Mella"
        ],
        "comments": "21 pages",
        "subjects": "Algebraic Geometry (math.AG); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Commutative Algebra (math.AC)",
        "abstract": "We study neurovarieties for polynomial neural networks and fully characterize when they attain the expected dimension in the single-output case. As consequences, we establish non-defectiveness and global identifiability for multi-output architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19716",
        "abs_url": "https://arxiv.org/abs/2511.19716",
        "pdf_url": "https://arxiv.org/pdf/2511.19716",
        "title": "Designing Preconditioners for SGD: Local Conditioning, Noise Floors, and Basin Stability",
        "authors": [
            "Mitchell Scott",
            "Tianshi Xu",
            "Ziyuan Tang",
            "Alexandra Pichette-Emmons",
            "Qiang Ye",
            "Yousef Saad",
            "Yuanzhe Xi"
        ],
        "comments": "31 pages, 11 Figures",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "Stochastic Gradient Descent (SGD) often slows in the late stage of training due to anisotropic curvature and gradient noise. We analyze preconditioned SGD in the geometry induced by a symmetric positive definite matrix $\\mathbf{M}$, deriving bounds in which both the convergence rate and the stochastic noise floor are governed by $\\mathbf{M}$-dependent quantities: the rate through an effective condition number in the $\\mathbf{M}$-metric, and the floor through the product of that condition number and the preconditioned noise level. For nonconvex objectives, we establish a preconditioner-dependent basin-stability guarantee: when smoothness and basin size are measured in the $\\mathbf{M}$-norm, the probability that the iterates remain in a well-behaved local region admits an explicit lower bound. This perspective is particularly relevant in Scientific Machine Learning (SciML), where achieving small training loss under stochastic updates is closely tied to physical fidelity, numerical stability, and constraint satisfaction. The framework applies to both diagonal/adaptive and curvature-aware preconditioners and yields a simple design principle: choose $\\mathbf{M}$ to improve local conditioning while attenuating noise. Experiments on a quadratic diagnostic and three SciML benchmarks validate the predicted rate-floor behavior.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19717",
        "abs_url": "https://arxiv.org/abs/2511.19717",
        "pdf_url": "https://arxiv.org/pdf/2511.19717",
        "title": "Large Scale Community-Aware Network Generation",
        "authors": [
            "Vikram Ramavarapu",
            "Joo Alfredo Cardoso Lamy",
            "Mohammad Dindoost",
            "David A. Bader"
        ],
        "comments": "22 pages, 10 figures, code made available at this https URL",
        "subjects": "Social and Information Networks (cs.SI); Machine Learning (cs.LG)",
        "abstract": "Community detection, or network clustering, is used to identify latent community structure in networks. Due to the scarcity of labeled ground truth in real-world networks, evaluating these algorithms poses significant challenges. To address this, researchers use synthetic network generators that produce networks with ground-truth community labels. RECCS is one such algorithm that takes a network and its clustering as input and generates a synthetic network through a modular pipeline. Each generated ground truth cluster preserves key characteristics of the corresponding input cluster, including connectivity, minimum degree, and degree sequence distribution. The output consists of a synthetically generated network, and disjoint ground truth cluster labels for all nodes. In this paper, we present two enhanced versions: RECCS+ and RECCS++. RECCS+ maintains algorithmic fidelity to the original RECCS while introducing parallelization through an orchestrator that coordinates algorithmic components across multiple processes and employs multithreading. RECCS++ builds upon this foundation with additional algorithmic optimizations to achieve further speedup. Our experimental results demonstrate that RECCS+ and RECCS++ achieve speedups of up to 49x and 139x respectively on our benchmark datasets, with RECCS++'s additional performance gains involving a modest accuracy tradeoff. With this newfound performance, RECCS++ can now scale to networks with over 100 million nodes and nearly 2 billion edges.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19722",
        "abs_url": "https://arxiv.org/abs/2511.19722",
        "pdf_url": "https://arxiv.org/pdf/2511.19722",
        "title": "Individual and group fairness in geographical partitioning",
        "authors": [
            "Ilya O. Ryzhov",
            "John Gunnar Carlsson",
            "Yinchu Zhu"
        ],
        "comments": "",
        "subjects": "Econometrics (econ.EM); Machine Learning (cs.LG)",
        "abstract": "Socioeconomic segregation often arises in school districting and other contexts, causing some groups to be over- or under-represented within a particular district. This phenomenon is closely linked with disparities in opportunities and outcomes. We formulate a new class of geographical partitioning problems in which the population is heterogeneous, and it is necessary to ensure fair representation for each group at each facility. We prove that the optimal solution is a novel generalization of the additively weighted Voronoi diagram, and we propose a simple and efficient algorithm to compute it, thus resolving an open question dating back to Dvoretzky et al. (1951). The efficacy and potential for practical insight of the approach are demonstrated in a realistic case study involving seven demographic groups and $78$ district offices.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19735",
        "abs_url": "https://arxiv.org/abs/2511.19735",
        "pdf_url": "https://arxiv.org/pdf/2511.19735",
        "title": "Integrating RCTs, RWD, AI/ML and Statistics: Next-Generation Evidence Synthesis",
        "authors": [
            "Shu Yang",
            "Margaret Gamalo",
            "Haoda Fu"
        ],
        "comments": "",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG)",
        "abstract": "Randomized controlled trials (RCTs) have been the cornerstone of clinical evidence; however, their cost, duration, and restrictive eligibility criteria limit power and external validity. Studies using real-world data (RWD), historically considered less reliable for establishing causality, are now recognized to be important for generating real-world evidence (RWE). In parallel, artificial intelligence and machine learning (AI/ML) are being increasingly used throughout the drug development process, providing scalability and flexibility but also presenting challenges in interpretability and rigor that traditional statistics do not face. This Perspective argues that the future of evidence generation will not depend on RCTs versus RWD, or statistics versus AI/ML, but on their principled integration. To this end, a causal roadmap is needed to clarify inferential goals, make assumptions explicit, and ensure transparency about tradeoffs. We highlight key objectives of integrative evidence synthesis, including transporting RCT results to broader populations, embedding AI-assisted analyses within RCTs, designing hybrid controlled trials, and extending short-term RCTs with long-term RWD. We also outline future directions in privacy-preserving analytics, uncertainty quantification, and small-sample methods. By uniting statistical rigor with AI/ML innovation, integrative approaches can produce robust, transparent, and policy-relevant evidence, making them a key component of modern regulatory science.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19739",
        "abs_url": "https://arxiv.org/abs/2511.19739",
        "pdf_url": "https://arxiv.org/pdf/2511.19739",
        "title": "Comparative Analysis of LoRA-Adapted Embedding Models for Clinical Cardiology Text Representation",
        "authors": [
            "Richard J. Young",
            "Alice M. Matthews"
        ],
        "comments": "25 pages, 13 figures, 5 tables",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Domain-specific text embeddings are critical for clinical natural language processing, yet systematic comparisons across model architectures remain limited. This study evaluates ten transformer-based embedding models adapted for cardiology through Low-Rank Adaptation (LoRA) fine-tuning on 106,535 cardiology text pairs derived from authoritative medical textbooks. Results demonstrate that encoder-only architectures, particularly BioLinkBERT, achieve superior domain-specific performance (separation score: 0.510) compared to larger decoder-based models, while requiring significantly fewer computational resources. The findings challenge the assumption that larger language models necessarily produce better domain-specific embeddings and provide practical guidance for clinical NLP system development. All models, training code, and evaluation datasets are publicly available to support reproducible research in medical informatics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19740",
        "abs_url": "https://arxiv.org/abs/2511.19740",
        "pdf_url": "https://arxiv.org/pdf/2511.19740",
        "title": "CAMformer: Associative Memory is All You Need",
        "authors": [
            "Tergel Molom-Ochir",
            "Benjamin F. Morris",
            "Mark Horton",
            "Chiyue Wei",
            "Cong Guo",
            "Brady Taylor",
            "Peter Liu",
            "Shan X. Wang",
            "Deliang Fan",
            "Hai Helen Li",
            "Yiran Chen"
        ],
        "comments": "7 pages, 10 figures",
        "subjects": "Hardware Architecture (cs.AR); Machine Learning (cs.LG)",
        "abstract": "Transformers face scalability challenges due to the quadratic cost of attention, which involves dense similarity computations between queries and keys. We propose CAMformer, a novel accelerator that reinterprets attention as an associative memory operation and computes attention scores using a voltage-domain Binary Attention Content Addressable Memory (BA-CAM). This enables constant-time similarity search through analog charge sharing, replacing digital arithmetic with physical similarity sensing. CAMformer integrates hierarchical two-stage top-k filtering, pipelined execution, and high-precision contextualization to achieve both algorithmic accuracy and architectural efficiency. Evaluated on BERT and Vision Transformer workloads, CAMformer achieves over 10x energy efficiency, up to 4x higher throughput, and 6-8x lower area compared to state-of-the-art accelerators--while maintaining near-lossless accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19755",
        "abs_url": "https://arxiv.org/abs/2511.19755",
        "pdf_url": "https://arxiv.org/pdf/2511.19755",
        "title": "Clustering Approaches for Mixed-Type Data: A Comparative Study",
        "authors": [
            "Badih Ghattas",
            "Alvaro Sanchez San-Benito"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Applications (stat.AP); Methodology (stat.ME)",
        "abstract": "Clustering is widely used in unsupervised learning to find homogeneous groups of observations within a dataset. However, clustering mixed-type data remains a challenge, as few existing approaches are suited for this task. This study presents the state-of-the-art of these approaches and compares them using various simulation models. The compared methods include the distance-based approaches k-prototypes, PDQ, and convex k-means, and the probabilistic methods KAy-means for MIxed LArge data (KAMILA), the mixture of Bayesian networks (MBNs), and latent class model (LCM). The aim is to provide insights into the behavior of different methods across a wide range of scenarios by varying some experimental factors such as the number of clusters, cluster overlap, sample size, dimension, proportion of continuous variables in the dataset, and clusters' distribution. The degree of cluster overlap and the proportion of continuous variables in the dataset and the sample size have a significant impact on the observed performances. When strong interactions exist between variables alongside an explicit dependence on cluster membership, none of the evaluated methods demonstrated satisfactory performance. In our experiments KAMILA, LCM, and k-prototypes exhibited the best performance, with respect to the adjusted rand index (ARI). All the methods are available in R.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19805",
        "abs_url": "https://arxiv.org/abs/2511.19805",
        "pdf_url": "https://arxiv.org/pdf/2511.19805",
        "title": "Latent-space metrics for Complex-Valued VAE out-of-distribution detection under radar clutter",
        "authors": [
            "Y. A. Rouzoumka",
            "E. Terreaux",
            "C. Morisseau",
            "J.-P. Ovarlez",
            "C. Ren"
        ],
        "comments": "Under review at ICASSP 2026",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We investigate complex-valued Variational AutoEncoders (CVAE) for radar Out-Of-Distribution (OOD) detection in complex radar environments. We proposed several detection metrics: the reconstruction error of CVAE (CVAE-MSE), the latent-based scores (Mahalanobis, Kullback-Leibler divergence (KLD)), and compared their performance against the classical ANMF-Tyler detector (ANMF-FP). The performance of all these detectors is analyzed on synthetic and experimental radar data, showing the advantages and the weaknesses of each detector.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 113,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19820",
        "abs_url": "https://arxiv.org/abs/2511.19820",
        "pdf_url": "https://arxiv.org/pdf/2511.19820",
        "title": "CropVLM: Learning to Zoom for Fine-Grained Vision-Language Perception",
        "authors": [
            "Miguel Carvalho",
            "Helder Dias",
            "Bruno Martins"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Vision-Language Models (VLMs) often struggle with tasks that require fine-grained image understanding, such as scene-text recognition or document analysis, due to perception limitations and visual fragmentation. To address these challenges, we introduce CropVLM as an external low-cost method for boosting performance, enabling VLMs to dynamically ''zoom in'' on relevant image regions, enhancing their ability to capture fine details. CropVLM is trained using reinforcement learning, without using human-labeled bounding boxes as a supervision signal, and without expensive synthetic evaluations. The model is trained once and can be paired with both open-source and proprietary VLMs to improve their performance. Our approach delivers significant improvements on tasks that require high-resolution image understanding, notably for benchmarks that are out-of-domain for the target VLM, without modifying or fine-tuning the VLM, thus avoiding catastrophic forgetting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 114,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19874",
        "abs_url": "https://arxiv.org/abs/2511.19874",
        "pdf_url": "https://arxiv.org/pdf/2511.19874",
        "title": "Cross-LLM Generalization of Behavioral Backdoor Detection in AI Agent Supply Chains",
        "authors": [
            "Arun Chowdary Sanna"
        ],
        "comments": "10 pages, 2 figures, 8 tables. Evaluation across 6 production LLMs with 1,198 traces",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "As AI agents become integral to enterprise workflows, their reliance on shared tool libraries and pre-trained components creates significant supply chain vulnerabilities. While previous work has demonstrated behavioral backdoor detection within individual LLM architectures, the critical question of cross-LLM generalization remains unexplored, a gap with serious implications for organizations deploying multiple AI systems. We present the first systematic study of cross-LLM behavioral backdoor detection, evaluating generalization across six production LLMs (GPT-5.1, Claude Sonnet 4.5, Grok 4.1, Llama 4 Maverick, GPT-OSS 120B, and DeepSeek Chat V3.1). Through 1,198 execution traces and 36 cross-model experiments, we quantify a critical finding: single-model detectors achieve 92.7% accuracy within their training distribution but only 49.2% across different LLMs, a 43.4 percentage point generalization gap equivalent to random guessing. Our analysis reveals that this gap stems from model-specific behavioral signatures, particularly in temporal features (coefficient of variation > 0.8), while structural features remain stable across architectures. We show that model-aware detection incorporating model identity as an additional feature achieves 90.6% accuracy universally across all evaluated models. We release our multi-LLM trace dataset and detection framework to enable reproducible research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 115,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19878",
        "abs_url": "https://arxiv.org/abs/2511.19878",
        "pdf_url": "https://arxiv.org/pdf/2511.19878",
        "title": "MAPS: Preserving Vision-Language Representations via Module-Wise Proximity Scheduling for Better Vision-Language-Action Generalization",
        "authors": [
            "Chengyue Huang",
            "Mellon M. Zhang",
            "Robert Azarcon",
            "Glen Chou",
            "Zsolt Kira"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "Vision-Language-Action (VLA) models inherit strong priors from pretrained Vision-Language Models (VLMs), but naive fine-tuning often disrupts these representations and harms generalization. Existing fixes -- freezing modules or applying uniform regularization -- either overconstrain adaptation or ignore the differing roles of VLA components. We present MAPS (Module-Wise Proximity Scheduling), the first robust fine-tuning framework for VLAs. Through systematic analysis, we uncover an empirical order in which proximity constraints should be relaxed to balance stability and flexibility. MAPS linearly schedules this relaxation, enabling visual encoders to stay close to their pretrained priors while action-oriented language layers adapt more freely. MAPS introduces no additional parameters or data, and can be seamlessly integrated into existing VLAs. Across MiniVLA-VQ, MiniVLA-OFT, OpenVLA-OFT, and challenging benchmarks such as SimplerEnv, CALVIN, LIBERO, as well as real-world evaluations on the Franka Emika Panda platform, MAPS consistently boosts both in-distribution and out-of-distribution performance (up to +30%). Our findings highlight empirically guided proximity to pretrained VLMs as a simple yet powerful principle for preserving broad generalization in VLM-to-VLA transfer.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 116,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19879",
        "abs_url": "https://arxiv.org/abs/2511.19879",
        "pdf_url": "https://arxiv.org/pdf/2511.19879",
        "title": "Learning Degenerate Manifolds of Frustrated Magnets with Boltzmann Machines",
        "authors": [
            "Jackson C. Glass",
            "Gia-Wei Chern"
        ],
        "comments": "12 pages, 10 figures",
        "subjects": "Strongly Correlated Electrons (cond-mat.str-el); Statistical Mechanics (cond-mat.stat-mech); Machine Learning (cs.LG)",
        "abstract": "We show that Restricted Boltzmann Machines (RBMs) provide a flexible generative framework for modeling spin configurations in disordered yet strongly correlated phases of frustrated magnets. As a benchmark, we first demonstrate that an RBM can learn the zero-temperature ground-state manifold of the one-dimensional ANNNI model at its multiphase point, accurately reproducing its characteristic oscillatory and exponentially decaying correlations. We then apply RBMs to kagome spin ice and show that they successfully learn the local ice rules and short-range correlations of the extensively degenerate ice-I manifold. Correlation functions computed from RBM-generated configurations closely match those from direct Monte Carlo simulations. For the partially ordered ice-II phase -- featuring long-range charge order and broken time-reversal symmetry -- accurate modeling requires RBMs with uniform-sign bias fields, mirroring the underlying symmetry breaking. These results highlight the utility of RBMs as generative models for learning constrained and highly frustrated magnetic states.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 117,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19885",
        "abs_url": "https://arxiv.org/abs/2511.19885",
        "pdf_url": "https://arxiv.org/pdf/2511.19885",
        "title": "Complex Instruction Following with Diverse Style Policies in Football Games",
        "authors": [
            "Chenglu Sun",
            "Shuo Shen",
            "Haonan Hu",
            "Wei Zhou",
            "Chen Chen"
        ],
        "comments": "21 pages, 13 figures, accepted by AAAI2026",
        "subjects": "Multiagent Systems (cs.MA); Machine Learning (cs.LG)",
        "abstract": "Despite advancements in language-controlled reinforcement learning (LC-RL) for basic domains and straightforward commands (e.g., object manipulation and navigation), effectively extending LC-RL to comprehend and execute high-level or abstract instructions in complex, multi-agent environments, such as football games, remains a significant challenge. To address this gap, we introduce Language-Controlled Diverse Style Policies (LCDSP), a novel LC-RL paradigm specifically designed for complex scenarios. LCDSP comprises two key components: a Diverse Style Training (DST) method and a Style Interpreter (SI). The DST method efficiently trains a single policy capable of exhibiting a wide range of diverse behaviors by modulating agent actions through style parameters (SP). The SI is designed to accurately and rapidly translate high-level language instructions into these corresponding SP. Through extensive experiments in a complex 5v5 football environment, we demonstrate that LCDSP effectively comprehends abstract tactical instructions and accurately executes the desired diverse behavioral styles, showcasing its potential for complex, real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 118,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.19930",
        "abs_url": "https://arxiv.org/abs/2511.19930",
        "pdf_url": "https://arxiv.org/pdf/2511.19930",
        "title": "Designing Reputation Systems for Manufacturing Data Trading Markets: A Multi-Agent Evaluation with Q-Learning and IRL-Estimated Utilities",
        "authors": [
            "Kenta Yamamoto",
            "Teruaki Hayashi"
        ],
        "comments": "10 pages, 10 figures",
        "subjects": "Computer Science and Game Theory (cs.GT); Computers and Society (cs.CY); Machine Learning (cs.LG)",
        "abstract": "Recent advances in machine learning and big data analytics have intensified the demand for high-quality cross-domain datasets and accelerated the growth of data trading across organizations. As data become increasingly recognized as an economic asset, data marketplaces have emerged as a key infrastructure for data-driven innovation. However, unlike mature product or service markets, data-trading environments remain nascent and suffer from pronounced information asymmetry. Buyers cannot verify the content or quality before purchasing data, making trust and quality assurance central challenges. To address these issues, this study develops a multi-agent data-market simulator that models participant behavior and evaluates the institutional mechanisms for trust formation. Focusing on the manufacturing sector, where initiatives such as GAIA-X and Catena-X are advancing, the simulator integrates reinforcement learning (RL) for adaptive agent behavior and inverse reinforcement learning (IRL) to estimate utility functions from empirical behavioral data. Using the simulator, we examine the market-level effects of five representative reputation systems-Time-decay, Bayesian-beta, PageRank, PowerTrust, and PeerTrust-and found that PeerTrust achieved the strongest alignment between data price and quality, while preventing monopolistic dominance. Building on these results, we develop a hybrid reputation mechanism that integrates the strengths of existing systems to achieve improved price-quality consistency and overall market stability. This study extends simulation-based data-market analysis by incorporating trust and reputation as endogenous mechanisms and offering methodological and institutional insights into the design of reliable and efficient data ecosystems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 119,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20038",
        "abs_url": "https://arxiv.org/abs/2511.20038",
        "pdf_url": "https://arxiv.org/pdf/2511.20038",
        "title": "Softmax Transformers are Turing-Complete",
        "authors": [
            "Hongjian Jiang",
            "Michael Hahn",
            "Georg Zetzsche",
            "Anthony Widjaja Lin"
        ],
        "comments": "",
        "subjects": "Formal Languages and Automata Theory (cs.FL); Machine Learning (cs.LG); Logic in Computer Science (cs.LO)",
        "abstract": "Hard attention Chain-of-Thought (CoT) transformers are known to be Turing-complete. However, it is an open problem whether softmax attention Chain-of-Thought (CoT) transformers are Turing-complete. In this paper, we prove a stronger result that length-generalizable softmax CoT transformers are Turing-complete. More precisely, our Turing-completeness proof goes via the CoT extension of the Counting RASP (C-RASP), which correspond to softmax CoT transformers that admit length generalization. We prove Turing-completeness for CoT C-RASP with causal masking over a unary alphabet (more generally, for letter-bounded languages). While we show this is not Turing-complete for arbitrary languages, we prove that its extension with relative positional encoding is Turing-complete for arbitrary languages. We empirically validate our theory by training transformers for languages requiring complex (non-linear) arithmetic reasoning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 120,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20048",
        "abs_url": "https://arxiv.org/abs/2511.20048",
        "pdf_url": "https://arxiv.org/pdf/2511.20048",
        "title": "Reducing Latency of LLM Search Agent via Speculation-based Algorithm-System Co-Design",
        "authors": [
            "Zixiao Huang",
            "Wen Zeng",
            "Tianyu Fu",
            "Tengxuan Liu",
            "Yizhou Sun",
            "Ke Hong",
            "Xinhao Yang",
            "Chengchun Liu",
            "Yan Li",
            "Quanlu Zhang",
            "Guohao Dai",
            "Zhenhua Zhu",
            "Yu Wang"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Performance (cs.PF)",
        "abstract": "LLM-based search agents achieve strong performance but suffer from severe latency, as each step requires serialized LLM reasoning followed by action of tool execution. We revisit this bottleneck through the lens of speculation. While traditional predict-verify speculation paradigm can break serial execution, its benefit remains limited, as it retains the full original workload and adds extra inference overhead. We observe that early agent steps often involve simple evidence-gathering, where correct actions can often be predicted without full reasoning. Building on these observations, we present SPAgent, an algorithm-system co-design framework that expands the role of speculation in search agents to reduce latency. Algorithmically, SPAgent introduces a two-phase adaptive speculation mechanism that selectively omits verification when safe. System-wise, a two-level scheduler regulates speculative requests based on engine load to ensure speculation remains beneficial. We implement SPAgent in real-world systems. Across extensive experimental settings, SPAgent achieves up to $1.65\\times$ end-to-end speedup while maintaining same or even achieving higher accuracy, enabling practical deployment of multi-step search agents.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 121,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20216",
        "abs_url": "https://arxiv.org/abs/2511.20216",
        "pdf_url": "https://arxiv.org/pdf/2511.20216",
        "title": "CostNav: A Navigation Benchmark for Cost-Aware Evaluation of Embodied Agents",
        "authors": [
            "Haebin Seong",
            "Sungmin Kim",
            "Minchan Kim",
            "Yongjun Cho",
            "Myunchul Joe",
            "Suhwan Choi",
            "Jaeyoon Jung",
            "Jiyong Youn",
            "Yoonshik Kim",
            "Samwoo Seong",
            "Yubeen Park",
            "Youngjae Yu",
            "Yunsung Lee"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "Existing navigation benchmarks focus on task success metrics while overlooking economic viability -- critical for commercial deployment of autonomous delivery robots. We introduce \\emph{CostNav}, a \\textbf{Micro-Navigation Economic Testbed} that evaluates embodied agents through comprehensive cost-revenue analysis aligned with real-world business operations. CostNav models the complete economic lifecycle including hardware, training, energy, maintenance costs, and delivery revenue with service-level agreements, using industry-derived parameters. \\textbf{To our knowledge, CostNav is the first work to quantitatively expose the gap between navigation research metrics and commercial viability}, revealing that optimizing for task success fundamentally differs from optimizing for economic deployment. Our cost model uses parameters derived from industry data sources (energy rates, delivery service pricing), and we project from a reduced-scale simulation to realistic deliveries. Under this projection, the baseline achieves 43.0\\% SLA compliance but is \\emph{not} commercially viable: yielding a loss of \\$30.009 per run with no finite break-even point, because operating costs are dominated by collision-induced maintenance, which accounts for 99.7\\% of per-run costs and highlights collision avoidance as a key optimization target. We demonstrate a learning-based on-device navigation baseline and establish a foundation for evaluating rule-based navigation, imitation learning, and cost-aware RL training. CostNav bridges the gap between navigation research and commercial deployment, enabling data-driven decisions about economic trade-offs across navigation paradigms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 122,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20236",
        "abs_url": "https://arxiv.org/abs/2511.20236",
        "pdf_url": "https://arxiv.org/pdf/2511.20236",
        "title": "Actionable and diverse counterfactual explanations incorporating domain knowledge and causal constraints",
        "authors": [
            "Szymon Bobek",
            "ukasz Baec",
            "Grzegorz J. Nalepa"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Counterfactual explanations enhance the actionable interpretability of machine learning models by identifying the minimal changes required to achieve a desired outcome of the model. However, existing methods often ignore the complex dependencies in real-world datasets, leading to unrealistic or impractical modifications. Motivated by cybersecurity applications in the email marketing domain, we propose a method for generating Diverse, Actionable, and kNowledge-Constrained Explanations (DANCE), which incorporates feature dependencies and causal constraints to ensure plausibility and real-world feasibility of counterfactuals. Our method learns linear and nonlinear constraints from data or integrates expert-provided dependency graphs, ensuring counterfactuals are plausible and actionable. By maintaining consistency with feature relationships, the method produces explanations that align with real-world constraints. Additionally, it balances plausibility, diversity, and sparsity, effectively addressing key limitations in existing algorithms. The work is developed based on a real-life case study with Freshmail, the largest email marketing company in Poland and supported by a joint R&D project Sendguard. Furthermore, we provide an extensive evaluation using 140 public datasets, which highlights its ability to generate meaningful, domain-relevant counterfactuals that outperform other existing approaches based on widely used metrics. The source code for reproduction of the results can be found in a GitHub repository we provide.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 123,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20237",
        "abs_url": "https://arxiv.org/abs/2511.20237",
        "pdf_url": "https://arxiv.org/pdf/2511.20237",
        "title": "Quantum-Enhanced Reinforcement Learning for Accelerating Newton-Raphson Convergence with Ising Machines: A Case Study for Power Flow Analysis",
        "authors": [
            "Zeynab Kaseb",
            "Matthias Moller",
            "Lindsay Spoor",
            "Jerry J. Guo",
            "Yu Xiang",
            "Peter Palensky",
            "Pedro P. Vergara"
        ],
        "comments": "10 pages, 9 figures, 4 tables",
        "subjects": "Systems and Control (eess.SY); Emerging Technologies (cs.ET); Machine Learning (cs.LG)",
        "abstract": "The Newton-Raphson (NR) method is widely used for solving power flow (PF) equations due to its quadratic convergence. However, its performance deteriorates under poor initialization or extreme operating scenarios, e.g., high levels of renewable energy penetration. Traditional NR initialization strategies often fail to address these challenges, resulting in slow convergence or even divergence. We propose the use of reinforcement learning (RL) to optimize the initialization of NR, and introduce a novel quantum-enhanced RL environment update mechanism to mitigate the significant computational cost of evaluating power system states over a combinatorially large action space at each RL timestep by formulating the voltage adjustment task as a quadratic unconstrained binary optimization problem. Specifically, quantum/digital annealers are integrated into the RL environment update to evaluate state transitions using a problem Hamiltonian designed for PF. Results demonstrate significant improvements in convergence speed, a reduction in NR iteration counts, and enhanced robustness under different operating conditions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 124,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20258",
        "abs_url": "https://arxiv.org/abs/2511.20258",
        "pdf_url": "https://arxiv.org/pdf/2511.20258",
        "title": "Modality-Balanced Collaborative Distillation for Multi-Modal Domain Generalization",
        "authors": [
            "Xiaohan Wang",
            "Zhangtao Cheng",
            "Ting Zhong",
            "Leiting Chen",
            "Fan Zhou"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Weight Averaging (WA) has emerged as a powerful technique for enhancing generalization by promoting convergence to a flat loss landscape, which correlates with stronger out-of-distribution performance. However, applying WA directly to multi-modal domain generalization (MMDG) is challenging: differences in optimization speed across modalities lead WA to overfit to faster-converging ones in early stages, suppressing the contribution of slower yet complementary modalities, thereby hindering effective modality fusion and skewing the loss surface toward sharper, less generalizable minima. To address this issue, we propose MBCD, a unified collaborative distillation framework that retains WA's flatness-inducing advantages while overcoming its shortcomings in multi-modal contexts. MBCD begins with adaptive modality dropout in the student model to curb early-stage bias toward dominant modalities. A gradient consistency constraint then aligns learning signals between uni-modal branches and the fused representation, encouraging coordinated and smoother optimization. Finally, a WA-based teacher conducts cross-modal distillation by transferring fused knowledge to each uni-modal branch, which strengthens cross-modal interactions and steer convergence toward flatter solutions. Extensive experiments on MMDG benchmarks show that MBCD consistently outperforms existing methods, achieving superior accuracy and robustness across diverse unseen domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 125,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20283",
        "abs_url": "https://arxiv.org/abs/2511.20283",
        "pdf_url": "https://arxiv.org/pdf/2511.20283",
        "title": "Solving Heterogeneous Agent Models with Physics-informed Neural Networks",
        "authors": [
            "Marta Grzeskiewicz"
        ],
        "comments": "",
        "subjects": "General Economics (econ.GN); Machine Learning (cs.LG)",
        "abstract": "Understanding household behaviour is essential for modelling macroeconomic dynamics and designing effective policy. While heterogeneous agent models offer a more realistic alternative to representative agent frameworks, their implementation poses significant computational challenges, particularly in continuous time. The Aiyagari-Bewley-Huggett (ABH) framework, recast as a system of partial differential equations, typically relies on grid-based solvers that suffer from the curse of dimensionality, high computational cost, and numerical inaccuracies. This paper introduces the ABH-PINN solver, an approach based on Physics-Informed Neural Networks (PINNs), which embeds the Hamilton-Jacobi-Bellman and Kolmogorov Forward equations directly into the neural network training objective. By replacing grid-based approximation with mesh-free, differentiable function learning, the ABH-PINN solver benefits from the advantages of PINNs of improved scalability, smoother solutions, and computational efficiency. Preliminary results show that the PINN-based approach is able to obtain economically valid results matching the established finite-difference solvers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 126,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20333",
        "abs_url": "https://arxiv.org/abs/2511.20333",
        "pdf_url": "https://arxiv.org/pdf/2511.20333",
        "title": "NNGPT: Rethinking AutoML with Large Language Models",
        "authors": [
            "Roman Kochnev",
            "Waleed Khalid",
            "Tolgay Atinc Uzun",
            "Xi Zhang",
            "Yashkumar Sanjaybhai Dhameliya",
            "Furui Qin",
            "Chandini Vysyaraju",
            "Raghuvir Duvvuri",
            "Avi Goyal",
            "Dmitry Ignatov",
            "Radu Timofte"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Building self-improving AI systems remains a fundamental challenge in the AI domain. We present NNGPT, an open-source framework that turns a large language model (LLM) into a self-improving AutoML engine for neural network development, primarily for computer vision. Unlike previous frameworks, NNGPT extends the dataset of neural networks by generating new models, enabling continuous fine-tuning of LLMs based on closed-loop system of generation, assessment, and self-improvement. It integrates within one unified workflow five synergistic LLM-based pipelines: zero-shot architecture synthesis, hyperparameter optimization (HPO), code-aware accuracy/early-stop prediction, retrieval-augmented synthesis of scope-closed PyTorch blocks (NN-RAG), and reinforcement learning. Built on the LEMUR dataset as an audited corpus with reproducible metrics, NNGPT emits from a single prompt and validates network architecture, preprocessing code, and hyperparameters, executes them end-to-end, and learns from result. The PyTorch adapter makes NNGPT framework-agnostic, enabling strong performance: NN-RAG achieves 73% executability on 1,289 targets, 3-shot prompting boosts accuracy on common datasets, and hash-based deduplication saves hundreds of runs. One-shot prediction matches search-based AutoML, reducing the need for numerous trials. HPO on LEMUR achieves RMSE 0.60, outperforming Optuna (0.64), while the code-aware predictor reaches RMSE 0.14 with Pearson r=0.78. The system has already generated over 5K validated models, proving NNGPT as an autonomous AutoML engine. Upon acceptance, the code, prompts, and checkpoints will be released for public access to enable reproducibility and facilitate community usage.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 127,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20361",
        "abs_url": "https://arxiv.org/abs/2511.20361",
        "pdf_url": "https://arxiv.org/pdf/2511.20361",
        "title": "Extension and neural operator approximation of the electrical impedance tomography inverse map",
        "authors": [
            "Maarten V. de Hoop",
            "Nikola B. Kovachki",
            "Matti Lassas",
            "Nicholas H. Nelsen"
        ],
        "comments": "80 pages (49 main text, 20 appendix, and 11 references pages), 14 figures, 2 tables",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG); Analysis of PDEs (math.AP)",
        "abstract": "This paper considers the problem of noise-robust neural operator approximation for the solution map of Caldern's inverse conductivity problem. In this continuum model of electrical impedance tomography (EIT), the boundary measurements are realized as a noisy perturbation of the Neumann-to-Dirichlet map's integral kernel. The theoretical analysis proceeds by extending the domain of the inversion operator to a Hilbert space of kernel functions. The resulting extension shares the same stability properties as the original inverse map from kernels to conductivities, but is now amenable to neural operator approximation. Numerical experiments demonstrate that Fourier neural operators excel at reconstructing infinite-dimensional piecewise constant and lognormal conductivities in noisy setups both within and beyond the theory's assumptions. The methodology developed in this paper for EIT exemplifies a broader strategy for addressing nonlinear inverse problems with a noise-aware operator learning framework.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 128,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20380",
        "abs_url": "https://arxiv.org/abs/2511.20380",
        "pdf_url": "https://arxiv.org/pdf/2511.20380",
        "title": "Differentiable Attenuation Filters for Feedback Delay Networks",
        "authors": [
            "Ilias Ibnyahya",
            "Joshua D. Reiss"
        ],
        "comments": "",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG)",
        "abstract": "We introduce a novel method for designing attenuation filters in digital audio reverberation systems based on Feedback Delay Net- works (FDNs). Our approach uses Second Order Sections (SOS) of Infinite Impulse Response (IIR) filters arranged as parametric equalizers (PEQ), enabling fine control over frequency-dependent reverberation decay. Unlike traditional graphic equalizer designs, which require numerous filters per delay line, we propose a scal- able solution where the number of filters can be adjusted. The fre- quency, gain, and quality factor (Q) parameters are shared parame- ters across delay lines and only the gain is adjusted based on delay length. This design not only reduces the number of optimization parameters, but also remains fully differentiable and compatible with gradient-based learning frameworks. Leveraging principles of analog filter design, our method allows for efficient and accu- rate filter fitting using supervised learning. Our method delivers a flexible and differentiable design, achieving state-of-the-art per- formance while significantly reducing computational cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 129,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20457",
        "abs_url": "https://arxiv.org/abs/2511.20457",
        "pdf_url": "https://arxiv.org/pdf/2511.20457",
        "title": "A Fully Probabilistic Tensor Network for Regularized Volterra System Identification",
        "authors": [
            "Afra Kilic",
            "Kim Batselier"
        ],
        "comments": "6 pages, 3 figures, 1 table. Submitted to IFAC 2026. Code available at: this https URL",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Modeling nonlinear systems with Volterra series is challenging because the number of kernel coefficients grows exponentially with the model order. This work introduces Bayesian Tensor Network Volterra kernel machines (BTN-V), extending the Bayesian Tensor Network framework to Volterra system identification. BTN-V represents Volterra kernels using canonical polyadic decomposition, reducing model complexity from O(I^D) to O(DIR). By treating all tensor components and hyperparameters as random variables, BTN-V provides predictive uncertainty estimation at no additional computational cost. Sparsity-inducing hierarchical priors enable automatic rank determination and the learning of fading-memory behavior directly from data, improving interpretability and preventing overfitting. Empirical results demonstrate competitive accuracy, enhanced uncertainty quantification, and reduced computational cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 130,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20469",
        "abs_url": "https://arxiv.org/abs/2511.20469",
        "pdf_url": "https://arxiv.org/pdf/2511.20469",
        "title": "Dance Style Classification using Laban-Inspired and Frequency-Domain Motion Features",
        "authors": [
            "Ben Hamscher",
            "Arnold Brosch",
            "Nicolas Binninger",
            "Maksymilian Jan Dejna",
            "Kira Maag"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Dance is an essential component of human culture and serves as a tool for conveying emotions and telling stories. Identifying and distinguishing dance genres based on motion data is a complex problem in human activity recognition, as many styles share similar poses, gestures, and temporal motion patterns. This work presents a lightweight framework for classifying dance styles that determines motion characteristics based on pose estimates extracted from videos. We propose temporal-spatial descriptors inspired by Laban Movement Analysis. These features capture local joint dynamics such as velocity, acceleration, and angular movement of the upper body, enabling a structured representation of spatial coordination. To further encode rhythmic and periodic aspects of movement, we integrate Fast Fourier Transform features that characterize movement patterns in the frequency domain. The proposed approach achieves robust classification of different dance styles with low computational effort, as complex model architectures are not required, and shows that interpretable motion representations can effectively capture stylistic nuances.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 131,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20489",
        "abs_url": "https://arxiv.org/abs/2511.20489",
        "pdf_url": "https://arxiv.org/pdf/2511.20489",
        "title": "InferF: Declarative Factorization of AI/ML Inferences over Joins",
        "authors": [
            "Kanchan Chowdhury",
            "Lixi Zhou",
            "Lulu Xie",
            "Xinwei Fu",
            "Jia Zou"
        ],
        "comments": "Accepted to SIGMOD 2026 as full research paper. This archived version has a full appendix",
        "subjects": "Databases (cs.DB); Machine Learning (cs.LG)",
        "abstract": "Real-world AI/ML workflows often apply inference computations to feature vectors joined from multiple datasets. To avoid the redundant AI/ML computations caused by repeated data records in the join's output, factorized ML has been proposed to decompose ML computations into sub-computations to be executed on each normalized dataset. However, there is insufficient discussion on how factorized ML could impact AI/ML inference over multi-way joins. To address the limitations, we propose a novel declarative InferF system, focusing on the factorization of arbitrary inference workflows represented as analyzable expressions over the multi-way joins. We formalize our problem to flexibly push down partial factorized computations to qualified nodes in the join tree to minimize the overall inference computation and join costs and propose two algorithms to resolve the problem: (1) a greedy algorithm based on a per-node cost function that estimates the influence on overall latency if a subset of factorized computations is pushed to a node, and (2) a genetic algorithm for iteratively enumerating and evaluating promising factorization plans. We implement InferF on Velox, an open-sourced database engine from Meta, evaluate it on real-world datasets, observed up to 11.3x speedups, and systematically summarized the factors that determine when factorized ML can benefit AI/ML inference workflows.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 132,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20503",
        "abs_url": "https://arxiv.org/abs/2511.20503",
        "pdf_url": "https://arxiv.org/pdf/2511.20503",
        "title": "Generative Modeling with Manifold Percolation",
        "authors": [
            "Rui Tong"
        ],
        "comments": "13 pages, 7 figures. Correspondence: this http URL@warwick.this http URL",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Generative modeling is typically framed as learning mapping rules, but from an observer's perspective without access to these rules, the task manifests as disentangling the geometric support from the probability distribution. We propose that Continuum Percolation is uniquely suited for this support analysis, as the sampling process effectively projects high-dimensional density estimation onto a geometric counting problem on the support. In this work, we establish a rigorous isomorphism between the topological phase transitions of Random Geometric Graphs and the underlying data manifold in high-dimensional space. By analyzing the relationship between our proposed Percolation Shift metric and FID, we demonstrate that our metric captures structural pathologies (such as implicit mode collapse) where statistical metrics fail. Finally, we translate this topological phenomenon into a differentiable loss function to guide training. Experimental results confirm that this approach not only prevents manifold shrinkage but drives the model toward a state of \"Hyper-Generalization,\" achieving good fidelity and verified topological expansion.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 133,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20541",
        "abs_url": "https://arxiv.org/abs/2511.20541",
        "pdf_url": "https://arxiv.org/pdf/2511.20541",
        "title": "Automated Monitoring of Cultural Heritage Artifacts Using Semantic Segmentation",
        "authors": [
            "Andrea Ranieri",
            "Giorgio Palmieri",
            "Silvia Biasotti"
        ],
        "comments": "Keywords: Cultural Heritage, Monitoring, Deep Learning, U-Nets, Semantic Segmentation",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "This paper addresses the critical need for automated crack detection in the preservation of cultural heritage through semantic segmentation. We present a comparative study of U-Net architectures, using various convolutional neural network (CNN) encoders, for pixel-level crack identification on statues and monuments. A comparative quantitative evaluation is performed on the test set of the OmniCrack30k dataset [1] using popular segmentation metrics including Mean Intersection over Union (mIoU), Dice coefficient, and Jaccard index. This is complemented by an out-of-distribution qualitative evaluation on an unlabeled test set of real-world cracked statues and monuments. Our findings provide valuable insights into the capabilities of different CNN- based encoders for fine-grained crack segmentation. We show that the models exhibit promising generalization capabilities to unseen cultural heritage contexts, despite never having been explicitly trained on images of statues or monuments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 134,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20558",
        "abs_url": "https://arxiv.org/abs/2511.20558",
        "pdf_url": "https://arxiv.org/pdf/2511.20558",
        "title": "Spatio-Temporal Hierarchical Causal Models",
        "authors": [
            "Xintong Li",
            "Haoran Zhang",
            "Xiao Zhou"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "The abundance of fine-grained spatio-temporal data, such as traffic sensor networks, offers vast opportunities for scientific discovery. However, inferring causal relationships from such observational data remains challenging, particularly due to unobserved confounders that are specific to units (e.g., geographical locations) yet influence outcomes over time. Most existing methods for spatio-temporal causal inference assume that all confounders are observed, an assumption that is often violated in practice. In this paper, we introduce Spatio-Temporal Hierarchical Causal Models (ST-HCMs), a novel graphical framework that extends hierarchical causal modeling to the spatio-temporal domain. At the core of our approach is the Spatio-Temporal Collapse Theorem, which shows that a complex ST-HCM converges to a simpler flat causal model as the amount of subunit data increases. This theoretical result enables a general procedure for causal identification, allowing ST-HCMs to recover causal effects even in the presence of unobserved, time-invariant unit-level confounders, a scenario where standard non-hierarchical models fail. We validate the effectiveness of our framework on both synthetic and real-world datasets, demonstrating its potential for robust causal inference in complex dynamic systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 135,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20586",
        "abs_url": "https://arxiv.org/abs/2511.20586",
        "pdf_url": "https://arxiv.org/pdf/2511.20586",
        "title": "PaTAS: A Parallel System for Trust Propagation in Neural Networks Using Subjective Logic",
        "authors": [
            "Koffi Ismael Ouattara",
            "Ioannis Krontiris",
            "Theo Dimitrakos",
            "Dennis Eisermann",
            "Frank Kargl"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Trustworthiness has become a key requirement for the deployment of artificial intelligence systems in safety-critical applications. Conventional evaluation metrics such as accuracy and precision fail to capture uncertainty or the reliability of model predictions, particularly under adversarial or degraded conditions. This paper introduces the \\emph{Parallel Trust Assessment System (PaTAS)}, a framework for modeling and propagating trust in neural networks using Subjective Logic (SL). PaTAS operates in parallel with standard neural computation through \\emph{Trust Nodes} and \\emph{Trust Functions} that propagate input, parameter, and activation trust across the network. The framework defines a \\emph{Parameter Trust Update} mechanism to refine parameter reliability during training and an \\emph{Inference-Path Trust Assessment (IPTA)} method to compute instance-specific trust at inference. Experiments on real-world and adversarial datasets demonstrate that PaTAS produces interpretable, symmetric, and convergent trust estimates that complement accuracy and expose reliability gaps in poisoned, biased, or uncertain data scenarios. The results show that PaTAS effectively distinguishes between benign and adversarial inputs and identifies cases where model confidence diverges from actual reliability. By enabling transparent and quantifiable trust reasoning within neural architectures, PaTAS provides a principled foundation for evaluating model reliability across the AI lifecycle.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 136,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20629",
        "abs_url": "https://arxiv.org/abs/2511.20629",
        "pdf_url": "https://arxiv.org/pdf/2511.20629",
        "title": "MapReduce LoRA: Advancing the Pareto Front in Multi-Preference Optimization for Generative Models",
        "authors": [
            "Chieh-Yun Chen",
            "Zhonghao Wang",
            "Qi Chen",
            "Zhifan Ye",
            "Min Shi",
            "Yue Zhao",
            "Yinan Zhao",
            "Hui Qu",
            "Wei-An Lin",
            "Yiru Shen",
            "Ajinkya Kale",
            "Irfan Essa",
            "Humphrey Shi"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Reinforcement learning from human feedback (RLHF) with reward models has advanced alignment of generative models to human aesthetic and perceptual preferences. However, jointly optimizing multiple rewards often incurs an alignment tax, improving one dimension while degrading others. To address this, we introduce two complementary methods: MapReduce LoRA and Reward-aware Token Embedding (RaTE). MapReduce LoRA trains preference-specific LoRA experts in parallel and iteratively merges them to refine a shared base model; RaTE learns reward-specific token embeddings that compose at inference for flexible preference control. Experiments on Text-to-Image generation (Stable Diffusion 3.5 Medium and FLUX.1-dev) show improvements of 36.1%, 4.6%, and 55.7%, and 32.7%, 4.3%, and 67.1% on GenEval, PickScore, and OCR, respectively. On Text-to-Video generation (HunyuanVideo), visual and motion quality improve by 48.1% and 90.0%, respectively. On the language task, Helpful Assistant, with Llama-2 7B, helpful and harmless improve by 43.4% and 136.7%, respectively. Our framework sets a new state-of-the-art multi-preference alignment recipe across modalities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 137,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20639",
        "abs_url": "https://arxiv.org/abs/2511.20639",
        "pdf_url": "https://arxiv.org/pdf/2511.20639",
        "title": "Latent Collaboration in Multi-Agent Systems",
        "authors": [
            "Jiaru Zou",
            "Xiyuan Yang",
            "Ruizhong Qiu",
            "Gaotang Li",
            "Katherine Tieu",
            "Pan Lu",
            "Ke Shen",
            "Hanghang Tong",
            "Yejin Choi",
            "Jingrui He",
            "James Zou",
            "Mengdi Wang",
            "Ling Yang"
        ],
        "comments": "Project: this https URL",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Multi-agent systems (MAS) extend large language models (LLMs) from independent single-model reasoning to coordinative system-level intelligence. While existing LLM agents depend on text-based mediation for reasoning and communication, we take a step forward by enabling models to collaborate directly within the continuous latent space. We introduce LatentMAS, an end-to-end training-free framework that enables pure latent collaboration among LLM agents. In LatentMAS, each agent first performs auto-regressive latent thoughts generation through last-layer hidden embeddings. A shared latent working memory then preserves and transfers each agent's internal representations, ensuring lossless information exchange. We provide theoretical analyses establishing that LatentMAS attains higher expressiveness and lossless information preservation with substantially lower complexity than vanilla text-based MAS. In addition, empirical evaluations across 9 comprehensive benchmarks spanning math and science reasoning, commonsense understanding, and code generation show that LatentMAS consistently outperforms strong single-model and text-based MAS baselines, achieving up to 14.6% higher accuracy, reducing output token usage by 70.8%-83.7%, and providing 4x-4.3x faster end-to-end inference. These results demonstrate that our new latent collaboration framework enhances system-level reasoning quality while offering substantial efficiency gains without any additional training. Code and data are fully open-sourced at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 138,
        "date": "2025-11-26",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-26?abs=True",
        "arxiv_id": "2511.20641",
        "abs_url": "https://arxiv.org/abs/2511.20641",
        "pdf_url": "https://arxiv.org/pdf/2511.20641",
        "title": "Unleashing the Power of Vision-Language Models for Long-Tailed Multi-Label Visual Recognition",
        "authors": [
            "Wei Tang",
            "Zuo-Zheng Wang",
            "Kun Zhang",
            "Tong Wei",
            "Min-Ling Zhang"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Long-tailed multi-label visual recognition poses a significant challenge, as images typically contain multiple labels with highly imbalanced class distributions, leading to biased models that favor head classes while underperforming on tail classes. Recent efforts have leveraged pre-trained vision-language models, such as CLIP, alongside long-tailed learning techniques to exploit rich visual-textual priors for improved performance. However, existing methods often derive semantic inter-class relationships directly from imbalanced datasets, resulting in unreliable correlations for tail classes due to data scarcity. Moreover, CLIP's zero-shot paradigm is optimized for single-label image-text matching, making it suboptimal for multi-label tasks. To address these issues, we propose the correlation adaptation prompt network (CAPNET), a novel end-to-end framework that explicitly models label correlations from CLIP's textual encoder. The framework incorporates a graph convolutional network for label-aware propagation and learnable soft prompts for refined embeddings. It utilizes a distribution-balanced Focal loss with class-aware re-weighting for optimized training under imbalance. Moreover, it improves generalization through test-time ensembling and realigns visual-textual modalities using parameter-efficient fine-tuning to avert overfitting on tail classes without compromising head class performance. Extensive experiments and ablation studies on benchmarks including VOC-LT, COCO-LT, and NUS-WIDE demonstrate that CAPNET achieves substantial improvements over state-of-the-art methods, validating its effectiveness for real-world long-tailed multi-label visual recognition.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]