[
    {
        "order": 1,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02879",
        "abs_url": "https://arxiv.org/abs/2511.02879",
        "pdf_url": "https://arxiv.org/pdf/2511.02879",
        "title": "Stochastic Deep Graph Clustering for Practical Group Formation",
        "authors": [
            "Junhyung Park",
            "Hyungjin Kim",
            "Seokho Ahn",
            "Young-Duk Seo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "While prior work on group recommender systems (GRSs) has primarily focused on improving recommendation accuracy, most approaches assume static or predefined groups, making them unsuitable for dynamic, real-world scenarios. We reframe group formation as a core challenge in GRSs and propose DeepForm (Stochastic Deep Graph Clustering for Practical Group Formation), a framework designed to meet three key operational requirements: (1) the incorporation of high-order user information, (2) real-time group formation, and (3) dynamic adjustment of the number of groups. DeepForm employs a lightweight GCN architecture that effectively captures high-order structural signals. Stochastic cluster learning enables adaptive group reconfiguration without retraining, while contrastive learning refines groups under dynamic conditions. Experiments on multiple datasets demonstrate that DeepForm achieves superior group formation quality, efficiency, and recommendation accuracy compared with various baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02887",
        "abs_url": "https://arxiv.org/abs/2511.02887",
        "pdf_url": "https://arxiv.org/pdf/2511.02887",
        "title": "Predicting Weekly Fishing Concentration Zones through Deep Learning Integration of Heterogeneous Environmental Spatial Datasets",
        "authors": [
            "Chaitanya Rele",
            "Aditya Rathod",
            "Kaustubh Natu",
            "Saurabh Kulkarni",
            "Ajay Koli",
            "Swapnali Makdey"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "The North Indian Ocean, including the Arabian Sea and the Bay of Bengal, represents a vital source of livelihood for coastal communities, yet fishermen often face uncertainty in locating productive fishing grounds. To address this challenge, we present an AI-assisted framework for predicting Potential Fishing Zones (PFZs) using oceanographic parameters such as sea surface temperature and chlorophyll concentration. The approach is designed to enhance the accuracy of PFZ identification and provide region-specific insights for sustainable fishing practices. Preliminary results indicate that the framework can support fishermen by reducing search time, lowering fuel consumption, and promoting efficient resource utilization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02894",
        "abs_url": "https://arxiv.org/abs/2511.02894",
        "pdf_url": "https://arxiv.org/pdf/2511.02894",
        "title": "Adaptive and Robust Data Poisoning Detection and Sanitization in Wearable IoT Systems using Large Language Models",
        "authors": [
            "W.K.M Mithsara",
            "Ning Yang",
            "Ahmed Imteaj",
            "Hussein Zangoti",
            "Abdur R. Shahid"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "The widespread integration of wearable sensing devices in Internet of Things (IoT) ecosystems, particularly in healthcare, smart homes, and industrial applications, has required robust human activity recognition (HAR) techniques to improve functionality and user experience. Although machine learning models have advanced HAR, they are increasingly susceptible to data poisoning attacks that compromise the data integrity and reliability of these systems. Conventional approaches to defending against such attacks often require extensive task-specific training with large, labeled datasets, which limits adaptability in dynamic IoT environments. This work proposes a novel framework that uses large language models (LLMs) to perform poisoning detection and sanitization in HAR systems, utilizing zero-shot, one-shot, and few-shot learning paradigms. Our approach incorporates \\textit{role play} prompting, whereby the LLM assumes the role of expert to contextualize and evaluate sensor anomalies, and \\textit{think step-by-step} reasoning, guiding the LLM to infer poisoning indicators in the raw sensor data and plausible clean alternatives. These strategies minimize reliance on curation of extensive datasets and enable robust, adaptable defense mechanisms in real-time. We perform an extensive evaluation of the framework, quantifying detection accuracy, sanitization quality, latency, and communication cost, thus demonstrating the practicality and effectiveness of LLMs in improving the security and reliability of wearable IoT systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02936",
        "abs_url": "https://arxiv.org/abs/2511.02936",
        "pdf_url": "https://arxiv.org/pdf/2511.02936",
        "title": "Zero-shot data citation function classification using transformer-based large language models (LLMs)",
        "authors": [
            "Neil Byers",
            "Ali Zaidi",
            "Valerie Skye",
            "Chris Beecroft",
            "Kjiersten Fagnan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Efforts have increased in recent years to identify associations between specific datasets and the scientific literature that incorporates them. Knowing that a given publication cites a given dataset, the next logical step is to explore how or why that data was used. Advances in recent years with pretrained, transformer-based large language models (LLMs) offer potential means for scaling the description of data use cases in the published literature. This avoids expensive manual labeling and the development of training datasets for classical machine-learning (ML) systems. In this work we apply an open-source LLM, Llama 3.1-405B, to generate structured data use case labels for publications known to incorporate specific genomic datasets. We also introduce a novel evaluation framework for determining the efficacy of our methods. Our results demonstrate that the stock model can achieve an F1 score of .674 on a zero-shot data citation classification task with no previously defined categories. While promising, our results are qualified by barriers related to data availability, prompt overfitting, computational infrastructure, and the expense required to conduct responsible performance evaluation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02957",
        "abs_url": "https://arxiv.org/abs/2511.02957",
        "pdf_url": "https://arxiv.org/pdf/2511.02957",
        "title": "Digital Twin-Driven Pavement Health Monitoring and Maintenance Optimization Using Graph Neural Networks",
        "authors": [
            "Mohsin Mahmud Topu",
            "Mahfuz Ahmed Anik",
            "Azmine Toushik Wasi",
            "Md Manjurul Ahsan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computational Engineering, Finance, and Science (cs.CE); Emerging Technologies (cs.ET); Neural and Evolutionary Computing (cs.NE); Systems and Control (eess.SY)",
        "abstract": "Pavement infrastructure monitoring is challenged by complex spatial dependencies, changing environmental conditions, and non-linear deterioration across road networks. Traditional Pavement Management Systems (PMS) remain largely reactive, lacking real-time intelligence for failure prevention and optimal maintenance planning. To address this, we propose a unified Digital Twin (DT) and Graph Neural Network (GNN) framework for scalable, data-driven pavement health monitoring and predictive maintenance. Pavement segments and spatial relations are modeled as graph nodes and edges, while real-time UAV, sensor, and LiDAR data stream into the DT. The inductive GNN learns deterioration patterns from graph-structured inputs to forecast distress and enable proactive interventions. Trained on a real-world-inspired dataset with segment attributes and dynamic connectivity, our model achieves an R2 of 0.3798, outperforming baseline regressors and effectively capturing non-linear degradation. We also develop an interactive dashboard and reinforcement learning module for simulation, visualization, and adaptive maintenance planning. This DT-GNN integration enhances forecasting precision and establishes a closed feedback loop for continuous improvement, positioning the approach as a foundation for proactive, intelligent, and sustainable pavement management, with future extensions toward real-world deployment, multi-agent coordination, and smart-city integration.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02966",
        "abs_url": "https://arxiv.org/abs/2511.02966",
        "pdf_url": "https://arxiv.org/pdf/2511.02966",
        "title": "Inference-Time Personalized Alignment with a Few User Preference Queries",
        "authors": [
            "Victor-Alexandru Pădurean",
            "Parameswaran Kamalaruban",
            "Nachiket Kotalwar",
            "Alkis Gotovos",
            "Adish Singla"
        ],
        "comments": "NeurIPS'25 paper",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study the problem of aligning a generative model's response with a user's preferences. Recent works have proposed several different formulations for personalized alignment; however, they either require a large amount of user preference queries or require that the preference be explicitly specified as a text input. In this paper, we propose a novel inference-time personalized alignment method, UserAlign, that elicits the user's preferences with a few queries as pairwise response comparisons. In particular, UserAlign builds on the theoretical framework of best-arm identification in logistic bandits and selects a personalized response from a fixed pool of the model's generated responses. The key idea is to consider the user's feedback consistent and noise-free, and incorporate it into the theoretical framework to identify the best response quickly. Experimental results across several tasks, involving personalized text and image generation, showcase the effectiveness of UserAlign in achieving personalized alignment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02969",
        "abs_url": "https://arxiv.org/abs/2511.02969",
        "pdf_url": "https://arxiv.org/pdf/2511.02969",
        "title": "Value of Information-Enhanced Exploration in Bootstrapped DQN",
        "authors": [
            "Stergios Plataniotis",
            "Charilaos Akasiadis",
            "Georgios Chalkiadakis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Efficient exploration in deep reinforcement learning remains a fundamental challenge, especially in environments characterized by high-dimensional states and sparse rewards. Traditional exploration strategies that rely on random local policy noise, such as $\\epsilon$-greedy and Boltzmann exploration methods, often struggle to efficiently balance exploration and exploitation. In this paper, we integrate the notion of (expected) value of information (EVOI) within the well-known Bootstrapped DQN algorithmic framework, to enhance the algorithm's deep exploration ability. Specifically, we develop two novel algorithms that incorporate the expected gain from learning the value of information into Bootstrapped DQN. Our methods use value of information estimates to measure the discrepancies of opinions among distinct network heads, and drive exploration towards areas with the most potential. We evaluate our algorithms with respect to performance and their ability to exploit inherent uncertainty arising from random network initialization. Our experiments in complex, sparse-reward Atari games demonstrate increased performance, all the while making better use of uncertainty, and, importantly, without introducing extra hyperparameters.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03012",
        "abs_url": "https://arxiv.org/abs/2511.03012",
        "pdf_url": "https://arxiv.org/pdf/2511.03012",
        "title": "Heterogeneous Metamaterials Design via Multiscale Neural Implicit Representation",
        "authors": [
            "Hongrui Chen",
            "Liwei Wang",
            "Levent Burak Kara"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Metamaterials are engineered materials composed of specially designed unit cells that exhibit extraordinary properties beyond those of natural materials. Complex engineering tasks often require heterogeneous unit cells to accommodate spatially varying property requirements. However, designing heterogeneous metamaterials poses significant challenges due to the enormous design space and strict compatibility requirements between neighboring cells. Traditional concurrent multiscale design methods require solving an expensive optimization problem for each unit cell and often suffer from discontinuities at cell boundaries. On the other hand, data-driven approaches that assemble structures from a fixed library of microstructures are limited by the dataset and require additional post-processing to ensure seamless connections. In this work, we propose a neural network-based metamaterial design framework that learns a continuous two-scale representation of the structure, thereby jointly addressing these challenges. Central to our framework is a multiscale neural representation in which the neural network takes both global (macroscale) and local (microscale) coordinates as inputs, outputting an implicit field that represents multiscale structures with compatible unit cell geometries across the domain, without the need for a predefined dataset. We use a compatibility loss term during training to enforce connectivity between adjacent unit cells. Once trained, the network can produce metamaterial designs at arbitrarily high resolution, hence enabling infinite upsampling for fabrication or simulation. We demonstrate the effectiveness of the proposed approach on mechanical metamaterial design, negative Poisson's ratio, and mechanical cloaking problems with potential applications in robotics, bioengineering, and aerospace.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03015",
        "abs_url": "https://arxiv.org/abs/2511.03015",
        "pdf_url": "https://arxiv.org/pdf/2511.03015",
        "title": "Discrete Bayesian Sample Inference for Graph Generation",
        "authors": [
            "Ole Petersen",
            "Marcel Kollovieh",
            "Marten Lienen",
            "Stephan Günnemann"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Generating graph-structured data is crucial in applications such as molecular generation, knowledge graphs, and network analysis. However, their discrete, unordered nature makes them difficult for traditional generative models, leading to the rise of discrete diffusion and flow matching models. In this work, we introduce GraphBSI, a novel one-shot graph generative model based on Bayesian Sample Inference (BSI). Instead of evolving samples directly, GraphBSI iteratively refines a belief over graphs in the continuous space of distribution parameters, naturally handling discrete structures. Further, we state BSI as a stochastic differential equation (SDE) and derive a noise-controlled family of SDEs that preserves the marginal distributions via an approximation of the score function. Our theoretical analysis further reveals the connection to Bayesian Flow Networks and Diffusion models. Finally, in our empirical evaluation, we demonstrate state-of-the-art performance on molecular and synthetic graph generation, outperforming existing one-shot graph generative models on the standard benchmarks Moses and GuacaMol.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03022",
        "abs_url": "https://arxiv.org/abs/2511.03022",
        "pdf_url": "https://arxiv.org/pdf/2511.03022",
        "title": "Adaptive-Sensorless Monitoring of Shipping Containers",
        "authors": [
            "Lingqing Shen",
            "Chi Heem Wong",
            "Misaki Mito",
            "Arnab Chakrabarti"
        ],
        "comments": "Published in 2025 IEEE Big Data",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE)",
        "abstract": "Monitoring the internal temperature and humidity of shipping containers is essential to preventing quality degradation during cargo transportation. Sensorless monitoring -- machine learning models that predict the internal conditions of the containers using exogenous factors -- shows promise as an alternative to monitoring using sensors. However, it does not incorporate telemetry information and correct for systematic errors, causing the predictions to differ significantly from the live data and confusing the users. In this paper, we introduce the residual correction method, a general framework for correcting for systematic biases in sensorless models after observing live telemetry data. We call this class of models ``adaptive-sensorless'' monitoring. We train and evaluate adaptive-sensorless models on the 3.48 million data points -- the largest dataset of container sensor readings ever used in academic research -- and show that they produce consistent improvements over the baseline sensorless models. When evaluated on the holdout set of the simulated data, they achieve average mean absolute errors (MAEs) of 2.24 $\\sim$ 2.31$^\\circ$C (vs 2.43$^\\circ$C by sensorless) for temperature and 5.72 $\\sim$ 7.09% for relative humidity (vs 7.99% by sensorless) and average root mean-squared errors (RMSEs) of 3.19 $\\sim$ 3.26$^\\circ$C for temperature (vs 3.38$^\\circ$C by sensorless) and 7.70 $\\sim$ 9.12% for relative humidity (vs 10.0% by sensorless). Adaptive-sensorless models enable more accurate cargo monitoring, early risk detection, and less dependence on full connectivity in global shipping.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03032",
        "abs_url": "https://arxiv.org/abs/2511.03032",
        "pdf_url": "https://arxiv.org/pdf/2511.03032",
        "title": "Leveraging Discrete Function Decomposability for Scientific Design",
        "authors": [
            "James C. Bowden",
            "Sergey Levine",
            "Jennifer Listgarten"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In the era of AI-driven science and engineering, we often want to design discrete objects in silico according to user-specified properties. For example, we may wish to design a protein to bind its target, arrange components within a circuit to minimize latency, or find materials with certain properties. Given a property predictive model, in silico design typically involves training a generative model over the design space (e.g., protein sequence space) to concentrate on designs with the desired properties. Distributional optimization -- which can be formalized as an estimation of distribution algorithm or as reinforcement learning policy optimization -- finds the generative model that maximizes an objective function in expectation. Optimizing a distribution over discrete-valued designs is in general challenging because of the combinatorial nature of the design space. However, many property predictors in scientific applications are decomposable in the sense that they can be factorized over design variables in a way that could in principle enable more effective optimization. For example, amino acids at a catalytic site of a protein may only loosely interact with amino acids of the rest of the protein to achieve maximal catalytic activity. Current distributional optimization algorithms are unable to make use of such decomposability structure. Herein, we propose and demonstrate use of a new distributional optimization algorithm, Decomposition-Aware Distributional Optimization (DADO), that can leverage any decomposability defined by a junction tree on the design variables, to make optimization more efficient. At its core, DADO employs a soft-factorized \"search distribution\" -- a learned generative model -- for efficient navigation of the search space, invoking graph message-passing to coordinate optimization across linked factors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03047",
        "abs_url": "https://arxiv.org/abs/2511.03047",
        "pdf_url": "https://arxiv.org/pdf/2511.03047",
        "title": "Unsupervised Evaluation of Multi-Turn Objective-Driven Interactions",
        "authors": [
            "Emi Soroka",
            "Tanmay Chopra",
            "Krish Desai",
            "Sanjay Lall"
        ],
        "comments": "Under review at ICLR 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) have seen increasing popularity in enterprise applications where AI agents and humans engage in objective-driven interactions. However, these systems are difficult to evaluate: data may be complex and unlabeled; human annotation is often impractical at scale; custom metrics can monitor for specific errors, but not previously-undetected ones; and LLM judges can produce unreliable results. We introduce the first set of unsupervised metrics for objective-driven interactions, leveraging statistical properties of unlabeled interaction data and using fine-tuned LLMs to adapt to distributional shifts. We develop metrics for labeling user goals, measuring goal completion, and quantifying LLM uncertainty without grounding evaluations in human-generated ideal responses. Our approach is validated on open-domain and task-specific interaction data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03060",
        "abs_url": "https://arxiv.org/abs/2511.03060",
        "pdf_url": "https://arxiv.org/pdf/2511.03060",
        "title": "The Curved Spacetime of Transformer Architectures",
        "authors": [
            "Riccardo Di Sipio",
            "Jairo Diaz-Rodriguez",
            "Luis Serrano"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL); Differential Geometry (math.DG)",
        "abstract": "We present a geometric framework for understanding Transformer-based language models, drawing an explicit analogy to General Relativity. Queries and keys induce an effective metric on representation space, and attention acts as a discrete connection that implements parallel transport of value vectors across tokens. Stacked layers provide discrete time-slices through which token representations evolve on this curved manifold, while backpropagation plays the role of a least-action principle that shapes loss-minimizing trajectories in parameter space. If this analogy is correct, token embeddings should not traverse straight paths in feature space; instead, their layer-wise steps should bend and reorient as interactions mediated by embedding space curvature. To test this prediction, we design experiments that expose both the presence and the consequences of curvature: (i) we visualize a curvature landscape for a full paragraph, revealing how local turning angles vary across tokens and layers; (ii) we show through simulations that excess counts of sharp/flat angles and longer length-to-chord ratios are not explainable by dimensionality or chance; and (iii) inspired by Einstein's eclipse experiment, we probe deflection under controlled context edits, demonstrating measurable, meaning-consistent bends in embedding trajectories that confirm attention-induced curvature.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03068",
        "abs_url": "https://arxiv.org/abs/2511.03068",
        "pdf_url": "https://arxiv.org/pdf/2511.03068",
        "title": "Homomorphism distortion: A metric to distinguish them all and in the latent space bind them",
        "authors": [
            "Martin Carrasco",
            "Olga Zaghen",
            "Erik Bekkers",
            "Bastian Rieck"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "For far too long, expressivity of graph neural networks has been measured \\emph{only} in terms of combinatorial properties. In this work we stray away from this tradition and provide a principled way to measure similarity between vertex attributed graphs. We denote this measure as the \\emph{graph homomorphism distortion}. We show it can \\emph{completely characterize} graphs and thus is also a \\emph{complete graph embedding}. However, somewhere along the road, we run into the graph canonization problem. To circumvent this obstacle, we devise to efficiently compute this measure via sampling, which in expectation ensures \\emph{completeness}. Additionally, we also discovered that we can obtain a metric from this measure. We validate our claims empirically and find that the \\emph{graph homomorphism distortion}: (1.) fully distinguishes the \\texttt{BREC} dataset with up to $4$-WL non-distinguishable graphs, and (2.) \\emph{outperforms} previous methods inspired in homomorphisms under the \\texttt{ZINC-12k} dataset. These theoretical results, (and their empirical validation), pave the way for future characterization of graphs, extending the graph theoretic tradition to new frontiers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03074",
        "abs_url": "https://arxiv.org/abs/2511.03074",
        "pdf_url": "https://arxiv.org/pdf/2511.03074",
        "title": "Online Learning to Rank under Corruption: A Robust Cascading Bandits Approach",
        "authors": [
            "Fatemeh Ghaffari",
            "Siddarth Sitaraman",
            "Xutong Liu",
            "Xuchuang Wang",
            "Mohammad Hajiesmaili"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Online learning to rank (OLTR) studies how to recommend a short ranked list of items from a large pool and improves future rankings based on user clicks. This setting is commonly modeled as cascading bandits, where the objective is to maximize the likelihood that the user clicks on at least one of the presented items across as many timesteps as possible. However, such systems are vulnerable to click fraud and other manipulations (i.e., corruption), where bots or paid click farms inject corrupted feedback that misleads the learning process and degrades user experience. In this paper, we propose MSUCB, a robust algorithm that incorporates a novel mean-of-medians estimator, which to our knowledge is applied to bandits with corruption setting for the first time. This estimator behaves like a standard mean in the absence of corruption, so no cost is paid for robustness. Under corruption, the median step filters out outliers and corrupted samples, keeping the estimate close to its true value. Updating this estimate at every round further accelerates empirical convergence in experiments. Hence, MSUCB achieves optimal logarithmic regret in the absence of corruption and degrades gracefully under corruptions, with regret increasing only by an additive term tied to the total corruption. Comprehensive and extensive experiments on real-world datasets further demonstrate that our approach consistently outperforms prior methods while maintaining strong robustness. In particular, it achieves a \\(97.35\\%\\) and a \\(91.60\\%\\) regret improvement over two state-of-the-art methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03100",
        "abs_url": "https://arxiv.org/abs/2511.03100",
        "pdf_url": "https://arxiv.org/pdf/2511.03100",
        "title": "Scaling Multi-Agent Environment Co-Design with Diffusion Models",
        "authors": [
            "Hao Xiang Li",
            "Michael Amir",
            "Amanda Prorok"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Multiagent Systems (cs.MA)",
        "abstract": "The agent-environment co-design paradigm jointly optimises agent policies and environment configurations in search of improved system performance. With application domains ranging from warehouse logistics to windfarm management, co-design promises to fundamentally change how we deploy multi-agent systems. However, current co-design methods struggle to scale. They collapse under high-dimensional environment design spaces and suffer from sample inefficiency when addressing moving targets inherent to joint optimisation. We address these challenges by developing Diffusion Co-Design (DiCoDe), a scalable and sample-efficient co-design framework pushing co-design towards practically relevant settings. DiCoDe incorporates two core innovations. First, we introduce Projected Universal Guidance (PUG), a sampling technique that enables DiCoDe to explore a distribution of reward-maximising environments while satisfying hard constraints such as spatial separation between obstacles. Second, we devise a critic distillation mechanism to share knowledge from the reinforcement learning critic, ensuring that the guided diffusion model adapts to evolving agent policies using a dense and up-to-date learning signal. Together, these improvements lead to superior environment-policy pairs when validated on challenging multi-agent environment co-design benchmarks including warehouse automation, multi-agent pathfinding and wind farm optimisation. Our method consistently exceeds the state-of-the-art, achieving, for example, 39% higher rewards in the warehouse setting with 66% fewer simulation samples. This sets a new standard in agent-environment co-design, and is a stepping stone towards reaping the rewards of co-design in real world domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03107",
        "abs_url": "https://arxiv.org/abs/2511.03107",
        "pdf_url": "https://arxiv.org/pdf/2511.03107",
        "title": "An Efficient Classification Model for Cyber Text",
        "authors": [
            "Md Sakhawat Hossen",
            "Md. Zashid Iqbal Borshon",
            "A. S. M. Badrudduza"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Information Theory (cs.IT)",
        "abstract": "The uprising of deep learning methodology and practice in recent years has brought about a severe consequence of increasing carbon footprint due to the insatiable demand for computational resources and power. The field of text analytics also experienced a massive transformation in this trend of monopolizing methodology. In this paper, the original TF-IDF algorithm has been modified, and Clement Term Frequency-Inverse Document Frequency (CTF-IDF) has been proposed for data preprocessing. This paper primarily discusses the effectiveness of classical machine learning techniques in text analytics with CTF-IDF and a faster IRLBA algorithm for dimensionality reduction. The introduction of both of these techniques in the conventional text analytics pipeline ensures a more efficient, faster, and less computationally intensive application when compared with deep learning methodology regarding carbon footprint, with minor compromise in accuracy. The experimental results also exhibit a manifold of reduction in time complexity and improvement of model accuracy for the classical machine learning methods discussed further in this paper.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03110",
        "abs_url": "https://arxiv.org/abs/2511.03110",
        "pdf_url": "https://arxiv.org/pdf/2511.03110",
        "title": "Towards Scalable Backpropagation-Free Gradient Estimation",
        "authors": [
            "Daniel Wang",
            "Evan Markou",
            "Dylan Campbell"
        ],
        "comments": "12 pages, 2 figures, Accepted to AJCAI 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "While backpropagation--reverse-mode automatic differentiation--has been extraordinarily successful in deep learning, it requires two passes (forward and backward) through the neural network and the storage of intermediate activations. Existing gradient estimation methods that instead use forward-mode automatic differentiation struggle to scale beyond small networks due to the high variance of the estimates. Efforts to mitigate this have so far introduced significant bias to the estimates, reducing their utility. We introduce a gradient estimation approach that reduces both bias and variance by manipulating upstream Jacobian matrices when computing guess directions. It shows promising results and has the potential to scale to larger networks, indeed performing better as the network width is increased. Our understanding of this method is facilitated by analyses of bias and variance, and their connection to the low-dimensional structure of neural network gradients.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03114",
        "abs_url": "https://arxiv.org/abs/2511.03114",
        "pdf_url": "https://arxiv.org/pdf/2511.03114",
        "title": "An Augmentation Overlap Theory of Contrastive Learning",
        "authors": [
            "Qi Zhang",
            "Yifei Wang",
            "Yisen Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Recently, self-supervised contrastive learning has achieved great success on various tasks. However, its underlying working mechanism is yet unclear. In this paper, we first provide the tightest bounds based on the widely adopted assumption of conditional independence. Further, we relax the conditional independence assumption to a more practical assumption of augmentation overlap and derive the asymptotically closed bounds for the downstream performance. Our proposed augmentation overlap theory hinges on the insight that the support of different intra-class samples will become more overlapped under aggressive data augmentations, thus simply aligning the positive samples (augmented views of the same sample) could make contrastive learning cluster intra-class samples together. Moreover, from the newly derived augmentation overlap perspective, we develop an unsupervised metric for the representation evaluation of contrastive learning, which aligns well with the downstream performance almost without relying on additional modules. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03128",
        "abs_url": "https://arxiv.org/abs/2511.03128",
        "pdf_url": "https://arxiv.org/pdf/2511.03128",
        "title": "From Insight to Exploit: Leveraging LLM Collaboration for Adaptive Adversarial Text Generation",
        "authors": [
            "Najrin Sultana",
            "Md Rafi Ur Rashid",
            "Kang Gu",
            "Shagufta Mehnaz"
        ],
        "comments": "Findings of the Association for Computational Linguistics: EMNLP 2025 (camera-ready)",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "LLMs can provide substantial zero-shot performance on diverse tasks using a simple task prompt, eliminating the need for training or fine-tuning. However, when applying these models to sensitive tasks, it is crucial to thoroughly assess their robustness against adversarial inputs. In this work, we introduce Static Deceptor (StaDec) and Dynamic Deceptor (DyDec), two innovative attack frameworks designed to systematically generate dynamic and adaptive adversarial examples by leveraging the understanding of the LLMs. We produce subtle and natural-looking adversarial inputs that preserve semantic similarity to the original text while effectively deceiving the target LLM. By utilizing an automated, LLM-driven pipeline, we eliminate the dependence on external heuristics. Our attacks evolve with the advancements in LLMs and demonstrate strong transferability across models unknown to the attacker. Overall, this work provides a systematic approach for the self-assessment of an LLM's robustness. We release our code and data at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03149",
        "abs_url": "https://arxiv.org/abs/2511.03149",
        "pdf_url": "https://arxiv.org/pdf/2511.03149",
        "title": "Forecast2Anomaly (F2A): Adapting Multivariate Time Series Foundation Models for Anomaly Prediction",
        "authors": [
            "Atif Hassan",
            "Tarun Kumar",
            "Ashish Mishra",
            "Sergey Serebryakov",
            "Satish Kumar Mopur",
            "Phanidhar Koganti",
            "Murthy Chelankuri",
            "Ramanagopal Vogety",
            "Suparna Bhattacharya",
            "Martin Foltin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Forecasting anomalies (anomaly prediction) in multivariate time series from different real-world, dynamic, and complex systems is vital for preempting critical failures, leading to a substantial minimization in operational costs and human labor. Yet, existing methods are limited to specific systems while failing to generalize to evolving anomaly patterns over time. In contrast, pretrained Time Series Foundation Models (TSFMs) have recently demonstrated strong generalization and zero-shot forecasting capabilities. However, their potential remains untapped for anomaly prediction, a task fundamentally different from forecasting normal behavior. Thus, we present Forecast2Anomaly (F2A), a novel framework that empowers TSFMs with anomaly prediction abilities through two key innovations. First, we propose a joint forecast-anomaly loss that fine-tunes TSFMs to accurately forecast future signals even at anomalous time points. Second, we introduce a Retrieval-Augmented Generation (RAG) module that retrieves historically relevant horizons and conditions predictions on them. This component dynamically adapts to distributional shifts at inference time, enabling F2A to track evolving anomalies without requiring model updates. By combining targeted fine-tuning with dynamic retrieval, F2A bridges the gap between robust TSFM zero-shot forecasting and zero-shot anomaly prediction. Extensive experiments across 16 diverse datasets and multiple TSFM backbones show that F2A consistently outperforms state-of-the-art methods, offering a scalable, zero-shot anomaly prediction solution for real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03168",
        "abs_url": "https://arxiv.org/abs/2511.03168",
        "pdf_url": "https://arxiv.org/pdf/2511.03168",
        "title": "UnCLe: Towards Scalable Dynamic Causal Discovery in Non-linear Temporal Systems",
        "authors": [
            "Tingzhu Bi",
            "Yicheng Pan",
            "Xinrui Jiang",
            "Huize Sun",
            "Meng Ma",
            "Ping Wang"
        ],
        "comments": "12 pages main content, 18 pages appendix, NeurIPS 2025. Code: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Uncovering cause-effect relationships from observational time series is fundamental to understanding complex systems. While many methods infer static causal graphs, real-world systems often exhibit dynamic causality-where relationships evolve over time. Accurately capturing these temporal dynamics requires time-resolved causal graphs. We propose UnCLe, a novel deep learning method for scalable dynamic causal discovery. UnCLe employs a pair of Uncoupler and Recoupler networks to disentangle input time series into semantic representations and learns inter-variable dependencies via auto-regressive Dependency Matrices. It estimates dynamic causal influences by analyzing datapoint-wise prediction errors induced by temporal perturbations. Extensive experiments demonstrate that UnCLe not only outperforms state-of-the-art baselines on static causal discovery benchmarks but, more importantly, exhibits a unique capability to accurately capture and represent evolving temporal causality in both synthetic and real-world dynamic systems (e.g., human motion). UnCLe offers a promising approach for revealing the underlying, time-varying mechanisms of complex phenomena.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03187",
        "abs_url": "https://arxiv.org/abs/2511.03187",
        "pdf_url": "https://arxiv.org/pdf/2511.03187",
        "title": "Periodic Skill Discovery",
        "authors": [
            "Jonghae Park",
            "Daesol Cho",
            "Jusuk Lee",
            "Dongseok Shim",
            "Inkyu Jang",
            "H. Jin Kim"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "Unsupervised skill discovery in reinforcement learning (RL) aims to learn diverse behaviors without relying on external rewards. However, current methods often overlook the periodic nature of learned skills, focusing instead on increasing the mutual dependence between states and skills or maximizing the distance traveled in latent space. Considering that many robotic tasks -- particularly those involving locomotion -- require periodic behaviors across varying timescales, the ability to discover diverse periodic skills is essential. Motivated by this, we propose Periodic Skill Discovery (PSD), a framework that discovers periodic behaviors in an unsupervised manner. The key idea of PSD is to train an encoder that maps states to a circular latent space, thereby naturally encoding periodicity in the latent representation. By capturing temporal distance, PSD can effectively learn skills with diverse periods in complex robotic tasks, even with pixel-based observations. We further show that these learned skills achieve high performance on downstream tasks such as hurdling. Moreover, integrating PSD with an existing skill discovery method offers more diverse behaviors, thus broadening the agent's repertoire. Our code and demos are available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03196",
        "abs_url": "https://arxiv.org/abs/2511.03196",
        "pdf_url": "https://arxiv.org/pdf/2511.03196",
        "title": "Cross-Modal Alignment via Variational Copula Modelling",
        "authors": [
            "Feng Wu",
            "Tsai Hor Chan",
            "Fuying Wang",
            "Guosheng Yin",
            "Lequan Yu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Various data modalities are common in real-world applications (e.g., electronic health records, medical images and clinical notes in healthcare). It is essential to develop multimodal learning methods to aggregate various information from multiple modalities. The main challenge is how to appropriately align and fuse the representations of different modalities into a joint distribution. Existing methods mainly rely on concatenation or the Kronecker product, oversimplifying the interaction structure between modalities and indicating a need to model more complex interactions. Additionally, the joint distribution of latent representations with higher-order interactions is underexplored. Copula is a powerful statistical structure for modelling the interactions among variables, as it naturally bridges the joint distribution and marginal distributions of multiple variables. We propose a novel copula-driven multimodal learning framework, which focuses on learning the joint distribution of various modalities to capture the complex interactions among them. The key idea is to interpret the copula model as a tool to align the marginal distributions of the modalities efficiently. By assuming a Gaussian mixture distribution for each modality and a copula model on the joint distribution, our model can generate accurate representations for missing modalities. Extensive experiments on public MIMIC datasets demonstrate the superior performance of our model over other competitors. The code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03201",
        "abs_url": "https://arxiv.org/abs/2511.03201",
        "pdf_url": "https://arxiv.org/pdf/2511.03201",
        "title": "A Quantized VAE-MLP Botnet Detection Model: A Systematic Evaluation of Quantization-Aware Training and Post-Training Quantization Strategies",
        "authors": [
            "Hassan Wasswa",
            "Hussein Abbass",
            "Timothy Lynar"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "In an effort to counter the increasing IoT botnet-based attacks, state-of-the-art deep learning methods have been proposed and have achieved impressive detection accuracy. However, their computational intensity restricts deployment on resource-constrained IoT devices, creating a critical need for lightweight detection models. A common solution to this challenge is model compression via quantization. This study proposes a VAE-MLP model framework where an MLP-based classifier is trained on 8-dimensional latent vectors derived from the high-dimensional train data using the encoder component of a pretrained variational autoencoder (VAE). Two widely used quantization strategies--Quantization-Aware Training (QAT) and Post-Training Quantization (PTQ)--are then systematically evaluated in terms of their impact on detection performance, storage efficiency, and inference latency using two benchmark IoT botnet datasets--N-BaIoT and CICIoT2022. The results revealed that, with respect to detection accuracy, the QAT strategy experienced a more noticeable decline,whereas PTQ incurred only a marginal reduction compared to the original unquantized model. Furthermore, PTQ yielded a 6x speedup and 21x reduction in size, while QAT achieved a 3x speedup and 24x compression, demonstrating the practicality of quantization for device-level IoT botnet detection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03238",
        "abs_url": "https://arxiv.org/abs/2511.03238",
        "pdf_url": "https://arxiv.org/pdf/2511.03238",
        "title": "Incorporating Quality of Life in Climate Adaptation Planning via Reinforcement Learning",
        "authors": [
            "Miguel Costa",
            "Arthur Vandervoort",
            "Martin Drews",
            "Karyn Morrissey",
            "Francisco C. Pereira"
        ],
        "comments": "Accepted for presentation at AI in Science (AIS) 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Urban flooding is expected to increase in frequency and severity as a consequence of climate change, causing wide-ranging impacts that include a decrease in urban Quality of Life (QoL). Meanwhile, policymakers must devise adaptation strategies that can cope with the uncertain nature of climate change and the complex and dynamic nature of urban flooding. Reinforcement Learning (RL) holds significant promise in tackling such complex, dynamic, and uncertain problems. Because of this, we use RL to identify which climate adaptation pathways lead to a higher QoL in the long term. We do this using an Integrated Assessment Model (IAM) which combines a rainfall projection model, a flood model, a transport accessibility model, and a quality of life index. Our preliminary results suggest that this approach can be used to learn optimal adaptation measures and it outperforms other realistic and real-world planning strategies. Our framework is publicly available: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03241",
        "abs_url": "https://arxiv.org/abs/2511.03241",
        "pdf_url": "https://arxiv.org/pdf/2511.03241",
        "title": "A unified physics-informed generative operator framework for general inverse problems",
        "authors": [
            "Gang Bao",
            "Yaohua Zang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Solving inverse problems governed by partial differential equations (PDEs) is central to science and engineering, yet remains challenging when measurements are sparse, noisy, or when the underlying coefficients are high-dimensional or discontinuous. Existing deep learning approaches either require extensive labeled datasets or are limited to specific measurement types, often leading to failure in such regimes and restricting their practical applicability. Here, a novel generative neural operator framework, IGNO, is introduced to overcome these limitations. IGNO unifies the solution of inverse problems from both point measurements and operator-valued data without labeled training pairs. This framework encodes high-dimensional, potentially discontinuous coefficient fields into a low-dimensional latent space, which drives neural operator decoders to reconstruct both coefficients and PDE solutions. Training relies purely on physics constraints through PDE residuals, while inversion proceeds via efficient gradient-based optimization in latent space, accelerated by an a priori normalizing flow model. Across a diverse set of challenging inverse problems, including recovery of discontinuous coefficients from solution-based measurements and the EIT problem with operator-based measurements, IGNO consistently achieves accurate, stable, and scalable inversion even under severe noise. It consistently outperforms the state-of-the-art method under varying noise levels and demonstrates strong generalization to out-of-distribution targets. These results establish IGNO as a unified and powerful framework for tackling challenging inverse problems across computational science domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03243",
        "abs_url": "https://arxiv.org/abs/2511.03243",
        "pdf_url": "https://arxiv.org/pdf/2511.03243",
        "title": "Climate Adaptation with Reinforcement Learning: Economic vs. Quality of Life Adaptation Pathways",
        "authors": [
            "Miguel Costa",
            "Arthur Vandervoort",
            "Martin Drews",
            "Karyn Morrissey",
            "Francisco C. Pereira"
        ],
        "comments": "Accepted for presentation at AI for Climate and Conservation Workshop at EurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Climate change will cause an increase in the frequency and severity of flood events, prompting the need for cohesive adaptation policymaking. Designing effective adaptation policies, however, depends on managing the uncertainty of long-term climate impacts. Meanwhile, such policies can feature important normative choices that are not always made explicit. We propose that Reinforcement Learning (RL) can be a useful tool to both identify adaptation pathways under uncertain conditions while it also allows for the explicit modelling (and consequent comparison) of different adaptation priorities (e.g. economic vs. wellbeing). We use an Integrated Assessment Model (IAM) to link together a rainfall and flood model, and compute the impacts of flooding in terms of quality of life (QoL), transportation, and infrastructure damage. Our results show that models prioritising QoL over economic impacts results in more adaptation spending as well as a more even distribution of spending over the study area, highlighting the extent to which such normative assumptions can alter adaptation policy. Our framework is publicly available: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03256",
        "abs_url": "https://arxiv.org/abs/2511.03256",
        "pdf_url": "https://arxiv.org/pdf/2511.03256",
        "title": "Decoupled Entropy Minimization",
        "authors": [
            "Jing Ma",
            "Hanlin Li",
            "Xiang Xiang"
        ],
        "comments": "To appear at NeurIPS 2025 (main conference), San Diego, CA, USA. Codes available at this https URL",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV); Information Theory (cs.IT); Statistics Theory (math.ST); Machine Learning (stat.ML)",
        "abstract": "Entropy Minimization (EM) is beneficial to reducing class overlap, bridging domain gap, and restricting uncertainty for various tasks in machine learning, yet its potential is limited. To study the internal mechanism of EM, we reformulate and decouple the classical EM into two parts with opposite effects: cluster aggregation driving factor (CADF) rewards dominant classes and prompts a peaked output distribution, while gradient mitigation calibrator (GMC) penalizes high-confidence classes based on predicted probabilities. Furthermore, we reveal the limitations of classical EM caused by its coupled formulation: 1) reward collapse impedes the contribution of high-certainty samples in the learning process, and 2) easy-class bias induces misalignment between output distribution and label distribution. To address these issues, we propose Adaptive Decoupled Entropy Minimization (AdaDEM), which normalizes the reward brought from CADF and employs a marginal entropy calibrator (MEC) to replace GMC. AdaDEM outperforms DEM*, an upper-bound variant of classical EM, and achieves superior performance across various imperfectly supervised learning tasks in noisy and dynamic environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03276",
        "abs_url": "https://arxiv.org/abs/2511.03276",
        "pdf_url": "https://arxiv.org/pdf/2511.03276",
        "title": "Diffusion Language Models are Super Data Learners",
        "authors": [
            "Jinjie Ni",
            "Qian Liu",
            "Longxu Dou",
            "Chao Du",
            "Zili Wang",
            "Hang Yan",
            "Tianyu Pang",
            "Michael Qizhe Shieh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Under strictly controlled pre-training settings, we observe a Crossover: when unique data is limited, diffusion language models (DLMs) consistently surpass autoregressive (AR) models by training for more epochs. The crossover shifts later with more or higher-quality data, earlier with larger models, and persists across dense and sparse architectures. We attribute the gains to three compounding factors: (1) any-order modeling, (2) super-dense compute from iterative bidirectional denoising, and (3) built-in Monte Carlo augmentation; input or parameter noise improves AR under data constraint but cannot close the gap. At scale, a 1.7B DLM trained with a ~1.5T-token compute budget on 10B unique Python tokens overtakes an AR coder trained with strictly matched settings. In addition, a 1B-parameter DLM achieves > 56% accuracy on HellaSwag and > 33% on MMLU using only 1B tokens, without any special tricks, just by repeating standard pre-training data. We also show that rising validation cross-entropy does not imply degraded downstream performance in this regime.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03279",
        "abs_url": "https://arxiv.org/abs/2511.03279",
        "pdf_url": "https://arxiv.org/pdf/2511.03279",
        "title": "Multi-Objective Adaptive Rate Limiting in Microservices Using Deep Reinforcement Learning",
        "authors": [
            "Ning Lyu",
            "Yuxi Wang",
            "Ziyu Cheng",
            "Qingyuan Zhang",
            "Feng Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As cloud computing and microservice architectures become increasingly prevalent, API rate limiting has emerged as a critical mechanism for ensuring system stability and service quality. Traditional rate limiting algorithms, such as token bucket and sliding window, while widely adopted, struggle to adapt to dynamic traffic patterns and varying system loads. This paper proposes an adaptive rate limiting strategy based on deep reinforcement learning that dynamically balances system throughput and service latency. We design a hybrid architecture combining Deep Q-Network (DQN) and Asynchronous Advantage Actor-Critic (A3C) algorithms, modeling the rate limiting decision process as a Markov Decision Process. The system continuously monitors microservice states and learns optimal rate limiting policies through environmental interaction. Extensive experiments conducted in a Kubernetes cluster environment demonstrate that our approach achieves 23.7% throughput improvement and 31.4% P99 latency reduction compared to traditional fixed-threshold strategies under high-load scenarios. Results from a 90-day production deployment handling 500 million daily requests validate the practical effectiveness of the proposed method, with 82% reduction in service degradation incidents and 68% decrease in manual interventions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03280",
        "abs_url": "https://arxiv.org/abs/2511.03280",
        "pdf_url": "https://arxiv.org/pdf/2511.03280",
        "title": "A Probabilistic Approach to Pose Synchronization for Multi-Reference Alignment with Applications to MIMO Wireless Communication Systems",
        "authors": [
            "Rob Romijnders",
            "Gabriele Cesa",
            "Christos Louizos",
            "Kumar Pratik",
            "Arash Behboodi"
        ],
        "comments": "To appear in NeurIPS workshop: AI and ML for Next-Generation Wireless Communications (AI4NextG)",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "From molecular imaging to wireless communications, the ability to align and reconstruct signals from multiple misaligned observations is crucial for system performance. We study the problem of multi-reference alignment (MRA), which arises in many real-world problems, such as cryo-EM, computer vision, and, in particular, wireless communication systems. Using a probabilistic approach to model MRA, we find a new algorithm that uses relative poses as nuisance variables to marginalize out -- thereby removing the global symmetries of the problem and allowing for more direct solutions and improved convergence. The decentralization of this approach enables significant computational savings by avoiding the cubic scaling of centralized methods through cycle consistency. Both proposed algorithms achieve lower reconstruction error across experimental settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03285",
        "abs_url": "https://arxiv.org/abs/2511.03285",
        "pdf_url": "https://arxiv.org/pdf/2511.03285",
        "title": "Graph Neural AI with Temporal Dynamics for Comprehensive Anomaly Detection in Microservices",
        "authors": [
            "Qingyuan Zhang",
            "Ning Lyu",
            "Le Liu",
            "Yuxi Wang",
            "Ziyu Cheng",
            "Cancan Hua"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This study addresses the problem of anomaly detection and root cause tracing in microservice architectures and proposes a unified framework that combines graph neural networks with temporal modeling. The microservice call chain is abstracted as a directed graph, where multidimensional features of nodes and edges are used to construct a service topology representation, and graph convolution is applied to aggregate features across nodes and model dependencies, capturing complex structural relationships among services. On this basis, gated recurrent units are introduced to model the temporal evolution of call chains, and multi-layer stacking and concatenation operations are used to jointly obtain structural and temporal representations, improving the ability to identify anomaly patterns. Furthermore, anomaly scoring functions at both the node and path levels are defined to achieve unified modeling from local anomaly detection to global call chain tracing, which enables the identification of abnormal service nodes and the reconstruction of potential anomaly propagation paths. Sensitivity experiments are then designed from multiple dimensions, including hyperparameters, environmental disturbances, and data distribution, to evaluate the framework, and results show that it outperforms baseline methods in key metrics such as AUC, ACC, Recall, and F1-Score, maintaining high accuracy and stability under dynamic topologies and complex environments. This research not only provides a new technical path for anomaly detection in microservices but also lays a methodological foundation for intelligent operations in distributed systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03344",
        "abs_url": "https://arxiv.org/abs/2511.03344",
        "pdf_url": "https://arxiv.org/pdf/2511.03344",
        "title": "SORTeD Rashomon Sets of Sparse Decision Trees: Anytime Enumeration",
        "authors": [
            "Elif Arslan",
            "Jacobus G. M. van der Linden",
            "Serge Hoogendoorn",
            "Marco Rinaldi",
            "Emir Demirović"
        ],
        "comments": "32 pages, 10 figures, to be published in the proceedings of The Thirty-Ninth Annual Conference on Neural Information Processing Systems",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Sparse decision tree learning provides accurate and interpretable predictive models that are ideal for high-stakes applications by finding the single most accurate tree within a (soft) size limit. Rather than relying on a single \"best\" tree, Rashomon sets-trees with similar performance but varying structures-can be used to enhance variable importance analysis, enrich explanations, and enable users to choose simpler trees or those that satisfy stakeholder preferences (e.g., fairness) without hard-coding such criteria into the objective function. However, because finding the optimal tree is NP-hard, enumerating the Rashomon set is inherently challenging. Therefore, we introduce SORTD, a novel framework that improves scalability and enumerates trees in the Rashomon set in order of the objective value, thus offering anytime behavior. Our experiments show that SORTD reduces runtime by up to two orders of magnitude compared with the state of the art. Moreover, SORTD can compute Rashomon sets for any separable and totally ordered objective and supports post-evaluating the set using other separable (and partially ordered) objectives. Together, these advances make exploring Rashomon sets more practical in real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03363",
        "abs_url": "https://arxiv.org/abs/2511.03363",
        "pdf_url": "https://arxiv.org/pdf/2511.03363",
        "title": "A Modular, Data-Free Pipeline for Multi-Label Intention Recognition in Transportation Agentic AI Applications",
        "authors": [
            "Xiaocai Zhang",
            "Hur Lim",
            "Ke Wang",
            "Zhe Xiao",
            "Jing Wang",
            "Kelvin Lee",
            "Xiuju Fu",
            "Zheng Qin"
        ],
        "comments": "Present in the Transportation Research Board (TRB) Annual Meeting 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In this study, a modular, data-free pipeline for multi-label intention recognition is proposed for agentic AI applications in transportation. Unlike traditional intent recognition systems that depend on large, annotated corpora and often struggle with fine-grained, multi-label discrimination, our approach eliminates the need for costly data collection while enhancing the accuracy of multi-label intention understanding. Specifically, the overall pipeline, named DMTC, consists of three steps: 1) using prompt engineering to guide large language models (LLMs) to generate diverse synthetic queries in different transport scenarios; 2) encoding each textual query with a Sentence-T5 model to obtain compact semantic embeddings; 3) training a lightweight classifier using a novel online focal-contrastive (OFC) loss that emphasizes hard samples and maximizes inter-class separability. The applicability of the proposed pipeline is demonstrated in an agentic AI application in the maritime transportation context. Extensive experiments show that DMTC achieves a Hamming loss of 5.35% and an AUC of 95.92%, outperforming state-of-the-art multi-label classifiers and recent end-to-end SOTA LLM-based baselines. Further analysis reveals that Sentence-T5 embeddings improve subset accuracy by at least 3.29% over alternative encoders, and integrating the OFC loss yields an additional 0.98% gain compared to standard contrastive objectives. In conclusion, our system seamlessly routes user queries to task-specific modules (e.g., ETA information, traffic risk evaluation, and other typical scenarios in the transportation domain), laying the groundwork for fully autonomous, intention-aware agents without costly manual labelling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03368",
        "abs_url": "https://arxiv.org/abs/2511.03368",
        "pdf_url": "https://arxiv.org/pdf/2511.03368",
        "title": "TripleWin: Fixed-Point Equilibrium Pricing for Data-Model Coupled Markets",
        "authors": [
            "Hongrun Ren",
            "Yun Xiong",
            "Lei You",
            "Yingying Wang",
            "Haixu Xiong",
            "Yangyong Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The rise of the machine learning (ML) model economy has intertwined markets for training datasets and pre-trained models. However, most pricing approaches still separate data and model transactions or rely on broker-centric pipelines that favor one side. Recent studies of data markets with externalities capture buyer interactions but do not yield a simultaneous and symmetric mechanism across data sellers, model producers, and model buyers. We propose a unified data-model coupled market that treats dataset and model trading as a single system. A supply-side mapping transforms dataset payments into buyer-visible model quotations, while a demand-side mapping propagates buyer prices back to datasets through Shapley-based allocation. Together, they form a closed loop that links four interactions: supply-demand propagation in both directions and mutual coupling among buyers and among sellers. We prove that the joint operator is a standard interference function (SIF), guaranteeing existence, uniqueness, and global convergence of equilibrium prices. Experiments demonstrate efficient convergence and improved fairness compared with broker-centric and one-sided baselines. The code is available on this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03464",
        "abs_url": "https://arxiv.org/abs/2511.03464",
        "pdf_url": "https://arxiv.org/pdf/2511.03464",
        "title": "POEMS: Product of Experts for Interpretable Multi-omic Integration using Sparse Decoding",
        "authors": [
            "Mihriban Kocak Balik",
            "Pekka Marttinen",
            "Negar Safinianaini"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Integrating different molecular layers, i.e., multiomics data, is crucial for unraveling the complexity of diseases; yet, most deep generative models either prioritize predictive performance at the expense of interpretability or enforce interpretability by linearizing the decoder, thereby weakening the network's nonlinear expressiveness. To overcome this tradeoff, we introduce POEMS: Product Of Experts for Interpretable Multiomics Integration using Sparse Decoding, an unsupervised probabilistic framework that preserves predictive performance while providing interpretability. POEMS provides interpretability without linearizing any part of the network by 1) mapping features to latent factors using sparse connections, which directly translates to biomarker discovery, 2) allowing for cross-omic associations through a shared latent space using product of experts model, and 3) reporting contributions of each omic by a gating network that adaptively computes their influence in the representation learning. Additionally, we present an efficient sparse decoder. In a cancer subtyping case study, POEMS achieves competitive clustering and classification performance while offering our novel set of interpretations, demonstrating that biomarker based insight and predictive accuracy can coexist in multiomics representation learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03473",
        "abs_url": "https://arxiv.org/abs/2511.03473",
        "pdf_url": "https://arxiv.org/pdf/2511.03473",
        "title": "Reinforcement Learning Using known Invariances",
        "authors": [
            "Alexandru Cioba",
            "Aya Kayal",
            "Laura Toni",
            "Sattar Vakili",
            "Alberto Bernacchia"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In many real-world reinforcement learning (RL) problems, the environment exhibits inherent symmetries that can be exploited to improve learning efficiency. This paper develops a theoretical and algorithmic framework for incorporating known group symmetries into kernel-based RL. We propose a symmetry-aware variant of optimistic least-squares value iteration (LSVI), which leverages invariant kernels to encode invariance in both rewards and transition dynamics. Our analysis establishes new bounds on the maximum information gain and covering numbers for invariant RKHSs, explicitly quantifying the sample efficiency gains from symmetry. Empirical results on a customized Frozen Lake environment and a 2D placement design problem confirm the theoretical improvements, demonstrating that symmetry-aware RL achieves significantly better performance than their standard kernel counterparts. These findings highlight the value of structural priors in designing more sample-efficient reinforcement learning algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03475",
        "abs_url": "https://arxiv.org/abs/2511.03475",
        "pdf_url": "https://arxiv.org/pdf/2511.03475",
        "title": "RAGBoost: Efficient Retrieval-Augmented Generation with Accuracy-Preserving Context Reuse",
        "authors": [
            "Yinsicheng Jiang",
            "Yeqi Huang",
            "Liang Cheng",
            "Cheng Deng",
            "Xuan Sun",
            "Luo Mai"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Retrieval-augmented generation (RAG) enhances large language models (LLMs) with retrieved context but often suffers from downgraded prefill performance as modern applications demand longer and more complex inputs. Existing caching techniques either preserve accuracy with low cache reuse or improve reuse at the cost of degraded reasoning quality. We present RAGBoost, an efficient RAG system that achieves high cache reuse without sacrificing accuracy through accuracy-preserving context reuse. RAGBoost detects overlapping retrieved items across concurrent sessions and multi-turn interactions, using efficient context indexing, ordering, and de-duplication to maximize reuse, while lightweight contextual hints maintain reasoning fidelity. It integrates seamlessly with existing LLM inference engines and improves their prefill performance by 1.5-3X over state-of-the-art methods, while preserving or even enhancing reasoning accuracy across diverse RAG and agentic AI workloads. Our code is released at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03488",
        "abs_url": "https://arxiv.org/abs/2511.03488",
        "pdf_url": "https://arxiv.org/pdf/2511.03488",
        "title": "NAP: Attention-Based Late Fusion for Automatic Sleep Staging",
        "authors": [
            "Alvise Dei Rossi",
            "Julia van der Meer",
            "Markus H. Schmidt",
            "Claudio L.A. Bassetti",
            "Luigi Fiorillo",
            "Francesca Faraci"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Polysomnography signals are highly heterogeneous, varying in modality composition (e.g., EEG, EOG, ECG), channel availability (e.g., frontal, occipital EEG), and acquisition protocols across datasets and clinical sites. Most existing models that process polysomnography data rely on a fixed subset of modalities or channels and therefore neglect to fully exploit its inherently multimodal nature. We address this limitation by introducing NAP (Neural Aggregator of Predictions), an attention-based model which learns to combine multiple prediction streams using a tri-axial attention mechanism that captures temporal, spatial, and predictor-level dependencies. NAP is trained to adapt to different input dimensions. By aggregating outputs from frozen, pretrained single-channel models, NAP consistently outperforms individual predictors and simple ensembles, achieving state-of-the-art zero-shot generalization across multiple datasets. While demonstrated in the context of automated sleep staging from polysomnography, the proposed approach could be extended to other multimodal physiological applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03492",
        "abs_url": "https://arxiv.org/abs/2511.03492",
        "pdf_url": "https://arxiv.org/pdf/2511.03492",
        "title": "Why Less is More (Sometimes): A Theory of Data Curation",
        "authors": [
            "Elvis Dohmatob",
            "Mohammad Pezeshki",
            "Reyhane Askari-Hemmat"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "This paper introduces a theoretical framework to resolve a central paradox in modern machine learning: When is it better to use less data? This question has become critical as classical scaling laws suggesting ``more is more'' (Sun et al., 2025) are challenged by methods like LIMO (``less is more'') and s1 (Ye et al., 2025; Muenighoff et al., 2025), which achieve superior performance with small, aggressively curated datasets. Here, we study data curation strategies where an imperfect oracle selects the training examples according to their difficulty and correctness. Our results provide exact scaling law curves for test error under both label-agnostic and label-aware curation rules, revealing when and why keeping only a subset of data can improve generalization. In contrast to classical scaling laws, we show that under certain conditions, small curated datasets can outperform full datasets, and we provide analytical conditions for this by deriving precise phase transition curves tied to data size and quality. We validate these theoretical claims with empirical results on ImageNet, confirming our predictions about when curation improves accuracy and can even mitigate model collapse. Furthermore, our framework provides a principled explanation for the contradictory curation strategies recently observed in LLM mathematical reasoning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03527",
        "abs_url": "https://arxiv.org/abs/2511.03527",
        "pdf_url": "https://arxiv.org/pdf/2511.03527",
        "title": "Learning Without Critics? Revisiting GRPO in Classical Reinforcement Learning Environments",
        "authors": [
            "Bryan L. M. de Oliveira",
            "Felipe V. Frujeri",
            "Marcos P. C. M. Queiroz",
            "Luana G. B. Martins",
            "Telma W. de L. Soares",
            "Luckeciano C. Melo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Group Relative Policy Optimization (GRPO) has emerged as a scalable alternative to Proximal Policy Optimization (PPO) by eliminating the learned critic and instead estimating advantages through group-relative comparisons of trajectories. This simplification raises fundamental questions about the necessity of learned baselines in policy-gradient methods. We present the first systematic study of GRPO in classical single-task reinforcement learning environments, spanning discrete and continuous control tasks. Through controlled ablations isolating baselines, discounting, and group sampling, we reveal three key findings: (1) learned critics remain essential for long-horizon tasks: all critic-free baselines underperform PPO except in short-horizon environments like CartPole where episodic returns can be effective; (2) GRPO benefits from high discount factors (gamma = 0.99) except in HalfCheetah, where lack of early termination favors moderate discounting (gamma = 0.9); (3) smaller group sizes outperform larger ones, suggesting limitations in batch-based grouping strategies that mix unrelated episodes. These results reveal both the limitations of critic-free methods in classical control and the specific conditions where they remain viable alternatives to learned value functions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03529",
        "abs_url": "https://arxiv.org/abs/2511.03529",
        "pdf_url": "https://arxiv.org/pdf/2511.03529",
        "title": "Byzantine-Robust Federated Learning with Learnable Aggregation Weights",
        "authors": [
            "Javad Parsa",
            "Amir Hossein Daghestani",
            "André M. H. Teixeira",
            "Mikael Johansson"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated Learning (FL) enables clients to collaboratively train a global model without sharing their private data. However, the presence of malicious (Byzantine) clients poses significant challenges to the robustness of FL, particularly when data distributions across clients are heterogeneous. In this paper, we propose a novel Byzantine-robust FL optimization problem that incorporates adaptive weighting into the aggregation process. Unlike conventional approaches, our formulation treats aggregation weights as learnable parameters, jointly optimizing them alongside the global model parameters. To solve this optimization problem, we develop an alternating minimization algorithm with strong convergence guarantees under adversarial attack. We analyze the Byzantine resilience of the proposed objective. We evaluate the performance of our algorithm against state-of-the-art Byzantine-robust FL approaches across various datasets and attack scenarios. Experimental results demonstrate that our method consistently outperforms existing approaches, particularly in settings with highly heterogeneous data and a large proportion of malicious clients.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03548",
        "abs_url": "https://arxiv.org/abs/2511.03548",
        "pdf_url": "https://arxiv.org/pdf/2511.03548",
        "title": "Flat Minima and Generalization: Insights from Stochastic Convex Optimization",
        "authors": [
            "Matan Schliserman",
            "Shira Vansover-Hager",
            "Tomer Koren"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Understanding the generalization behavior of learning algorithms is a central goal of learning theory. A recently emerging explanation is that learning algorithms are successful in practice because they converge to flat minima, which have been consistently associated with improved generalization performance. In this work, we study the link between flat minima and generalization in the canonical setting of stochastic convex optimization with a non-negative, $\\beta$-smooth objective. Our first finding is that, even in this fundamental and well-studied setting, flat empirical minima may incur trivial $\\Omega(1)$ population risk while sharp minima generalizes optimally. Then, we show that this poor generalization behavior extends to two natural ''sharpness-aware'' algorithms originally proposed by Foret et al. (2021), designed to bias optimization toward flat solutions: Sharpness-Aware Gradient Descent (SA-GD) and Sharpness-Aware Minimization (SAM). For SA-GD, which performs gradient steps on the maximal loss in a predefined neighborhood, we prove that while it successfully converges to a flat minimum at a fast rate, the population risk of the solution can still be as large as $\\Omega(1)$, indicating that even flat minima found algorithmically using a sharpness-aware gradient method might generalize poorly. For SAM, a computationally efficient approximation of SA-GD based on normalized ascent steps, we show that although it minimizes the empirical loss, it may converge to a sharp minimum and also incur population risk $\\Omega(1)$. Finally, we establish population risk upper bounds for both SA-GD and SAM using algorithmic stability techniques.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03570",
        "abs_url": "https://arxiv.org/abs/2511.03570",
        "pdf_url": "https://arxiv.org/pdf/2511.03570",
        "title": "TabGemma: Text-Based Tabular ICL via LLM using Continued Pretraining and Retrieval",
        "authors": [
            "Günther Schindler",
            "Maximilian Schambach",
            "Michael Medek",
            "Sam Thelin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study LLMs for tabular prediction with mixed text, numeric, and categorical fields. We introduce TabGemma, a schema-agnostic in-context learner that treats rows as sequences and tackles two practical hurdles when adapting pretrained LLMs for tabular predictions: unstable numeric tokenization and limited context size. We propose to canonicalize numbers via signed scientific notation and continue pretraining of a 12B Gemma 3 model with a target imputation objective using a large-scale real world dataset. For inference, we use a compact n-gram-based retrieval to select informative exemplars that fit within a 128k-token window. On semantically rich benchmarks, TabGemma establishes a new state of the art on classification across low- and high-data regimes and improves monotonically with more context rows. For regression, it is competitive at small sample sizes but trails conventional approaches as data grows. Our results show that LLMs can be effective tabular in-context learners on highly semantic tasks when paired with dedicated numeric handling and context retrieval, while motivating further advances in numeric modeling and long-context scaling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03595",
        "abs_url": "https://arxiv.org/abs/2511.03595",
        "pdf_url": "https://arxiv.org/pdf/2511.03595",
        "title": "Tensor-Efficient High-Dimensional Q-learning",
        "authors": [
            "Junyi Wu",
            "Dan Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "High-dimensional reinforcement learning faces challenges with complex calculations and low sample efficiency in large state-action spaces. Q-learning algorithms struggle particularly with the curse of dimensionality, where the number of state-action pairs grows exponentially with problem size. While neural network-based approaches like Deep Q-Networks have shown success, recent tensor-based methods using low-rank decomposition offer more parameter-efficient alternatives. Building upon existing tensor-based methods, we propose Tensor-Efficient Q-Learning (TEQL), which enhances low-rank tensor decomposition via improved block coordinate descent on discretized state-action spaces, incorporating novel exploration and regularization mechanisms. The key innovation is an exploration strategy that combines approximation error with visit count-based upper confidence bound to prioritize actions with high uncertainty, avoiding wasteful random exploration. Additionally, we incorporate a frequency-based penalty term in the objective function to encourage exploration of less-visited state-action pairs and reduce overfitting to frequently visited regions. Empirical results on classic control tasks demonstrate that TEQL outperforms conventional matrix-based methods and deep RL approaches in both sample efficiency and total rewards, making it suitable for resource-constrained applications, such as space and healthcare where sampling costs are high.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03616",
        "abs_url": "https://arxiv.org/abs/2511.03616",
        "pdf_url": "https://arxiv.org/pdf/2511.03616",
        "title": "Going Beyond Expert Performance via Deep Implicit Imitation Reinforcement Learning",
        "authors": [
            "Iason Chrysomallis",
            "Georgios Chalkiadakis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Imitation learning traditionally requires complete state-action demonstrations from optimal or near-optimal experts. These requirements severely limit practical applicability, as many real-world scenarios provide only state observations without corresponding actions and expert performance is often suboptimal. In this paper we introduce a deep implicit imitation reinforcement learning framework that addresses both limitations by combining deep reinforcement learning with implicit imitation learning from observation-only datasets. Our main algorithm, Deep Implicit Imitation Q-Network (DIIQN), employs an action inference mechanism that reconstructs expert actions through online exploration and integrates a dynamic confidence mechanism that adaptively balances expert-guided and self-directed learning. This enables the agent to leverage expert guidance for accelerated training while maintaining capacity to surpass suboptimal expert performance. We further extend our framework with a Heterogeneous Actions DIIQN (HA-DIIQN) algorithm to tackle scenarios where expert and agent possess different action sets, a challenge previously unaddressed in the implicit imitation learning literature. HA-DIIQN introduces an infeasibility detection mechanism and a bridging procedure identifying alternative pathways connecting agent capabilities to expert guidance when direct action replication is impossible. Our experimental results demonstrate that DIIQN achieves up to 130% higher episodic returns compared to standard DQN, while consistently outperforming existing implicit imitation methods that cannot exceed expert performance. In heterogeneous action settings, HA-DIIQN learns up to 64% faster than baselines, leveraging expert datasets unusable by conventional approaches. Extensive parameter sensitivity analysis reveals the framework's robustness across varying dataset sizes and hyperparameter configurations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03618",
        "abs_url": "https://arxiv.org/abs/2511.03618",
        "pdf_url": "https://arxiv.org/pdf/2511.03618",
        "title": "Towards Formalizing Reinforcement Learning Theory",
        "authors": [
            "Shangtong Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "In this paper, we formalize the almost sure convergence of $Q$-learning and linear temporal difference (TD) learning with Markovian samples using the Lean 4 theorem prover based on the Mathlib library. $Q$-learning and linear TD are among the earliest and most influential reinforcement learning (RL) algorithms. The investigation of their convergence properties is not only a major research topic during the early development of the RL field but also receives increasing attention nowadays. This paper formally verifies their almost sure convergence in a unified framework based on the Robbins-Siegmund theorem. The framework developed in this work can be easily extended to convergence rates and other modes of convergence. This work thus makes an important step towards fully formalizing convergent RL results. The code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03631",
        "abs_url": "https://arxiv.org/abs/2511.03631",
        "pdf_url": "https://arxiv.org/pdf/2511.03631",
        "title": "Financial Management System for SMEs: Real-World Deployment of Accounts Receivable and Cash Flow Prediction",
        "authors": [
            "Bartłomiej Małkus",
            "Szymon Bobek",
            "Grzegorz J. Nalepa"
        ],
        "comments": "11 pages, 1 figure",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Small and Medium Enterprises (SMEs), particularly freelancers and early-stage businesses, face unique financial management challenges due to limited resources, small customer bases, and constrained data availability. This paper presents the development and deployment of an integrated financial prediction system that combines accounts receivable prediction and cash flow forecasting specifically designed for SME operational constraints. Our system addresses the gap between enterprise-focused financial tools and the practical needs of freelancers and small businesses. The solution integrates two key components: a binary classification model for predicting invoice payment delays, and a multi-module cash flow forecasting model that handles incomplete and limited historical data. A prototype system has been implemented and deployed as a web application with integration into Cluee's platform, a startup providing financial management tools for freelancers, demonstrating practical feasibility for real-world SME financial management.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03634",
        "abs_url": "https://arxiv.org/abs/2511.03634",
        "pdf_url": "https://arxiv.org/pdf/2511.03634",
        "title": "nanoTabPFN: A Lightweight and Educational Reimplementation of TabPFN",
        "authors": [
            "Alexander Pfefferle",
            "Johannes Hog",
            "Lennart Purucker",
            "Frank Hutter"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Tabular foundation models such as TabPFN have revolutionized predictive machine learning for tabular data. At the same time, the driving factors of this revolution are hard to understand. Existing open-source tabular foundation models are implemented in complicated pipelines boasting over 10,000 lines of code, lack architecture documentation or code quality. In short, the implementations are hard to understand, not beginner-friendly, and complicated to adapt for new experiments. We introduce nanoTabPFN, a simplified and lightweight implementation of the TabPFN v2 architecture and a corresponding training loop that uses pre-generated training data. nanoTabPFN makes tabular foundation models more accessible to students and researchers alike. For example, restricted to a small data setting it achieves a performance comparable to traditional machine learning baselines within one minute of pre-training on a single GPU (160,000x faster than TabPFN v2 pretraining). This eliminated requirement of large computational resources makes pre-training tabular foundation models accessible for educational purposes. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03661",
        "abs_url": "https://arxiv.org/abs/2511.03661",
        "pdf_url": "https://arxiv.org/pdf/2511.03661",
        "title": "SHIELD: Securing Healthcare IoT with Efficient Machine Learning Techniques for Anomaly Detection",
        "authors": [
            "Mahek Desai",
            "Apoorva Rumale",
            "Marjan Asadinia"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The integration of IoT devices in healthcare introduces significant security and reliability challenges, increasing susceptibility to cyber threats and operational anomalies. This study proposes a machine learning-driven framework for (1) detecting malicious cyberattacks and (2) identifying faulty device anomalies, leveraging a dataset of 200,000 records. Eight machine learning models are evaluated across three learning approaches: supervised learning (XGBoost, K-Nearest Neighbors (K- NN)), semi-supervised learning (Generative Adversarial Networks (GAN), Variational Autoencoders (VAE)), and unsupervised learning (One-Class Support Vector Machine (SVM), Isolation Forest, Graph Neural Networks (GNN), and Long Short-Term Memory (LSTM) Autoencoders). The comprehensive evaluation was conducted across multiple metrics like F1-score, precision, recall, accuracy, ROC-AUC, computational efficiency. XGBoost achieved 99\\% accuracy with minimal computational overhead (0.04s) for anomaly detection, while Isolation Forest balanced precision and recall effectively. LSTM Autoencoders underperformed with lower accuracy and higher latency. For attack detection, KNN achieved near-perfect precision, recall, and F1-score with the lowest computational cost (0.05s), followed by VAE at 97% accuracy. GAN showed the highest computational cost with lowest accuracy and ROC-AUC. These findings enhance IoT-enabled healthcare security through effective anomaly detection strategies. By improving early detection of cyber threats and device failures, this framework has the potential to prevent data breaches, minimize system downtime, and ensure the continuous and safe operation of medical devices, ultimately safeguarding patient health and trust in IoT-driven healthcare solutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03685",
        "abs_url": "https://arxiv.org/abs/2511.03685",
        "pdf_url": "https://arxiv.org/pdf/2511.03685",
        "title": "Structured Matrix Scaling for Multi-Class Calibration",
        "authors": [
            "Eugène Berta",
            "David Holzmüller",
            "Michael I. Jordan",
            "Francis Bach"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Post-hoc recalibration methods are widely used to ensure that classifiers provide faithful probability estimates. We argue that parametric recalibration functions based on logistic regression can be motivated from a simple theoretical setting for both binary and multiclass classification. This insight motivates the use of more expressive calibration methods beyond standard temperature scaling. For multi-class calibration however, a key challenge lies in the increasing number of parameters introduced by more complex models, often coupled with limited calibration data, which can lead to overfitting. Through extensive experiments, we demonstrate that the resulting bias-variance tradeoff can be effectively managed by structured regularization, robust preprocessing and efficient optimization. The resulting methods lead to substantial gains over existing logistic-based calibration techniques. We provide efficient and easy-to-use open-source implementations of our methods, making them an attractive alternative to common temperature, vector, and matrix scaling implementations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03695",
        "abs_url": "https://arxiv.org/abs/2511.03695",
        "pdf_url": "https://arxiv.org/pdf/2511.03695",
        "title": "Behavior-Adaptive Q-Learning: A Unifying Framework for Offline-to-Online RL",
        "authors": [
            "Lipeng Zu",
            "Hansong Zhou",
            "Xiaonan Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Offline reinforcement learning (RL) enables training from fixed data without online interaction, but policies learned offline often struggle when deployed in dynamic environments due to distributional shift and unreliable value estimates on unseen state-action pairs. We introduce Behavior-Adaptive Q-Learning (BAQ), a framework designed to enable a smooth and reliable transition from offline to online RL. The key idea is to leverage an implicit behavioral model derived from offline data to provide a behavior-consistency signal during online fine-tuning. BAQ incorporates a dual-objective loss that (i) aligns the online policy toward the offline behavior when uncertainty is high, and (ii) gradually relaxes this constraint as more confident online experience is accumulated. This adaptive mechanism reduces error propagation from out-of-distribution estimates, stabilizes early online updates, and accelerates adaptation to new scenarios. Across standard benchmarks, BAQ consistently outperforms prior offline-to-online RL approaches, achieving faster recovery, improved robustness, and higher overall performance. Our results demonstrate that implicit behavior adaptation is a principled and practical solution for reliable real-world policy deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03710",
        "abs_url": "https://arxiv.org/abs/2511.03710",
        "pdf_url": "https://arxiv.org/pdf/2511.03710",
        "title": "Shrinking the Variance: Shrinkage Baselines for Reinforcement Learning with Verifiable Rewards",
        "authors": [
            "Guanning Zeng",
            "Zhaoyi Zhou",
            "Daman Arora",
            "Andrea Zanette"
        ],
        "comments": "Preprint. Under Review",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reinforcement Learning with Verifiable Rewards (RLVR) has emerged as a powerful paradigm for post-training large reasoning models (LRMs) using policy-gradient methods such as GRPO. To stabilize training, these methods typically center trajectory rewards by subtracting the empirical mean for each prompt. Statistically, this centering acts as a control variate (or baseline), reducing the variance of the policy-gradient estimator. Typically, the mean reward is estimated using per-prompt empirical averages for each prompt in a batch. Drawing inspiration from Stein's paradox, we propose using shrinkage estimators that combine per-prompt and across-prompt means to improve the overall per-prompt mean estimation accuracy -- particularly in the low-generation regime typical of RLVR. Theoretically, we construct a shrinkage-based baseline that provably yields lower-variance policy-gradient estimators across algorithms. Our proposed baseline serves as a drop-in replacement for existing per-prompt mean baselines, requiring no additional hyper-parameters or computation. Empirically, shrinkage baselines consistently outperform standard empirical-mean baselines, leading to lower-variance gradient updates and improved training stability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2509.17994",
        "abs_url": "https://arxiv.org/abs/2509.17994",
        "pdf_url": "https://arxiv.org/pdf/2509.17994",
        "title": "Supersimulators",
        "authors": [
            "Cynthia Dwork",
            "Pranay Tankala"
        ],
        "comments": "",
        "subjects": "Computational Complexity (cs.CC); Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG)",
        "abstract": "We prove that every randomized Boolean function admits a supersimulator: a randomized polynomial-size circuit whose output on random inputs cannot be efficiently distinguished from reality with constant advantage, even by polynomially larger distinguishers. Our result builds on the landmark complexity-theoretic regularity lemma of Trevisan, Tulsiani and Vadhan (2009), which, in contrast, provides a simulator that fools smaller distinguishers. We circumvent lower bounds for the simulator size by letting the distinguisher size bound vary with the target function, while remaining below an absolute upper bound independent of the target function. This dependence on the target function arises naturally from our use of an iteration technique originating in the graph regularity literature. The simulators provided by the regularity lemma and recent refinements thereof, known as multiaccurate and multicalibrated predictors, respectively, as per Hebert-Johnson et al. (2018), have previously been shown to have myriad applications in complexity theory, cryptography, learning theory, and beyond. We first show that a recent multicalibration-based characterization of the computational indistinguishability of product distributions actually requires only (calibrated) multiaccuracy. We then show that supersimulators yield an even tighter result in this application domain, closing a complexity gap present in prior versions of the characterization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02722",
        "abs_url": "https://arxiv.org/abs/2511.02722",
        "pdf_url": "https://arxiv.org/pdf/2511.02722",
        "title": "Association-sensory spatiotemporal hierarchy and functional gradient-regularised recurrent neural network with implications for schizophrenia",
        "authors": [
            "Subati Abulikemu",
            "Puria Radmard",
            "Michail Mamalakis",
            "John Suckling"
        ],
        "comments": "34 pages, 9 figures",
        "subjects": "Neurons and Cognition (q-bio.NC); Machine Learning (cs.LG)",
        "abstract": "The human neocortex is functionally organised at its highest level along a continuous sensory-to-association (AS) hierarchy. This study characterises the AS hierarchy of patients with schizophrenia in a comparison with controls. Using a large fMRI dataset (N=355), we extracted individual AS gradients via spectral analysis of brain connectivity, quantified hierarchical specialisation by gradient spread, and related this spread with connectivity geometry. We found that schizophrenia compresses the AS hierarchy indicating reduced functional differentiation. By modelling neural timescale with the Ornstein-Uhlenbeck process, we observed that the most specialised, locally cohesive regions at the gradient extremes exhibit dynamics with a longer time constant, an effect that is attenuated in schizophrenia. To study computation, we used the gradients to regularise subject-specific recurrent neural networks (RNNs) trained on working memory tasks. Networks endowed with greater gradient spread learned more efficiently, plateaued at lower task loss, and maintained stronger alignment to the prescribed AS hierarchical geometry. Fixed point linearisation showed that high-range networks settled into more stable neural states during memory delay, evidenced by lower energy and smaller maximal Jacobian eigenvalues. This gradient-regularised RNN framework therefore links large-scale cortical architecture with fixed point stability, providing a mechanistic account of how gradient de-differentiation could destabilise neural computations in schizophrenia, convergently supported by empirical timescale flattening and model-based evidence of less stable fixed points.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02848",
        "abs_url": "https://arxiv.org/abs/2511.02848",
        "pdf_url": "https://arxiv.org/pdf/2511.02848",
        "title": "EEGReXferNet: A Lightweight Gen-AI Framework for EEG Subspace Reconstruction via Cross-Subject Transfer Learning and Channel-Aware Embedding",
        "authors": [
            "Shantanu Sarkar",
            "Piotr Nabrzyski",
            "Saurabh Prasad",
            "Jose Luis Contreras-Vidal"
        ],
        "comments": "Accepted for presentation at the NeurIPS 2025 Workshop on Foundation Models for the Brain and Body",
        "subjects": "Signal Processing (eess.SP); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Electroencephalography (EEG) is a widely used non-invasive technique for monitoring brain activity, but low signal-to-noise ratios (SNR) due to various artifacts often compromise its utility. Conventional artifact removal methods require manual intervention or risk suppressing critical neural features during filtering/reconstruction. Recent advances in generative models, including Variational Autoencoders (VAEs) and Generative Adversarial Networks (GANs), have shown promise for EEG reconstruction; however, these approaches often lack integrated temporal-spectral-spatial sensitivity and are computationally intensive, limiting their suitability for real-time applications like brain-computer interfaces (BCIs). To overcome these challenges, we introduce EEGReXferNet, a lightweight Gen-AI framework for EEG subspace reconstruction via cross-subject transfer learning - developed using Keras TensorFlow (v2.15.1). EEGReXferNet employs a modular architecture that leverages volume conduction across neighboring channels, band-specific convolution encoding, and dynamic latent feature extraction through sliding windows. By integrating reference-based scaling, the framework ensures continuity across successive windows and generalizes effectively across subjects. This design improves spatial-temporal-spectral resolution (mean PSD correlation >= 0.95; mean spectrogram RV-Coefficient >= 0.85), reduces total weights by ~45% to mitigate overfitting, and maintains computational efficiency for robust, real-time EEG preprocessing in neurophysiological and BCI applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02850",
        "abs_url": "https://arxiv.org/abs/2511.02850",
        "pdf_url": "https://arxiv.org/pdf/2511.02850",
        "title": "ECGXtract: Deep Learning-based ECG Feature Extraction for Automated CVD Diagnosis",
        "authors": [
            "Youssif Abuzied",
            "Hassan AbdEltawab",
            "Abdelrhman Gaber",
            "Tamer ElBatt"
        ],
        "comments": "",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "This paper presents ECGXtract, a deep learning-based approach for interpretable ECG feature extraction, addressing the limitations of traditional signal processing and black-box machine learning methods. In particular, we develop convolutional neural network models capable of extracting both temporal and morphological features with strong correlations to a clinically validated ground truth. Initially, each model is trained to extract a single feature, ensuring precise and interpretable outputs. A series of experiments is then carried out to evaluate the proposed method across multiple setups, including global versus lead-specific features, different sampling frequencies, and comparisons with other approaches such as ECGdeli. Our findings show that ECGXtract achieves robust performance across most features with a mean correlation score of 0.80 with the ground truth for global features, with lead II consistently providing the best results. For lead-specific features, ECGXtract achieves a mean correlation score of 0.822. Moreover, ECGXtract achieves superior results to the state-of-the-art open source ECGdeli as it got a higher correlation score with the ground truth in 90% of the features. Furthermore, we explore the feasibility of extracting multiple features simultaneously utilizing a single model. Semantic grouping is proved to be effective for global features, while large-scale grouping and lead-specific multi-output models show notable performance drops. These results highlight the potential of structured grouping strategies to balance the computational efficiency vs. model accuracy, paving the way for more scalable and clinically interpretable ECG feature extraction systems in limited resource settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02853",
        "abs_url": "https://arxiv.org/abs/2511.02853",
        "pdf_url": "https://arxiv.org/pdf/2511.02853",
        "title": "Consciousness-ECG Transformer for Conscious State Estimation System with Real-Time Monitoring",
        "authors": [
            "Young-Seok Kweon",
            "Gi-Hwan Shin",
            "Ji-Yong Kim",
            "Bokyeong Ryu",
            "Seong-Whan Lee"
        ],
        "comments": "30 pages, 8 figures",
        "subjects": "Signal Processing (eess.SP); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Conscious state estimation is important in various medical settings, including sleep staging and anesthesia management, to ensure patient safety and optimize health outcomes. Traditional methods predominantly utilize electroencephalography (EEG), which faces challenges such as high sensitivity to noise and the requirement for controlled environments. In this study, we propose the consciousness-ECG transformer that leverages electrocardiography (ECG) signals for non-invasive and reliable conscious state estimation. Our approach employs a transformer with decoupled query attention to effectively capture heart rate variability features that distinguish between conscious and unconscious states. We implemented the conscious state estimation system with real-time monitoring and validated our system on datasets involving sleep staging and anesthesia level monitoring during surgeries. Experimental results demonstrate that our model outperforms baseline models, achieving accuracies of 0.877 on sleep staging and 0.880 on anesthesia level monitoring. Moreover, our model achieves the highest area under curve values of 0.786 and 0.895 on sleep staging and anesthesia level monitoring, respectively. The proposed system offers a practical and robust alternative to EEG-based methods, particularly suited for dynamic clinical environments. Our results highlight the potential of ECG-based consciousness monitoring to enhance patient safety and advance our understanding of conscious states.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02953",
        "abs_url": "https://arxiv.org/abs/2511.02953",
        "pdf_url": "https://arxiv.org/pdf/2511.02953",
        "title": "EvtSlowTV - A Large and Diverse Dataset for Event-Based Depth Estimation",
        "authors": [
            "Sadiq Layi Macaulay",
            "Nimet Kaygusuz",
            "Simon Hadfield"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "Event cameras, with their high dynamic range (HDR) and low latency, offer a promising alternative for robust depth estimation in challenging environments. However, many event-based depth estimation approaches are constrained by small-scale annotated datasets, limiting their generalizability to real-world scenarios. To bridge this gap, we introduce EvtSlowTV, a large-scale event camera dataset curated from publicly available YouTube footage, which contains more than 13B events across various environmental conditions and motions, including seasonal hiking, flying, scenic driving, and underwater exploration. EvtSlowTV is an order of magnitude larger than existing event datasets, providing an unconstrained, naturalistic setting for event-based depth learning. This work shows the suitability of EvtSlowTV for a self-supervised learning framework to capitalise on the HDR potential of raw event streams. We further demonstrate that training with EvtSlowTV enhances the model's ability to generalise to complex scenes and motions. Our approach removes the need for frame-based annotations and preserves the asynchronous nature of event data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02958",
        "abs_url": "https://arxiv.org/abs/2511.02958",
        "pdf_url": "https://arxiv.org/pdf/2511.02958",
        "title": "Automatic Machine Translation Detection Using a Surrogate Multilingual Translation Model",
        "authors": [
            "Cristian García-Romero",
            "Miquel Esplà-Gomis",
            "Felipe Sánchez-Martínez"
        ],
        "comments": "Pre-MIT Press publication version",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Modern machine translation (MT) systems depend on large parallel corpora, often collected from the Internet. However, recent evidence indicates that (i) a substantial portion of these texts are machine-generated translations, and (ii) an overreliance on such synthetic content in training data can significantly degrade translation quality. As a result, filtering out non-human translations is becoming an essential pre-processing step in building high-quality MT systems. In this work, we propose a novel approach that directly exploits the internal representations of a surrogate multilingual MT model to distinguish between human and machine-translated sentences. Experimental results show that our method outperforms current state-of-the-art techniques, particularly for non-English language pairs, achieving gains of at least 5 percentage points of accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.02986",
        "abs_url": "https://arxiv.org/abs/2511.02986",
        "pdf_url": "https://arxiv.org/pdf/2511.02986",
        "title": "Scalable Single-Cell Gene Expression Generation with Latent Diffusion Models",
        "authors": [
            "Giovanni Palla",
            "Sudarshan Babu",
            "Payam Dibaeinia",
            "James D. Pearce",
            "Donghui Li",
            "Aly A. Khan",
            "Theofanis Karaletsos",
            "Jakub M. Tomczak"
        ],
        "comments": "Github: this https URL",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Genomics (q-bio.GN)",
        "abstract": "Computational modeling of single-cell gene expression is crucial for understanding cellular processes, but generating realistic expression profiles remains a major challenge. This difficulty arises from the count nature of gene expression data and complex latent dependencies among genes. Existing generative models often impose artificial gene orderings or rely on shallow neural network architectures. We introduce a scalable latent diffusion model for single-cell gene expression data, which we refer to as scLDM, that respects the fundamental exchangeability property of the data. Our VAE uses fixed-size latent variables leveraging a unified Multi-head Cross-Attention Block (MCAB) architecture, which serves dual roles: permutation-invariant pooling in the encoder and permutation-equivariant unpooling in the decoder. We enhance this framework by replacing the Gaussian prior with a latent diffusion model using Diffusion Transformers and linear interpolants, enabling high-quality generation with multi-conditional classifier-free guidance. We show its superior performance in a variety of experiments for both observational and perturbational single-cell data, as well as downstream tasks like cell-level classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03000",
        "abs_url": "https://arxiv.org/abs/2511.03000",
        "pdf_url": "https://arxiv.org/pdf/2511.03000",
        "title": "Unifying Information-Theoretic and Pair-Counting Clustering Similarity",
        "authors": [
            "Alexander J. Gates"
        ],
        "comments": "28 pages, 2 figures",
        "subjects": "Machine Learning (stat.ML); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "Comparing clusterings is central to evaluating unsupervised models, yet the many existing similarity measures can produce widely divergent, sometimes contradictory, evaluations. Clustering similarity measures are typically organized into two principal families, pair-counting and information-theoretic, reflecting whether they quantify agreement through element pairs or aggregate information across full cluster contingency tables. Prior work has uncovered parallels between these families and applied empirical normalization or chance-correction schemes, but their deeper analytical connection remains only partially understood. Here, we develop an analytical framework that unifies these families through two complementary perspectives. First, both families are expressed as weighted expansions of observed versus expected co-occurrences, with pair-counting arising as a quadratic, low-order approximation and information-theoretic measures as higher-order, frequency-weighted extensions. Second, we generalize pair-counting to $k$-tuple agreement and show that information-theoretic measures can be viewed as systematically accumulating higher-order co-assignment structure beyond the pairwise level. We illustrate the approaches analytically for the Rand index and Mutual Information, and show how other indices in each family emerge as natural extensions. Together, these views clarify when and why the two regimes diverge, relating their sensitivities directly to weighting and approximation order, and provide a principled basis for selecting, interpreting, and extending clustering similarity measures across applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03020",
        "abs_url": "https://arxiv.org/abs/2511.03020",
        "pdf_url": "https://arxiv.org/pdf/2511.03020",
        "title": "Exploratory Analysis of Cyberattack Patterns on E-Commerce Platforms Using Statistical Methods",
        "authors": [
            "Fatimo Adenike Adeniya"
        ],
        "comments": "32 pages, 9 figures, 6 tables; MSc Research Dissertation, York St John University, London Campus",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Cyberattacks on e-commerce platforms have grown in sophistication, threatening consumer trust and operational continuity. This research presents a hybrid analytical framework that integrates statistical modelling and machine learning for detecting and forecasting cyberattack patterns in the e-commerce domain. Using the Verizon Community Data Breach (VCDB) dataset, the study applies Auto ARIMA for temporal forecasting and significance testing, including a Mann-Whitney U test (U = 2579981.5, p = 0.0121), which confirmed that holiday shopping events experienced significantly more severe cyberattacks than non-holiday periods. ANOVA was also used to examine seasonal variation in threat severity, while ensemble machine learning models (XGBoost, LightGBM, and CatBoost) were employed for predictive classification. Results reveal recurrent attack spikes during high-risk periods such as Black Friday and holiday seasons, with breaches involving Personally Identifiable Information (PII) exhibiting elevated threat indicators. Among the models, CatBoost achieved the highest performance (accuracy = 85.29%, F1 score = 0.2254, ROC AUC = 0.8247). The framework uniquely combines seasonal forecasting with interpretable ensemble learning, enabling temporal risk anticipation and breach-type classification. Ethical considerations, including responsible use of sensitive data and bias assessment, were incorporated. Despite class imbalance and reliance on historical data, the study provides insights for proactive cybersecurity resource allocation and outlines directions for future real-time threat detection research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03034",
        "abs_url": "https://arxiv.org/abs/2511.03034",
        "pdf_url": "https://arxiv.org/pdf/2511.03034",
        "title": "Data-Efficient Adaptation and a Novel Evaluation Method for Aspect-based Sentiment Analysis",
        "authors": [
            "Yan Cathy Hua",
            "Paul Denny",
            "Jörg Wicker",
            "Katerina Taškova"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Aspect-based Sentiment Analysis (ABSA) is a fine-grained opinion mining approach that identifies and classifies opinions associated with specific entities (aspects) or their categories within a sentence. Despite its rapid growth and broad potential, ABSA research and resources remain concentrated in commercial domains, leaving analytical needs unmet in high-demand yet low-resource areas such as education and healthcare. Domain adaptation challenges and most existing methods' reliance on resource-intensive in-training knowledge injection further hinder progress in these areas. Moreover, traditional evaluation methods based on exact matches are overly rigid for ABSA tasks, penalising any boundary variations which may misrepresent the performance of generative models. This work addresses these gaps through three contributions: 1) We propose a novel evaluation method, Flexible Text Similarity Matching and Optimal Bipartite Pairing (FTS-OBP), which accommodates realistic extraction boundary variations while maintaining strong correlation with traditional metrics and offering fine-grained diagnostics. 2) We present the first ABSA study of small decoder-only generative language models (SLMs; <7B parameters), examining resource lower bounds via a case study in education review ABSA. We systematically explore data-free (in-context learning and weight merging) and data-light fine-tuning methods, and propose a multitask fine-tuning strategy that significantly enhances SLM performance, enabling 1.5-3.8 B models to surpass proprietary large models and approach benchmark results with only 200-1,000 examples on a single GPU. 3) We release the first public set of education review ABSA resources to support future research in low-resource domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03050",
        "abs_url": "https://arxiv.org/abs/2511.03050",
        "pdf_url": "https://arxiv.org/pdf/2511.03050",
        "title": "Precise asymptotic analysis of Sobolev training for random feature models",
        "authors": [
            "Katharine E Fisher",
            "Matthew TC Li",
            "Youssef Marzouk",
            "Timo Schorlepp"
        ],
        "comments": "23(+49) pages, 7(+16) figures main text(+appendix)",
        "subjects": "Machine Learning (stat.ML); Disordered Systems and Neural Networks (cond-mat.dis-nn); Machine Learning (cs.LG); Probability (math.PR); Statistics Theory (math.ST)",
        "abstract": "Gradient information is widely useful and available in applications, and is therefore natural to include in the training of neural networks. Yet little is known theoretically about the impact of Sobolev training -- regression with both function and gradient data -- on the generalization error of highly overparameterized predictive models in high dimensions. In this paper, we obtain a precise characterization of this training modality for random feature (RF) models in the limit where the number of trainable parameters, input dimensions, and training data tend proportionally to infinity. Our model for Sobolev training reflects practical implementations by sketching gradient data onto finite dimensional subspaces. By combining the replica method from statistical physics with linearizations in operator-valued free probability theory, we derive a closed-form description for the generalization errors of the trained RF models. For target functions described by single-index models, we demonstrate that supplementing function data with additional gradient data does not universally improve predictive performance. Rather, the degree of overparameterization should inform the choice of training method. More broadly, our results identify settings where models perform optimally by interpolating noisy function and gradient data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03052",
        "abs_url": "https://arxiv.org/abs/2511.03052",
        "pdf_url": "https://arxiv.org/pdf/2511.03052",
        "title": "Min-Max Optimization Is Strictly Easier Than Variational Inequalities",
        "authors": [
            "Henry Shugart",
            "Jason M. Altschuler"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG)",
        "abstract": "Classically, a mainstream approach for solving a convex-concave min-max problem is to instead solve the variational inequality problem arising from its first-order optimality conditions. Is it possible to solve min-max problems faster by bypassing this reduction? This paper initiates this investigation. We show that the answer is yes in the textbook setting of unconstrained quadratic objectives: the optimal convergence rate for first-order algorithms is strictly better for min-max problems than for the corresponding variational inequalities. The key reason that min-max algorithms can be faster is that they can exploit the asymmetry of the min and max variables--a property that is lost in the reduction to variational inequalities. Central to our analyses are sharp characterizations of optimal convergence rates in terms of extremal polynomials which we compute using Green's functions and conformal mappings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03056",
        "abs_url": "https://arxiv.org/abs/2511.03056",
        "pdf_url": "https://arxiv.org/pdf/2511.03056",
        "title": "Reading Between the Lines: The One-Sided Conversation Problem",
        "authors": [
            "Victoria Ebert",
            "Rishabh Singh",
            "Tuochao Chen",
            "Noah A. Smith",
            "Shyamnath Gollakota"
        ],
        "comments": "8 pages, 6 figures, 4 tables",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Conversational AI is constrained in many real-world settings where only one side of a dialogue can be recorded, such as telemedicine, call centers, and smart glasses. We formalize this as the one-sided conversation problem (1SC): inferring and learning from one side of a conversation. We study two tasks: (1) reconstructing the missing speaker's turns for real-time use cases, and (2) generating summaries from one-sided transcripts. Evaluating prompting and finetuned models on MultiWOZ, DailyDialog, and Candor with both human A/B testing and LLM-as-a-judge metrics, we find that access to one future turn and information about utterance length improves reconstruction, placeholder prompting helps to mitigate hallucination, and while large models generate promising reconstructions with prompting, smaller models require finetuning. Further, high-quality summaries can be generated without reconstructing missing turns. We present 1SC as a novel challenge and report promising results that mark a step toward privacy-aware conversational AI.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03080",
        "abs_url": "https://arxiv.org/abs/2511.03080",
        "pdf_url": "https://arxiv.org/pdf/2511.03080",
        "title": "PolyNorm: Few-Shot LLM-Based Text Normalization for Text-to-Speech",
        "authors": [
            "Michel Wong",
            "Ali Alshehri",
            "Sophia Kao",
            "Haotian He"
        ],
        "comments": "9 pages including appendix. EMNLP 2025 Industry Track",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Text Normalization (TN) is a key preprocessing step in Text-to-Speech (TTS) systems, converting written forms into their canonical spoken equivalents. Traditional TN systems can exhibit high accuracy, but involve substantial engineering effort, are difficult to scale, and pose challenges to language coverage, particularly in low-resource settings. We propose PolyNorm, a prompt-based approach to TN using Large Language Models (LLMs), aiming to reduce the reliance on manually crafted rules and enable broader linguistic applicability with minimal human intervention. Additionally, we present a language-agnostic pipeline for automatic data curation and evaluation, designed to facilitate scalable experimentation across diverse languages. Experiments across eight languages show consistent reductions in the word error rate (WER) compared to a production-grade-based system. To support further research, we release PolyNorm-Benchmark, a multilingual data set covering a diverse range of text normalization phenomena.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03084",
        "abs_url": "https://arxiv.org/abs/2511.03084",
        "pdf_url": "https://arxiv.org/pdf/2511.03084",
        "title": "Quantifying Articulatory Coordination as a Biomarker for Schizophrenia",
        "authors": [
            "Gowtham Premananth",
            "Carol Espy-Wilson"
        ],
        "comments": "Submitted to ICASSP 2026",
        "subjects": "Audio and Speech Processing (eess.AS); Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Advances in artificial intelligence (AI) and deep learning have improved diagnostic capabilities in healthcare, yet limited interpretability continues to hinder clinical adoption. Schizophrenia, a complex disorder with diverse symptoms including disorganized speech and social withdrawal, demands tools that capture symptom severity and provide clinically meaningful insights beyond binary diagnosis. Here, we present an interpretable framework that leverages articulatory speech features through eigenspectra difference plots and a weighted sum with exponential decay (WSED) to quantify vocal tract coordination. Eigenspectra plots effectively distinguished complex from simpler coordination patterns, and WSED scores reliably separated these groups, with ambiguity confined to a narrow range near zero. Importantly, WSED scores correlated not only with overall BPRS severity but also with the balance between positive and negative symptoms, reflecting more complex coordination in subjects with pronounced positive symptoms and the opposite trend for stronger negative symptoms. This approach offers a transparent, severity-sensitive biomarker for schizophrenia, advancing the potential for clinically interpretable speech-based assessment tools.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03122",
        "abs_url": "https://arxiv.org/abs/2511.03122",
        "pdf_url": "https://arxiv.org/pdf/2511.03122",
        "title": "EGMOF: Efficient Generation of Metal-Organic Frameworks Using a Hybrid Diffusion-Transformer Architecture",
        "authors": [
            "Seunghee Han",
            "Yeonghun Kang",
            "Taeun Bae",
            "Varinia Bernales",
            "Alan Aspuru-Guzik",
            "Jihan Kim"
        ],
        "comments": "",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Designing materials with targeted properties remains challenging due to the vastness of chemical space and the scarcity of property-labeled data. While recent advances in generative models offer a promising way for inverse design, most approaches require large datasets and must be retrained for every new target property. Here, we introduce the EGMOF (Efficient Generation of MOFs), a hybrid diffusion-transformer framework that overcomes these limitations through a modular, descriptor-mediated workflow. EGMOF decomposes inverse design into two steps: (1) a one-dimensional diffusion model (Prop2Desc) that maps desired properties to chemically meaningful descriptors followed by (2) a transformer model (Desc2MOF) that generates structures from these descriptors. This modular hybrid design enables minimal retraining and maintains high accuracy even under small-data conditions. On a hydrogen uptake dataset, EGMOF achieved over 95% validity and 84% hit rate, representing significant improvements of up to 57% in validity and 14% in hit rate compared to existing methods, while remaining effective with only 1,000 training samples. Moreover, our model successfully performed conditional generation across 29 diverse property datasets, including CoREMOF, QMOF, and text-mined experimental datasets, whereas previous models have not. This work presents a data-efficient, generalizable approach to the inverse design of diverse MOFs and highlights the potential of modular inverse design workflows for broader materials discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03125",
        "abs_url": "https://arxiv.org/abs/2511.03125",
        "pdf_url": "https://arxiv.org/pdf/2511.03125",
        "title": "Provable Accelerated Bayesian Optimization with Knowledge Transfer",
        "authors": [
            "Haitao Lin",
            "Boxin Zhao",
            "Mladen Kolar",
            "Chong Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We study how Bayesian optimization (BO) can be accelerated on a target task with historical knowledge transferred from related source tasks. Existing works on BO with knowledge transfer either do not have theoretical guarantees or achieve the same regret as BO in the non-transfer setting, $\\tilde{\\mathcal{O}}(\\sqrt{T \\gamma_f})$, where $T$ is the number of evaluations of the target function and $\\gamma_f$ denotes its information gain. In this paper, we propose the DeltaBO algorithm, in which a novel uncertainty-quantification approach is built on the difference function $\\delta$ between the source and target functions, which are allowed to belong to different reproducing kernel Hilbert spaces (RKHSs). Under mild assumptions, we prove that the regret of DeltaBO is of order $\\tilde{\\mathcal{O}}(\\sqrt{T (T/N + \\gamma_\\delta)})$, where $N$ denotes the number of evaluations from source tasks and typically $N \\gg T$. In many applications, source and target tasks are similar, which implies that $\\gamma_\\delta$ can be much smaller than $\\gamma_f$. Empirical studies on both real-world hyperparameter tuning tasks and synthetic functions show that DeltaBO outperforms other baseline methods and support our theoretical claims.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03143",
        "abs_url": "https://arxiv.org/abs/2511.03143",
        "pdf_url": "https://arxiv.org/pdf/2511.03143",
        "title": "From Measurement to Expertise: Empathetic Expert Adapters for Context-Based Empathy in Conversational AI Agents",
        "authors": [
            "Erfan Shayegani",
            "Jina Suh",
            "Andy Wilson",
            "Nagu Rangan",
            "Javier Hernandez"
        ],
        "comments": "",
        "subjects": "Human-Computer Interaction (cs.HC); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Computers and Society (cs.CY); Machine Learning (cs.LG)",
        "abstract": "Empathy is a critical factor in fostering positive user experiences in conversational AI. While models can display empathy, it is often generic rather than tailored to specific tasks and contexts. In this work, we introduce a novel framework for developing and evaluating context-specific empathetic large language models (LLMs). We first analyze a real-world conversational dataset consisting of 672 multi-turn conversations across 8 tasks, revealing significant differences in terms of expected and experienced empathy before and after the conversations, respectively. To help minimize this gap, we develop a synthetic multi-turn conversational generation pipeline and steer responses toward our defined empathy patterns based on the context that more closely matches users' expectations. We then train empathetic expert adapters for context-specific empathy that specialize in varying empathy levels based on the recognized task. Our empirical results demonstrate a significant gap reduction of 72.66% between perceived and desired empathy with scores increasing by an average factor of 2.43 as measured by our metrics and reward models. Additionally, our trained empathetic expert adapters demonstrate superior effectiveness in preserving empathy patterns throughout conversation turns, outperforming system prompts, which tend to dramatically diminish in impact as conversations lengthen.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03154",
        "abs_url": "https://arxiv.org/abs/2511.03154",
        "pdf_url": "https://arxiv.org/pdf/2511.03154",
        "title": "Modeling Headway in Heterogeneous and Mixed Traffic Flow: A Statistical Distribution Based on a General Exponential Function",
        "authors": [
            "Natchaphon Leungbootnak",
            "Zihao Li",
            "Zihang Wei",
            "Dominique Lord",
            "Yunlong Zhang"
        ],
        "comments": "",
        "subjects": "Applications (stat.AP); Machine Learning (cs.LG)",
        "abstract": "The ability of existing headway distributions to accurately reflect the diverse behaviors and characteristics in heterogeneous traffic (different types of vehicles) and mixed traffic (human-driven vehicles with autonomous vehicles) is limited, leading to unsatisfactory goodness of fit. To address these issues, we modified the exponential function to obtain a novel headway distribution. Rather than employing Euler's number (e) as the base of the exponential function, we utilized a real number base to provide greater flexibility in modeling the observed headway. However, the proposed is not a probability function. We normalize it to calculate the probability and derive the closed-form equation. In this study, we utilized a comprehensive experiment with five open datasets: highD, exiD, NGSIM, Waymo, and Lyft to evaluate the performance of the proposed distribution and compared its performance with six existing distributions under mixed and heterogeneous traffic flow. The results revealed that the proposed distribution not only captures the fundamental characteristics of headway distribution but also provides physically meaningful parameters that describe the distribution shape of observed headways. Under heterogeneous flow on highways (i.e., uninterrupted traffic flow), the proposed distribution outperforms other candidate distributions. Under urban road conditions (i.e., interrupted traffic flow), including heterogeneous and mixed traffic, the proposed distribution still achieves decent results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03179",
        "abs_url": "https://arxiv.org/abs/2511.03179",
        "pdf_url": "https://arxiv.org/pdf/2511.03179",
        "title": "Toward Autonomous Engineering Design: A Knowledge-Guided Multi-Agent Framework",
        "authors": [
            "Varun Kumar",
            "George Em Karniadakis"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "The engineering design process often demands expertise from multiple domains, leading to complex collaborations and iterative refinements. Traditional methods can be resource-intensive and prone to inefficiencies. To address this, we formalize the engineering design process through a multi-agent AI framework that integrates structured design and review loops. The framework introduces specialized knowledge-driven agents that collaborate to generate and refine design candidates. As an exemplar, we demonstrate its application to the aerodynamic optimization of 4-digit NACA airfoils. The framework consists of three key AI agents: a Graph Ontologist, a Design Engineer, and a Systems Engineer. The Graph Ontologist employs a Large Language Model (LLM) to construct two domain-specific knowledge graphs from airfoil design literature. The Systems Engineer, informed by a human manager, formulates technical requirements that guide design generation and evaluation. The Design Engineer leverages the design knowledge graph and computational tools to propose candidate airfoils meeting these requirements. The Systems Engineer reviews and provides feedback both qualitative and quantitative using its own knowledge graph, forming an iterative feedback loop until a design is validated by the manager. The final design is then optimized to maximize performance metrics such as the lift-to-drag ratio. Overall, this work demonstrates how collaborative AI agents equipped with structured knowledge representations can enhance efficiency, consistency, and quality in the engineering design process.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03181",
        "abs_url": "https://arxiv.org/abs/2511.03181",
        "pdf_url": "https://arxiv.org/pdf/2511.03181",
        "title": "Learning-based Cooperative Robotic Paper Wrapping: A Unified Control Policy with Residual Force Control",
        "authors": [
            "Rewida Ali",
            "Cristian C. Beltran-Hernandez",
            "Weiwei Wan",
            "Kensuke Harada"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Human-robot cooperation is essential in environments such as warehouses and retail stores, where workers frequently handle deformable objects like paper, bags, and fabrics. Coordinating robotic actions with human assistance remains difficult due to the unpredictable dynamics of deformable materials and the need for adaptive force control. To explore this challenge, we focus on the task of gift wrapping, which exemplifies a long-horizon manipulation problem involving precise folding, controlled creasing, and secure fixation of paper. Success is achieved when the robot completes the sequence to produce a neatly wrapped package with clean folds and no tears. We propose a learning-based framework that integrates a high-level task planner powered by a large language model (LLM) with a low-level hybrid imitation learning (IL) and reinforcement learning (RL) policy. At its core is a Sub-task Aware Robotic Transformer (START) that learns a unified policy from human demonstrations. The key novelty lies in capturing long-range temporal dependencies across the full wrapping sequence within a single model. Unlike vanilla Action Chunking with Transformer (ACT), typically applied to short tasks, our method introduces sub-task IDs that provide explicit temporal grounding. This enables robust performance across the entire wrapping process and supports flexible execution, as the policy learns sub-goals rather than merely replicating motion sequences. Our framework achieves a 97% success rate on real-world wrapping tasks. We show that the unified transformer-based policy reduces the need for specialized models, allows controlled human supervision, and effectively bridges high-level intent with the fine-grained force control required for deformable object manipulation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03182",
        "abs_url": "https://arxiv.org/abs/2511.03182",
        "pdf_url": "https://arxiv.org/pdf/2511.03182",
        "title": "Understanding Robustness of Model Editing in Code LLMs: An Empirical Study",
        "authors": [
            "Vinaik Chhetri",
            "A.B Siddique",
            "Umar Farooq"
        ],
        "comments": "26 pages, 2 figures, 15 tables",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) are increasingly used in software development. However, while LLMs remain static after pretraining, programming languages and APIs continue to evolve, leading to the generation of deprecated or incompatible code that undermines reliability. Retraining LLMs from scratch to reflect such changes is computationally expensive, making model editing a promising lightweight alternative that updates only a small subset of parameters. Despite its potential, it remains unclear whether model editing yields genuine syntactic and semantic adaptations or merely superficial fixes. In this work, we present a systematic study of five state-of-the-art model editing methods: Constrained Fine-Tuning (FT), GRACE, MEMIT, PMET, and ROME. We apply these methods to three leading open-source code LLMs, CodeLlama, CodeQwen1.5, and DeepSeek-Coder, under controlled API deprecation scenarios. Our evaluation covers both instant and sequential editing settings, using three disjoint evaluation sets designed to assess reliability, generalization, and specificity. We measure model correctness at three levels: successful compilation, partial test case pass, and full test pass. Our findings show that instant edits consistently degrade model performance, with syntactic validity dropping by up to 86 percentage points and functional correctness declining by 45 points even in the best-performing setting. Sequential edits further amplify this degradation, and in some cases, model performance collapses entirely. Across all models, most passing generations relied on workarounds rather than correctly adopting the intended changes, while faulty adoptions that result in test failures or compilation errors were significantly more frequent. Correct adoptions, where the model correctly integrates the intended change, occurred in only about 6% of cases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03193",
        "abs_url": "https://arxiv.org/abs/2511.03193",
        "pdf_url": "https://arxiv.org/pdf/2511.03193",
        "title": "Statistical Properties of Rectified Flow",
        "authors": [
            "Gonzalo Mena",
            "Arun Kumar Kuchibhotla",
            "Larry Wasserman"
        ],
        "comments": "159 pages, 7 figures",
        "subjects": "Statistics Theory (math.ST); Machine Learning (cs.LG); Methodology (stat.ME); Machine Learning (stat.ML)",
        "abstract": "Rectified flow (Liu et al., 2022; Liu, 2022; Wu et al., 2023) is a method for defining a transport map between two distributions, and enjoys popularity in machine learning, although theoretical results supporting the validity of these methods are scant. The rectified flow can be regarded as an approximation to optimal transport, but in contrast to other transport methods that require optimization over a function space, computing the rectified flow only requires standard statistical tools such as regression or density estimation. Because of this, one can leverage standard data analysis tools for regression and density estimation to develop empirical versions of transport maps. We study some structural properties of the rectified flow, including existence, uniqueness, and regularity, as well as the related statistical properties, such as rates of convergence and central limit theorems, for some selected estimators. To do so, we analyze separately the bounded and unbounded cases as each presents unique challenges. In both cases, we are able to establish convergence at faster rates than the ones for the usual nonparametric regression and density estimation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03202",
        "abs_url": "https://arxiv.org/abs/2511.03202",
        "pdf_url": "https://arxiv.org/pdf/2511.03202",
        "title": "Provable Separations between Memorization and Generalization in Diffusion Models",
        "authors": [
            "Zeqi Ye",
            "Qijie Zhu",
            "Molei Tao",
            "Minshuo Chen"
        ],
        "comments": "51 pages, 4 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Diffusion models have achieved remarkable success across diverse domains, but they remain vulnerable to memorization -- reproducing training data rather than generating novel outputs. This not only limits their creative potential but also raises concerns about privacy and safety. While empirical studies have explored mitigation strategies, theoretical understanding of memorization remains limited. We address this gap through developing a dual-separation result via two complementary perspectives: statistical estimation and network approximation. From the estimation side, we show that the ground-truth score function does not minimize the empirical denoising loss, creating a separation that drives memorization. From the approximation side, we prove that implementing the empirical score function requires network size to scale with sample size, spelling a separation compared to the more compact network representation of the ground-truth score function. Guided by these insights, we develop a pruning-based method that reduces memorization while maintaining generation quality in diffusion transformers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03216",
        "abs_url": "https://arxiv.org/abs/2511.03216",
        "pdf_url": "https://arxiv.org/pdf/2511.03216",
        "title": "RKUM: An R Package for Robust Kernel Unsupervised Methods",
        "authors": [
            "Md Ashad Alam"
        ],
        "comments": "26, 2 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "RKUM is an R package developed for implementing robust kernel-based unsupervised methods. It provides functions for estimating the robust kernel covariance operator (CO) and the robust kernel cross-covariance operator (CCO) using generalized loss functions instead of the conventional quadratic loss. These operators form the foundation of robust kernel learning and enable reliable analysis under contaminated or noisy data conditions. The package includes implementations of robust kernel canonical correlation analysis (Kernel CCA), as well as the influence function (IF) for both standard and multiple kernel CCA frameworks. The influence function quantifies sensitivity and helps detect influential or outlying observations across two-view and multi-view datasets. Experiments using synthesized two-view and multi-view data demonstrate that the IF of the standard kernel CCA effectively identifies outliers, while the robust kernel methods implemented in RKUM exhibit reduced sensitivity to contamination. Overall, RKUM provides an efficient and extensible platform for robust kernel-based analysis in high-dimensional data applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03242",
        "abs_url": "https://arxiv.org/abs/2511.03242",
        "pdf_url": "https://arxiv.org/pdf/2511.03242",
        "title": "Topography, climate, land cover, and biodiversity: Explaining endemic richness and management implications on a Mediterranean island",
        "authors": [
            "Aristides Moustakas",
            "Ioannis N Vogiatzakis"
        ],
        "comments": "",
        "subjects": "Populations and Evolution (q-bio.PE); Machine Learning (cs.LG); Other Statistics (stat.OT)",
        "abstract": "Island endemism is shaped by complex interactions among environmental, ecological, and evolutionary factors, yet the relative contributions of topography, climate, and land cover remain incompletely quantified. We investigated the drivers of endemic plant richness across Crete, a Mediterranean biodiversity hotspot, using spatially explicit data on species distributions, topographic complexity, climatic variability, land cover, and soil characteristics. Artificial Neural Network models, a machine learning tool, were employed to assess the relative importance of these predictors and to identify hotspots of endemism. We found that total species richness, elevation range, and climatic variability were the strongest predictors of endemic richness, reflecting the role of biodiversity, topographic heterogeneity, and climatic gradients in generating diverse habitats and micro-refugia that promote speciation and buffer extinction risk. Endemic hotspots only partially overlapped with areas of high total species richness, indicating that total species richness was the optimal from the ones examined, yet an imperfect surrogate. These environmentally heterogeneous areas also provide critical ecosystem services, including soil stabilization, pollination, and cultural value, which are increasingly threatened by tourism, renewable energy development, land-use change, and climate impacts. Our findings underscore the importance of prioritizing mountainous and climatically variable regions in conservation planning, integrating ecosystem service considerations, and accounting for within-island spatial heterogeneity. By explicitly linking the environmental drivers of endemism to both biodiversity patterns and ecosystem function, this study provides a framework for evidence-based conservation planning in Crete and other Mediterranean islands with similar geological and biogeographic contexts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03247",
        "abs_url": "https://arxiv.org/abs/2511.03247",
        "pdf_url": "https://arxiv.org/pdf/2511.03247",
        "title": "Death by a Thousand Prompts: Open Model Vulnerability Analysis",
        "authors": [
            "Amy Chang",
            "Nicholas Conley",
            "Harish Santhanalakshmi Ganesan",
            "Adam Swanda"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Open-weight models provide researchers and developers with accessible foundations for diverse downstream applications. We tested the safety and security postures of eight open-weight large language models (LLMs) to identify vulnerabilities that may impact subsequent fine-tuning and deployment. Using automated adversarial testing, we measured each model's resilience against single-turn and multi-turn prompt injection and jailbreak attacks. Our findings reveal pervasive vulnerabilities across all tested models, with multi-turn attacks achieving success rates between 25.86\\% and 92.78\\% -- representing a $2\\times$ to $10\\times$ increase over single-turn baselines. These results underscore a systemic inability of current open-weight models to maintain safety guardrails across extended interactions. We assess that alignment strategies and lab priorities significantly influence resilience: capability-focused models such as Llama 3.3 and Qwen 3 demonstrate higher multi-turn susceptibility, whereas safety-oriented designs such as Google Gemma 3 exhibit more balanced performance. The analysis concludes that open-weight models, while crucial for innovation, pose tangible operational and ethical risks when deployed without layered security controls. These findings are intended to inform practitioners and developers of the potential risks and the value of professional AI security solutions to mitigate exposure. Addressing multi-turn vulnerabilities is essential to ensure the safe, reliable, and responsible deployment of open-weight LLMs in enterprise and public domains. We recommend adopting a security-first design philosophy and layered protections to ensure resilient deployments of open-weight models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03320",
        "abs_url": "https://arxiv.org/abs/2511.03320",
        "pdf_url": "https://arxiv.org/pdf/2511.03320",
        "title": "Influence of Data Dimensionality Reduction Methods on the Effectiveness of Quantum Machine Learning Models",
        "authors": [
            "Aakash Ravindra Shinde",
            "Jukka K. Nurminen"
        ],
        "comments": "12 pages, IEEE International Conference on Quantum Computing & Engineering (QCE25)",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "Data dimensionality reduction techniques are often utilized in the implementation of Quantum Machine Learning models to address two significant issues: the constraints of NISQ quantum devices, which are characterized by noise and a limited number of qubits, and the challenge of simulating a large number of qubits on classical devices. It also raises concerns over the scalability of these approaches, as dimensionality reduction methods are slow to adapt to large datasets. In this article, we analyze how data reduction methods affect different QML models. We conduct this experiment over several generated datasets, quantum machine algorithms, quantum data encoding methods, and data reduction methods. All these models were evaluated on the performance metrics like accuracy, precision, recall, and F1 score. Our findings have led us to conclude that the usage of data dimensionality reduction methods results in skewed performance metric values, which results in wrongly estimating the actual performance of quantum machine learning models. There are several factors, along with data dimensionality reduction methods, that worsen this problem, such as characteristics of the datasets, classical to quantum information embedding methods, percentage of feature reduction, classical components associated with quantum models, and structure of quantum machine learning models. We consistently observed the difference in the accuracy range of 14% to 48% amongst these models, using data reduction and not using it. Apart from this, our observations have shown that some data reduction methods tend to perform better for some specific data embedding methodologies and ansatz constructions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03367",
        "abs_url": "https://arxiv.org/abs/2511.03367",
        "pdf_url": "https://arxiv.org/pdf/2511.03367",
        "title": "Decoupling Augmentation Bias in Prompt Learning for Vision-Language Models",
        "authors": [
            "Gahyeon Kim",
            "Sohee Kim",
            "Seokju Lee"
        ],
        "comments": "Accepted in Pattern Recognition",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Recent advances in large-scale vision and language models have led to significant progress in zero-shot learning tasks. Methods such as CoOp and CoCoOp have shown that replacing handcrafted prompts with learnable vectors, known as prompt learning, can result in improved performance. However, these models often struggle to generalize to entirely unseen categories. While traditional zero-shot learning techniques benefit from various data augmentation strategies, prompt learning has primarily focused on text-based modifications, leaving the potential of image-based augmentation largely unexplored. In this work, we explore how image-level augmentations, particularly those that introduce attribute-specific variations, can support and enhance prompt learning. Our analysis examines the interaction between these augmentations and soft prompt frameworks, revealing their potential to improve generalization. We also identify a limitation in existing methods, such as CoCoOp, which do not provide explicit guidance for learning prompts that focus on semantically meaningful visual features. To address this, we propose Adding Attributes to Prompt Learning, AAPL, a novel method that introduces adversarial token embeddings to decouple superficial visual variations introduced by augmentation from class-relevant semantic representations. This decoupling enables the learned prompts to concentrate on visually discriminative features that align with the target categories. We conduct comprehensive experiments on eleven benchmark datasets, and AAPL consistently outperforms existing methods across few-shot, zero-shot, cross-dataset, and domain generalization settings. Our source code is publicly available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03425",
        "abs_url": "https://arxiv.org/abs/2511.03425",
        "pdf_url": "https://arxiv.org/pdf/2511.03425",
        "title": "SyMuPe: Affective and Controllable Symbolic Music Performance",
        "authors": [
            "Ilya Borovik",
            "Dmitrii Gavrilev",
            "Vladimir Viro"
        ],
        "comments": "ACM Multimedia 2025. Extended version with supplementary material",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG); Multimedia (cs.MM)",
        "abstract": "Emotions are fundamental to the creation and perception of music performances. However, achieving human-like expression and emotion through machine learning models for performance rendering remains a challenging task. In this work, we present SyMuPe, a novel framework for developing and training affective and controllable symbolic piano performance models. Our flagship model, PianoFlow, uses conditional flow matching trained to solve diverse multi-mask performance inpainting tasks. By design, it supports both unconditional generation and infilling of music performance features. For training, we use a curated, cleaned dataset of 2,968 hours of aligned musical scores and expressive MIDI performances. For text and emotion control, we integrate a piano performance emotion classifier and tune PianoFlow with the emotion-weighted Flan-T5 text embeddings provided as conditional inputs. Objective and subjective evaluations against transformer-based baselines and existing models show that PianoFlow not only outperforms other approaches, but also achieves performance quality comparable to that of human-recorded and transcribed MIDI samples. For emotion control, we present and analyze samples generated under different text conditioning scenarios. The developed model can be integrated into interactive applications, contributing to the creation of more accessible and engaging music performance systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03443",
        "abs_url": "https://arxiv.org/abs/2511.03443",
        "pdf_url": "https://arxiv.org/pdf/2511.03443",
        "title": "A Support-Set Algorithm for Optimization Problems with Nonnegative and Orthogonal Constraints",
        "authors": [
            "Lei Wang",
            "Xin Liu",
            "Xiaojun Chen"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "In this paper, we investigate optimization problems with nonnegative and orthogonal constraints, where any feasible matrix of size $n \\times p$ exhibits a sparsity pattern such that each row accommodates at most one nonzero entry. Our analysis demonstrates that, by fixing the support set, the global solution of the minimization subproblem for the proximal linearization of the objective function can be computed in closed form with at most $n$ nonzero entries. Exploiting this structural property offers a powerful avenue for dramatically enhancing computational efficiency. Guided by this insight, we propose a support-set algorithm preserving strictly the feasibility of iterates. A central ingredient is a strategically devised update scheme for support sets that adjusts the placement of nonzero entries. We establish the global convergence of the support-set algorithm to a first-order stationary point, and show that its iteration complexity required to reach an $\\epsilon$-approximate first-order stationary point is $O (\\epsilon^{-2})$. Numerical results are strongly in favor of our algorithm in real-world applications, including nonnegative PCA, clustering, and community detection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03482",
        "abs_url": "https://arxiv.org/abs/2511.03482",
        "pdf_url": "https://arxiv.org/pdf/2511.03482",
        "title": "System Identification of a Moored ASV with Recessed Moon Pool via Deterministic and Bayesian Hankel-DMDc",
        "authors": [
            "Giorgio Palma",
            "Ivan Santic",
            "Andrea Serani",
            "Lorenzo Minno",
            "Matteo Diez"
        ],
        "comments": "26 pages, 11 figures, 2 tables, 1 box",
        "subjects": "Systems and Control (eess.SY); Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG)",
        "abstract": "This study addresses the system identification of a small autonomous surface vehicle (ASV) under moored conditions using Hankel dynamic mode decomposition with control (HDMDc) and its Bayesian extension (BHDMDc). Experiments were carried out on a Codevintec CK-14e ASV in the towing tank of CNR-INM, under both irregular and regular head-sea wave conditions. The ASV under investigation features a recessed moon pool, which induces nonlinear responses due to sloshing, thereby increasing the modelling challenge. Data-driven reduced-order models were built from measurements of vessel motions and mooring loads. The HDMDc framework provided accurate deterministic predictions of vessel dynamics, while the Bayesian formulation enabled uncertainty-aware characterization of the model response by accounting for variability in hyperparameter selection. Validation against experimental data demonstrated that both HDMDc and BHDMDc can predict the vessel's response to unseen regular and irregular wave excitations. In conclusion, the study shows that HDMDc-based ROMs are a viable data-driven alternative for system identification, demonstrating for the first time their generalization capability for a sea condition different from the training set, achieving high accuracy in reproducing vessel dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03498",
        "abs_url": "https://arxiv.org/abs/2511.03498",
        "pdf_url": "https://arxiv.org/pdf/2511.03498",
        "title": "BanglaSTEM: A Parallel Corpus for Technical Domain Bangla-English Translation",
        "authors": [
            "Kazi Reyazul Hasan",
            "Mubasshira Musarrat",
            "A. B. M. Alim Al Islam",
            "Muhammad Abdullah Adnan"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Large language models work well for technical problem solving in English but perform poorly when the same questions are asked in Bangla. A simple solution would be to translate Bangla questions into English first and then use these models. However, existing Bangla-English translation systems struggle with technical terms. They often mistranslate specialized vocabulary, which changes the meaning of the problem and leads to wrong answers. We present BanglaSTEM, a dataset of 5,000 carefully selected Bangla-English sentence pairs from STEM fields including computer science, mathematics, physics, chemistry, and biology. We generated over 12,000 translations using language models and then used human evaluators to select the highest quality pairs that preserve technical terminology correctly. We train a T5-based translation model on BanglaSTEM and test it on two tasks: generating code and solving math problems. Our results show significant improvements in translation accuracy for technical content, making it easier for Bangla speakers to use English-focused language models effectively. Both the BanglaSTEM dataset and the trained translation model are publicly released at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03554",
        "abs_url": "https://arxiv.org/abs/2511.03554",
        "pdf_url": "https://arxiv.org/pdf/2511.03554",
        "title": "The Structure of Cross-Validation Error: Stability, Covariance, and Minimax Limits",
        "authors": [
            "Ido Nachum",
            "Rüdiger Urbanke",
            "Thomas Weinberger"
        ],
        "comments": "59 pages",
        "subjects": "Statistics Theory (math.ST); Machine Learning (cs.LG)",
        "abstract": "Despite ongoing theoretical research on cross-validation (CV), many theoretical questions about CV remain widely open. This motivates our investigation into how properties of algorithm-distribution pairs can affect the choice for the number of folds in $k$-fold cross-validation. Our results consist of a novel decomposition of the mean-squared error of cross-validation for risk estimation, which explicitly captures the correlations of error estimates across overlapping folds and includes a novel algorithmic stability notion, squared loss stability, that is considerably weaker than the typically required hypothesis stability in other comparable works. Furthermore, we prove: 1. For every learning algorithm that minimizes empirical error, a minimax lower bound on the mean-squared error of $k$-fold CV estimating the population risk $L_\\mathcal{D}$: \\[ \\min_{k \\mid n}\\; \\max_{\\mathcal{D}}\\; \\mathbb{E}\\!\\left[\\big(\\widehat{L}_{\\mathrm{CV}}^{(k)} - L_{\\mathcal{D}}\\big)^{2}\\right] \\;=\\; \\Omega\\!\\big(\\sqrt{k}/n\\big), \\] where $n$ is the sample size and $k$ the number of folds. This shows that even under idealized conditions, for large values of $k$, CV cannot attain the optimum of order $1/n$ achievable by a validation set of size $n$, reflecting an inherent penalty caused by dependence between folds. 2. Complementing this, we exhibit learning rules for which \\[ \\max_{\\mathcal{D}}\\; \\mathbb{E}\\!\\left[\\big(\\widehat{L}_{\\mathrm{CV}}^{(k)} - L_{\\mathcal{D}}\\big)^{2}\\right] \\;=\\; \\Omega(k/n), \\] matching (up to constants) the accuracy of a hold-out estimator of a single fold of size $n/k$. Together these results delineate the fundamental trade-off in resampling-based risk estimation: CV cannot fully exploit all $n$ samples for unbiased risk evaluation, and its minimax performance is pinned between the $k/n$ and $\\sqrt{k}/n$ regimes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03606",
        "abs_url": "https://arxiv.org/abs/2511.03606",
        "pdf_url": "https://arxiv.org/pdf/2511.03606",
        "title": "Vector-valued self-normalized concentration inequalities beyond sub-Gaussianity",
        "authors": [
            "Diego Martinez-Taboada",
            "Tomas Gonzalez",
            "Aaditya Ramdas"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "The study of self-normalized processes plays a crucial role in a wide range of applications, from sequential decision-making to econometrics. While the behavior of self-normalized concentration has been widely investigated for scalar-valued processes, vector-valued processes remain comparatively underexplored, especially outside of the sub-Gaussian framework. In this contribution, we provide concentration bounds for self-normalized processes with light tails beyond sub-Gaussianity (such as Bennett or Bernstein bounds). We illustrate the relevance of our results in the context of online linear regression, with applications in (kernelized) linear bandits.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03620",
        "abs_url": "https://arxiv.org/abs/2511.03620",
        "pdf_url": "https://arxiv.org/pdf/2511.03620",
        "title": "CLAX: Fast and Flexible Neural Click Models in JAX",
        "authors": [
            "Philipp Hager",
            "Onno Zoeter",
            "Maarten de Rijke"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG); Software Engineering (cs.SE)",
        "abstract": "CLAX is a JAX-based library that implements classic click models using modern gradient-based optimization. While neural click models have emerged over the past decade, complex click models based on probabilistic graphical models (PGMs) have not systematically adopted gradient-based optimization, preventing practitioners from leveraging modern deep learning frameworks while preserving the interpretability of classic models. CLAX addresses this gap by replacing EM-based optimization with direct gradient-based optimization in a numerically stable manner. The framework's modular design enables the integration of any component, from embeddings and deep networks to custom modules, into classic click models for end-to-end optimization. We demonstrate CLAX's efficiency by running experiments on the full Baidu-ULTR dataset comprising over a billion user sessions in $\\approx$ 2 hours on a single GPU, orders of magnitude faster than traditional EM approaches. CLAX implements ten classic click models, serving both industry practitioners seeking to understand user behavior and improve ranking performance at scale and researchers developing new click models. CLAX is available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03632",
        "abs_url": "https://arxiv.org/abs/2511.03632",
        "pdf_url": "https://arxiv.org/pdf/2511.03632",
        "title": "Neural Beamforming with Doppler-Aware Sparse Attention for High Mobility Environments",
        "authors": [
            "Cemil Vahapoglu",
            "Timothy J. O'Shea",
            "Wan Liu",
            "Sennur Ulukus"
        ],
        "comments": "",
        "subjects": "Information Theory (cs.IT); Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Beamforming has significance for enhancing spectral efficiency and mitigating interference in multi-antenna wireless systems, facilitating spatial multiplexing and diversity in dense and high mobility scenarios. Traditional beamforming techniques such as zero-forcing beamforming (ZFBF) and minimum mean square error (MMSE) beamforming experience performance deterioration under adverse channel conditions. Deep learning-based beamforming offers an alternative with nonlinear mappings from channel state information (CSI) to beamforming weights by improving robustness against dynamic channel environments. Transformer-based models are particularly effective due to their ability to model long-range dependencies across time and frequency. However, their quadratic attention complexity limits scalability in large OFDM grids. Recent studies address this issue through sparse attention mechanisms that reduce complexity while maintaining expressiveness, yet often employ patterns that disregard channel dynamics, as they are not specifically designed for wireless communication scenarios. In this work, we propose a Doppler-aware Sparse Neural Network Beamforming (Doppler-aware Sparse NNBF) model that incorporates a channel-adaptive sparse attention mechanism in a multi-user single-input multiple-output (MU-SIMO) setting. The proposed sparsity structure is configurable along 2D time-frequency axes based on channel dynamics and is theoretically proven to ensure full connectivity within p hops, where p is the number of attention heads. Simulation results under urban macro (UMa) channel conditions show that Doppler-aware Sparse NNBF significantly outperforms both a fixed-pattern baseline, referred to as Standard Sparse NNBF, and conventional beamforming techniques ZFBF and MMSE beamforming in high mobility scenarios, while maintaining structured sparsity with a controlled number of attended keys per query.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03635",
        "abs_url": "https://arxiv.org/abs/2511.03635",
        "pdf_url": "https://arxiv.org/pdf/2511.03635",
        "title": "Towards Transparent Stance Detection: A Zero-Shot Approach Using Implicit and Explicit Interpretability",
        "authors": [
            "Apoorva Upadhyaya",
            "Wolfgang Nejdl",
            "Marco Fisichella"
        ],
        "comments": "Accepted in AAAI CONFERENCE ON WEB AND SOCIAL MEDIA (ICWSM 2026)",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Zero-Shot Stance Detection (ZSSD) identifies the attitude of the post toward unseen targets. Existing research using contrastive, meta-learning, or data augmentation suffers from generalizability issues or lack of coherence between text and target. Recent works leveraging large language models (LLMs) for ZSSD focus either on improving unseen target-specific knowledge or generating explanations for stance analysis. However, most of these works are limited by their over-reliance on explicit reasoning, provide coarse explanations that lack nuance, and do not explicitly model the reasoning process, making it difficult to interpret the model's predictions. To address these issues, in our study, we develop a novel interpretable ZSSD framework, IRIS. We provide an interpretable understanding of the attitude of the input towards the target implicitly based on sequences within the text (implicit rationales) and explicitly based on linguistic measures (explicit rationales). IRIS considers stance detection as an information retrieval ranking task, understanding the relevance of implicit rationales for different stances to guide the model towards correct predictions without requiring the ground-truth of rationales, thus providing inherent interpretability. In addition, explicit rationales based on communicative features help decode the emotional and cognitive dimensions of stance, offering an interpretable understanding of the author's attitude towards the given target. Extensive experiments on the benchmark datasets of VAST, EZ-STANCE, P-Stance, and RFD using 50%, 30%, and even 10% training data prove the generalizability of our model, benefiting from the proposed architecture and interpretable design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03636",
        "abs_url": "https://arxiv.org/abs/2511.03636",
        "pdf_url": "https://arxiv.org/pdf/2511.03636",
        "title": "Quantifying Weighted Morphological Content of Large-Scale Structures via Simulation-Based Inference",
        "authors": [
            "M. H. Jalali Kanafi",
            "S. M. S. Movahed"
        ],
        "comments": "19 pages, 9 figures and 3 tables. Comments are welcome",
        "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "In this work, we perform a simulation-based forecasting analysis to compare the constraining power of two higher-order summary statistics of the large-scale structure (LSS), the Minkowski Functionals (MFs) and the Conditional Moments of Derivative (CMD), with a particular focus on their sensitivity to nonlinear and anisotropic features in redshift-space. Our analysis relies on halo catalogs from the Big Sobol Sequence(BSQ) simulations at redshift $z=0.5$, employing a likelihood-free inference framework implemented via neural posterior estimation. At the fiducial cosmology of the Quijote simulations $(\\Omega_{m}=0.3175,\\,\\sigma_{8}=0.834)$, and for the smoothing scale $R=15\\,h^{-1}$Mpc, we find that the CMD yields tighter forecasts for $(\\Omega_{m}},\\,\\sigma_{8})$ than the zeroth- to third-order MFs components, improving the constraint precision by ${\\sim}(44\\%,\\,52\\%)$, ${\\sim}(30\\%,\\,45\\%)$, ${\\sim}(27\\%,\\,17\\%)$, and ${\\sim}(26\\%,\\,17\\%)$, respectively. A joint configuration combining the MFs and CMD further enhances the precision by approximately ${\\sim}27\\%$ compared to the standard MFs alone, highlighting the complementary anisotropy-sensitive information captured by the CMD in contrast to the scalar morphological content encapsulated by the MFs. We further extend the forecasting analysis to a continuous range of cosmological parameter values and multiple smoothing scales. Our results show that, although the absolute forecast uncertainty for each component of summary statistics depends on the underlying parameter values and the adopted smoothing scale, the relative constraining power among the summary statistics remains nearly constant throughout.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03653",
        "abs_url": "https://arxiv.org/abs/2511.03653",
        "pdf_url": "https://arxiv.org/pdf/2511.03653",
        "title": "Efficient Testing Implies Structured Symmetry",
        "authors": [
            "Cynthia Dwork",
            "Pranay Tankala"
        ],
        "comments": "",
        "subjects": "Computational Complexity (cs.CC); Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG)",
        "abstract": "Given a small random sample of $n$-bit strings labeled by an unknown Boolean function, which properties of this function can be tested computationally efficiently? We show an equivalence between properties that are efficiently testable from few samples and properties with structured symmetry, which depend only on the function's average values on parts of a low-complexity partition of the domain. Without the efficiency constraint, a similar characterization in terms of unstructured symmetry was obtained by Blais and Yoshida (2019). Our main technical tool is supersimulation, which builds on methods from the algorithmic fairness literature to approximate arbitrarily complex functions by small-circuit simulators that fool significantly larger distinguishers. We extend the characterization along other axes as well. We show that allowing parts to overlap exponentially reduces their required number, broadening the scope of the construction from properties testable with $O(\\log n)$ samples to properties testable with $O(n)$ samples. For larger sample sizes, we show that any efficient tester is essentially checking for indistinguishability from a bounded collection of small circuits, in the spirit of a characterization of testable graph properties. Finally, we show that our results for Boolean function testing generalize to high-entropy distribution testing on arbitrary domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03693",
        "abs_url": "https://arxiv.org/abs/2511.03693",
        "pdf_url": "https://arxiv.org/pdf/2511.03693",
        "title": "Colorectal Cancer Histopathological Grading using Multi-Scale Federated Learning",
        "authors": [
            "Md Ahasanul Arafath",
            "Abhijit Kumar Ghosh",
            "Md Rony Ahmed",
            "Sabrin Afroz",
            "Minhazul Hosen",
            "Md Hasan Moon",
            "Md Tanzim Reza",
            "Md Ashad Alam"
        ],
        "comments": "15 pages and 7 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Colorectal cancer (CRC) grading is a critical prognostic factor but remains hampered by inter-observer variability and the privacy constraints of multi-institutional data sharing. While deep learning offers a path to automation, centralized training models conflict with data governance regulations and neglect the diagnostic importance of multi-scale analysis. In this work, we propose a scalable, privacy-preserving federated learning (FL) framework for CRC histopathological grading that integrates multi-scale feature learning within a distributed training paradigm. Our approach employs a dual-stream ResNetRS50 backbone to concurrently capture fine-grained nuclear detail and broader tissue-level context. This architecture is integrated into a robust FL system stabilized using FedProx to mitigate client drift across heterogeneous data distributions from multiple hospitals. Extensive evaluation on the CRC-HGD dataset demonstrates that our framework achieves an overall accuracy of 83.5%, outperforming a comparable centralized model (81.6%). Crucially, the system excels in identifying the most aggressive Grade III tumors with a high recall of 87.5%, a key clinical priority to prevent dangerous false negatives. Performance further improves with higher magnification, reaching 88.0% accuracy at 40x. These results validate that our federated multi-scale approach not only preserves patient privacy but also enhances model performance and generalization. The proposed modular pipeline, with built-in preprocessing, checkpointing, and error handling, establishes a foundational step toward deployable, privacy-aware clinical AI for digital pathology.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2025-11-06",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-06?abs=True",
        "arxiv_id": "2511.03708",
        "abs_url": "https://arxiv.org/abs/2511.03708",
        "pdf_url": "https://arxiv.org/pdf/2511.03708",
        "title": "The Adaptivity Barrier in Batched Nonparametric Bandits: Sharp Characterization of the Price of Unknown Margin",
        "authors": [
            "Rong Jiang",
            "Cong Ma"
        ],
        "comments": "",
        "subjects": "Statistics Theory (math.ST); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study batched nonparametric contextual bandits under a margin condition when the margin parameter $\\alpha$ is unknown. To capture the statistical price of this ignorance, we introduce the regret inflation criterion, defined as the ratio between the regret of an adaptive algorithm and that of an oracle knowing $\\alpha$. We show that the optimal regret inflation grows polynomial with the horizon $T$, with exponent precisely given by the value of a convex optimization problem involving the dimension, smoothness, and batch budget. Moreover, the minimizers of this optimization problem directly prescribe the batch allocation and exploration strategy of a rate-optimal algorithm. Building on this principle, we develop RoBIN (RObust batched algorithm with adaptive BINning), which achieves the optimal regret inflation up to logarithmic factors. These results reveal a new adaptivity barrier: under batching, adaptation to an unknown margin parameter inevitably incurs a polynomial penalty, sharply characterized by a variational problem. Remarkably, this barrier vanishes when the number of batches exceeds $\\log \\log T$; with only a doubly logarithmic number of updates, one can recover the oracle regret rate up to polylogarithmic factors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]