[
    {
        "order": 1,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10680",
        "abs_url": "https://arxiv.org/abs/2511.10680",
        "pdf_url": "https://arxiv.org/pdf/2511.10680",
        "title": "LAD-BNet: Lag-Aware Dual-Branch Networks for Real-Time Energy Forecasting on Edge Devices",
        "authors": [
            "Jean-Philippe Lignier"
        ],
        "comments": "27 pages, in French language. 10 tables, 26 references. Submitted to Energy and AI",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Real-time energy forecasting on edge devices represents a major challenge for smart grid optimization and intelligent buildings. We present LAD-BNet (Lag-Aware Dual-Branch Network), an innovative neural architecture optimized for edge inference with Google Coral TPU. Our hybrid approach combines a branch dedicated to explicit exploitation of temporal lags with a Temporal Convolutional Network (TCN) featuring dilated convolutions, enabling simultaneous capture of short and long-term dependencies. Tested on real energy consumption data with 10-minute temporal resolution, LAD-BNet achieves 14.49% MAPE at 1-hour horizon with only 18ms inference time on Edge TPU, representing an 8-12 x acceleration compared to CPU. The multi-scale architecture enables predictions up to 12 hours with controlled performance degradation. Our model demonstrates a 2.39% improvement over LSTM baselines and 3.04% over pure TCN architectures, while maintaining a 180MB memory footprint suitable for embedded device constraints. These results pave the way for industrial applications in real-time energy optimization, demand management, and operational planning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10706",
        "abs_url": "https://arxiv.org/abs/2511.10706",
        "pdf_url": "https://arxiv.org/pdf/2511.10706",
        "title": "Differentiable Sparse Identification of Lagrangian Dynamics",
        "authors": [
            "Zitong Zhang",
            "Hao Sun"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Data-driven discovery of governing equations from data remains a fundamental challenge in nonlinear dynamics. Although sparse regression techniques have advanced system identification, they struggle with rational functions and noise sensitivity in complex mechanical systems. The Lagrangian formalism offers a promising alternative, as it typically avoids rational expressions and provides a more concise representation of system dynamics. However, existing Lagrangian identification methods are significantly affected by measurement noise and limited data availability. This paper presents a novel differentiable sparse identification framework that addresses these limitations through three key contributions: (1) the first integration of cubic B-Spline approximation into Lagrangian system identification, enabling accurate representation of complex nonlinearities, (2) a robust equation discovery mechanism that effectively utilizes measurements while incorporating known physical constraints, (3) a recursive derivative computation scheme based on B-spline basis functions, effectively constraining higher-order derivatives and reducing noise sensitivity on second-order dynamical systems. The proposed method demonstrates superior performance and enables more accurate and reliable extraction of physical laws from noisy data, particularly in complex mechanical systems compared to baseline methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10710",
        "abs_url": "https://arxiv.org/abs/2511.10710",
        "pdf_url": "https://arxiv.org/pdf/2511.10710",
        "title": "Towards Uncertainty Quantification in Generative Model Learning",
        "authors": [
            "Giorgio Morales",
            "Frederic Jurie",
            "Jalal Fadili"
        ],
        "comments": "Accepted at EurIPS 2025 Workshop: Epistemic Intelligence in Machine Learning (EIML@EurIPS 2025)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "While generative models have become increasingly prevalent across various domains, fundamental concerns regarding their reliability persist. A crucial yet understudied aspect of these models is the uncertainty quantification surrounding their distribution approximation capabilities. Current evaluation methodologies focus predominantly on measuring the closeness between the learned and the target distributions, neglecting the inherent uncertainty in these measurements. In this position paper, we formalize the problem of uncertainty quantification in generative model learning. We discuss potential research directions, including the use of ensemble-based precision-recall curves. Our preliminary experiments on synthetic datasets demonstrate the effectiveness of aggregated precision-recall curves in capturing model approximation uncertainty, enabling systematic comparison among different model architectures based on their uncertainty characteristics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10713",
        "abs_url": "https://arxiv.org/abs/2511.10713",
        "pdf_url": "https://arxiv.org/pdf/2511.10713",
        "title": "Movement-Specific Analysis for FIM Score Classification Using Spatio-Temporal Deep Learning",
        "authors": [
            "Jun Masaki",
            "Ariaki Higashi",
            "Naoko Shinagawa",
            "Kazuhiko Hirata",
            "Yuichi Kurita",
            "Akira Furui"
        ],
        "comments": "10 pages, 5 figures, 3tables, Accepted for the 2026 IEEE/SICE International Symposium on System Integration (SII 2026), January 11-14, 2026, Cancun, Mexico",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The functional independence measure (FIM) is widely used to evaluate patients' physical independence in activities of daily living. However, traditional FIM assessment imposes a significant burden on both patients and healthcare professionals. To address this challenge, we propose an automated FIM score estimation method that utilizes simple exercises different from the designated FIM assessment actions. Our approach employs a deep neural network architecture integrating a spatial-temporal graph convolutional network (ST-GCN), bidirectional long short-term memory (BiLSTM), and an attention mechanism to estimate FIM motor item scores. The model effectively captures long-term temporal dependencies and identifies key body-joint contributions through learned attention weights. We evaluated our method in a study of 277 rehabilitation patients, focusing on FIM transfer and locomotion items. Our approach successfully distinguishes between completely independent patients and those requiring assistance, achieving balanced accuracies of 70.09-78.79 % across different FIM items. Additionally, our analysis reveals specific movement patterns that serve as reliable predictors for particular FIM evaluation items.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10809",
        "abs_url": "https://arxiv.org/abs/2511.10809",
        "pdf_url": "https://arxiv.org/pdf/2511.10809",
        "title": "Near-optimal Linear Predictive Clustering in Non-separable Spaces via Mixed Integer Programming and Quadratic Pseudo-Boolean Reductions",
        "authors": [
            "Jiazhou Liang",
            "Hassan Khurram",
            "Scott Sanner"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Linear Predictive Clustering (LPC) partitions samples based on shared linear relationships between feature and target variables, with numerous applications including marketing, medicine, and education. Greedy optimization methods, commonly used for LPC, alternate between clustering and linear regression but lack global optimality. While effective for separable clusters, they struggle in non-separable settings where clusters overlap in feature space. In an alternative constrained optimization paradigm, Bertsimas and Shioda (2007) formulated LPC as a Mixed-Integer Program (MIP), ensuring global optimality regardless of separability but suffering from poor scalability. This work builds on the constrained optimization paradigm to introduce two novel approaches that improve the efficiency of global optimization for LPC. By leveraging key theoretical properties of separability, we derive near-optimal approximations with provable error bounds, significantly reducing the MIP formulation's complexity and improving scalability. Additionally, we can further approximate LPC as a Quadratic Pseudo-Boolean Optimization (QPBO) problem, achieving substantial computational improvements in some settings. Comparative analyses on synthetic and real-world datasets demonstrate that our methods consistently achieve near-optimal solutions with substantially lower regression errors than greedy optimization while exhibiting superior scalability over existing MIP formulations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10811",
        "abs_url": "https://arxiv.org/abs/2511.10811",
        "pdf_url": "https://arxiv.org/pdf/2511.10811",
        "title": "Transformers know more than they can tell -- Learning the Collatz sequence",
        "authors": [
            "François Charton",
            "Ashvni Narayanan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We investigate transformer prediction of long Collatz steps, a complex arithmetic function that maps odd integers to their distant successors in the Collatz sequence ( $u_{n+1}=u_n/2$ if $u_n$ is even, $u_{n+1}=(3u_n+1)/2$ if $u_n$ is odd). Model accuracy varies with the base used to encode input and output. It can be as high as $99.7\\%$ for bases $24$ and $32$, and as low as $37$ and $25\\%$ for bases $11$ and $3$. Yet, all models, no matter the base, follow a common learning pattern. As training proceeds, they learn a sequence of classes of inputs that share the same residual modulo $2^p$. Models achieve near-perfect accuracy on these classes, and less than $1\\%$ for all other inputs. This maps to a mathematical property of Collatz sequences: the length of the loops involved in the computation of a long Collatz step can be deduced from the binary representation of its input. The learning pattern reflects the model learning to predict inputs associated with increasing loop lengths. An analysis of failure cases reveals that almost all model errors follow predictable patterns. Hallucination, a common feature of large language models, almost never happens. In over $90\\%$ of failures, the model performs the correct calculation, but wrongly estimates loop lengths. Our observations give a full account of the algorithms learned by the models. They suggest that the difficulty of learning such complex arithmetic function lies in figuring the control structure of the computation -- the length of the loops. We believe that the approach outlined here, using mathematical problems as tools for understanding, explaining, and perhaps improving language models, can be applied to a broad range of problems and bear fruitful results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10829",
        "abs_url": "https://arxiv.org/abs/2511.10829",
        "pdf_url": "https://arxiv.org/pdf/2511.10829",
        "title": "Towards Universal Neural Operators through Multiphysics Pretraining",
        "authors": [
            "Mikhail Masliaev",
            "Dmitry Gusarov",
            "Ilya Markov",
            "Alexander Hvatov"
        ],
        "comments": "5 pages, 1 figure, accepted for Machine Learning and the Physical Sciences Workshop, NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Although neural operators are widely used in data-driven physical simulations, their training remains computationally expensive. Recent advances address this issue via downstream learning, where a model pretrained on simpler problems is fine-tuned on more complex ones. In this research, we investigate transformer-based neural operators, which have previously been applied only to specific problems, in a more general transfer learning setting. We evaluate their performance across diverse PDE problems, including extrapolation to unseen parameters, incorporation of new variables, and transfer from multi-equation datasets. Our results demonstrate that advanced neural operator architectures can effectively transfer knowledge across PDE problems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10831",
        "abs_url": "https://arxiv.org/abs/2511.10831",
        "pdf_url": "https://arxiv.org/pdf/2511.10831",
        "title": "Benchmarking Quantum Kernels Across Diverse and Complex Data",
        "authors": [
            "Yuhan Jiang",
            "Matthew Otten"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Quantum kernel methods are a promising branch of quantum machine learning, yet their practical advantage on diverse, high-dimensional, real-world data remains unverified. Current research has largely been limited to low-dimensional or synthetic datasets, preventing a thorough evaluation of their potential. To address this gap, we developed a variational quantum kernel framework utilizing resource-efficient ansätze for complex classification tasks and introduced a parameter scaling technique to accelerate convergence. We conducted a comprehensive benchmark of this framework on eight challenging, real world and high-dimensional datasets covering tabular, image, time series, and graph data. Our classically simulated results show that the proposed quantum kernel demonstrated a clear performance advantage over standard classical kernels, such as the radial basis function (RBF) kernel. This work demonstrates that properly designed quantum kernels can function as versatile, high-performance tools, laying a foundation for quantum-enhanced applications in real-world machine learning. Further research is needed to fully assess the practical quantum advantage.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10833",
        "abs_url": "https://arxiv.org/abs/2511.10833",
        "pdf_url": "https://arxiv.org/pdf/2511.10833",
        "title": "SURFACEBENCH: Can Self-Evolving LLMs Find the Equations of 3D Scientific Surfaces?",
        "authors": [
            "Sanchit Kabra",
            "Shobhnik Kriplani",
            "Parshin Shojaee",
            "Chandan K. Reddy"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Equation discovery from data is a core challenge in machine learning for science, requiring the recovery of concise symbolic expressions that govern complex physical and geometric phenomena. Recent approaches with large language models (LLMs) show promise in symbolic regression, but their success often hinges on memorized formulas or overly simplified functional forms. Existing benchmarks exacerbate this limitation: they focus on scalar functions, ignore domain grounding, and rely on brittle string-matching based metrics that fail to capture scientific equivalence. We introduce SurfaceBench, first comprehensive benchmark for symbolic surface discovery. SurfaceBench comprises 183 tasks across 15 categories of symbolic complexity, spanning explicit, implicit, and parametric equation representation forms. Each task includes ground-truth equations, variable semantics, and synthetically sampled three dimensional data. Unlike prior SR datasets, our tasks reflect surface-level structure, resist LLM memorization through novel symbolic compositions, and are grounded in scientific domains such as fluid dynamics, robotics, electromagnetics, and geometry. To evaluate equation discovery quality, we pair symbolic checks with geometry-aware metrics such as Chamfer and Hausdorff distances, capturing both algebraic fidelity and spatial reconstruction accuracy. Our experiments reveal that state-of-the-art frameworks, while occasionally successful on specific families, struggle to generalize across representation types and surface complexities. SurfaceBench thus establishes a challenging and diagnostic testbed that bridges symbolic reasoning with geometric reconstruction, enabling principled benchmarking of progress in compositional generalization, data-driven scientific induction, and geometry-aware reasoning with LLMs. We release the code here: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10834",
        "abs_url": "https://arxiv.org/abs/2511.10834",
        "pdf_url": "https://arxiv.org/pdf/2511.10834",
        "title": "EarthSight: A Distributed Framework for Low-Latency Satellite Intelligence",
        "authors": [
            "Ansel Kaplan Erol",
            "Seungjun Lee",
            "Divya Mahajan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Low-latency delivery of satellite imagery is essential for time-critical applications such as disaster response, intelligence, and infrastructure monitoring. However, traditional pipelines rely on downlinking all captured images before analysis, introducing delays of hours to days due to restricted communication bandwidth. To address these bottlenecks, emerging systems perform onboard machine learning to prioritize which images to transmit. However, these solutions typically treat each satellite as an isolated compute node, limiting scalability and efficiency. Redundant inference across satellites and tasks further strains onboard power and compute costs, constraining mission scope and responsiveness. We present EarthSight, a distributed runtime framework that redefines satellite image intelligence as a distributed decision problem between orbit and ground. EarthSight introduces three core innovations: (1) multi-task inference on satellites using shared backbones to amortize computation across multiple vision tasks; (2) a ground-station query scheduler that aggregates user requests, predicts priorities, and assigns compute budgets to incoming imagery; and (3) dynamic filter ordering, which integrates model selectivity, accuracy, and execution cost to reject low-value images early and conserve resources. EarthSight leverages global context from ground stations and resource-aware adaptive decisions in orbit to enable constellations to perform scalable, low-latency image analysis within strict downlink bandwidth and onboard power budgets. Evaluations using a prior established satellite simulator show that EarthSight reduces average compute time per image by 1.9x and lowers 90th percentile end-to-end latency from first contact to delivery from 51 to 21 minutes compared to the state-of-the-art baseline.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10841",
        "abs_url": "https://arxiv.org/abs/2511.10841",
        "pdf_url": "https://arxiv.org/pdf/2511.10841",
        "title": "FlowPath: Learning Data-Driven Manifolds with Invertible Flows for Robust Irregularly-sampled Time Series Classification",
        "authors": [
            "YongKyung Oh",
            "Dong-Young Lim",
            "Sungil Kim"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Modeling continuous-time dynamics from sparse and irregularly-sampled time series remains a fundamental challenge. Neural controlled differential equations provide a principled framework for such tasks, yet their performance is highly sensitive to the choice of control path constructed from discrete observations. Existing methods commonly employ fixed interpolation schemes, which impose simplistic geometric assumptions that often misrepresent the underlying data manifold, particularly under high missingness. We propose FlowPath, a novel approach that learns the geometry of the control path via an invertible neural flow. Rather than merely connecting observations, FlowPath constructs a continuous and data-adaptive manifold, guided by invertibility constraints that enforce information-preserving and well-behaved transformations. This inductive bias distinguishes FlowPath from prior unconstrained learnable path models. Empirical evaluations on 18 benchmark datasets and a real-world case study demonstrate that FlowPath consistently achieves statistically significant improvements in classification accuracy over baselines using fixed interpolants or non-invertible architectures. These results highlight the importance of modeling not only the dynamics along the path but also the geometry of the path itself, offering a robust and generalizable solution for learning from irregular time series.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10848",
        "abs_url": "https://arxiv.org/abs/2511.10848",
        "pdf_url": "https://arxiv.org/pdf/2511.10848",
        "title": "STAMP: Spatial-Temporal Adapter with Multi-Head Pooling",
        "authors": [
            "Brad Shook",
            "Abby Turner",
            "Jieshi Chen",
            "Michał Wiliński",
            "Mononito Goswami",
            "Jonathan Elmer",
            "Artur Dubrawski"
        ],
        "comments": "Accepted as a Proceedings paper at Machine Learning for Health (ML4H) 2025, invited presentation at the Time Series for Health (TS4H) Workshop, NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Time series foundation models (TSFMs) pretrained on data from multiple domains have shown strong performance on diverse modeling tasks. Various efforts have been made to develop foundation models specific to electroencephalography (EEG) data, which records brain electrical activity as time series. However, no comparative analysis of EEG-specific foundation models (EEGFMs) versus general TSFMs has been performed on EEG-specific tasks. We introduce a novel Spatial-Temporal Adapter with Multi-Head Pooling (STAMP), which leverages univariate embeddings produced by a general TSFM, implicitly models spatial-temporal characteristics of EEG data, and achieves performance comparable to state-of-the-art EEGFMs. A comprehensive analysis is performed on 8 benchmark datasets of clinical tasks using EEG for classification, along with ablation studies. Our proposed adapter is lightweight in trainable parameters and flexible in the inputs it can accommodate, supporting easy modeling of EEG data using TSFMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10855",
        "abs_url": "https://arxiv.org/abs/2511.10855",
        "pdf_url": "https://arxiv.org/pdf/2511.10855",
        "title": "ExPairT-LLM: Exact Learning for LLM Code Selection by Pairwise Queries",
        "authors": [
            "Tom Yuviler",
            "Dana Drachsler-Cohen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Despite recent advances in LLMs, the task of code generation is still challenging. To cope, code selection algorithms select the best program from multiple programs generated by an LLM. However, existing algorithms can fail to identify the correct program, either because they can misidentify nonequivalent programs or because they rely on an LLM and assume it always correctly determines the output for every input. We present ExPairT-LLM, an exact learning algorithm for code selection that selects a program by posing to an LLM oracle two new types of queries: pairwise membership and pairwise equivalence. These queries are simpler for LLMs and enable ExPairT-LLM to identify the correct program through a tournament, which is robust to some LLM mistakes. We evaluate ExPairT-LLM on four popular code datasets. Its pass@1 (success rate) outperforms the state-of-the-art code selection algorithm on average by +13.0% and up to +27.1%. It also improves the pass@1 of LLMs performing complex reasoning by +24.0%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10859",
        "abs_url": "https://arxiv.org/abs/2511.10859",
        "pdf_url": "https://arxiv.org/pdf/2511.10859",
        "title": "Private Zeroth-Order Optimization with Public Data",
        "authors": [
            "Xuchen Gong",
            "Tian Li"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "One of the major bottlenecks for deploying popular first-order differentially private (DP) machine learning algorithms (e.g., DP-SGD) lies in their high computation and memory cost, despite the existence of optimized implementations. Zeroth-order methods have promise in mitigating the overhead, as they leverage function evaluations to approximate the gradients, hence significantly easier to privatize. While recent works have explored zeroth-order approaches in both private and non-private settings, they still suffer from relatively low utilities compared with DP-SGD, and have only been evaluated in limited application domains. In this work, we propose to leverage public information to guide and improve gradient approximation of private zeroth-order algorithms. We explore a suite of public-data-assisted zeroth-order optimizers (PAZO) with minimal overhead. We provide theoretical analyses of the PAZO framework under an assumption of the similarity between public and private data. Empirically, we demonstrate that PAZO achieves superior privacy/utility tradeoffs across vision and text tasks in both pre-training and fine-tuning settings, outperforming the best first-order baselines (with public data) especially in highly private regimes, while offering up to $16\\times$ runtime speedup.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10868",
        "abs_url": "https://arxiv.org/abs/2511.10868",
        "pdf_url": "https://arxiv.org/pdf/2511.10868",
        "title": "Go-UT-Bench: A Fine-Tuning Dataset for LLM-Based Unit Test Generation in Go",
        "authors": [
            "Yashshi Pipalani",
            "Hritik Raj",
            "Rajat Ghosh",
            "Vaishnavi Bhargava",
            "Debojyoti Dutta"
        ],
        "comments": "9 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Training data imbalance poses a major challenge for code LLMs. Most available data heavily over represents raw opensource code while underrepresenting broader software engineering tasks, especially in low resource languages like Golang. As a result, models excel at code autocompletion but struggle with real world developer workflows such as unit test generation. To address this gap, we introduce GO UT Bench, a benchmark dataset of 5264 pairs of code and unit tests, drawn from 10 permissively licensed Golang repositories spanning diverse domain. We evaluate its effectiveness as a fine tuning dataset across two LLM families i.e. mixture of experts and dense decoders. Our results show that finetuned models outperform their base counterparts on more than 75% of benchmark tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10872",
        "abs_url": "https://arxiv.org/abs/2511.10872",
        "pdf_url": "https://arxiv.org/pdf/2511.10872",
        "title": "Incorporating Spatial Information into Goal-Conditioned Hierarchical Reinforcement Learning via Graph Representations",
        "authors": [
            "Shuyuan Zhang",
            "Zihan Wang",
            "Xiao-Wen Chang",
            "Doina Precup"
        ],
        "comments": "Transactions on Machine Learning Research (2025)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "The integration of graphs with Goal-conditioned Hierarchical Reinforcement Learning (GCHRL) has recently gained attention, as intermediate goals (subgoals) can be effectively sampled from graphs that naturally represent the overall task structure in most RL tasks. However, existing approaches typically rely on domain-specific knowledge to construct these graphs, limiting their applicability to new tasks. Other graph-based approaches create graphs dynamically during exploration but struggle to fully utilize them, because they have problems passing the information in the graphs to newly visited states. Additionally, current GCHRL methods face challenges such as sample inefficiency and poor subgoal representation. This paper proposes a solution to these issues by developing a graph encoder-decoder to evaluate unseen states. Our proposed method, Graph-Guided sub-Goal representation Generation RL (G4RL), can be incorporated into any existing GCHRL method when operating in environments with primarily symmetric and reversible transitions to enhance performance across this class of problems. We show that the graph encoder-decoder can be effectively implemented using a network trained on the state graph generated during exploration. Empirical results indicate that leveraging high and low-level intrinsic rewards from the graph encoder-decoder significantly enhances the performance of state-of-the-art GCHRL approaches with an extra small computational cost in dense and sparse reward environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10878",
        "abs_url": "https://arxiv.org/abs/2511.10878",
        "pdf_url": "https://arxiv.org/pdf/2511.10878",
        "title": "Multi-Joint Physics-Informed Deep Learning Framework for Time-Efficient Inverse Dynamics",
        "authors": [
            "Shuhao Ma",
            "Zeyi Huang",
            "Yu Cao",
            "Wesley Doorsamy",
            "Chaoyang Shi",
            "Jun Li",
            "Zhi-Qiang Zhang"
        ],
        "comments": "11 pages",
        "subjects": "Machine Learning (cs.LG); Human-Computer Interaction (cs.HC); Signal Processing (eess.SP)",
        "abstract": "Time-efficient estimation of muscle activations and forces across multi-joint systems is critical for clinical assessment and assistive device control. However, conventional approaches are computationally expensive and lack a high-quality labeled dataset for multi-joint applications. To address these challenges, we propose a physics-informed deep learning framework that estimates muscle activations and forces directly from kinematics. The framework employs a novel Multi-Joint Cross-Attention (MJCA) module with Bidirectional Gated Recurrent Unit (BiGRU) layers to capture inter-joint coordination, enabling each joint to adaptively integrate motion information from others. By embedding multi-joint dynamics, inter-joint coupling, and external force interactions into the loss function, our Physics-Informed MJCA-BiGRU (PI-MJCA-BiGRU) delivers physiologically consistent predictions without labeled data while enabling time-efficient inference. Experimental validation on two datasets demonstrates that PI-MJCA-BiGRU achieves performance comparable to conventional supervised methods without requiring ground-truth labels, while the MJCA module significantly enhances inter-joint coordination modeling compared to other baseline architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10893",
        "abs_url": "https://arxiv.org/abs/2511.10893",
        "pdf_url": "https://arxiv.org/pdf/2511.10893",
        "title": "Multi-View Polymer Representations for the Open Polymer Prediction",
        "authors": [
            "Wonjin Jung",
            "Yongseok Choi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We address polymer property prediction with a multi-view design that exploits complementary representations. Our system integrates four families: (i) tabular RDKit/Morgan descriptors, (ii) graph neural networks, (iii) 3D-informed representations, and (iv) pretrained SMILES language models, and averages per-property predictions via a uniform ensemble. Models are trained with 10-fold splits and evaluated with SMILES test-time augmentation. The approach ranks 9th of 2241 teams in the Open Polymer Prediction Challenge at NeurIPS 2025. The submitted ensemble achieves a public MAE of 0.057 and a private MAE of 0.082.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10898",
        "abs_url": "https://arxiv.org/abs/2511.10898",
        "pdf_url": "https://arxiv.org/pdf/2511.10898",
        "title": "Graph Attention Network for Predicting Duration of Large-Scale Power Outages Induced by Natural Disasters",
        "authors": [
            "Chenghao Duan",
            "Chuanyi Ji"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Natural disasters such as hurricanes, wildfires, and winter storms have induced large-scale power outages in the U.S., resulting in tremendous economic and societal impacts. Accurately predicting power outage recovery and impact is key to resilience of power grid. Recent advances in machine learning offer viable frameworks for estimating power outage duration from geospatial and weather data. However, three major challenges are inherent to the task in a real world setting: spatial dependency of the data, spatial heterogeneity of the impact, and moderate event data. We propose a novel approach to estimate the duration of severe weather-induced power outages through Graph Attention Networks (GAT). Our network uses a simple structure from unsupervised pre-training, followed by semi-supervised learning. We use field data from four major hurricanes affecting $501$ counties in eight Southeastern U.S. states. The model exhibits an excellent performance ($>93\\%$ accuracy) and outperforms the existing methods XGBoost, Random Forest, GCN and simple GAT by $2\\% - 15\\%$ in both the overall performance and class-wise accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10915",
        "abs_url": "https://arxiv.org/abs/2511.10915",
        "pdf_url": "https://arxiv.org/pdf/2511.10915",
        "title": "Towards Federated Clustering: A Client-wise Private Graph Aggregation Framework",
        "authors": [
            "Guanxiong He",
            "Jie Wang",
            "Liaoyuan Tang",
            "Zheng Wang",
            "Rong Wang",
            "Feiping Nie"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated clustering addresses the critical challenge of extracting patterns from decentralized, unlabeled data. However, it is hampered by the flaw that current approaches are forced to accept a compromise between performance and privacy: \\textit{transmitting embedding representations risks sensitive data leakage, while sharing only abstract cluster prototypes leads to diminished model accuracy}. To resolve this dilemma, we propose Structural Privacy-Preserving Federated Graph Clustering (SPP-FGC), a novel algorithm that innovatively leverages local structural graphs as the primary medium for privacy-preserving knowledge sharing, thus moving beyond the limitations of conventional techniques. Our framework operates on a clear client-server logic; on the client-side, each participant constructs a private structural graph that captures intrinsic data relationships, which the server then securely aggregates and aligns to form a comprehensive global graph from which a unified clustering structure is derived. The framework offers two distinct modes to suit different needs. SPP-FGC is designed as an efficient one-shot method that completes its task in a single communication round, ideal for rapid analysis. For more complex, unstructured data like images, SPP-FGC+ employs an iterative process where clients and the server collaboratively refine feature representations to achieve superior downstream performance. Extensive experiments demonstrate that our framework achieves state-of-the-art performance, improving clustering accuracy by up to 10\\% (NMI) over federated baselines while maintaining provable privacy guarantees.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10938",
        "abs_url": "https://arxiv.org/abs/2511.10938",
        "pdf_url": "https://arxiv.org/pdf/2511.10938",
        "title": "Cascading Bandits With Feedback",
        "authors": [
            "R Sri Prakash",
            "Nikhil Karamchandani",
            "Sharayu Moharir"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Motivated by the challenges of edge inference, we study a variant of the cascade bandit model in which each arm corresponds to an inference model with an associated accuracy and error probability. We analyse four decision-making policies-Explore-then-Commit, Action Elimination, Lower Confidence Bound (LCB), and Thompson Sampling-and provide sharp theoretical regret guarantees for each. Unlike in classical bandit settings, Explore-then-Commit and Action Elimination incur suboptimal regret because they commit to a fixed ordering after the exploration phase, limiting their ability to adapt. In contrast, LCB and Thompson Sampling continuously update their decisions based on observed feedback, achieving constant O(1) regret. Simulations corroborate these theoretical findings, highlighting the crucial role of adaptivity for efficient edge inference under uncertainty.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10941",
        "abs_url": "https://arxiv.org/abs/2511.10941",
        "pdf_url": "https://arxiv.org/pdf/2511.10941",
        "title": "Flow matching-based generative models for MIMO channel estimation",
        "authors": [
            "Wenkai Liu",
            "Nan Ma",
            "Jianqiao Chen",
            "Xiaoxuan Qi",
            "Yuhang Ma"
        ],
        "comments": "6 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Diffusion model (DM)-based channel estimation, which generates channel samples via a posteriori sampling stepwise with denoising process, has shown potential in high-precision channel state information (CSI) acquisition. However, slow sampling speed is an essential challenge for recent developed DM-based schemes. To alleviate this problem, we propose a novel flow matching (FM)-based generative model for multiple-input multiple-output (MIMO) channel estimation. We first formulate the channel estimation problem within FM framework, where the conditional probability path is constructed from the noisy channel distribution to the true channel distribution. In this case, the path evolves along the straight-line trajectory at a constant speed. Then, guided by this, we derive the velocity field that depends solely on the noise statistics to guide generative models training. Furthermore, during the sampling phase, we utilize the trained velocity field as prior information for channel estimation, which allows for quick and reliable noise channel enhancement via ordinary differential equation (ODE) Euler solver. Finally, numerical results demonstrate that the proposed FM-based channel estimation scheme can significantly reduce the sampling overhead compared to other popular DM-based schemes, such as the score matching (SM)-based scheme. Meanwhile, it achieves superior channel estimation accuracy under different channel conditions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10964",
        "abs_url": "https://arxiv.org/abs/2511.10964",
        "pdf_url": "https://arxiv.org/pdf/2511.10964",
        "title": "How Data Quality Affects Machine Learning Models for Credit Risk Assessment",
        "authors": [
            "Andrea Maurino"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Databases (cs.DB)",
        "abstract": "Machine Learning (ML) models are being increasingly employed for credit risk evaluation, with their effectiveness largely hinging on the quality of the input data. In this paper we investigate the impact of several data quality issues, including missing values, noisy attributes, outliers, and label errors, on the predictive accuracy of the machine learning model used in credit risk assessment. Utilizing an open-source dataset, we introduce controlled data corruption using the Pucktrick library to assess the robustness of 10 frequently used models like Random Forest, SVM, and Logistic Regression and so on. Our experiments show significant differences in model robustness based on the nature and severity of the data degradation. Moreover, the proposed methodology and accompanying tools offer practical support for practitioners seeking to enhance data pipeline robustness, and provide researchers with a flexible framework for further experimentation in data-centric AI contexts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11046",
        "abs_url": "https://arxiv.org/abs/2511.11046",
        "pdf_url": "https://arxiv.org/pdf/2511.11046",
        "title": "Enhancing Graph Representations with Neighborhood-Contextualized Message-Passing",
        "authors": [
            "Brian Godwin Lim"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Graph neural networks (GNNs) have become an indispensable tool for analyzing relational data. In the literature, classical GNNs may be classified into three variants: convolutional, attentional, and message-passing. While the standard message-passing variant is highly expressive, its typical pair-wise messages nevertheless only consider the features of the center node and each neighboring node individually. This design fails to incorporate the rich contextual information contained within the broader local neighborhood, potentially hindering its ability to learn complex relationships within the entire set of neighboring nodes. To address this limitation, this work first formalizes the concept of neighborhood-contextualization, rooted in a key property of the attentional variant. This then serves as the foundation for generalizing the message-passing variant to the proposed neighborhood-contextualized message-passing (NCMP) framework. To demonstrate its utility, a simple, practical, and efficient method to parametrize and operationalize NCMP is presented, leading to the development of the proposed Soft-Isomorphic Neighborhood-Contextualized Graph Convolution Network (SINC-GCN). A preliminary analysis on a synthetic binary node classification problem then underscores both the expressivity and efficiency of the proposed GNN architecture. Overall, the paper lays the foundation for the novel NCMP framework as a practical path toward further enhancing the graph representational power of classical GNNs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11081",
        "abs_url": "https://arxiv.org/abs/2511.11081",
        "pdf_url": "https://arxiv.org/pdf/2511.11081",
        "title": "Echoless Label-Based Pre-computation for Memory-Efficient Heterogeneous Graph Learning",
        "authors": [
            "Jun Hu",
            "Shangheng Chen",
            "Yufei He",
            "Yuan Li",
            "Bryan Hooi",
            "Bingsheng He"
        ],
        "comments": "Accepted by AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Social and Information Networks (cs.SI)",
        "abstract": "Heterogeneous Graph Neural Networks (HGNNs) are widely used for deep learning on heterogeneous graphs. Typical end-to-end HGNNs require repetitive message passing during training, limiting efficiency for large-scale real-world graphs. Pre-computation-based HGNNs address this by performing message passing only once during preprocessing, collecting neighbor information into regular-shaped tensors, which enables efficient mini-batch training. Label-based pre-computation methods collect neighbors' label information but suffer from training label leakage, where a node's own label information propagates back to itself during multi-hop message passing - the echo effect. Existing mitigation strategies are memory-inefficient on large graphs or suffer from compatibility issues with advanced message passing methods. We propose Echoless Label-based Pre-computation (Echoless-LP), which eliminates training label leakage with Partition-Focused Echoless Propagation (PFEP). PFEP partitions target nodes and performs echoless propagation, where nodes in each partition collect label information only from neighbors in other partitions, avoiding echo while remaining memory-efficient and compatible with any message passing method. We also introduce an Asymmetric Partitioning Scheme (APS) and a PostAdjust mechanism to address information loss from partitioning and distributional shifts across partitions. Experiments on public datasets demonstrate that Echoless-LP achieves superior performance and maintains memory efficiency compared to baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11092",
        "abs_url": "https://arxiv.org/abs/2511.11092",
        "pdf_url": "https://arxiv.org/pdf/2511.11092",
        "title": "Sheaf Cohomology of Linear Predictive Coding Networks",
        "authors": [
            "Jeffrey Seely"
        ],
        "comments": "Accepted to NeurIPS 2025 Workshop on Symmetry and Geometry in Neural Representations",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Predictive coding (PC) replaces global backpropagation with local optimization over weights and activations. We show that linear PC networks admit a natural formulation as cellular sheaves: the sheaf coboundary maps activations to edge-wise prediction errors, and PC inference is diffusion under the sheaf Laplacian. Sheaf cohomology then characterizes irreducible error patterns that inference cannot remove. We analyze recurrent topologies where feedback loops create internal contradictions, introducing prediction errors unrelated to supervision. Using a Hodge decomposition, we determine when these contradictions cause learning to stall. The sheaf formalism provides both diagnostic tools for identifying problematic network configurations and design principles for effective weight initialization for recurrent PC networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11111",
        "abs_url": "https://arxiv.org/abs/2511.11111",
        "pdf_url": "https://arxiv.org/pdf/2511.11111",
        "title": "SMART: A Surrogate Model for Predicting Application Runtime in Dragonfly Systems",
        "authors": [
            "Xin Wang",
            "Pietro Lodi Rizzini",
            "Sourav Medya",
            "Zhiling Lan"
        ],
        "comments": "Accepted at AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "The Dragonfly network, with its high-radix and low-diameter structure, is a leading interconnect in high-performance computing. A major challenge is workload interference on shared network links. Parallel discrete event simulation (PDES) is commonly used to analyze workload interference. However, high-fidelity PDES is computationally expensive, making it impractical for large-scale or real-time scenarios. Hybrid simulation that incorporates data-driven surrogate models offers a promising alternative, especially for forecasting application runtime, a task complicated by the dynamic behavior of network traffic. We present \\ourmodel, a surrogate model that combines graph neural networks (GNNs) and large language models (LLMs) to capture both spatial and temporal patterns from port level router data. \\ourmodel outperforms existing statistical and machine learning baselines, enabling accurate runtime prediction and supporting efficient hybrid simulation of Dragonfly networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11118",
        "abs_url": "https://arxiv.org/abs/2511.11118",
        "pdf_url": "https://arxiv.org/pdf/2511.11118",
        "title": "Improving Continual Learning of Knowledge Graph Embeddings via Informed Initialization",
        "authors": [
            "Gerard Pons",
            "Besim Bilalli",
            "Anna Queralt"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Many Knowledege Graphs (KGs) are frequently updated, forcing their Knowledge Graph Embeddings (KGEs) to adapt to these changes. To address this problem, continual learning techniques for KGEs incorporate embeddings for new entities while updating the old ones. One necessary step in these methods is the initialization of the embeddings, as an input to the KGE learning process, which can have an important impact in the accuracy of the final embeddings, as well as in the time required to train them. This is especially relevant for relatively small and frequent updates. We propose a novel informed embedding initialization strategy, which can be seamlessly integrated into existing continual learning methods for KGE, that enhances the acquisition of new knowledge while reducing catastrophic forgetting. Specifically, the KG schema and the previously learned embeddings are utilized to obtain initial representations for the new entities, based on the classes the entities belong to. Our extensive experimental analysis shows that the proposed initialization strategy improves the predictive performance of the resulting KGEs, while also enhancing knowledge retention. Furthermore, our approach accelerates knowledge acquisition, reducing the number of epochs, and therefore time, required to incrementally learn new embeddings. Finally, its benefits across various types of KGE learning models are demonstrated.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11143",
        "abs_url": "https://arxiv.org/abs/2511.11143",
        "pdf_url": "https://arxiv.org/pdf/2511.11143",
        "title": "Anomaly Detection in High-Dimensional Bank Account Balances via Robust Methods",
        "authors": [
            "Federico Maddanu",
            "Tommaso Proietti",
            "Riccardo Crupi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Detecting point anomalies in bank account balances is essential for financial institutions, as it enables the identification of potential fraud, operational issues, or other irregularities. Robust statistics is useful for flagging outliers and for providing estimates of the data distribution parameters that are not affected by contaminated observations. However, such a strategy is often less efficient and computationally expensive under high dimensional setting. In this paper, we propose and evaluate empirically several robust approaches that may be computationally efficient in medium and high dimensional datasets, with high breakdown points and low computational time. Our application deals with around 2.6 million daily records of anonymous users' bank account balances.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11152",
        "abs_url": "https://arxiv.org/abs/2511.11152",
        "pdf_url": "https://arxiv.org/pdf/2511.11152",
        "title": "Deep Learning for Short-Term Precipitation Prediction in Four Major Indian Cities: A ConvLSTM Approach with Explainable AI",
        "authors": [
            "Tanmay Ghosh",
            "Shaurabh Anand",
            "Rakesh Gomaji Nannewar",
            "Nithin Nagaraj"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep learning models for precipitation forecasting often function as black boxes, limiting their adoption in real-world weather prediction. To enhance transparency while maintaining accuracy, we developed an interpretable deep learning framework for short-term precipitation prediction in four major Indian cities: Bengaluru, Mumbai, Delhi, and Kolkata, spanning diverse climate zones. We implemented a hybrid Time-Distributed CNN-ConvLSTM (Convolutional Neural Network-Long Short-Term Memory) architecture, trained on multi-decadal ERA5 reanalysis data. The architecture was optimized for each city with a different number of convolutional filters: Bengaluru (32), Mumbai and Delhi (64), and Kolkata (128). The models achieved root mean square error (RMSE) values of 0.21 mm/day (Bengaluru), 0.52 mm/day (Mumbai), 0.48 mm/day (Delhi), and 1.80 mm/day (Kolkata). Through interpretability analysis using permutation importance, Gradient-weighted Class Activation Mapping (Grad-CAM), temporal occlusion, and counterfactual perturbation, we identified distinct patterns in the model's behavior. The model relied on city-specific variables, with prediction horizons ranging from one day for Bengaluru to five days for Kolkata. This study demonstrates how explainable AI (xAI) can provide accurate forecasts and transparent insights into precipitation patterns in diverse urban environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11159",
        "abs_url": "https://arxiv.org/abs/2511.11159",
        "pdf_url": "https://arxiv.org/pdf/2511.11159",
        "title": "Adaptive Symmetrization of the KL Divergence",
        "authors": [
            "Omri Ben-Dov",
            "Luiz F.O. Chamon"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Many tasks in machine learning can be described as or reduced to learning a probability distribution given a finite set of samples. A common approach is to minimize a statistical divergence between the (empirical) data distribution and a parameterized distribution, e.g., a normalizing flow (NF) or an energy-based model (EBM). In this context, the forward KL divergence is a ubiquitous due to its tractability, though its asymmetry may prevent capturing some properties of the target distribution. Symmetric alternatives involve brittle min-max formulations and adversarial training (e.g., generative adversarial networks) or evaluating the reverse KL divergence, as is the case for the symmetric Jeffreys divergence, which is challenging to compute from samples. This work sets out to develop a new approach to minimize the Jeffreys divergence. To do so, it uses a proxy model whose goal is not only to fit the data, but also to assist in optimizing the Jeffreys divergence of the main model. This joint training task is formulated as a constrained optimization problem to obtain a practical algorithm that adapts the models priorities throughout training. We illustrate how this framework can be used to combine the advantages of NFs and EBMs in tasks such as density estimation, image generation, and simulation-based inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11163",
        "abs_url": "https://arxiv.org/abs/2511.11163",
        "pdf_url": "https://arxiv.org/pdf/2511.11163",
        "title": "Training Neural Networks at Any Scale",
        "authors": [
            "Thomas Pethick",
            "Kimon Antonakopoulos",
            "Antonio Silveti-Falls",
            "Leena Chennuru Vankadara",
            "Volkan Cevher"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This article reviews modern optimization methods for training neural networks with an emphasis on efficiency and scale. We present state-of-the-art optimization algorithms under a unified algorithmic template that highlights the importance of adapting to the structures in the problem. We then cover how to make these algorithms agnostic to the scale of the problem. Our exposition is intended as an introduction for both practitioners and researchers who wish to be involved in these exciting new developments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11170",
        "abs_url": "https://arxiv.org/abs/2511.11170",
        "pdf_url": "https://arxiv.org/pdf/2511.11170",
        "title": "Power Ensemble Aggregation for Improved Extreme Event AI Prediction",
        "authors": [
            "Julien Collard",
            "Pierre Gentine",
            "Tian Zheng"
        ],
        "comments": "Accepted for the NeurIPS 2025 ML4PS workshop",
        "subjects": "Machine Learning (cs.LG); Atmospheric and Oceanic Physics (physics.ao-ph)",
        "abstract": "This paper addresses the critical challenge of improving predictions of climate extreme events, specifically heat waves, using machine learning methods. Our work is framed as a classification problem in which we try to predict whether surface air temperature will exceed its q-th local quantile within a specified timeframe. Our key finding is that aggregating ensemble predictions using a power mean significantly enhances the classifier's performance. By making a machine-learning based weather forecasting model generative and applying this non-linear aggregation method, we achieve better accuracy in predicting extreme heat events than with the typical mean prediction from the same model. Our power aggregation method shows promise and adaptability, as its optimal performance varies with the quantile threshold chosen, demonstrating increased effectiveness for higher extremes prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11178",
        "abs_url": "https://arxiv.org/abs/2511.11178",
        "pdf_url": "https://arxiv.org/pdf/2511.11178",
        "title": "On-line learning of dynamic systems: sparse regression meets Kalman filtering",
        "authors": [
            "Gianluigi Pillonetto",
            "Akram Yazdani",
            "Aleksandr Aravkin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Learning governing equations from data is central to understanding the behavior of physical systems across diverse scientific disciplines, including physics, biology, and engineering. The Sindy algorithm has proven effective in leveraging sparsity to identify concise models of nonlinear dynamical systems. In this paper, we extend sparsity-driven approaches to real-time learning by integrating a cornerstone algorithm from control theory -- the Kalman filter (KF). The resulting Sindy Kalman Filter (SKF) unifies both frameworks by treating unknown system parameters as state variables, enabling real-time inference of complex, time-varying nonlinear models unattainable by either method alone. Furthermore, SKF enhances KF parameter identification strategies, particularly via look-ahead error, significantly simplifying the estimation of sparsity levels, variance parameters, and switching instants. We validate SKF on a chaotic Lorenz system with drifting or switching parameters and demonstrate its effectiveness in the real-time identification of a sparse nonlinear aircraft model built from real flight data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11181",
        "abs_url": "https://arxiv.org/abs/2511.11181",
        "pdf_url": "https://arxiv.org/pdf/2511.11181",
        "title": "Dynamic Deep Graph Learning for Incomplete Multi-View Clustering with Masked Graph Reconstruction Loss",
        "authors": [
            "Zhenghao Zhang",
            "Jun Xie",
            "Xingchen Chen",
            "Tao Yu",
            "Hongzhu Yi",
            "Kaixin Xu",
            "Yuanxiang Wang",
            "Tianyu Zong",
            "Xinming Wang",
            "Jiahuan Chen",
            "Guoqing Chao",
            "Feng Chen",
            "Zhepeng Wang",
            "Jungang Xu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The prevalence of real-world multi-view data makes incomplete multi-view clustering (IMVC) a crucial research. The rapid development of Graph Neural Networks (GNNs) has established them as one of the mainstream approaches for multi-view clustering. Despite significant progress in GNNs-based IMVC, some challenges remain: (1) Most methods rely on the K-Nearest Neighbors (KNN) algorithm to construct static graphs from raw data, which introduces noise and diminishes the robustness of the graph topology. (2) Existing methods typically utilize the Mean Squared Error (MSE) loss between the reconstructed graph and the sparse adjacency graph directly as the graph reconstruction loss, leading to substantial gradient noise during optimization. To address these issues, we propose a novel \\textbf{D}ynamic Deep \\textbf{G}raph Learning for \\textbf{I}ncomplete \\textbf{M}ulti-\\textbf{V}iew \\textbf{C}lustering with \\textbf{M}asked Graph Reconstruction Loss (DGIMVCM). Firstly, we construct a missing-robust global graph from the raw data. A graph convolutional embedding layer is then designed to extract primary features and refined dynamic view-specific graph structures, leveraging the global graph for imputation of missing views. This process is complemented by graph structure contrastive learning, which identifies consistency among view-specific graph structures. Secondly, a graph self-attention encoder is introduced to extract high-level representations based on the imputed primary features and view-specific graphs, and is optimized with a masked graph reconstruction loss to mitigate gradient noise during optimization. Finally, a clustering module is constructed and optimized through a pseudo-label self-supervised training mechanism. Extensive experiments on multiple datasets validate the effectiveness and superiority of DGIMVCM.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11190",
        "abs_url": "https://arxiv.org/abs/2511.11190",
        "pdf_url": "https://arxiv.org/pdf/2511.11190",
        "title": "LoRaCompass: Robust Reinforcement Learning to Efficiently Search for a LoRa Tag",
        "authors": [
            "Tianlang He",
            "Zhongming Lin",
            "Tianrui Jiang",
            "S.-H. Gary Chan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The Long-Range (LoRa) protocol, known for its extensive range and low power, has increasingly been adopted in tags worn by mentally incapacitated persons (MIPs) and others at risk of going missing. We study the sequential decision-making process for a mobile sensor to locate a periodically broadcasting LoRa tag with the fewest moves (hops) in general, unknown environments, guided by the received signal strength indicator (RSSI). While existing methods leverage reinforcement learning for search, they remain vulnerable to domain shift and signal fluctuation, resulting in cascading decision errors that culminate in substantial localization inaccuracies. To bridge this gap, we propose LoRaCompass, a reinforcement learning model designed to achieve robust and efficient search for a LoRa tag. For exploitation under domain shift and signal fluctuation, LoRaCompass learns a robust spatial representation from RSSI to maximize the probability of moving closer to a tag, via a spatially-aware feature extractor and a policy distillation loss function. It further introduces an exploration function inspired by the upper confidence bound (UCB) that guides the sensor toward the tag with increasing confidence. We have validated LoRaCompass in ground-based and drone-assisted scenarios within diverse unseen environments covering an area of over 80km^2. It has demonstrated high success rate (>90%) in locating the tag within 100m proximity (a 40% improvement over existing methods) and high efficiency with a search path length (in hops) that scales linearly with the initial distance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11208",
        "abs_url": "https://arxiv.org/abs/2511.11208",
        "pdf_url": "https://arxiv.org/pdf/2511.11208",
        "title": "When to Stop Federated Learning: Zero-Shot Generation of Synthetic Validation Data with Generative AI for Early Stopping",
        "authors": [
            "Youngjoon Lee",
            "Hyukjoon Lee",
            "Jinu Gong",
            "Yang Cao",
            "Joonhyuk Kang"
        ],
        "comments": "Accepted to IEEE BigData 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated Learning (FL) enables collaborative model training across decentralized devices while preserving data privacy. However, FL methods typically run for a predefined number of global rounds, often leading to unnecessary computation when optimal performance is reached earlier. In addition, training may continue even when the model fails to achieve meaningful performance. To address this inefficiency, we introduce a zero-shot synthetic validation framework that leverages generative AI to monitor model performance and determine early stopping points. Our approach adaptively stops training near the optimal round, thereby conserving computational resources and enabling rapid hyperparameter adjustments. Numerical results on multi-label chest X-ray classification demonstrate that our method reduces training rounds by up to 74% while maintaining accuracy within 1% of the optimal.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11211",
        "abs_url": "https://arxiv.org/abs/2511.11211",
        "pdf_url": "https://arxiv.org/pdf/2511.11211",
        "title": "A Best-of-Both-Worlds Proof for Tsallis-INF without Fenchel Conjugates",
        "authors": [
            "Wei-Cheng Lee",
            "Francesco Orabona"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "In this short note, we present a simple derivation of the best-of-both-world guarantee for the Tsallis-INF multi-armed bandit algorithm from J. Zimmert and Y. Seldin. Tsallis-INF: An optimal algorithm for stochastic and adversarial bandits. Journal of Machine Learning Research, 22(28):1-49, 2021. URL this https URL. In particular, the proof uses modern tools from online convex optimization and avoid the use of conjugate functions. Also, we do not optimize the constants in the bounds in favor of a slimmer proof.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11221",
        "abs_url": "https://arxiv.org/abs/2511.11221",
        "pdf_url": "https://arxiv.org/pdf/2511.11221",
        "title": "Sparse Methods for Vector Embeddings of TPC Data",
        "authors": [
            "Tyler Wheeler",
            "Michelle P. Kuchera",
            "Raghuram Ramanujan",
            "Ryan Krupp",
            "Chris Wrede",
            "Saiprasad Ravishankar",
            "Connor L. Cross",
            "Hoi Yan Ian Heung",
            "Andrew J. Jones",
            "Benjamin Votaw"
        ],
        "comments": "NeurIPS Machine Learning and the Physical Sciences Workshop 2025",
        "subjects": "Machine Learning (cs.LG); Nuclear Experiment (nucl-ex)",
        "abstract": "Time Projection Chambers (TPCs) are versatile detectors that reconstruct charged-particle tracks in an ionizing medium, enabling sensitive measurements across a wide range of nuclear physics experiments. We explore sparse convolutional networks for representation learning on TPC data, finding that a sparse ResNet architecture, even with randomly set weights, provides useful structured vector embeddings of events. Pre-training this architecture on a simple physics-motivated binary classification task further improves the embedding quality. Using data from the GAseous Detector with GErmanium Tagging (GADGET) II TPC, a detector optimized for measuring low-energy $\\beta$-delayed particle decays, we represent raw pad-level signals as sparse tensors, train Minkowski Engine ResNet models, and probe the resulting event-level embeddings which reveal rich event structure. As a cross-detector test, we embed data from the Active-Target TPC (AT-TPC) -- a detector designed for nuclear reaction studies in inverse kinematics -- using the same encoder. We find that even an untrained sparse ResNet model provides useful embeddings of AT-TPC data, and we observe improvements when the model is trained on GADGET data. Together, these results highlight the potential of sparse convolutional techniques as a general tool for representation learning in diverse TPC experiments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11235",
        "abs_url": "https://arxiv.org/abs/2511.11235",
        "pdf_url": "https://arxiv.org/pdf/2511.11235",
        "title": "Neural Network-Powered Finger-Drawn Biometric Authentication",
        "authors": [
            "Maan Al Balkhi",
            "Kordian Gontarska",
            "Marko Harasic",
            "Adrian Paschke"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "This paper investigates neural network-based biometric authentication using finger-drawn digits on touchscreen devices. We evaluated CNN and autoencoder architectures for user authentication through simple digit patterns (0-9) traced with finger input. Twenty participants contributed 2,000 finger-drawn digits each on personal touchscreen devices. We compared two CNN architectures: a modified Inception-V1 network and a lightweight shallow CNN for mobile environments. Additionally, we examined Convolutional and Fully Connected autoencoders for anomaly detection. Both CNN architectures achieved ~89% authentication accuracy, with the shallow CNN requiring fewer parameters. Autoencoder approaches achieved ~75% accuracy. The results demonstrate that finger-drawn symbol authentication provides a viable, secure, and user-friendly biometric solution for touchscreen devices. This approach can be integrated with existing pattern-based authentication methods to create multi-layered security systems for mobile applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11238",
        "abs_url": "https://arxiv.org/abs/2511.11238",
        "pdf_url": "https://arxiv.org/pdf/2511.11238",
        "title": "Virtual Width Networks",
        "authors": [
            "Seed",
            "Baisheng Li",
            "Banggu Wu",
            "Bole Ma",
            "Bowen Xiao",
            "Chaoyi Zhang",
            "Cheng Li",
            "Chengyi Wang",
            "Chenyin Xu",
            "Chi Zhang",
            "Chong Hu",
            "Daoguang Zan",
            "Defa Zhu",
            "Dongyu Xu",
            "Du Li",
            "Faming Wu",
            "Fan Xia",
            "Ge Zhang",
            "Guang Shi",
            "Haobin Chen",
            "Hongyu Zhu",
            "Hongzhi Huang",
            "Huan Zhou",
            "Huanzhang Dou",
            "Jianhui Duan",
            "Jianqiao Lu",
            "Jianyu Jiang",
            "Jiayi Xu",
            "Jiecao Chen",
            "Jin Chen",
            "Jin Ma",
            "Jing Su",
            "Jingji Chen",
            "Jun Wang",
            "Jun Yuan",
            "Juncai Liu",
            "Jundong Zhou",
            "Kai Hua",
            "Kai Shen",
            "Kai Xiang",
            "Kaiyuan Chen",
            "Kang Liu",
            "Ke Shen",
            "Liang Xiang",
            "Lin Yan",
            "Lishu Luo",
            "Mengyao Zhang",
            "Ming Ding",
            "Mofan Zhang",
            "Nianning Liang",
            "Peng Li",
            "Penghao Huang",
            "Pengpeng Mu",
            "Qi Huang",
            "Qianli Ma",
            "Qiyang Min",
            "Qiying Yu",
            "Renming Pang",
            "Ru Zhang",
            "Shen Yan",
            "Shen Yan",
            "Shixiong Zhao",
            "Shuaishuai Cao",
            "Shuang Wu",
            "Siyan Chen",
            "Siyu Li",
            "Siyuan Qiao",
            "Tao Sun",
            "Tian Xin",
            "Tiantian Fan",
            "Ting Huang",
            "Ting-Han Fan",
            "Wei Jia",
            "Wenqiang Zhang",
            "Wenxuan Liu",
            "Xiangzhong Wu",
            "Xiaochen Zuo",
            "Xiaoying Jia",
            "Ximing Yang",
            "Xin Liu",
            "Xin Yu",
            "Xingyan Bin",
            "Xintong Hao",
            "Xiongcai Luo",
            "Xujing Li",
            "Xun Zhou",
            "Yanghua Peng",
            "Yangrui Chen",
            "Yi Lin",
            "Yichong Leng",
            "Yinghao Li",
            "Yingshuan Song",
            "Yiyuan Ma",
            "Yong Shan",
            "Yongan Xiang",
            "Yonghui Wu",
            "Yongtao Zhang",
            "Yongzhen Yao",
            "Yu Bao",
            "Yuehang Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We introduce Virtual Width Networks (VWN), a framework that delivers the benefits of wider representations without incurring the quadratic cost of increasing the hidden size. VWN decouples representational width from backbone width, expanding the embedding space while keeping backbone compute nearly constant. In our large-scale experiment, an 8-times expansion accelerates optimization by over 2 times for next-token and 3 times for next-2-token prediction. The advantage amplifies over training as both the loss gap grows and the convergence-speedup ratio increases, showing that VWN is not only token-efficient but also increasingly effective with scale. Moreover, we identify an approximately log-linear scaling relation between virtual width and loss reduction, offering an initial empirical basis and motivation for exploring virtual-width scaling as a new dimension of large-model efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11245",
        "abs_url": "https://arxiv.org/abs/2511.11245",
        "pdf_url": "https://arxiv.org/pdf/2511.11245",
        "title": "Heterogeneous Attributed Graph Learning via Neighborhood-Aware Star Kernels",
        "authors": [
            "Hong Huang",
            "Chengyu Yao",
            "Haiming Chen",
            "Hang Gao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Attributed graphs, typically characterized by irregular topologies and a mix of numerical and categorical attributes, are ubiquitous in diverse domains such as social networks, bioinformatics, and cheminformatics. While graph kernels provide a principled framework for measuring graph similarity, existing kernel methods often struggle to simultaneously capture heterogeneous attribute semantics and neighborhood information in attributed graphs. In this work, we propose the Neighborhood-Aware Star Kernel (NASK), a novel graph kernel designed for attributed graph learning. NASK leverages an exponential transformation of the Gower similarity coefficient to jointly model numerical and categorical features efficiently, and employs star substructures enhanced by Weisfeiler-Lehman iterations to integrate multi-scale neighborhood structural information. We theoretically prove that NASK is positive definite, ensuring compatibility with kernel-based learning frameworks such as SVMs. Extensive experiments are conducted on eleven attributed and four large-scale real-world graph benchmarks. The results demonstrate that NASK consistently achieves superior performance over sixteen state-of-the-art baselines, including nine graph kernels and seven Graph Neural Networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11293",
        "abs_url": "https://arxiv.org/abs/2511.11293",
        "pdf_url": "https://arxiv.org/pdf/2511.11293",
        "title": "Toward Scalable Early Cancer Detection: Evaluating EHR-Based Predictive Models Against Traditional Screening Criteria",
        "authors": [
            "Jiheum Park",
            "Chao Pang",
            "Tristan Y. Lee",
            "Jeong Yun Yang",
            "Jacob Berkowitz",
            "Alexander Z. Wei",
            "Nicholas Tatonetti"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Current cancer screening guidelines cover only a few cancer types and rely on narrowly defined criteria such as age or a single risk factor like smoking history, to identify high-risk individuals. Predictive models using electronic health records (EHRs), which capture large-scale longitudinal patient-level health information, may provide a more effective tool for identifying high-risk groups by detecting subtle prediagnostic signals of cancer. Recent advances in large language and foundation models have further expanded this potential, yet evidence remains limited on how useful HER-based models are compared with traditional risk factors currently used in screening guidelines. We systematically evaluated the clinical utility of EHR-based predictive models against traditional risk factors, including gene mutations and family history of cancer, for identifying high-risk individuals across eight major cancers (breast, lung, colorectal, prostate, ovarian, liver, pancreatic, and stomach), using data from the All of Us Research Program, which integrates EHR, genomic, and survey data from over 865,000 participants. Even with a baseline modeling approach, EHR-based models achieved a 3- to 6-fold higher enrichment of true cancer cases among individuals identified as high risk compared with traditional risk factors alone, whether used as a standalone or complementary tool. The EHR foundation model, a state-of-the-art approach trained on comprehensive patient trajectories, further improved predictive performance across 26 cancer types, demonstrating the clinical potential of EHR-based predictive modeling to support more precise and scalable early detection strategies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11346",
        "abs_url": "https://arxiv.org/abs/2511.11346",
        "pdf_url": "https://arxiv.org/pdf/2511.11346",
        "title": "Fast and Expressive Multi-Token Prediction with Probabilistic Circuits",
        "authors": [
            "Andreas Grivas",
            "Lorenzo Loconte",
            "Emile van Krieken",
            "Piotr Nawrot",
            "Yu Zhao",
            "Euan Wielewski",
            "Pasquale Minervini",
            "Edoardo Ponti",
            "Antonio Vergari"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multi-token prediction (MTP) is a prominent strategy to significantly speed up generation in large language models (LLMs), including byte-level LLMs, which are tokeniser-free but prohibitively slow. However, existing MTP methods often sacrifice expressiveness by assuming independence between future tokens. In this work, we investigate the trade-off between expressiveness and latency in MTP within the framework of probabilistic circuits (PCs). Our framework, named MTPC, allows one to explore different ways to encode the joint distributions over future tokens by selecting different circuit architectures, generalising classical models such as (hierarchical) mixture models, hidden Markov models and tensor networks. We show the efficacy of MTPC by retrofitting existing byte-level LLMs, such as EvaByte. Our experiments show that, when combined with speculative decoding, MTPC significantly speeds up generation compared to MTP with independence assumptions, while guaranteeing to retain the performance of the original verifier LLM. We also rigorously study the optimal trade-off between expressiveness and latency when exploring the possible parameterisations of MTPC, such as PC architectures and partial layer sharing between the verifier and draft LLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11361",
        "abs_url": "https://arxiv.org/abs/2511.11361",
        "pdf_url": "https://arxiv.org/pdf/2511.11361",
        "title": "Toward Multi-Fidelity Machine Learning Force Field for Cathode Materials",
        "authors": [
            "Guangyi Dong",
            "Zhihui Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Machine learning force fields (MLFFs), which employ neural networks to map atomic structures to system energies, effectively combine the high accuracy of first-principles calculation with the computational efficiency of empirical force fields. They are widely used in computational materials simulations. However, the development and application of MLFFs for lithium-ion battery cathode materials remain relatively limited. This is primarily due to the complex electronic structure characteristics of cathode materials and the resulting scarcity of high-quality computational datasets available for force field training. In this work, we develop a multi-fidelity machine learning force field framework to enhance the data efficiency of computational results, which can simultaneously utilize both low-fidelity non-magnetic and high-fidelity magnetic computational datasets of cathode materials for training. Tests conducted on the lithium manganese iron phosphate (LMFP) cathode material system demonstrate the effectiveness of this multi-fidelity approach. This work helps to achieve high-accuracy MLFF training for cathode materials at a lower training dataset cost, and offers new perspectives for applying MLFFs to computational simulations of cathode materials.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11362",
        "abs_url": "https://arxiv.org/abs/2511.11362",
        "pdf_url": "https://arxiv.org/pdf/2511.11362",
        "title": "On-Device Fine-Tuning via Backprop-Free Zeroth-Order Optimization",
        "authors": [
            "Prabodh Katti",
            "Sangwoo Park",
            "Bipin Rajendran",
            "Osvaldo Simeone"
        ],
        "comments": "Conference submission; Under review",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "On-device fine-tuning is a critical capability for edge AI systems, which must support adaptation to different agentic tasks under stringent memory constraints. Conventional backpropagation (BP)-based training requires storing layer activations and optimizer states, a demand that can be only partially alleviated through checkpointing. In edge deployments in which the model weights must reside entirely in device memory, this overhead severely limits the maximum model size that can be deployed. Memory-efficient zeroth-order optimization (MeZO) alleviates this bottleneck by estimating gradients using forward evaluations alone, eliminating the need for storing intermediate activations or optimizer states. This enables significantly larger models to fit within on-chip memory, albeit at the cost of potentially longer fine-tuning wall-clock time. This paper first provides a theoretical estimate of the relative model sizes that can be accommodated under BP and MeZO training. We then numerically validate the analysis, demonstrating that MeZO exhibits accuracy advantages under on-device memory constraints, provided sufficient wall-clock time is available for fine-tuning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11380",
        "abs_url": "https://arxiv.org/abs/2511.11380",
        "pdf_url": "https://arxiv.org/pdf/2511.11380",
        "title": "When Genes Speak: A Semantic-Guided Framework for Spatially Resolved Transcriptomics Data Clustering",
        "authors": [
            "Jiangkai Long",
            "Yanran Zhu",
            "Chang Tang",
            "Kun Sun",
            "Yuanyuan Liu",
            "Xuesong Yan"
        ],
        "comments": "AAAI'2026 poster paper. 12 pages, 8 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Spatial transcriptomics enables gene expression profiling with spatial context, offering unprecedented insights into the tissue microenvironment. However, most computational models treat genes as isolated numerical features, ignoring the rich biological semantics encoded in their symbols. This prevents a truly deep understanding of critical biological characteristics. To overcome this limitation, we present SemST, a semantic-guided deep learning framework for spatial transcriptomics data clustering. SemST leverages Large Language Models (LLMs) to enable genes to \"speak\" through their symbolic meanings, transforming gene sets within each tissue spot into biologically informed embeddings. These embeddings are then fused with the spatial neighborhood relationships captured by Graph Neural Networks (GNNs), achieving a coherent integration of biological function and spatial structure. We further introduce the Fine-grained Semantic Modulation (FSM) module to optimally exploit these biological priors. The FSM module learns spot-specific affine transformations that empower the semantic embeddings to perform an element-wise calibration of the spatial features, thus dynamically injecting high-order biological knowledge into the spatial context. Extensive experiments on public spatial transcriptomics datasets show that SemST achieves state-of-the-art clustering performance. Crucially, the FSM module exhibits plug-and-play versatility, consistently improving the performance when integrated into other baseline methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11388",
        "abs_url": "https://arxiv.org/abs/2511.11388",
        "pdf_url": "https://arxiv.org/pdf/2511.11388",
        "title": "Robust inverse material design with physical guarantees using the Voigt-Reuss Net",
        "authors": [
            "Sanath Keshav",
            "Felix Fritzen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose a spectrally normalized surrogate for forward and inverse mechanical homogenization with hard physical guarantees. Leveraging the Voigt-Reuss bounds, we factor their difference via a Cholesky-like operator and learn a dimensionless, symmetric positive semi-definite representation with eigenvalues in $[0,1]$; the inverse map returns symmetric positive-definite predictions that lie between the bounds in the Löwner sense. In 3D linear elasticity on an open dataset of stochastic biphasic microstructures, a fully connected Voigt-Reuss net trained on $>\\!7.5\\times 10^{5}$ FFT-based labels with 236 isotropy-invariant descriptors and three contrast parameters recovers the isotropic projection with near-perfect fidelity (isotropy-related entries: $R^2 \\ge 0.998$), while anisotropy-revealing couplings are unidentifiable from $SO(3)$-invariant inputs. Tensor-level relative Frobenius errors have median $\\approx 1.7\\%$ and mean $\\approx 3.4\\%$ across splits. For 2D plane strain on thresholded trigonometric microstructures, coupling spectral normalization with a differentiable renderer and a CNN yields $R^2>0.99$ on all components, subpercent normalized losses, accurate tracking of percolation-induced eigenvalue jumps, and robust generalization to out-of-distribution images. Treating the parametric microstructure as design variables, batched first-order optimization with a single surrogate matches target tensors within a few percent and returns diverse near-optimal designs. Overall, the Voigt-Reuss net unifies accurate, physically admissible forward prediction with large-batch, constraint-consistent inverse design, and is generic to elliptic operators and coupled-physics settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11391",
        "abs_url": "https://arxiv.org/abs/2511.11391",
        "pdf_url": "https://arxiv.org/pdf/2511.11391",
        "title": "SPOT: Single-Shot Positioning via Trainable Near-Field Rainbow Beamforming",
        "authors": [
            "Yeyue Cai",
            "Jianhua Mo",
            "Meixia Tao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Phase-time arrays, which integrate phase shifters (PSs) and true-time delays (TTDs), have emerged as a cost-effective architecture for generating frequency-dependent rainbow beams in wideband sensing and localization. This paper proposes an end-to-end deep learning-based scheme that simultaneously designs the rainbow beams and estimates user positions. Treating the PS and TTD coefficients as trainable variables allows the network to synthesize task-oriented beams that maximize localization accuracy. A lightweight fully connected module then recovers the user's angle-range coordinates from its feedback of the maximum quantized received power and its corresponding subcarrier index after a single downlink transmission. Compared with existing analytical and learning-based schemes, the proposed method reduces overhead by an order of magnitude and delivers consistently lower two-dimensional positioning error.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11402",
        "abs_url": "https://arxiv.org/abs/2511.11402",
        "pdf_url": "https://arxiv.org/pdf/2511.11402",
        "title": "Multi-Phase Spacecraft Trajectory Optimization via Transformer-Based Reinforcement Learning",
        "authors": [
            "Amit Jain",
            "Victor Rodriguez-Fernandez",
            "Richard Linares"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Autonomous spacecraft control for mission phases such as launch, ascent, stage separation, and orbit insertion remains a critical challenge due to the need for adaptive policies that generalize across dynamically distinct regimes. While reinforcement learning (RL) has shown promise in individual astrodynamics tasks, existing approaches often require separate policies for distinct mission phases, limiting adaptability and increasing operational complexity. This work introduces a transformer-based RL framework that unifies multi-phase trajectory optimization through a single policy architecture, leveraging the transformer's inherent capacity to model extended temporal contexts. Building on proximal policy optimization (PPO), our framework replaces conventional recurrent networks with a transformer encoder-decoder structure, enabling the agent to maintain coherent memory across mission phases spanning seconds to minutes during critical operations. By integrating a Gated Transformer-XL (GTrXL) architecture, the framework eliminates manual phase transitions while maintaining stability in control decisions. We validate our approach progressively: first demonstrating near-optimal performance on single-phase benchmarks (double integrator and Van der Pol oscillator), then extending to multiphase waypoint navigation variants, and finally tackling a complex multiphase rocket ascent problem that includes atmospheric flight, stage separation, and vacuum operations. Results demonstrate that the transformer-based framework not only matches analytical solutions in simple cases but also effectively learns coherent control policies across dynamically distinct regimes, establishing a foundation for scalable autonomous mission planning that reduces reliance on phase-specific controllers while maintaining compatibility with safety-critical verification protocols.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11413",
        "abs_url": "https://arxiv.org/abs/2511.11413",
        "pdf_url": "https://arxiv.org/pdf/2511.11413",
        "title": "Multicalibration yields better matchings",
        "authors": [
            "Riccardo Colini Baldeschi",
            "Simone Di Gregorio",
            "Simone Fioravanti",
            "Federico Fusco",
            "Ido Guy",
            "Daniel Haimovich",
            "Stefano Leonardi",
            "Fridolin Linder",
            "Lorenzo Perini",
            "Matteo Russo",
            "Niek Tax"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Consider the problem of finding the best matching in a weighted graph where we only have access to predictions of the actual stochastic weights, based on an underlying context. If the predictor is the Bayes optimal one, then computing the best matching based on the predicted weights is optimal. However, in practice, this perfect information scenario is not realistic. Given an imperfect predictor, a suboptimal decision rule may compensate for the induced error and thus outperform the standard optimal rule. In this paper, we propose multicalibration as a way to address this problem. This fairness notion requires a predictor to be unbiased on each element of a family of protected sets of contexts. Given a class of matching algorithms $\\mathcal C$ and any predictor $\\gamma$ of the edge-weights, we show how to construct a specific multicalibrated predictor $\\hat \\gamma$, with the following property. Picking the best matching based on the output of $\\hat \\gamma$ is competitive with the best decision rule in $\\mathcal C$ applied onto the original predictor $\\gamma$. We complement this result by providing sample complexity bounds.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11415",
        "abs_url": "https://arxiv.org/abs/2511.11415",
        "pdf_url": "https://arxiv.org/pdf/2511.11415",
        "title": "Differentiation Strategies for Acoustic Inverse Problems: Admittance Estimation and Shape Optimization",
        "authors": [
            "Nikolas Borrel-Jensen",
            "Josiah Bjorgaard"
        ],
        "comments": "4 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG); Computational Engineering, Finance, and Science (cs.CE); Computational Physics (physics.comp-ph)",
        "abstract": "We demonstrate a practical differentiable programming approach for acoustic inverse problems through two applications: admittance estimation and shape optimization for resonance damping. First, we show that JAX-FEM's automatic differentiation (AD) enables direct gradient-based estimation of complex boundary admittance from sparse pressure measurements, achieving 3-digit precision without requiring manual derivation of adjoint equations. Second, we apply randomized finite differences to acoustic shape optimization, combining JAX-FEM for forward simulation with PyTorch3D for mesh manipulation through AD. By separating physics-driven boundary optimization from geometry-driven interior mesh adaptation, we achieve 48.1% energy reduction at target frequencies with 30-fold fewer FEM solutions compared to standard finite difference on the full mesh. This work showcases how modern differentiable software stacks enable rapid prototyping of optimization workflows for physics-based inverse problems, with automatic differentiation for parameter estimation and a combination of finite differences and AD for geometric design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11439",
        "abs_url": "https://arxiv.org/abs/2511.11439",
        "pdf_url": "https://arxiv.org/pdf/2511.11439",
        "title": "Retrofit: Continual Learning with Bounded Forgetting for Security Applications",
        "authors": [
            "Yiling He",
            "Junchi Lei",
            "Hongyu She",
            "Shuo Shao",
            "Xinran Zheng",
            "Yiping Liu",
            "Zhan Qin",
            "Lorenzo Cavallaro"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Modern security analytics are increasingly powered by deep learning models, but their performance often degrades as threat landscapes evolve and data representations shift. While continual learning (CL) offers a promising paradigm to maintain model effectiveness, many approaches rely on full retraining or data replay, which are infeasible in data-sensitive environments. Moreover, existing methods remain inadequate for security-critical scenarios, facing two coupled challenges in knowledge transfer: preserving prior knowledge without old data and integrating new knowledge with minimal interference. We propose RETROFIT, a data retrospective-free continual learning method that achieves bounded forgetting for effective knowledge transfer. Our key idea is to consolidate previously trained and newly fine-tuned models, serving as teachers of old and new knowledge, through parameter-level merging that eliminates the need for historical data. To mitigate interference, we apply low-rank and sparse updates that confine parameter changes to independent subspaces, while a knowledge arbitration dynamically balances the teacher contributions guided by model confidence. Our evaluation on two representative applications demonstrates that RETROFIT consistently mitigates forgetting while maintaining adaptability. In malware detection under temporal drift, it substantially improves the retention score, from 20.2% to 38.6% over CL baselines, and exceeds the oracle upper bound on new data. In binary summarization across decompilation levels, where analyzing stripped binaries is especially challenging, RETROFIT achieves around twice the BLEU score of transfer learning used in prior work and surpasses all baselines in cross-representation generalization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11446",
        "abs_url": "https://arxiv.org/abs/2511.11446",
        "pdf_url": "https://arxiv.org/pdf/2511.11446",
        "title": "DiffPro: Joint Timestep and Layer-Wise Precision Optimization for Efficient Diffusion Inference",
        "authors": [
            "Farhana Amin",
            "Sabiha Afroz",
            "Kanchon Gharami",
            "Mona Moghadampanah",
            "Dimitrios S. Nikolopoulos"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Diffusion models produce high quality images but inference is costly due to many denoising steps and heavy matrix operations. We present DiffPro, a post-training, hardware-faithful framework that works with the exact integer kernels used in deployment and jointly tunes timesteps and per-layer precision in Diffusion Transformers (DiTs) to reduce latency and memory without any training. DiffPro combines three parts: a manifold-aware sensitivity metric to allocate weight bits, dynamic activation quantization to stabilize activations across timesteps, and a budgeted timestep selector guided by teacher-student drift. In experiments DiffPro achieves up to 6.25x model compression, fifty percent fewer timesteps, and 2.8x faster inference with Delta FID <= 10 on standard benchmarks, demonstrating practical efficiency gains. DiffPro unifies step reduction and precision planning into a single budgeted deployable plan for real-time energy-aware diffusion inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11459",
        "abs_url": "https://arxiv.org/abs/2511.11459",
        "pdf_url": "https://arxiv.org/pdf/2511.11459",
        "title": "FairReweighing: Density Estimation-Based Reweighing Framework for Improving Separation in Fair Regression",
        "authors": [
            "Xiaoyin Xi",
            "Zhe Yu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "There has been a prevalence of applying AI software in both high-stakes public-sector and industrial contexts. However, the lack of transparency has raised concerns about whether these data-informed AI software decisions secure fairness against people of all racial, gender, or age groups. Despite extensive research on emerging fairness-aware AI software, up to now most efforts to solve this issue have been dedicated to binary classification tasks. Fairness in regression is relatively underexplored. In this work, we adopted a mutual information-based metric to assess separation violations. The metric is also extended so that it can be directly applied to both classification and regression problems with both binary and continuous sensitive attributes. Inspired by the Reweighing algorithm in fair classification, we proposed a FairReweighing pre-processing algorithm based on density estimation to ensure that the learned model satisfies the separation criterion. Theoretically, we show that the proposed FairReweighing algorithm can guarantee separation in the training data under a data independence assumption. Empirically, on both synthetic and real-world data, we show that FairReweighing outperforms existing state-of-the-art regression fairness solutions in terms of improving separation while maintaining high accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11462",
        "abs_url": "https://arxiv.org/abs/2511.11462",
        "pdf_url": "https://arxiv.org/pdf/2511.11462",
        "title": "MoCap2Radar: A Spatiotemporal Transformer for Synthesizing Micro-Doppler Radar Signatures from Motion Capture",
        "authors": [
            "Kevin Chen",
            "Kenneth W. Parker",
            "Anish Arora"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present a pure machine learning process for synthesizing radar spectrograms from Motion-Capture (MoCap) data. We formulate MoCap-to-spectrogram translation as a windowed sequence-to-sequence task using a transformer-based model that jointly captures spatial relations among MoCap markers and temporal dynamics across frames. Real-world experiments show that the proposed approach produces visually and quantitatively plausible doppler radar spectrograms and achieves good generalizability. Ablation experiments show that the learned model includes both the ability to convert multi-part motion into doppler signatures and an understanding of the spatial relations between different parts of the human body. The result is an interesting example of using transformers for time-series signal processing. It is especially applicable to edge computing and Internet of Things (IoT) radars. It also suggests the ability to augment scarce radar datasets using more abundant MoCap data for training higher-level applications. Finally, it requires far less computation than physics-based methods for generating radar data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11472",
        "abs_url": "https://arxiv.org/abs/2511.11472",
        "pdf_url": "https://arxiv.org/pdf/2511.11472",
        "title": "Quantifying and Improving Adaptivity in Conformal Prediction through Input Transformations",
        "authors": [
            "Sooyong Jang",
            "Insup Lee"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Conformal prediction constructs a set of labels instead of a single point prediction, while providing a probabilistic coverage guarantee. Beyond the coverage guarantee, adaptiveness to example difficulty is an important property. It means that the method should produce larger prediction sets for more difficult examples, and smaller ones for easier examples. Existing evaluation methods for adaptiveness typically analyze coverage rate violation or average set size across bins of examples grouped by difficulty. However, these approaches often suffer from imbalanced binning, which can lead to inaccurate estimates of coverage or set size. To address this issue, we propose a binning method that leverages input transformations to sort examples by difficulty, followed by uniform-mass binning. Building on this binning, we introduce two metrics to better evaluate adaptiveness. These metrics provide more reliable estimates of coverage rate violation and average set size due to balanced binning, leading to more accurate adaptivity assessment. Through experiments, we demonstrate that our proposed metric correlates more strongly with the desired adaptiveness property compared to existing ones. Furthermore, motivated by our findings, we propose a new adaptive prediction set algorithm that groups examples by estimated difficulty and applies group-conditional conformal prediction. This allows us to determine appropriate thresholds for each group. Experimental results on both (a) an Image Classification (ImageNet) (b) a medical task (visual acuity prediction) show that our method outperforms existing approaches according to the new metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11485",
        "abs_url": "https://arxiv.org/abs/2511.11485",
        "pdf_url": "https://arxiv.org/pdf/2511.11485",
        "title": "Data-efficient U-Net for Segmentation of Carbide Microstructures in SEM Images of Steel Alloys",
        "authors": [
            "Alinda Ezgi Gerçek",
            "Till Korten",
            "Paul Chekhonin",
            "Maleeha Hassan",
            "Peter Steinbach"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Understanding reactor-pressure-vessel steel microstructure is crucial for predicting mechanical properties, as carbide precipitates both strengthen the alloy and can initiate cracks. In scanning electron microscopy images, gray-value overlap between carbides and matrix makes simple thresholding ineffective. We present a data-efficient segmentation pipeline using a lightweight U-Net (30.7~M parameters) trained on just \\textbf{10 annotated scanning electron microscopy images}. Despite limited data, our model achieves a \\textbf{Dice-Sørensen coefficient of 0.98}, significantly outperforming the state-of-the-art in the field of metallurgy (classical image analysis: 0.85), while reducing annotation effort by one order of magnitude compared to the state-of-the-art data efficient segmentation model. This approach enables rapid, automated carbide quantification for alloy design and generalizes to other steel types, demonstrating the potential of data-efficient deep learning in reactor-pressure-vessel steel analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11490",
        "abs_url": "https://arxiv.org/abs/2511.11490",
        "pdf_url": "https://arxiv.org/pdf/2511.11490",
        "title": "Intrinsic Dimension Estimation for Radio Galaxy Zoo using Diffusion Models",
        "authors": [
            "Joan Font-Quer Roset",
            "Devina Mohan",
            "Anna Scaife"
        ],
        "comments": "9 pages, 5 figures, 2 tables, submitted to NeurIPS 2025 ML4PS Workshop",
        "subjects": "Machine Learning (cs.LG); Instrumentation and Methods for Astrophysics (astro-ph.IM); Artificial Intelligence (cs.AI)",
        "abstract": "In this work, we estimate the intrinsic dimension (iD) of the Radio Galaxy Zoo (RGZ) dataset using a score-based diffusion model. We examine how the iD estimates vary as a function of Bayesian neural network (BNN) energy scores, which measure how similar the radio sources are to the MiraBest subset of the RGZ dataset. We find that out-of-distribution sources exhibit higher iD values, and that the overall iD for RGZ exceeds those typically reported for natural image datasets. Furthermore, we analyse how iD varies across Fanaroff-Riley (FR) morphological classes and as a function of the signal-to-noise ratio (SNR). While no relationship is found between FR I and FR II classes, a weak trend toward higher SNR at lower iD. Future work using the RGZ dataset could make use of the relationship between iD and energy scores to quantitatively study and improve the representations learned by various self-supervised learning algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11500",
        "abs_url": "https://arxiv.org/abs/2511.11500",
        "pdf_url": "https://arxiv.org/pdf/2511.11500",
        "title": "Honesty over Accuracy: Trustworthy Language Models through Reinforced Hesitation",
        "authors": [
            "Mohamad Amin Mohamadi",
            "Tianhao Wang",
            "Zhiyuan Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Modern language models fail a fundamental requirement of trustworthy intelligence: knowing when not to answer. Despite achieving impressive accuracy on benchmarks, these models produce confident hallucinations, even when wrong answers carry catastrophic consequences. Our evaluations on GSM8K, MedQA and GPQA show frontier models almost never abstain despite explicit warnings of severe penalties, suggesting that prompts cannot override training that rewards any answer over no answer. As a remedy, we propose Reinforced Hesitation (RH): a modification to Reinforcement Learning from Verifiable Rewards (RLVR) to use ternary rewards (+1 correct, 0 abstention, -$\\lambda$ error) instead of binary. Controlled experiments on logic puzzles reveal that varying $\\lambda$ produces distinct models along a Pareto frontier, where each training penalty yields the optimal model for its corresponding risk regime: low penalties produce aggressive answerers, high penalties conservative abstainers. We then introduce two inference strategies that exploit trained abstention as a coordination signal: cascading routes queries through models with decreasing risk tolerance, while self-cascading re-queries the same model on abstention. Both outperform majority voting with lower computational cost. These results establish abstention as a first-class training objective that transforms ``I don't know'' from failure into a coordination signal, enabling models to earn trust through calibrated honesty about their limits.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11505",
        "abs_url": "https://arxiv.org/abs/2511.11505",
        "pdf_url": "https://arxiv.org/pdf/2511.11505",
        "title": "FarSkip-Collective: Unhobbling Blocking Communication in Mixture of Experts Models",
        "authors": [
            "Yonatan Dukler",
            "Guihong Li",
            "Deval Shah",
            "Vikram Appia",
            "Emad Barsoum"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Blocking communication presents a major hurdle in running MoEs efficiently in distributed settings. To address this, we present FarSkip-Collective which modifies the architecture of modern models to enable overlapping of their computation with communication. Our approach modifies the architecture to skip connections in the model and it is unclear a priori whether the modified model architecture can remain as capable, especially for large state-of-the-art models and while modifying all of the model layers. We answer this question in the affirmative and fully convert a series of state-of-the-art models varying from 16B to 109B parameters to enable overlapping of their communication while achieving accuracy on par with their original open-source releases. For example, we convert Llama 4 Scout (109B) via self-distillation and achieve average accuracy within 1% of its instruction tuned release averaged across a wide range of downstream evaluations. In addition to demonstrating retained accuracy of the large modified models, we realize the benefits of FarSkip-Collective through optimized implementations that explicitly overlap communication with computation, accelerating both training and inference in existing frameworks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11539",
        "abs_url": "https://arxiv.org/abs/2511.11539",
        "pdf_url": "https://arxiv.org/pdf/2511.11539",
        "title": "Generalizing Fair Clustering to Multiple Groups: Algorithms and Applications",
        "authors": [
            "Diptarka Chakraborty",
            "Kushagra Chatterjee",
            "Debarati Das",
            "Tien-Long Nguyen"
        ],
        "comments": "Accepted in AAAI 2026 for Oral Representation",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Clustering is a fundamental task in machine learning and data analysis, but it frequently fails to provide fair representation for various marginalized communities defined by multiple protected attributes -- a shortcoming often caused by biases in the training data. As a result, there is a growing need to enhance the fairness of clustering outcomes, ideally by making minimal modifications, possibly as a post-processing step after conventional clustering. Recently, Chakraborty et al. [COLT'25] initiated the study of \\emph{closest fair clustering}, though in a restricted scenario where data points belong to only two groups. In practice, however, data points are typically characterized by many groups, reflecting diverse protected attributes such as age, ethnicity, gender, etc. In this work, we generalize the study of the \\emph{closest fair clustering} problem to settings with an arbitrary number (more than two) of groups. We begin by showing that the problem is NP-hard even when all groups are of equal size -- a stark contrast with the two-group case, for which an exact algorithm exists. Next, we propose near-linear time approximation algorithms that efficiently handle arbitrary-sized multiple groups, thereby answering an open question posed by Chakraborty et al. [COLT'25]. Leveraging our closest fair clustering algorithms, we further achieve improved approximation guarantees for the \\emph{fair correlation clustering} problem, advancing the state-of-the-art results established by Ahmadian et al. [AISTATS'20] and Ahmadi et al. [2020]. Additionally, we are the first to provide approximation algorithms for the \\emph{fair consensus clustering} problem involving multiple (more than two) groups, thus addressing another open direction highlighted by Chakraborty et al. [COLT'25].",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11553",
        "abs_url": "https://arxiv.org/abs/2511.11553",
        "pdf_url": "https://arxiv.org/pdf/2511.11553",
        "title": "Multistability of Self-Attention Dynamics in Transformers",
        "authors": [
            "Claudio Altafini"
        ],
        "comments": "8 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Dynamical Systems (math.DS)",
        "abstract": "In machine learning, a self-attention dynamics is a continuous-time multiagent-like model of the attention mechanisms of transformers. In this paper we show that such dynamics is related to a multiagent version of the Oja flow, a dynamical system that computes the principal eigenvector of a matrix corresponding for transformers to the value matrix. We classify the equilibria of the ``single-head'' self-attention system into four classes: consensus, bipartite consensus, clustering and polygonal equilibria. Multiple asymptotically stable equilibria from the first three classes often coexist in the self-attention dynamics. Interestingly, equilibria from the first two classes are always aligned with the eigenvectors of the value matrix, often but not exclusively with the principal eigenvector.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11571",
        "abs_url": "https://arxiv.org/abs/2511.11571",
        "pdf_url": "https://arxiv.org/pdf/2511.11571",
        "title": "Optimizing Mixture of Block Attention",
        "authors": [
            "Guangxuan Xiao",
            "Junxian Guo",
            "Kasra Mazaheri",
            "Song Han"
        ],
        "comments": "The first two authors contributed equally to this work",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Mixture of Block Attention (MoBA) (Lu et al., 2025) is a promising building block for efficiently processing long contexts in LLMs by enabling queries to sparsely attend to a small subset of key-value blocks, drastically reducing computational cost. However, the design principles governing MoBA's performance are poorly understood, and it lacks an efficient GPU implementation, hindering its practical adoption. In this paper, we first develop a statistical model to analyze MoBA's underlying mechanics. Our model reveals that performance critically depends on the router's ability to accurately distinguish relevant from irrelevant blocks based on query-key affinities. We derive a signal-to-noise ratio that formally connects architectural parameters to this retrieval accuracy. Guided by our analysis, we identify two key pathways for improvement: using smaller block sizes and applying a short convolution on keys to cluster relevant signals, which enhances routing accuracy. While theoretically better, small block sizes are inefficient on GPUs. To bridge this gap, we introduce FlashMoBA, a hardware-aware CUDA kernel that enables efficient MoBA execution even with the small block sizes our theory recommends. We validate our insights by training LLMs from scratch, showing that our improved MoBA models match the performance of dense attention baselines. FlashMoBA achieves up to 14.7x speedup over FlashAttention-2 for small blocks, making our theoretically-grounded improvements practical. Code is available at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10657",
        "abs_url": "https://arxiv.org/abs/2511.10657",
        "pdf_url": "https://arxiv.org/pdf/2511.10657",
        "title": "Patent Representation Learning via Self-supervision",
        "authors": [
            "You Zuo",
            "Kim Gerdes",
            "Eric Villemonte de La Clergerie",
            "Benoît Sagot"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "This paper presents a simple yet effective contrastive learning framework for learning patent embeddings by leveraging multiple views from within the same document. We first identify a patent-specific failure mode of SimCSE style dropout augmentation: it produces overly uniform embeddings that lose semantic cohesion. To remedy this, we propose section-based augmentation, where different sections of a patent (e.g., abstract, claims, background) serve as complementary views. This design introduces natural semantic and structural diversity, mitigating over-dispersion and yielding embeddings that better preserve both global structure and local continuity. On large-scale benchmarks, our fully self-supervised method matches or surpasses citation-and IPC-supervised baselines in prior-art retrieval and classification, while avoiding reliance on brittle or incomplete annotations. Our analysis further shows that different sections specialize for different tasks-claims and summaries benefit retrieval, while background sections aid classification-highlighting the value of patents' inherent discourse structure for representation learning. These results highlight the value of exploiting intra-document views for scalable and generalizable patent understanding.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10661",
        "abs_url": "https://arxiv.org/abs/2511.10661",
        "pdf_url": "https://arxiv.org/pdf/2511.10661",
        "title": "Bayesian Evaluation of Large Language Model Behavior",
        "authors": [
            "Rachel Longjohn",
            "Shang Wu",
            "Saatvik Kher",
            "Catarina Belém",
            "Padhraic Smyth"
        ],
        "comments": "Accepted to NeurIPS 2025 Workshop on Evaluating the Evolving LLM Lifecycle: Benchmarks, Emergent Abilities, and Scaling",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG); Applications (stat.AP); Machine Learning (stat.ML)",
        "abstract": "It is increasingly important to evaluate how text generation systems based on large language models (LLMs) behave, such as their tendency to produce harmful output or their sensitivity to adversarial inputs. Such evaluations often rely on a curated benchmark set of input prompts provided to the LLM, where the output for each prompt may be assessed in a binary fashion (e.g., harmful/non-harmful or does not leak/leaks sensitive information), and the aggregation of binary scores is used to evaluate the LLM. However, existing approaches to evaluation often neglect statistical uncertainty quantification. With an applied statistics audience in mind, we provide background on LLM text generation and evaluation, and then describe a Bayesian approach for quantifying uncertainty in binary evaluation metrics. We focus in particular on uncertainty that is induced by the probabilistic text generation strategies typically deployed in LLM-based systems. We present two case studies applying this approach: 1) evaluating refusal rates on a benchmark of adversarial inputs designed to elicit harmful responses, and 2) evaluating pairwise preferences of one LLM over another on a benchmark of open-ended interactive dialogue examples. We demonstrate how the Bayesian approach can provide useful uncertainty quantification about the behavior of LLM-based systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10667",
        "abs_url": "https://arxiv.org/abs/2511.10667",
        "pdf_url": "https://arxiv.org/pdf/2511.10667",
        "title": "Evaluating LLM Understanding via Structured Tabular Decision Simulations",
        "authors": [
            "Sichao Li",
            "Xinyue Xu",
            "Xiaomeng Li"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) often achieve impressive predictive accuracy, yet correctness alone does not imply genuine understanding. True LLM understanding, analogous to human expertise, requires making consistent, well-founded decisions across multiple instances and diverse domains, relying on relevant and domain-grounded decision factors. We introduce Structured Tabular Decision Simulations (STaDS), a suite of expert-like decision settings that evaluate LLMs as if they were professionals undertaking structured decision ``exams''. In this context, understanding is defined as the ability to identify and rely on the correct decision factors, features that determine outcomes within a domain. STaDS jointly assesses understanding through: (i) question and instruction comprehension, (ii) knowledge-based prediction, and (iii) reliance on relevant decision factors. By analyzing 9 frontier LLMs across 15 diverse decision settings, we find that (a) most models struggle to achieve consistently strong accuracy across diverse domains; (b) models can be accurate yet globally unfaithful, and there are frequent mismatches between stated rationales and factors driving predictions. Our findings highlight the need for global-level understanding evaluation protocols and advocate for novel frameworks that go beyond accuracy to enhance LLMs' understanding ability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10669",
        "abs_url": "https://arxiv.org/abs/2511.10669",
        "pdf_url": "https://arxiv.org/pdf/2511.10669",
        "title": "Forecasting Spoken Language Development in Children with Cochlear Implants Using Preimplantation MRI",
        "authors": [
            "Yanlin Wang",
            "Di Yuan",
            "Shani Dettman",
            "Dawn Choo",
            "Emily Shimeng Xu",
            "Denise Thomas",
            "Maura E Ryan",
            "Patrick C M Wong",
            "Nancy M Young"
        ],
        "comments": "38 pages",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Cochlear implants (CI) significantly improve spoken language in children with severe-to-profound sensorineural hearing loss (SNHL), yet outcomes remain more variable than in children with normal hearing. This variability cannot be reliably predicted for individual children using age at implantation or residual hearing. This study aims to compare the accuracy of traditional machine learning (ML) to deep transfer learning (DTL) algorithms to predict post-CI spoken language development of children with bilateral SNHL using a binary classification model of high versus low language improvers. A total of 278 implanted children enrolled from three centers. The accuracy, sensitivity and specificity of prediction models based upon brain neuroanatomic features using traditional ML and DTL learning. DTL prediction models using bilinear attention-based fusion strategy achieved: accuracy of 92.39% (95% CI, 90.70%-94.07%), sensitivity of 91.22% (95% CI, 89.98%-92.47%), specificity of 93.56% (95% CI, 90.91%-96.21%), and area under the curve (AUC) of 0.977 (95% CI, 0.969-0.986). DTL outperformed traditional ML models in all outcome measures. DTL was significantly improved by direct capture of discriminative and task-specific information that are advantages of representation learning enabled by this approach over ML. The results support the feasibility of a single DTL prediction model for language prediction of children served by CI programs worldwide.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10721",
        "abs_url": "https://arxiv.org/abs/2511.10721",
        "pdf_url": "https://arxiv.org/pdf/2511.10721",
        "title": "Fast Data Attribution for Text-to-Image Models",
        "authors": [
            "Sheng-Yu Wang",
            "Aaron Hertzmann",
            "Alexei A Efros",
            "Richard Zhang",
            "Jun-Yan Zhu"
        ],
        "comments": "NeurIPS 2025 camera ready. Project page: this https URL",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Data attribution for text-to-image models aims to identify the training images that most significantly influenced a generated output. Existing attribution methods involve considerable computational resources for each query, making them impractical for real-world applications. We propose a novel approach for scalable and efficient data attribution. Our key idea is to distill a slow, unlearning-based attribution method to a feature embedding space for efficient retrieval of highly influential training images. During deployment, combined with efficient indexing and search methods, our method successfully finds highly influential images without running expensive attribution algorithms. We show extensive results on both medium-scale models trained on MSCOCO and large-scale Stable Diffusion models trained on LAION, demonstrating that our method can achieve better or competitive performance in a few seconds, faster than existing methods by 2,500x - 400,000x. Our work represents a meaningful step towards the large-scale application of data attribution methods on real-world models such as Stable Diffusion.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10824",
        "abs_url": "https://arxiv.org/abs/2511.10824",
        "pdf_url": "https://arxiv.org/pdf/2511.10824",
        "title": "Neural Local Wasserstein Regression",
        "authors": [
            "Inga Girshfeld",
            "Xiaohui Chen"
        ],
        "comments": "Accepted to TAG-DS 2025. 11 pages, 3 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We study the estimation problem of distribution-on-distribution regression, where both predictors and responses are probability measures. Existing approaches typically rely on a global optimal transport map or tangent-space linearization, which can be restrictive in approximation capacity and distort geometry in multivariate underlying domains. In this paper, we propose the \\emph{Neural Local Wasserstein Regression}, a flexible nonparametric framework that models regression through locally defined transport maps in Wasserstein space. Our method builds on the analogy with classical kernel regression: kernel weights based on the 2-Wasserstein distance localize estimators around reference measures, while neural networks parameterize transport operators that adapt flexibly to complex data geometries. This localized perspective broadens the class of admissible transformations and avoids the limitations of global map assumptions and linearization structures. We develop a practical training procedure using DeepSets-style architectures and Sinkhorn-approximated losses, combined with a greedy reference selection strategy for scalability. Through synthetic experiments on Gaussian and mixture models, as well as distributional prediction tasks on MNIST, we demonstrate that our approach effectively captures nonlinear and high-dimensional distributional relationships that elude existing methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10850",
        "abs_url": "https://arxiv.org/abs/2511.10850",
        "pdf_url": "https://arxiv.org/pdf/2511.10850",
        "title": "Leveraging Parameter Space Symmetries for Reasoning Skill Transfer in LLMs",
        "authors": [
            "Stefan Horoi",
            "Sangwoo Cho",
            "Supriyo Chakraborty",
            "Shi-Xiong Zhang",
            "Sambit Sahu",
            "Guy Wolf",
            "Genta Indra Winata"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Task arithmetic is a powerful technique for transferring skills between Large Language Models (LLMs), but it often suffers from negative interference when models have diverged during training. We address this limitation by first aligning the models' parameter spaces, leveraging the inherent permutation, rotation, and scaling symmetries of Transformer architectures. We adapt parameter space alignment for modern Grouped-Query Attention (GQA) and SwiGLU layers, exploring both weight-based and activation-based approaches. Using this alignment-first strategy, we successfully transfer advanced reasoning skills to a non-reasoning model. Experiments on challenging reasoning benchmarks show that our method consistently outperforms standard task arithmetic. This work provides an effective approach for merging and transferring specialized skills across evolving LLM families, reducing redundant fine-tuning and enhancing model adaptability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10876",
        "abs_url": "https://arxiv.org/abs/2511.10876",
        "pdf_url": "https://arxiv.org/pdf/2511.10876",
        "title": "Architecting software monitors for control-flow anomaly detection through large language models and conformance checking",
        "authors": [
            "Francesco Vitale",
            "Francesco Flammini",
            "Mauro Caporuscio",
            "Nicola Mazzocca"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Context: Ensuring high levels of dependability in modern computer-based systems has become increasingly challenging due to their complexity. Although systems are validated at design time, their behavior can be different at run-time, possibly showing control-flow anomalies due to \"unknown unknowns\". Objective: We aim to detect control-flow anomalies through software monitoring, which verifies run-time behavior by logging software execution and detecting deviations from expected control flow. Methods: We propose a methodology to develop software monitors for control-flow anomaly detection through Large Language Models (LLMs) and conformance checking. The methodology builds on existing software development practices to maintain traditional V&V while providing an additional level of robustness and trustworthiness. It leverages LLMs to link design-time models and implementation code, automating source-code instrumentation. The resulting event logs are analyzed via conformance checking, an explainable and effective technique for control-flow anomaly detection. Results: We test the methodology on a case-study scenario from the European Railway Traffic Management System / European Train Control System (ERTMS/ETCS), which is a railway standard for modern interoperable railways. The results obtained from the ERTMS/ETCS case study demonstrate that LLM-based source-code instrumentation can achieve up to 84.775% control-flow coverage of the reference design-time process model, while the subsequent conformance checking-based anomaly detection reaches a peak performance of 96.610% F1-score and 93.515% AUC. Conclusion: Incorporating domain-specific knowledge to guide LLMs in source-code instrumentation significantly allowed obtaining reliable and quality software logs and enabled effective control-flow anomaly detection through conformance checking.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10879",
        "abs_url": "https://arxiv.org/abs/2511.10879",
        "pdf_url": "https://arxiv.org/pdf/2511.10879",
        "title": "ICX360: In-Context eXplainability 360 Toolkit",
        "authors": [
            "Dennis Wei",
            "Ronny Luss",
            "Xiaomeng Hu",
            "Lucas Monteiro Paes",
            "Pin-Yu Chen",
            "Karthikeyan Natesan Ramamurthy",
            "Erik Miehling",
            "Inge Vejsbjerg",
            "Hendrik Strobelt"
        ],
        "comments": "14 pages, 4 figures",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) have become ubiquitous in everyday life and are entering higher-stakes applications ranging from summarizing meeting transcripts to answering doctors' questions. As was the case with earlier predictive models, it is crucial that we develop tools for explaining the output of LLMs, be it a summary, list, response to a question, etc. With these needs in mind, we introduce In-Context Explainability 360 (ICX360), an open-source Python toolkit for explaining LLMs with a focus on the user-provided context (or prompts in general) that are fed to the LLMs. ICX360 contains implementations for three recent tools that explain LLMs using both black-box and white-box methods (via perturbations and gradients respectively). The toolkit, available at this https URL, contains quick-start guidance materials as well as detailed tutorials covering use cases such as retrieval augmented generation, natural language generation, and jailbreaking.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10909",
        "abs_url": "https://arxiv.org/abs/2511.10909",
        "pdf_url": "https://arxiv.org/pdf/2511.10909",
        "title": "MMA-Sim: Bit-Accurate Reference Model of Tensor Cores and Matrix Cores",
        "authors": [
            "Peichen Xie",
            "Yang Wang",
            "Fan Yang",
            "Mao Yang"
        ],
        "comments": "",
        "subjects": "Hardware Architecture (cs.AR); Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "The rapidly growing computation demands of deep neural networks (DNNs) have driven hardware vendors to integrate matrix multiplication accelerators (MMAs), such as NVIDIA Tensor Cores and AMD Matrix Cores, into modern GPUs. However, due to distinct and undocumented arithmetic specifications for floating-point matrix multiplication, some MMAs can lead to numerical imprecision and inconsistency that can compromise the stability and reproducibility of DNN training and inference. This paper presents MMA-Sim, the first bit-accurate reference model that reveals the detailed arithmetic behaviors of the MMAs from ten GPU architectures (eight from NVIDIA and two from AMD). By dissecting the MMAs using a combination of targeted and randomized tests, our methodology derives nine arithmetic algorithms to simulate the floating-point matrix multiplication of the MMAs. Large-scale validation confirms bitwise equivalence between MMA-Sim and the real hardware. Using MMA-Sim, we investigate arithmetic behaviors that affect DNN training stability, and identify undocumented behaviors that could lead to significant errors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10919",
        "abs_url": "https://arxiv.org/abs/2511.10919",
        "pdf_url": "https://arxiv.org/pdf/2511.10919",
        "title": "Heterogeneous Multisource Transfer Learning via Model Averaging for Positive-Unlabeled Data",
        "authors": [
            "Jialei Liu",
            "Jun Liao",
            "Kuangnan Fang"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Positive-Unlabeled (PU) learning presents unique challenges due to the lack of explicitly labeled negative samples, particularly in high-stakes domains such as fraud detection and medical diagnosis. To address data scarcity and privacy constraints, we propose a novel transfer learning with model averaging framework that integrates information from heterogeneous data sources - including fully binary labeled, semi-supervised, and PU data sets - without direct data sharing. For each source domain type, a tailored logistic regression model is conducted, and knowledge is transferred to the PU target domain through model averaging. Optimal weights for combining source models are determined via a cross-validation criterion that minimizes the Kullback-Leibler divergence. We establish theoretical guarantees for weight optimality and convergence, covering both misspecified and correctly specified target models, with further extensions to high-dimensional settings using sparsity-penalized estimators. Extensive simulations and real-world credit risk data analyses demonstrate that our method outperforms other comparative methods in terms of predictive accuracy and robustness, especially under limited labeled data and heterogeneous environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10930",
        "abs_url": "https://arxiv.org/abs/2511.10930",
        "pdf_url": "https://arxiv.org/pdf/2511.10930",
        "title": "CardioEmbed: Domain-Specialized Text Embeddings for Clinical Cardiology",
        "authors": [
            "Richard J. Young",
            "Alice M. Matthews"
        ],
        "comments": "14 pages, 6 figures",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Biomedical text embeddings have primarily been developed using research literature from PubMed, yet clinical cardiology practice relies heavily on procedural knowledge and specialized terminology found in comprehensive textbooks rather than research abstracts. This research practice gap limits the effectiveness of existing embedding models for clinical applications incardiology. This study trained CardioEmbed, a domain-specialized embedding model based on Qwen3-Embedding-8B, using contrastive learning on a curated corpus of seven comprehensive cardiology textbooks totaling approximately 150,000 sentences after deduplication. The model employs InfoNCE loss with in-batch negatives and achieves 99.60% retrieval accuracy on cardiac-specific semantic retrieval tasks, a +15.94 percentage point improvement over MedTE, the current state-of-the-art medical embedding model. On MTEB medical benchmarks, the model obtained BIOSSES 0.77 Spearman and SciFact 0.61 NDCG@10, indicating competitive performance on related biomedical domains. Domain-specialized training on comprehensive clinical textbooks yields near-perfect cardiology retrieval (99.60% Acc@1), improving over MedTE by +15.94 percentage points.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.10935",
        "abs_url": "https://arxiv.org/abs/2511.10935",
        "pdf_url": "https://arxiv.org/pdf/2511.10935",
        "title": "CAT-Net: A Cross-Attention Tone Network for Cross-Subject EEG-EMG Fusion Tone Decoding",
        "authors": [
            "Yifan Zhuang",
            "Calvin Huang",
            "Zepeng Yu",
            "Yongjie Zou",
            "Jiawei Ju"
        ],
        "comments": "This is the extended version with technical appendices. The version of record appears in AAAI-26. Please cite the AAAI version",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG); Neurons and Cognition (q-bio.NC)",
        "abstract": "Brain-computer interface (BCI) speech decoding has emerged as a promising tool for assisting individuals with speech impairments. In this context, the integration of electroencephalography (EEG) and electromyography (EMG) signals offers strong potential for enhancing decoding performance. Mandarin tone classification presents particular challenges, as tonal variations convey distinct meanings even when phonemes remain identical. In this study, we propose a novel cross-subject multimodal BCI decoding framework that fuses EEG and EMG signals to classify four Mandarin tones under both audible and silent speech conditions. Inspired by the cooperative mechanisms of neural and muscular systems in speech production, our neural decoding architecture combines spatial-temporal feature extraction branches with a cross-attention fusion mechanism, enabling informative interaction between modalities. We further incorporate domain-adversarial training to improve cross-subject generalization. We collected 4,800 EEG trials and 4,800 EMG trials from 10 participants using only twenty EEG and five EMG channels, demonstrating the feasibility of minimal-channel decoding. Despite employing lightweight modules, our model outperforms state-of-the-art baselines across all conditions, achieving average classification accuracies of 87.83% for audible speech and 88.08% for silent speech. In cross-subject evaluations, it still maintains strong performance with accuracies of 83.27% and 85.10% for audible and silent speech, respectively. We further conduct ablation studies to validate the effectiveness of each component. Our findings suggest that tone-level decoding with minimal EEG-EMG channels is feasible and potentially generalizable across subjects, contributing to the development of practical BCI applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11007",
        "abs_url": "https://arxiv.org/abs/2511.11007",
        "pdf_url": "https://arxiv.org/pdf/2511.11007",
        "title": "VisMem: Latent Vision Memory Unlocks Potential of Vision-Language Models",
        "authors": [
            "Xinlei Yu",
            "Chengming Xu",
            "Guibin Zhang",
            "Zhangquan Chen",
            "Yudong Zhang",
            "Yongbo He",
            "Peng-Tao Jiang",
            "Jiangning Zhang",
            "Xiaobin Hu",
            "Shuicheng Yan"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Despite the remarkable success of Vision-Language Models (VLMs), their performance on a range of complex visual tasks is often hindered by a \"visual processing bottleneck\": a propensity to lose grounding in visual evidence and exhibit a deficit in contextualized visual experience during prolonged generation. Drawing inspiration from human cognitive memory theory, which distinguishes short-term visually-dominant memory and long-term semantically-dominant memory, we propose VisMem, a cognitively-aligned framework that equips VLMs with dynamic latent vision memories, a short-term module for fine-grained perceptual retention and a long-term module for abstract semantic consolidation. These memories are seamlessly invoked during inference, allowing VLMs to maintain both perceptual fidelity and semantic consistency across thinking and generation. Extensive experiments across diverse visual benchmarks for understanding, reasoning, and generation reveal that VisMem delivers a significant average performance boost of 11.8% relative to the vanilla model and outperforms all counterparts, establishing a new paradigm for latent-space memory enhancement. The code will be available: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11018",
        "abs_url": "https://arxiv.org/abs/2511.11018",
        "pdf_url": "https://arxiv.org/pdf/2511.11018",
        "title": "Automata-Based Steering of Large Language Models for Diverse Structured Generation",
        "authors": [
            "Xiaokun Luan",
            "Zeming Wei",
            "Yihao Zhang",
            "Meng Sun"
        ],
        "comments": "ICFEM 2025 (Best Paper Award)",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Cryptography and Security (cs.CR); Machine Learning (cs.LG); Software Engineering (cs.SE)",
        "abstract": "Large language models (LLMs) are increasingly tasked with generating structured outputs. While structured generation methods ensure validity, they often lack output diversity, a critical limitation that we confirm in our preliminary study. We propose a novel method to enhance diversity in automaton-based structured generation. Our approach utilizes automata traversal history to steer LLMs towards novel structural patterns. Evaluations show our method significantly improves structural and content diversity while maintaining comparable generation efficiency. Furthermore, we conduct a case study showcasing the effectiveness of our method in generating diverse test cases for testing open-source libraries.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11048",
        "abs_url": "https://arxiv.org/abs/2511.11048",
        "pdf_url": "https://arxiv.org/pdf/2511.11048",
        "title": "PINGS-X: Physics-Informed Normalized Gaussian Splatting with Axes Alignment for Efficient Super-Resolution of 4D Flow MRI",
        "authors": [
            "Sun Jo",
            "Seok Young Hong",
            "JinHyun Kim",
            "Seungmin Kang",
            "Ahjin Choi",
            "Don-Gwan An",
            "Simon Song",
            "Je Hyeong Hong"
        ],
        "comments": "Accepted at AAAI 2026. Supplementary material included after references. 27 pages, 21 figures, 11 tables",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "4D flow magnetic resonance imaging (MRI) is a reliable, non-invasive approach for estimating blood flow velocities, vital for cardiovascular diagnostics. Unlike conventional MRI focused on anatomical structures, 4D flow MRI requires high spatiotemporal resolution for early detection of critical conditions such as stenosis or aneurysms. However, achieving such resolution typically results in prolonged scan times, creating a trade-off between acquisition speed and prediction accuracy. Recent studies have leveraged physics-informed neural networks (PINNs) for super-resolution of MRI data, but their practical applicability is limited as the prohibitively slow training process must be performed for each patient. To overcome this limitation, we propose PINGS-X, a novel framework modeling high-resolution flow velocities using axes-aligned spatiotemporal Gaussian representations. Inspired by the effectiveness of 3D Gaussian splatting (3DGS) in novel view synthesis, PINGS-X extends this concept through several non-trivial novel innovations: (i) normalized Gaussian splatting with a formal convergence guarantee, (ii) axes-aligned Gaussians that simplify training for high-dimensional data while preserving accuracy and the convergence guarantee, and (iii) a Gaussian merging procedure to prevent degenerate solutions and boost computational efficiency. Experimental results on computational fluid dynamics (CFD) and real 4D flow MRI datasets demonstrate that PINGS-X substantially reduces training time while achieving superior super-resolution accuracy. Our code and datasets are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11137",
        "abs_url": "https://arxiv.org/abs/2511.11137",
        "pdf_url": "https://arxiv.org/pdf/2511.11137",
        "title": "One-Shot Transfer Learning for Nonlinear PDEs with Perturbative PINNs",
        "authors": [
            "Samuel Auroy",
            "Pavlos Protopapas"
        ],
        "comments": "Accepted at Machine Learning and the Physical Sciences Workshop, NeurIPS 2025",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "We propose a framework for solving nonlinear partial differential equations (PDEs) by combining perturbation theory with one-shot transfer learning in Physics-Informed Neural Networks (PINNs). Nonlinear PDEs with polynomial terms are decomposed into a sequence of linear subproblems, which are efficiently solved using a Multi-Head PINN. Once the latent representation of the linear operator is learned, solutions to new PDE instances with varying perturbations, forcing terms, or boundary/initial conditions can be obtained in closed form without retraining. We validate the method on KPP-Fisher and wave equations, achieving errors on the order of 1e-3 while adapting to new problem instances in under 0.2 seconds; comparable accuracy to classical solvers but with faster transfer. Sensitivity analyses show predictable error growth with epsilon and polynomial degree, clarifying the method's effective regime. Our contributions are: (i) extending one-shot transfer learning from nonlinear ODEs to PDEs, (ii) deriving a closed-form solution for adapting to new PDE instances, and (iii) demonstrating accuracy and efficiency on canonical nonlinear PDEs. We conclude by outlining extensions to derivative-dependent nonlinearities and higher-dimensional PDEs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11141",
        "abs_url": "https://arxiv.org/abs/2511.11141",
        "pdf_url": "https://arxiv.org/pdf/2511.11141",
        "title": "PRSM: A Measure to Evaluate CLIP's Robustness Against Paraphrases",
        "authors": [
            "Udo Schlegel",
            "Franziska Weeber",
            "Jian Lan",
            "Thomas Seidl"
        ],
        "comments": "8 pages, accpeted as short paper at MMM 2026",
        "subjects": "Computation and Language (cs.CL); Computers and Society (cs.CY); Machine Learning (cs.LG)",
        "abstract": "Contrastive Language-Image Pre-training (CLIP) is a widely used multimodal model that aligns text and image representations through large-scale training. While it performs strongly on zero-shot and few-shot tasks, its robustness to linguistic variation, particularly paraphrasing, remains underexplored. Paraphrase robustness is essential for reliable deployment, especially in socially sensitive contexts where inconsistent representations can amplify demographic biases. In this paper, we introduce the Paraphrase Ranking Stability Metric (PRSM), a novel measure for quantifying CLIP's sensitivity to paraphrased queries. Using the Social Counterfactuals dataset, a benchmark designed to reveal social and demographic biases, we empirically assess CLIP's stability under paraphrastic variation, examine the interaction between paraphrase robustness and gender, and discuss implications for fairness and equitable deployment of multimodal systems. Our analysis reveals that robustness varies across paraphrasing strategies, with subtle yet consistent differences observed between male- and female-associated queries.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11161",
        "abs_url": "https://arxiv.org/abs/2511.11161",
        "pdf_url": "https://arxiv.org/pdf/2511.11161",
        "title": "Drift Estimation for Diffusion Processes Using Neural Networks Based on Discretely Observed Independent Paths",
        "authors": [
            "Yuzhen Zhao",
            "Yating Liu",
            "Marc Hoffmann"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "This paper addresses the nonparametric estimation of the drift function over a compact domain for a time-homogeneous diffusion process, based on high-frequency discrete observations from $N$ independent trajectories. We propose a neural network-based estimator and derive a non-asymptotic convergence rate, decomposed into a training error, an approximation error, and a diffusion-related term scaling as ${\\log N}/{N}$. For compositional drift functions, we establish an explicit rate. In the numerical experiments, we consider a drift function with local fluctuations generated by a double-layer compositional structure featuring local oscillations, and show that the empirical convergence rate becomes independent of the input dimension $d$. Compared to the $B$-spline method, the neural network estimator achieves better convergence rates and more effectively captures local features, particularly in higher-dimensional settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11206",
        "abs_url": "https://arxiv.org/abs/2511.11206",
        "pdf_url": "https://arxiv.org/pdf/2511.11206",
        "title": "Questioning the Stability of Visual Question Answering",
        "authors": [
            "Amir Rosenfeld",
            "Neta Glazer",
            "Ethan Fetaya"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Visual Language Models (VLMs) have achieved remarkable progress, yet their reliability under small, meaning-preserving input changes remains poorly understood. We present the first large-scale, systematic study of VLM robustness to benign visual and textual perturbations: pixel-level shifts, light geometric transformations, padded rescaling, paraphrasing, and multilingual rewrites that do not alter the underlying semantics of an image-question pair. Across a broad set of models and datasets, we find that modern VLMs are highly sensitive to such minor perturbations: a substantial fraction of samples change their predicted answer under at least one visual or textual modification. We characterize how this instability varies across perturbation types, question categories, and models, revealing that even state-of-the-art systems (e.g., GPT-4o, Gemini 2.0 Flash) frequently fail under shifts as small as a few pixels or harmless rephrasings. We further show that sample-level stability serves as a strong indicator of correctness: stable samples are consistently far more likely to be answered correctly. Leveraging this, we demonstrate that the stability patterns of small, accessible open-source models can be used to predict the correctness of much larger closed-source models with high precision. Our findings expose a fundamental fragility in current VLMs and highlight the need for robustness evaluations that go beyond adversarial perturbations, focusing instead on invariances that models should reliably uphold.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11294",
        "abs_url": "https://arxiv.org/abs/2511.11294",
        "pdf_url": "https://arxiv.org/pdf/2511.11294",
        "title": "Decomposing Direct and Indirect Biases in Linear Models under Demographic Parity Constraint",
        "authors": [
            "Bertille Tierny",
            "Arthur Charpentier",
            "François Hu"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Linear models are widely used in high-stakes decision-making due to their simplicity and interpretability. Yet when fairness constraints such as demographic parity are introduced, their effects on model coefficients, and thus on how predictive bias is distributed across features, remain opaque. Existing approaches on linear models often rely on strong and unrealistic assumptions, or overlook the explicit role of the sensitive attribute, limiting their practical utility for fairness assessment. We extend the work of (Chzhen and Schreuder, 2022) and (Fukuchi and Sakuma, 2023) by proposing a post-processing framework that can be applied on top of any linear model to decompose the resulting bias into direct (sensitive-attribute) and indirect (correlated-features) components. Our method analytically characterizes how demographic parity reshapes each model coefficient, including those of both sensitive and non-sensitive features. This enables a transparent, feature-level interpretation of fairness interventions and reveals how bias may persist or shift through correlated variables. Our framework requires no retraining and provides actionable insights for model auditing and mitigation. Experiments on both synthetic and real-world datasets demonstrate that our method captures fairness dynamics missed by prior work, offering a practical and interpretable tool for responsible deployment of linear models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11311",
        "abs_url": "https://arxiv.org/abs/2511.11311",
        "pdf_url": "https://arxiv.org/pdf/2511.11311",
        "title": "Large-scale modality-invariant foundation models for brain MRI analysis: Application to lesion segmentation",
        "authors": [
            "Petros Koutsouvelis",
            "Matej Gazda",
            "Leroy Volmer",
            "Sina Amirrajab",
            "Kamil Barbierik",
            "Branislav Setlak",
            "Jakub Gazda",
            "Peter Drotar"
        ],
        "comments": "Submitted to IEEE ISBI 2026",
        "subjects": "Image and Video Processing (eess.IV); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "The field of computer vision is undergoing a paradigm shift toward large-scale foundation model pre-training via self-supervised learning (SSL). Leveraging large volumes of unlabeled brain MRI data, such models can learn anatomical priors that improve few-shot performance in diverse neuroimaging tasks. However, most SSL frameworks are tailored to natural images, and their adaptation to capture multi-modal MRI information remains underexplored. This work proposes a modality-invariant representation learning setup and evaluates its effectiveness in stroke and epilepsy lesion segmentation, following large-scale pre-training. Experimental results suggest that despite successful cross-modality alignment, lesion segmentation primarily benefits from preserving fine-grained modality-specific features. Model checkpoints and code are made publicly available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11320",
        "abs_url": "https://arxiv.org/abs/2511.11320",
        "pdf_url": "https://arxiv.org/pdf/2511.11320",
        "title": "StochEP: Stochastic Equilibrium Propagation for Spiking Convergent Recurrent Neural Networks",
        "authors": [
            "Jiaqi Lin",
            "Yi Jiang",
            "Abhronil Sengupta"
        ],
        "comments": "",
        "subjects": "Emerging Technologies (cs.ET); Machine Learning (cs.LG)",
        "abstract": "Spiking Neural Networks (SNNs) promise energy-efficient, sparse, biologically inspired computation. Training them with Backpropagation Through Time (BPTT) and surrogate gradients achieves strong performance but remains biologically implausible. Equilibrium Propagation (EP) provides a more local and biologically grounded alternative. However, existing EP frameworks, primarily based on deterministic neurons, either require complex mechanisms to handle discontinuities in spiking dynamics or fail to scale beyond simple visual tasks. Inspired by the stochastic nature of biological spiking mechanism and recent hardware trends, we propose a stochastic EP framework that integrates probabilistic spiking neurons into the EP paradigm. This formulation smoothens the optimization landscape, stabilizes training, and enables scalable learning in deep convolutional spiking convergent recurrent neural networks (CRNNs). We provide theoretical guarantees showing that the proposed stochastic EP dynamics approximate deterministic EP under mean-field theory, thereby inheriting its underlying theoretical guarantees. The proposed framework narrows the gap to both BPTT-trained SNNs and EP-trained non-spiking CRNNs in vision benchmarks while preserving locality, highlighting stochastic EP as a promising direction for neuromorphic and on-chip learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11381",
        "abs_url": "https://arxiv.org/abs/2511.11381",
        "pdf_url": "https://arxiv.org/pdf/2511.11381",
        "title": "SoK: Security Evaluation of Wi-Fi CSI Biometrics: Attacks, Metrics, and Systemic Weaknesses",
        "authors": [
            "Gioliano de Oliveira Braga",
            "Pedro Henrique dos Santos Rocha",
            "Rafael Pimenta de Mattos Paixão",
            "Giovani Hoff da Costa",
            "Gustavo Cavalcanti Morais",
            "Lourenço Alves Pereira Júnior"
        ],
        "comments": "An improved version will be submitted to Euro S&P 2026, and this paper will be updated in the near future",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "Wi-Fi Channel State Information (CSI) has been repeatedly proposed as a biometric modality, often with reports of high accuracy and operational feasibility. However, the field lacks a consolidated understanding of its security properties, adversarial resilience, and methodological consistency. This Systematization of Knowledge (SoK) examines CSI-based biometric authentication through a security perspective, analyzing how existing work differs across sensing infrastructure, signal representations, feature pipelines, learning models, and evaluation methodologies. Our synthesis reveals systemic inconsistencies: reliance on aggregate accuracy metrics, limited reporting of FAR/FRR/EER, absence of per-user risk analysis, and scarce consideration of threat models or adversarial feasibility. We construct a unified evaluation framework to empirically expose these issues and demonstrate how security-relevant metrics, such as per-class EER, FCS, and the Gini Coefficient, uncover risk concentration that remains hidden under traditional reporting practices. Our analysis highlights concrete attack surfaces and shows how methodological choices materially influence vulnerability profiles, which include replay, geometric mimicry, and environmental perturbation. Based on these findings, we articulate the security boundaries of current CSI biometrics and provide guidelines for rigorous evaluation, reproducible experimentation, and future research directions. This SoK offers the security community a structured, evidence-driven reassessment of Wi-Fi CSI biometrics and their suitability as an authentication primitive.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11450",
        "abs_url": "https://arxiv.org/abs/2511.11450",
        "pdf_url": "https://arxiv.org/pdf/2511.11450",
        "title": "VoxTell: Free-Text Promptable Universal 3D Medical Image Segmentation",
        "authors": [
            "Maximilian Rokuss",
            "Moritz Langenberg",
            "Yannick Kirchhoff",
            "Fabian Isensee",
            "Benjamin Hamm",
            "Constantin Ulrich",
            "Sebastian Regnery",
            "Lukas Bauer",
            "Efthimios Katsigiannopulos",
            "Tobias Norajitra",
            "Klaus Maier-Hein"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "We introduce VoxTell, a vision-language model for text-prompted volumetric medical image segmentation. It maps free-form descriptions, from single words to full clinical sentences, to 3D masks. Trained on 62K+ CT, MRI, and PET volumes spanning over 1K anatomical and pathological classes, VoxTell uses multi-stage vision-language fusion across decoder layers to align textual and visual features at multiple scales. It achieves state-of-the-art zero-shot performance across modalities on unseen datasets, excelling on familiar concepts while generalizing to related unseen classes. Extensive experiments further demonstrate strong cross-modality transfer, robustness to linguistic variations and clinical language, as well as accurate instance-specific segmentation from real-world text. Code is available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11464",
        "abs_url": "https://arxiv.org/abs/2511.11464",
        "pdf_url": "https://arxiv.org/pdf/2511.11464",
        "title": "Adaptive Intrusion Detection for Evolving RPL IoT Attacks Using Incremental Learning",
        "authors": [
            "Sumeyye Bas",
            "Kiymet Kaya",
            "Elif Ak",
            "Sule Gunduz Oguducu"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "The routing protocol for low-power and lossy networks (RPL) has become the de facto routing standard for resource-constrained IoT systems, but its lightweight design exposes critical vulnerabilities to a wide range of routing-layer attacks such as hello flood, decreased rank, and version number manipulation. Traditional countermeasures, including protocol-level modifications and machine learning classifiers, can achieve high accuracy against known threats, yet they fail when confronted with novel or zero-day attacks unless fully retrained, an approach that is impractical for dynamic IoT environments. In this paper, we investigate incremental learning as a practical and adaptive strategy for intrusion detection in RPL-based networks. We systematically evaluate five model families, including ensemble models and deep learning models. Our analysis highlights that incremental learning not only restores detection performance on new attack classes but also mitigates catastrophic forgetting of previously learned threats, all while reducing training time compared to full retraining. By combining five diverse models with attack-specific analysis, forgetting behavior, and time efficiency, this study provides systematic evidence that incremental learning offers a scalable pathway to maintain resilient intrusion detection in evolving RPL-based IoT networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11466",
        "abs_url": "https://arxiv.org/abs/2511.11466",
        "pdf_url": "https://arxiv.org/pdf/2511.11466",
        "title": "Non-Euclidean SGD for Structured Optimization: Unified Analysis and Improved Rates",
        "authors": [
            "Dmitry Kovalev",
            "Ekaterina Borodich"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "Recently, several instances of non-Euclidean SGD, including SignSGD, Lion, and Muon, have attracted significant interest from the optimization community due to their practical success in training deep neural networks. Consequently, a number of works have attempted to explain this success by developing theoretical convergence analyses. Unfortunately, these results cannot properly justify the superior performance of these methods, as they could not beat the convergence rate of vanilla Euclidean SGD. We resolve this important open problem by developing a new unified convergence analysis under the structured smoothness and gradient noise assumption. In particular, our results indicate that non-Euclidean SGD (i) can exploit the sparsity or low-rank structure of the upper bounds on the Hessian and gradient noise, (ii) can provably benefit from popular algorithmic tools such as extrapolation or momentum variance reduction, and (iii) can match the state-of-the-art convergence rates of adaptive and more complex optimization algorithms such as AdaGrad and Shampoo.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11498",
        "abs_url": "https://arxiv.org/abs/2511.11498",
        "pdf_url": "https://arxiv.org/pdf/2511.11498",
        "title": "Learning and Testing Convex Functions",
        "authors": [
            "Renato Ferreira Pinto Jr.",
            "Cassandra Marcussen",
            "Elchanan Mossel",
            "Shivam Nadimpalli"
        ],
        "comments": "43 pages",
        "subjects": "Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG)",
        "abstract": "We consider the problems of \\emph{learning} and \\emph{testing} real-valued convex functions over Gaussian space. Despite the extensive study of function convexity across mathematics, statistics, and computer science, its learnability and testability have largely been examined only in discrete or restricted settings -- typically with respect to the Hamming distance, which is ill-suited for real-valued functions. In contrast, we study these problems in high dimensions under the standard Gaussian measure, assuming sample access to the function and a mild smoothness condition, namely Lipschitzness. A smoothness assumption is natural and, in fact, necessary even in one dimension: without it, convexity cannot be inferred from finitely many samples. As our main results, we give: - Learning Convex Functions: An agnostic proper learning algorithm for Lipschitz convex functions that achieves error $\\varepsilon$ using $n^{O(1/\\varepsilon^2)}$ samples, together with a complementary lower bound of $n^{\\mathrm{poly}(1/\\varepsilon)}$ samples in the \\emph{correlational statistical query (CSQ)} model. - Testing Convex Functions: A tolerant (two-sided) tester for convexity of Lipschitz functions with the same sample complexity (as a corollary of our learning result), and a one-sided tester (which never rejects convex functions) using $O(\\sqrt{n}/\\varepsilon)^n$ samples.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11522",
        "abs_url": "https://arxiv.org/abs/2511.11522",
        "pdf_url": "https://arxiv.org/pdf/2511.11522",
        "title": "CVChess: A Deep Learning Framework for Converting Chessboard Images to Forsyth-Edwards Notation",
        "authors": [
            "Luthira Abeykoon",
            "Ved Patel",
            "Gawthaman Senthilvelan",
            "Darshan Kasundra"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Chess has experienced a large increase in viewership since the pandemic, driven largely by the accessibility of online learning platforms. However, no equivalent assistance exists for physical chess games, creating a divide between analog and digital chess experiences. This paper presents CVChess, a deep learning framework for converting chessboard images to Forsyth-Edwards Notation (FEN), which is later input into online chess engines to provide you with the best next move. Our approach employs a convolutional neural network (CNN) with residual layers to perform piece recognition from smartphone camera images. The system processes RGB images of a physical chess board through a multistep process: image preprocessing using the Hough Line Transform for edge detection, projective transform to achieve a top-down board alignment, segmentation into 64 individual squares, and piece classification into 13 classes (6 unique white pieces, 6 unique black pieces and an empty square) using the residual CNN. Residual connections help retain low-level visual features while enabling deeper feature extraction, improving accuracy and stability during training. We train and evaluate our model using the Chess Recognition Dataset (ChessReD), containing 10,800 annotated smartphone images captured under diverse lighting conditions and angles. The resulting classifications are encoded as an FEN string, which can be fed into a chess engine to generate the most optimal move",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-11-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-17?abs=True",
        "arxiv_id": "2511.11564",
        "abs_url": "https://arxiv.org/abs/2511.11564",
        "pdf_url": "https://arxiv.org/pdf/2511.11564",
        "title": "Estimating Total Effects in Bipartite Experiments with Spillovers and Partial Eligibility",
        "authors": [
            "Albert Tan",
            "Mohsen Bayati",
            "James Nordlund",
            "Roman Istomin"
        ],
        "comments": "21 pages, 6 figures, Appeared as Oral Presentation in 2025 Conference on Digital Experimentation (CODE) at MIT",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study randomized experiments in bipartite systems where only a subset of treatment-side units are eligible for assignment while all units continue to interact, generating interference. We formalize eligibility-constrained bipartite experiments and define estimands aligned with full deployment: the Primary Total Treatment Effect (PTTE) on eligible units and the Secondary Total Treatment Effect (STTE) on ineligible units. Under randomization within the eligible set, we give identification conditions and develop interference-aware ensemble estimators that combine exposure mappings, generalized propensity scores, and flexible machine learning. We further introduce a projection that links treatment- and outcome-level estimands; this mapping is exact under a Linear Additive Edges condition and enables estimation on the (typically much smaller) treatment side with deterministic aggregation to outcomes. In simulations with known ground truth across realistic exposure regimes, the proposed estimators recover PTTE and STTE with low bias and variance and reduce the bias that could arise when interference is ignored. Two field experiments illustrate practical relevance: our method corrects the direction of expected interference bias for a pre-specified metric in both studies and reverses the sign and significance of the primary decision metric in one case.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]