[
    {
        "order": 1,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01892",
        "abs_url": "https://arxiv.org/abs/2511.01892",
        "pdf_url": "https://arxiv.org/pdf/2511.01892",
        "title": "Retrieval-Augmented Multimodal Depression Detection",
        "authors": [
            "Ruibo Hou",
            "Shiyu Teng",
            "Jiaqing Liu",
            "Shurong Chai",
            "Yinhao Li",
            "Lanfen Lin",
            "Yen-Wei Chen"
        ],
        "comments": "Accepted in IEEE EMBC 2025",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Multimodal deep learning has shown promise in depression detection by integrating text, audio, and video signals. Recent work leverages sentiment analysis to enhance emotional understanding, yet suffers from high computational cost, domain mismatch, and static knowledge limitations. To address these issues, we propose a novel Retrieval-Augmented Generation (RAG) framework. Given a depression-related text, our method retrieves semantically relevant emotional content from a sentiment dataset and uses a Large Language Model (LLM) to generate an Emotion Prompt as an auxiliary modality. This prompt enriches emotional representation and improves interpretability. Experiments on the AVEC 2019 dataset show our approach achieves state-of-the-art performance with CCC of 0.593 and MAE of 3.95, surpassing previous transfer learning and multi-task learning baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01904",
        "abs_url": "https://arxiv.org/abs/2511.01904",
        "pdf_url": "https://arxiv.org/pdf/2511.01904",
        "title": "The Eigenvalues Entropy as a Classifier Evaluation Measure",
        "authors": [
            "Doulaye Dembélé"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Classification is a machine learning method used in many practical applications: text mining, handwritten character recognition, face recognition, pattern classification, scene labeling, computer vision, natural langage processing. A classifier prediction results and training set information are often used to get a contingency table which is used to quantify the method quality through an evaluation measure. Such measure, typically a numerical value, allows to choose a suitable method among several. Many evaluation measures available in the literature are less accurate for a dataset with imbalanced classes. In this paper, the eigenvalues entropy is used as an evaluation measure for a binary or a multi-class problem. For a binary problem, relations are given between the eigenvalues and some commonly used measures, the sensitivity, the specificity, the area under the operating receiver characteristic curve and the Gini index. A by-product result of this paper is an estimate of the confusion matrix to deal with the curse of the imbalanced classes. Various data examples are used to show the better performance of the proposed evaluation measure over the gold standard measures available in the literature.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01918",
        "abs_url": "https://arxiv.org/abs/2511.01918",
        "pdf_url": "https://arxiv.org/pdf/2511.01918",
        "title": "Superpositional Gradient Descent: Harnessing Quantum Principles for Model Training",
        "authors": [
            "Ahmet Erdem Pamuk",
            "Emir Kaan Özdemir",
            "Şuayp Talha Kocabay"
        ],
        "comments": "Accepted at 2025 IEEE International Conference on Quantum Artificial Intelligence (IEEE QAI 2025). This is the accepted version of the paper. The final published version will appear in the IEEE proceedings. \\c{opyright} 2025 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses",
        "subjects": "Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Large language models (LLMs) are increasingly trained with classical optimization techniques like AdamW to improve convergence and generalization. However, the mechanisms by which quantum-inspired methods enhance classical training remain underexplored. We introduce Superpositional Gradient Descent (SGD), a novel optimizer linking gradient updates with quantum superposition by injecting quantum circuit perturbations. We present a mathematical framework and implement hybrid quantum-classical circuits in PyTorch and Qiskit. On synthetic sequence classification and large-scale LLM fine-tuning, SGD converges faster and yields lower final loss than AdamW. Despite promising results, scalability and hardware constraints limit adoption. Overall, this work provides new insights into the intersection of quantum computing and deep learning, suggesting practical pathways for leveraging quantum principles to control and enhance model behavior.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01927",
        "abs_url": "https://arxiv.org/abs/2511.01927",
        "pdf_url": "https://arxiv.org/pdf/2511.01927",
        "title": "DeepContour: A Hybrid Deep Learning Framework for Accelerating Generalized Eigenvalue Problem Solving via Efficient Contour Design",
        "authors": [
            "Yeqiu Chen",
            "Ziyan Liu",
            "Hong Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Numerical Analysis (math.NA)",
        "abstract": "Solving large-scale Generalized Eigenvalue Problems (GEPs) is a fundamental yet computationally prohibitive task in science and engineering. As a promising direction, contour integral (CI) methods, such as the CIRR algorithm, offer an efficient and parallelizable framework. However, their performance is critically dependent on the selection of integration contours -- improper selection without reliable prior knowledge of eigenvalue distribution can incur significant computational overhead and compromise numerical accuracy. To address this challenge, we propose DeepContour, a novel hybrid framework that integrates a deep learning-based spectral predictor with Kernel Density Estimation for principled contour design. Specifically, DeepContour first employs a Fourier Neural Operator (FNO) to rapidly predict the spectral distribution of a given GEP. Subsequently, Kernel Density Estimation (KDE) is applied to the predicted spectrum to automatically and systematically determine proper integration contours. Finally, these optimized contours guide the CI solver to efficiently find the desired eigenvalues. We demonstrate the effectiveness of our method on diverse challenging scientific problems. In our main experiments, DeepContour accelerates GEP solving across multiple datasets, achieving up to a 5.63$\\times$ speedup. By combining the predictive power of deep learning with the numerical rigor of classical solvers, this work pioneers an efficient and robust paradigm for tackling difficult generalized eigenvalue involving matrices of high dimension.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01932",
        "abs_url": "https://arxiv.org/abs/2511.01932",
        "pdf_url": "https://arxiv.org/pdf/2511.01932",
        "title": "Deciphering Personalization: Towards Fine-Grained Explainability in Natural Language for Personalized Image Generation Models",
        "authors": [
            "Haoming Wang",
            "Wei Gao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV); Multimedia (cs.MM)",
        "abstract": "Image generation models are usually personalized in practical uses in order to better meet the individual users' heterogeneous needs, but most personalized models lack explainability about how they are being personalized. Such explainability can be provided via visual features in generated images, but is difficult for human users to understand. Explainability in natural language is a better choice, but the existing approaches to explainability in natural language are limited to be coarse-grained. They are unable to precisely identify the multiple aspects of personalization, as well as the varying levels of personalization in each aspect. To address such limitation, in this paper we present a new technique, namely \\textbf{FineXL}, towards \\textbf{Fine}-grained e\\textbf{X}plainability in natural \\textbf{L}anguage for personalized image generation models. FineXL can provide natural language descriptions about each distinct aspect of personalization, along with quantitative scores indicating the level of each aspect of personalization. Experiment results show that FineXL can improve the accuracy of explainability by 56\\%, when different personalization scenarios are applied to multiple types of image generation models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01934",
        "abs_url": "https://arxiv.org/abs/2511.01934",
        "pdf_url": "https://arxiv.org/pdf/2511.01934",
        "title": "Tool Zero: Training Tool-Augmented LLMs via Pure RL from Scratch",
        "authors": [
            "Yirong Zeng",
            "Xiao Ding",
            "Yutai Hou",
            "Yuxian Wang",
            "Li Du",
            "Juyi Dai",
            "Qiuyang Ding",
            "Duyu Tang",
            "Dandan Tu",
            "Weiwen Liu",
            "Bing Qin",
            "Ting Liu"
        ],
        "comments": "EMNLP 2025 finding",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Training tool-augmented LLMs has emerged as a promising approach to enhancing language models' capabilities for complex tasks. The current supervised fine-tuning paradigm relies on constructing extensive domain-specific datasets to train models. However, this approach often struggles to generalize effectively to unfamiliar or intricate tool-use scenarios. Recently, reinforcement learning (RL) paradigm can endow LLMs with superior reasoning and generalization abilities. In this work, we address a key question: Can the pure RL be used to effectively elicit a model's intrinsic reasoning capabilities and enhance the tool-agnostic generalization? We propose a dynamic generalization-guided reward design for rule-based RL, which progressively shifts rewards from exploratory to exploitative tool-use patterns. Based on this design, we introduce the Tool-Zero series models. These models are trained to enable LLMs to autonomously utilize general tools by directly scaling up RL from Zero models (i.e., base models without post-training). Experimental results demonstrate that our models achieve over 7% performance improvement compared to both SFT and RL-with-SFT models under the same experimental settings. These gains are consistently replicated across cross-dataset and intra-dataset evaluations, validating the effectiveness and robustness of our methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01937",
        "abs_url": "https://arxiv.org/abs/2511.01937",
        "pdf_url": "https://arxiv.org/pdf/2511.01937",
        "title": "Shorter but not Worse: Frugal Reasoning via Easy Samples as Length Regularizers in Math RLVR",
        "authors": [
            "Abdelaziz Bounhar",
            "Hadi Abdine",
            "Evan Dufraisse",
            "Ahmad Chamma",
            "Amr Mohamed",
            "Dani Bouch",
            "Michalis Vazirgiannis",
            "Guokan Shang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Machine Learning (stat.ML)",
        "abstract": "Large language models (LLMs) trained for step-by-step reasoning often become excessively verbose, raising inference cost. Standard Reinforcement Learning with Verifiable Rewards (RLVR) pipelines filter out ``easy'' problems for training efficiency, leaving the model to train primarily on harder problems that require longer reasoning chains. This skews the output length distribution upward, resulting in a \\textbf{model that conflates ``thinking longer'' with ``thinking better''}. In this work, we show that retaining and modestly up-weighting moderately easy problems acts as an implicit length regularizer. Exposing the model to solvable short-chain tasks constrains its output distribution and prevents runaway verbosity. The result is \\textbf{\\emph{emergent brevity for free}}: the model learns to solve harder problems without inflating the output length, \\textbf{ despite the absence of any explicit length penalization}. RLVR experiments using this approach on \\textit{Qwen3-4B-Thinking-2507} (with a 16k token limit) achieve baseline pass@1 AIME25 accuracy while generating solutions that are, on average, nearly twice as short. The code is available at \\href{this https URL}{GitHub}, with datasets and models on \\href{this https URL}{Hugging Face}.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01945",
        "abs_url": "https://arxiv.org/abs/2511.01945",
        "pdf_url": "https://arxiv.org/pdf/2511.01945",
        "title": "Learning a Distance for the Clustering of Patients with Amyotrophic Lateral Sclerosis",
        "authors": [
            "Guillaume Tejedor",
            "Veronika Peralta",
            "Nicolas Labroche",
            "Patrick Marcel",
            "Hélène Blasco",
            "Hugo Alarcan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Amyotrophic lateral sclerosis (ALS) is a severe disease with a typical survival of 3-5 years after symptom onset. Current treatments offer only limited life extension, and the variability in patient responses highlights the need for personalized care. However, research is hindered by small, heterogeneous cohorts, sparse longitudinal data, and the lack of a clear definition for clinically meaningful patient clusters. Existing clustering methods remain limited in both scope and number. To address this, we propose a clustering approach that groups sequences using a disease progression declarative score. Our approach integrates medical expertise through multiple descriptive variables, investigating several distance measures combining such variables, both by reusing off-the-shelf distances and employing a weak-supervised learning method. We pair these distances with clustering methods and benchmark them against state-of-the-art techniques. The evaluation of our approach on a dataset of 353 ALS patients from the University Hospital of Tours, shows that our method outperforms state-of-the-art methods in survival analysis while achieving comparable silhouette scores. In addition, the learned distances enhance the relevance and interpretability of results for medical experts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01947",
        "abs_url": "https://arxiv.org/abs/2511.01947",
        "pdf_url": "https://arxiv.org/pdf/2511.01947",
        "title": "Interpretable Heart Disease Prediction via a Weighted Ensemble Model: A Large-Scale Study with SHAP and Surrogate Decision Trees",
        "authors": [
            "Md Abrar Hasnat",
            "Md Jobayer",
            "Md. Mehedi Hasan Shawon",
            "Md. Golam Rabiul Alam"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Signal Processing (eess.SP)",
        "abstract": "Cardiovascular disease (CVD) remains a critical global health concern, demanding reliable and interpretable predictive models for early risk assessment. This study presents a large-scale analysis using the Heart Disease Health Indicators Dataset, developing a strategically weighted ensemble model that combines tree-based methods (LightGBM, XGBoost) with a Convolutional Neural Network (CNN) to predict CVD risk. The model was trained on a preprocessed dataset of 229,781 patients where the inherent class imbalance was managed through strategic weighting and feature engineering enhanced the original 22 features to 25. The final ensemble achieves a statistically significant improvement over the best individual model, with a Test AUC of 0.8371 (p=0.003) and is particularly suited for screening with a high recall of 80.0%. To provide transparency and clinical interpretability, surrogate decision trees and SHapley Additive exPlanations (SHAP) are used. The proposed model delivers a combination of robust predictive performance and clinical transparency by blending diverse learning architectures and incorporating explainability through SHAP and surrogate decision trees, making it a strong candidate for real-world deployment in public health screening.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01950",
        "abs_url": "https://arxiv.org/abs/2511.01950",
        "pdf_url": "https://arxiv.org/pdf/2511.01950",
        "title": "EchoLSTM: A Self-Reflective Recurrent Network for Stabilizing Long-Range Memory",
        "authors": [
            "Prasanth K K",
            "Shubham Sharma"
        ],
        "comments": "11 pages, 4 figures, 5 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Standard Recurrent Neural Networks, including LSTMs, struggle to model long-range dependencies, particularly in sequences containing noisy or misleading information. We propose a new architectural principle, Output-Conditioned Gating, which enables a model to perform self-reflection by modulating its internal memory gates based on its own past inferences. This creates a stabilizing feedback loop that enhances memory retention. Our final model, the EchoLSTM, integrates this principle with an attention mechanism. We evaluate the EchoLSTM on a series of challenging benchmarks. On a custom-designed Distractor Signal Task, the EchoLSTM achieves 69.0% accuracy, decisively outperforming a standard LSTM baseline by 33 percentage points. Furthermore, on the standard ListOps benchmark, the EchoLSTM achieves performance competitive with a modern Transformer model, 69.8% vs. 71.8%, while being over 5 times more parameter-efficient. A final Trigger Sensitivity Test provides qualitative evidence that our model's self-reflective mechanism leads to a fundamentally more robust memory system.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01951",
        "abs_url": "https://arxiv.org/abs/2511.01951",
        "pdf_url": "https://arxiv.org/pdf/2511.01951",
        "title": "NeuroClean: A Generalized Machine-Learning Approach to Neural Time-Series Conditioning",
        "authors": [
            "Manuel A. Hernandez Alonso",
            "Michael Depass",
            "Stephan Quessy",
            "Numa Dancause",
            "Ignasi Cos"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Electroencephalography (EEG) and local field potentials (LFP) are two widely used techniques to record electrical activity from the brain. These signals are used in both the clinical and research domains for multiple applications. However, most brain data recordings suffer from a myriad of artifacts and noise sources other than the brain itself. Thus, a major requirement for their use is proper and, given current volumes of data, a fully automatized conditioning. As a means to this end, here we introduce an unsupervised, multipurpose EEG/LFP preprocessing method, the NeuroClean pipeline. In addition to its completeness and reliability, NeuroClean is an unsupervised series of algorithms intended to mitigate reproducibility issues and biases caused by human intervention. The pipeline is designed as a five-step process, including the common bandpass and line noise filtering, and bad channel rejection. However, it incorporates an efficient independent component analysis with an automatic component rejection based on a clustering algorithm. This machine learning classifier is used to ensure that task-relevant information is preserved after each step of the cleaning process. We used several data sets to validate the pipeline. NeuroClean removed several common types of artifacts from the signal. Moreover, in the context of motor tasks of varying complexity, it yielded more than 97% accuracy (vs. a chance-level of 33.3%) in an optimized Multinomial Logistic Regression model after cleaning the data, compared to the raw data, which performed at 74% accuracy. These results show that NeuroClean is a promising pipeline and workflow that can be applied to future work and studies to achieve better generalization and performance on machine learning pipelines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02003",
        "abs_url": "https://arxiv.org/abs/2511.02003",
        "pdf_url": "https://arxiv.org/pdf/2511.02003",
        "title": "Bulk-boundary decomposition of neural networks",
        "authors": [
            "Donghee Lee",
            "Hye-Sung Lee",
            "Jaeok Yi"
        ],
        "comments": "6 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG); Disordered Systems and Neural Networks (cond-mat.dis-nn); High Energy Physics - Phenomenology (hep-ph)",
        "abstract": "We present the bulk-boundary decomposition as a new framework for understanding the training dynamics of deep neural networks. Starting from the stochastic gradient descent formulation, we show that the Lagrangian can be reorganized into a data-independent bulk term and a data-dependent boundary term. The bulk captures the intrinsic dynamics set by network architecture and activation functions, while the boundary reflects stochastic interactions from training samples at the input and output layers. This decomposition exposes the local and homogeneous structure underlying deep networks. As a natural extension, we develop a field-theoretic formulation of neural dynamics based on this decomposition.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02017",
        "abs_url": "https://arxiv.org/abs/2511.02017",
        "pdf_url": "https://arxiv.org/pdf/2511.02017",
        "title": "TapOut: A Bandit-Based Approach to Dynamic Speculative Decoding",
        "authors": [
            "Aditya Sridhar",
            "Nish Sinnadurai",
            "Sean Lie",
            "Vithursan Thangarasa"
        ],
        "comments": "9 pages, 6 figures, 5 tables",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Speculative decoding accelerates LLMs by using a lightweight draft model to generate tokens autoregressively before verifying them in parallel with a larger target model. However, determining the optimal number of tokens to draft remains a key challenge limiting the approach's effectiveness. Dynamic speculative decoding aims to intelligently decide how many tokens to draft to achieve maximum speedups. Existing methods often rely on hand-tuned, sensitive thresholds (e.g., token entropy), which are costly to set and generalize poorly across models and domains. We propose TapOut, an online, training-free, plug-and-play algorithm for dynamic speculation policy selection using multi-armed bandits. Our approach employs a meta-algorithm that selects among multiple parameter-free dynamic speculation strategies based on past reward and exploration. We conduct extensive experiments across diverse model pairs and datasets, showing that TapOut achieves competitive or superior speedups compared to well-established dynamic speculation baselines without any hyperparameter tuning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02025",
        "abs_url": "https://arxiv.org/abs/2511.02025",
        "pdf_url": "https://arxiv.org/pdf/2511.02025",
        "title": "Path-Coordinated Continual Learning with Neural Tangent Kernel-Justified Plasticity: A Theoretical Framework with Near State-of-the-Art Performance",
        "authors": [
            "Rathin Chandra Shit"
        ],
        "comments": "Under review, IEEE Letters",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Robotics (cs.RO)",
        "abstract": "Catastrophic forgetting is one of the fundamental issues of continual learning because neural networks forget the tasks learned previously when trained on new tasks. The proposed framework is a new path-coordinated framework of continual learning that unites the Neural Tangent Kernel (NTK) theory of principled plasticity bounds, statistical validation by Wilson confidence intervals, and evaluation of path quality by the use of multiple metrics. Experimental evaluation shows an average accuracy of 66.7% at the cost of 23.4% catastrophic forgetting on Split-CIFAR10, a huge improvement over the baseline and competitive performance achieved, which is very close to state-of-the-art results. Further, it is found out that NTK condition numbers are predictive indicators of learning capacity limits, showing the existence of a critical threshold at condition number $>10^{11}$. It is interesting to note that the proposed strategy shows a tendency of lowering forgetting as the sequence of tasks progresses (27% to 18%), which is a system stabilization. The framework validates 80% of discovered paths with a rigorous statistical guarantee and maintains 90-97% retention on intermediate tasks. The core capacity limits of the continual learning environment are determined in the analysis, and actionable insights to enhance the adaptive regularization are offered.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02038",
        "abs_url": "https://arxiv.org/abs/2511.02038",
        "pdf_url": "https://arxiv.org/pdf/2511.02038",
        "title": "Predicting Microbial Interactions Using Graph Neural Networks",
        "authors": [
            "Elham Gholamzadeh",
            "Kajal Singla",
            "Nico Scherf"
        ],
        "comments": "9 pages, 3 figures, NeurIPS 2025 Workshop New Perspectives in Graph Machine Learning",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Predicting interspecies interactions is a key challenge in microbial ecology, as these interactions are critical to determining the structure and activity of microbial communities. In this work, we used data on monoculture growth capabilities, interactions with other species, and phylogeny to predict a negative or positive effect of interactions. More precisely, we used one of the largest available pairwise interaction datasets to train our models, comprising over 7,500 interactions be- tween 20 species from two taxonomic groups co-cultured under 40 distinct carbon conditions, with a primary focus on the work of Nestor et al.[28 ]. In this work, we propose Graph Neural Networks (GNNs) as a powerful classifier to predict the direction of the effect. We construct edge-graphs of pairwise microbial interactions in order to leverage shared information across individual co-culture experiments, and use GNNs to predict modes of interaction. Our model can not only predict binary interactions (positive/negative) but also classify more complex interaction types such as mutualism, competition, and parasitism. Our initial results were encouraging, achieving an F1-score of 80.44%. This significantly outperforms comparable methods in the literature, including conventional Extreme Gradient Boosting (XGBoost) models, which reported an F1-score of 72.76%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02043",
        "abs_url": "https://arxiv.org/abs/2511.02043",
        "pdf_url": "https://arxiv.org/pdf/2511.02043",
        "title": "Flashlight: PyTorch Compiler Extensions to Accelerate Attention Variants",
        "authors": [
            "Bozhi You",
            "Irene Wang",
            "Zelal Su Mustafaoglu",
            "Abhinav Jangda",
            "Angélica Moreira",
            "Roshan Dathathri",
            "Divya Mahajan",
            "Keshav Pingali"
        ],
        "comments": "Submitted to MLSys 2026",
        "subjects": "Machine Learning (cs.LG); Performance (cs.PF)",
        "abstract": "Bad charactors when submitting to arXiv: Attention is a fundamental building block of large language models (LLMs), so there have been many efforts to implement it efficiently. For example, FlashAttention leverages tiling and kernel fusion to optimize attention. Recently, a number of variants of attention have been introduced to enhance model quality or efficiency. Supporting them efficiently remains difficult since they usually require specialized kernels or hand-tuned implementations. FlexAttention recently addressed part of this gap by using static programming templates to support FlashAttention-like kernels for a subset of attention variants. In this paper, we introduce Flashlight, a compiler-native framework within the PyTorch ecosystem that automatically generates fused, FlashAttention-style kernels for arbitrary attention-based programs, without relying on static templates or predefined kernel specializations. Flashlight leverages PyTorch's compilation workflow to fuse and tile attention computations transparently, enabling efficient execution for diverse attention patterns. Not only does it support all variants expressible in the FlexAttention model but it also handles more general, data-dependent attention formulations that are beyond the capabilities of FlexAttention. Our results show that Flashlight produces kernels with competitive or superior performance to FlexAttention, while offering the flexibility of native PyTorch code, enabling developers to rapidly explore new attention models without sacrificing performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02047",
        "abs_url": "https://arxiv.org/abs/2511.02047",
        "pdf_url": "https://arxiv.org/pdf/2511.02047",
        "title": "A Dual-Use Framework for Clinical Gait Analysis: Attention-Based Sensor Optimization and Automated Dataset Auditing",
        "authors": [
            "Hamidreza Sadeghsalehi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Objective gait analysis using wearable sensors and AI is critical for managing neurological and orthopedic conditions. However, models are vulnerable to hidden dataset biases, and task-specific sensor optimization remains a challenge. We propose a multi-stream attention-based deep learning framework that functions as both a sensor optimizer and an automated data auditor. Applied to the Voisard et al. (2025) multi-cohort gait dataset on four clinical tasks (PD, OA, CVA screening; PD vs CVA differential), the model's attention mechanism quantitatively discovered a severe dataset confound. For OA and CVA screening, tasks where bilateral assessment is clinically essential, the model assigned more than 70 percent attention to the Right Foot while statistically ignoring the Left Foot (less than 0.1 percent attention, 95 percent CI [0.0-0.1]). This was not a clinical finding but a direct reflection of a severe laterality bias (for example, 15 of 15 right-sided OA) in the public dataset. The primary contribution of this work is methodological, demonstrating that an interpretable framework can automatically audit dataset integrity. As a secondary finding, the model proposes novel, data-driven sensor synergies (for example, Head plus Foot for PD screening) as hypotheses for future optimized protocols.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02048",
        "abs_url": "https://arxiv.org/abs/2511.02048",
        "pdf_url": "https://arxiv.org/pdf/2511.02048",
        "title": "Finding Probably Approximate Optimal Solutions by Training to Estimate the Optimal Values of Subproblems",
        "authors": [
            "Nimrod Megiddo",
            "Segev Wasserkrug",
            "Orit Davidovich",
            "Shimrit Shtern"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The paper is about developing a solver for maximizing a real-valued function of binary variables. The solver relies on an algorithm that estimates the optimal objective-function value of instances from the underlying distribution of objectives and their respective sub-instances. The training of the estimator is based on an inequality that facilitates the use of the expected total deviation from optimality conditions as a loss function rather than the objective-function itself. Thus, it does not calculate values of policies, nor does it rely on solved instances.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02077",
        "abs_url": "https://arxiv.org/abs/2511.02077",
        "pdf_url": "https://arxiv.org/pdf/2511.02077",
        "title": "Beyond Static Cutoffs: One-Shot Dynamic Thresholding for Diffusion Language Models",
        "authors": [
            "Jucheng Shen",
            "Yeonju Ro"
        ],
        "comments": "7 pages, NeurIPS 2025 Efficient Reasoning Workshop",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Masked diffusion language models (MDLMs) are becoming competitive with their autoregressive counterparts but typically decode with fixed steps and sequential unmasking. To accelerate decoding, recent work such as Fast-dLLM enables parallel decoding via a static global confidence threshold, yet we observe strong block- and step-wise confidence fluctuations and, within a dataset, near-identical confidence trajectories across inputs as measured by cosine similarity. Motivated by these observations, we introduce One-Shot Dynamic Thresholding (OSDT), which calibrates thresholds on a single sequence and applies them to subsequent inputs with negligible overhead. On GPQA, GSM8K, and HumanEval, OSDT attains superior accuracy-throughput trade-offs (+24% tokens/s on GSM8K at the best accuracy, +45% on GPQA with comparable accuracy, and +50% on HumanEval with a modest accuracy gap). Beyond these results, our findings suggest broader opportunities to leverage reusable task-level confidence signatures for more general-purpose algorithmic and systems innovations in diffusion decoding.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02089",
        "abs_url": "https://arxiv.org/abs/2511.02089",
        "pdf_url": "https://arxiv.org/pdf/2511.02089",
        "title": "LLM Probing with Contrastive Eigenproblems: Improving Understanding and Applicability of CCS",
        "authors": [
            "Stefan F. Schouten",
            "Peter Bloem"
        ],
        "comments": "Accepted to the Mechanistic Interpretability Workshop at NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Contrast-Consistent Search (CCS) is an unsupervised probing method able to test whether large language models represent binary features, such as sentence truth, in their internal activations. While CCS has shown promise, its two-term objective has been only partially understood. In this work, we revisit CCS with the aim of clarifying its mechanisms and extending its applicability. We argue that what should be optimized for, is relative contrast consistency. Building on this insight, we reformulate CCS as an eigenproblem, yielding closed-form solutions with interpretable eigenvalues and natural extensions to multiple variables. We evaluate these approaches across a range of datasets, finding that they recover similar performance to CCS, while avoiding problems around sensitivity to random initialization. Our results suggest that relativizing contrast consistency not only improves our understanding of CCS but also opens pathways for broader probing and mechanistic interpretability methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02092",
        "abs_url": "https://arxiv.org/abs/2511.02092",
        "pdf_url": "https://arxiv.org/pdf/2511.02092",
        "title": "Uncertainty Guided Online Ensemble for Non-stationary Data Streams in Fusion Science",
        "authors": [
            "Kishansingh Rajput",
            "Malachi Schram",
            "Brian Sammuli",
            "Sen Lin"
        ],
        "comments": "24 pages including total of references, 2 appendices, 7 Figures (5 in main article, 2 in appendix A)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Plasma Physics (physics.plasm-ph)",
        "abstract": "Machine Learning (ML) is poised to play a pivotal role in the development and operation of next-generation fusion devices. Fusion data shows non-stationary behavior with distribution drifts, resulted by both experimental evolution and machine wear-and-tear. ML models assume stationary distribution and fail to maintain performance when encountered with such non-stationary data streams. Online learning techniques have been leveraged in other domains, however it has been largely unexplored for fusion applications. In this paper, we present an application of online learning to continuously adapt to drifting data stream for prediction of Toroidal Field (TF) coils deflection at the DIII-D fusion facility. The results demonstrate that online learning is critical to maintain ML model performance and reduces error by 80% compared to a static model. Moreover, traditional online learning can suffer from short-term performance degradation as ground truth is not available before making the predictions. As such, we propose an uncertainty guided online ensemble method to further improve the performance. The Deep Gaussian Process Approximation (DGPA) technique is leveraged for calibrated uncertainty estimation and the uncertainty values are then used to guide a meta-algorithm that produces predictions based on an ensemble of learners trained on different horizon of historical data. The DGPA also provides uncertainty estimation along with the predictions for decision makers. The online ensemble and the proposed uncertainty guided online ensemble reduces predictions error by about 6%, and 10% respectively over standard single model based online learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02101",
        "abs_url": "https://arxiv.org/abs/2511.02101",
        "pdf_url": "https://arxiv.org/pdf/2511.02101",
        "title": "Measuring the Intrinsic Dimension of Earth Representations",
        "authors": [
            "Arjun Rao",
            "Marc Rußwurm",
            "Konstantin Klemmer",
            "Esther Rolf"
        ],
        "comments": "Pre-print. 27 pages, 11 figures, 6 tables",
        "subjects": "Machine Learning (cs.LG); Information Theory (cs.IT)",
        "abstract": "Within the context of representation learning for Earth observation, geographic Implicit Neural Representations (INRs) embed low-dimensional location inputs (longitude, latitude) into high-dimensional embeddings, through models trained on geo-referenced satellite, image or text data. Despite the common aim of geographic INRs to distill Earth's data into compact, learning-friendly representations, we lack an understanding of how much information is contained in these Earth representations, and where that information is concentrated. The intrinsic dimension of a dataset measures the number of degrees of freedom required to capture its local variability, regardless of the ambient high-dimensional space in which it is embedded. This work provides the first study of the intrinsic dimensionality of geographic INRs. Analyzing INRs with ambient dimension between 256 and 512, we find that their intrinsic dimensions fall roughly between 2 and 10 and are sensitive to changing spatial resolution and input modalities during INR pre-training. Furthermore, we show that the intrinsic dimension of a geographic INR correlates with downstream task performance and can capture spatial artifacts, facilitating model evaluation and diagnostics. More broadly, our work offers an architecture-agnostic, label-free metric of information content that can enable unsupervised evaluation, model selection, and pre-training design across INRs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02123",
        "abs_url": "https://arxiv.org/abs/2511.02123",
        "pdf_url": "https://arxiv.org/pdf/2511.02123",
        "title": "Variance-Aware Feel-Good Thompson Sampling for Contextual Bandits",
        "authors": [
            "Xuheng Li",
            "Quanquan Gu"
        ],
        "comments": "19 pages, 2 figures, 39th Conference on Neural Information Processing Systems (NeurIPS 2025)",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "Variance-dependent regret bounds have received increasing attention in recent studies on contextual bandits. However, most of these studies are focused on upper confidence bound (UCB)-based bandit algorithms, while sampling based bandit algorithms such as Thompson sampling are still understudied. The only exception is the LinVDTS algorithm (Xu et al., 2023), which is limited to linear reward function and its regret bound is not optimal with respect to the model dimension. In this paper, we present FGTSVA, a variance-aware Thompson Sampling algorithm for contextual bandits with general reward function with optimal regret bound. At the core of our analysis is an extension of the decoupling coefficient, a technique commonly used in the analysis of Feel-good Thompson sampling (FGTS) that reflects the complexity of the model space. With the new decoupling coefficient denoted by $\\mathrm{dc}$, FGTS-VA achieves the regret of $\\tilde{O}(\\sqrt{\\mathrm{dc}\\cdot\\log|\\mathcal{F}|\\sum_{t=1}^T\\sigma_t^2}+\\mathrm{dc})$, where $|\\mathcal{F}|$ is the size of the model space, $T$ is the total number of rounds, and $\\sigma_t^2$ is the subgaussian norm of the noise (e.g., variance when the noise is Gaussian) at round $t$. In the setting of contextual linear bandits, the regret bound of FGTSVA matches that of UCB-based algorithms using weighted linear regression (Zhou and Gu, 2022).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02140",
        "abs_url": "https://arxiv.org/abs/2511.02140",
        "pdf_url": "https://arxiv.org/pdf/2511.02140",
        "title": "QuPCG: Quantum Convolutional Neural Network for Detecting Abnormal Patterns in PCG Signals",
        "authors": [
            "Yasaman Torabi",
            "Shahram Shirani",
            "James P. Reilly"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Early identification of abnormal physiological patterns is essential for the timely detection of cardiac disease. This work introduces a hybrid quantum-classical convolutional neural network (QCNN) designed to classify S3 and murmur abnormalities in heart sound signals. The approach transforms one-dimensional phonocardiogram (PCG) signals into compact two-dimensional images through a combination of wavelet feature extraction and adaptive threshold compression methods. We compress the cardiac-sound patterns into an 8-pixel image so that only 8 qubits are needed for the quantum stage. Preliminary results on the HLS-CMDS dataset demonstrate 93.33% classification accuracy on the test set and 97.14% on the train set, suggesting that quantum models can efficiently capture temporal-spectral correlations in biomedical signals. To our knowledge, this is the first application of a QCNN algorithm for bioacoustic signal processing. The proposed method represents an early step toward quantum-enhanced diagnostic systems for resource-constrained healthcare environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02148",
        "abs_url": "https://arxiv.org/abs/2511.02148",
        "pdf_url": "https://arxiv.org/pdf/2511.02148",
        "title": "CFL: On the Use of Characteristic Function Loss for Domain Alignment in Machine Learning",
        "authors": [
            "Abdullah Almansour",
            "Ozan Tonguz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine Learning (ML) models are extensively used in various applications due to their significant advantages over traditional learning methods. However, the developed ML models often underperform when deployed in the real world due to the well-known distribution shift problem. This problem can lead to a catastrophic outcomes when these decision-making systems have to operate in high-risk applications. Many researchers have previously studied this problem in ML, known as distribution shift problem, using statistical techniques (such as Kullback-Leibler, Kolmogorov-Smirnov Test, Wasserstein distance, etc.) to quantify the distribution shift. In this letter, we show that using Characteristic Function (CF) as a frequency domain approach is a powerful alternative for measuring the distribution shift in high-dimensional space and for domain adaptation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02152",
        "abs_url": "https://arxiv.org/abs/2511.02152",
        "pdf_url": "https://arxiv.org/pdf/2511.02152",
        "title": "ProtoTSNet: Interpretable Multivariate Time Series Classification With Prototypical Parts",
        "authors": [
            "Bartłomiej Małkus",
            "Szymon Bobek",
            "Grzegorz J. Nalepa"
        ],
        "comments": "30 pages, 10 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series data is one of the most popular data modalities in critical domains such as industry and medicine. The demand for algorithms that not only exhibit high accuracy but also offer interpretability is crucial in such fields, as decisions made there bear significant consequences. In this paper, we present ProtoTSNet, a novel approach to interpretable classification of multivariate time series data, through substantial enhancements to the ProtoPNet architecture. Our method is tailored to overcome the unique challenges of time series analysis, including capturing dynamic patterns and handling varying feature significance. Central to our innovation is a modified convolutional encoder utilizing group convolutions, pre-trainable as part of an autoencoder and designed to preserve and quantify feature importance. We evaluated our model on 30 multivariate time series datasets from the UEA archive, comparing our approach with existing explainable methods as well as non-explainable baselines. Through comprehensive evaluation and ablation studies, we demonstrate that our approach achieves the best performance among ante-hoc explainable methods while maintaining competitive performance with non-explainable and post-hoc explainable approaches, providing interpretable results accessible to domain experts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02205",
        "abs_url": "https://arxiv.org/abs/2511.02205",
        "pdf_url": "https://arxiv.org/pdf/2511.02205",
        "title": "OmniField: Conditioned Neural Fields for Robust Multimodal Spatiotemporal Learning",
        "authors": [
            "Kevin Valencia",
            "Thilina Balasooriya",
            "Xihaier Luo",
            "Shinjae Yoo",
            "David Keetae Park"
        ],
        "comments": "25 pages, 12 figures, 8 tables",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "Multimodal spatiotemporal learning on real-world experimental data is constrained by two challenges: within-modality measurements are sparse, irregular, and noisy (QA/QC artifacts) but cross-modally correlated; the set of available modalities varies across space and time, shrinking the usable record unless models can adapt to arbitrary subsets at train and test time. We propose OmniField, a continuity-aware framework that learns a continuous neural field conditioned on available modalities and iteratively fuses cross-modal context. A multimodal crosstalk block architecture paired with iterative cross-modal refinement aligns signals prior to the decoder, enabling unified reconstruction, interpolation, forecasting, and cross-modal prediction without gridding or surrogate preprocessing. Extensive evaluations show that OmniField consistently outperforms eight strong multimodal spatiotemporal baselines. Under heavy simulated sensor noise, performance remains close to clean-input levels, highlighting robustness to corrupted measurements.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02225",
        "abs_url": "https://arxiv.org/abs/2511.02225",
        "pdf_url": "https://arxiv.org/pdf/2511.02225",
        "title": "Learning Interactive World Model for Object-Centric Reinforcement Learning",
        "authors": [
            "Fan Feng",
            "Phillip Lippe",
            "Sara Magliacane"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Agents that understand objects and their interactions can learn policies that are more robust and transferable. However, most object-centric RL methods factor state by individual objects while leaving interactions implicit. We introduce the Factored Interactive Object-Centric World Model (FIOC-WM), a unified framework that learns structured representations of both objects and their interactions within a world model. FIOC-WM captures environment dynamics with disentangled and modular representations of object interactions, improving sample efficiency and generalization for policy learning. Concretely, FIOC-WM first learns object-centric latents and an interaction structure directly from pixels, leveraging pre-trained vision encoders. The learned world model then decomposes tasks into composable interaction primitives, and a hierarchical policy is trained on top: a high level selects the type and order of interactions, while a low level executes them. On simulated robotic and embodied-AI benchmarks, FIOC-WM improves policy-learning sample efficiency and generalization over world-model baselines, indicating that explicit, modular interaction learning is crucial for robust control.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02237",
        "abs_url": "https://arxiv.org/abs/2511.02237",
        "pdf_url": "https://arxiv.org/pdf/2511.02237",
        "title": "Opportunistic Expert Activation: Batch-Aware Expert Routing for Faster Decode Without Retraining",
        "authors": [
            "Costin-Andrei Oncescu",
            "Qingyang Wu",
            "Wai Tong Chung",
            "Robert Wu",
            "Bryan Gopal",
            "Junxiong Wang",
            "Tri Dao",
            "Ben Athiwaratkun"
        ],
        "comments": "18 pages, 9 figures, 10 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "An increasing number of LLMs employ Mixture-of-Experts (MoE) architectures where the feed-forward layer is replaced by a pool of experts and each token only activates a small subset of them. During autoregressive generation, these models often enter a memory-bound regime even for moderate batch sizes because the average expert load grows more slowly than in an equivalent dense feedforward layer. Consequently, MoE latency is governed by the number of activated experts. We introduce a framework for dynamically re-routing token-to-expert mapping to lower this number (and thus, the decode latency) while preserving a comparable quality. Our best results use a batch-aware routing that works by having tokens piggyback experts that have already been loaded into memory due to being crucial to other tokens within the same batch. Empirically, we evaluate our method on the Qwen3-30B and Qwen3-235B models with a batch size of $16$. Without any statistically significant loss in accuracy, our approach achieves latency reductions of $39\\%$ and $15\\%$ in the MoE layer decode latency, respectively.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02244",
        "abs_url": "https://arxiv.org/abs/2511.02244",
        "pdf_url": "https://arxiv.org/pdf/2511.02244",
        "title": "Neural network initialization with nonlinear characteristics and information on spectral bias",
        "authors": [
            "Hikaru Homma",
            "Jun Ohkubo"
        ],
        "comments": "7 pages, 7 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Initialization of neural network parameters, such as weights and biases, has a crucial impact on learning performance; if chosen well, we can even avoid the need for additional training with backpropagation. For example, algorithms based on the ridgelet transform or the SWIM (sampling where it matters) concept have been proposed for initialization. On the other hand, it is well-known that neural networks tend to learn coarse information in the earlier layers. The feature is called spectral bias. In this work, we investigate the effects of utilizing information on the spectral bias in the initialization of neural networks. Hence, we propose a framework that adjusts the scale factors in the SWIM algorithm to capture low-frequency components in the early-stage hidden layers and to represent high-frequency components in the late-stage hidden layers. Numerical experiments on a one-dimensional regression task and the MNIST classification task demonstrate that the proposed method outperforms the conventional initialization algorithms. This work clarifies the importance of intrinsic spectral properties in learning neural networks, and the finding yields an effective parameter initialization strategy that enhances their training performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02272",
        "abs_url": "https://arxiv.org/abs/2511.02272",
        "pdf_url": "https://arxiv.org/pdf/2511.02272",
        "title": "Probabilistic Graph Cuts",
        "authors": [
            "Ayoub Ghriss"
        ],
        "comments": "23 pages",
        "subjects": "Machine Learning (cs.LG); Data Structures and Algorithms (cs.DS); Machine Learning (stat.ML)",
        "abstract": "Probabilistic relaxations of graph cuts offer a differentiable alternative to spectral clustering, enabling end-to-end and online learning without eigendecompositions, yet prior work centered on RatioCut and lacked general guarantees and principled gradients. We present a unified probabilistic framework that covers a wide class of cuts, including Normalized Cut. Our framework provides tight analytic upper bounds on expected discrete cuts via integral representations and Gauss hypergeometric functions with closed-form forward and backward. Together, these results deliver a rigorous, numerically stable foundation for scalable, differentiable graph partitioning covering a wide range of clustering and contrastive learning objectives.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02276",
        "abs_url": "https://arxiv.org/abs/2511.02276",
        "pdf_url": "https://arxiv.org/pdf/2511.02276",
        "title": "Gradient-Variation Online Adaptivity for Accelerated Optimization with Hölder Smoothness",
        "authors": [
            "Yuheng Zhao",
            "Yu-Hu Yan",
            "Kfir Yehuda Levy",
            "Peng Zhao"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Smoothness is known to be crucial for acceleration in offline optimization, and for gradient-variation regret minimization in online learning. Interestingly, these two problems are actually closely connected -- accelerated optimization can be understood through the lens of gradient-variation online learning. In this paper, we investigate online learning with Hölder smooth functions, a general class encompassing both smooth and non-smooth (Lipschitz) functions, and explore its implications for offline optimization. For (strongly) convex online functions, we design the corresponding gradient-variation online learning algorithm whose regret smoothly interpolates between the optimal guarantees in smooth and non-smooth regimes. Notably, our algorithms do not require prior knowledge of the Hölder smoothness parameter, exhibiting strong adaptivity over existing methods. Through online-to-batch conversion, this gradient-variation online adaptivity yields an optimal universal method for stochastic convex optimization under Hölder smoothness. However, achieving universality in offline strongly convex optimization is more challenging. We address this by integrating online adaptivity with a detection-based guess-and-check procedure, which, for the first time, yields a universal offline method that achieves accelerated convergence in the smooth regime while maintaining near-optimal convergence in the non-smooth one.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02286",
        "abs_url": "https://arxiv.org/abs/2511.02286",
        "pdf_url": "https://arxiv.org/pdf/2511.02286",
        "title": "Reinforcement learning based data assimilation for unknown state model",
        "authors": [
            "Ziyi Wang",
            "Lijian Jiang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Data assimilation (DA) has increasingly emerged as a critical tool for state estimation across a wide range of applications. It is signiffcantly challenging when the governing equations of the underlying dynamics are unknown. To this end, various machine learning approaches have been employed to construct a surrogate state transition model in a supervised learning framework, which relies on pre-computed training datasets. However, it is often infeasible to obtain noise-free ground-truth state sequences in practice. To address this challenge, we propose a novel method that integrates reinforcement learning with ensemble-based Bayesian ffltering methods, enabling the learning of surrogate state transition model for unknown dynamics directly from noisy observations, without using true state trajectories. Speciffcally, we treat the process for computing maximum likelihood estimation of surrogate model parameters as a sequential decision-making problem, which can be formulated as a discretetime Markov decision process (MDP). Under this formulation, learning the surrogate transition model is equivalent to ffnding an optimal policy of the MDP, which can be effectively addressed using reinforcement learning techniques. Once the model is trained offfine, state estimation can be performed in the online stage using ffltering methods based on the learned dynamics. The proposed framework accommodates a wide range of observation scenarios, including nonlinear and partially observed measurement models. A few numerical examples demonstrate that the proposed method achieves superior accuracy and robustness in high-dimensional settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02302",
        "abs_url": "https://arxiv.org/abs/2511.02302",
        "pdf_url": "https://arxiv.org/pdf/2511.02302",
        "title": "FP8-Flow-MoE: A Casting-Free FP8 Recipe without Double Quantization Error",
        "authors": [
            "Fengjuan Wang",
            "Zhiyi Su",
            "Xingzhu Hu",
            "Cheng Wang",
            "Mou Sun"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Training large Mixture-of-Experts (MoE) models remains computationally prohibitive due to their extreme compute and memory demands. Although low-precision training promises to accelerate computation and reduce memory footprint, existing implementations still rely on BF16-dominated dataflows with frequent quantize-dequantize (Q/DQ) conversions. These redundant casts erode much of FP8's theoretical efficiency. However, naively removing these casts by keeping dataflows entirely in FP8 introduces double quantization error: tensors quantized along different dimensions accumulate inconsistent scaling factors, degrading numerical stability. We propose FP8-Flow-MoE, an FP8 training recipe featuring a quantization-consistent FP8-centric dataflow with a scaling-aware transpose and fused FP8 operators that streamline computation and eliminate explicit cast operations from 12 to 2. Evaluations on a 671B-parameter MoE model demonstrate up to 21\\% higher throughput and 16.5 GB lower memory usage per GPU compared to BF16 and naïve FP8 baselines, while maintaining stable convergence. We provide a plug-and-play FP8 recipe compatible with TransformerEngine and Megatron-LM, which will be open-sourced soon.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02314",
        "abs_url": "https://arxiv.org/abs/2511.02314",
        "pdf_url": "https://arxiv.org/pdf/2511.02314",
        "title": "Large-scale automatic carbon ion treatment planning for head and neck cancers via parallel multi-agent reinforcement learning",
        "authors": [
            "Jueye Zhang",
            "Chao Yang",
            "Youfang Lai",
            "Kai-Wen Li",
            "Wenting Yan",
            "Yunzhou Xia",
            "Haimei Zhang",
            "Jingjing Zhou",
            "Gen Yang",
            "Chen Lin",
            "Tian Li",
            "Yibao Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Medical Physics (physics.med-ph)",
        "abstract": "Head-and-neck cancer (HNC) planning is difficult because multiple critical organs-at-risk (OARs) are close to complex targets. Intensity-modulated carbon-ion therapy (IMCT) offers superior dose conformity and OAR sparing but remains slow due to relative biological effectiveness (RBE) modeling, leading to laborious, experience-based, and often suboptimal tuning of many treatment-planning parameters (TPPs). Recent deep learning (DL) methods are limited by data bias and plan feasibility, while reinforcement learning (RL) struggles to efficiently explore the exponentially large TPP search space. We propose a scalable multi-agent RL (MARL) framework for parallel tuning of 45 TPPs in IMCT. It uses a centralized-training decentralized-execution (CTDE) QMIX backbone with Double DQN, Dueling DQN, and recurrent encoding (DRQN) for stable learning in a high-dimensional, non-stationary environment. To enhance efficiency, we (1) use compact historical DVH vectors as state inputs, (2) apply a linear action-to-value transform mapping small discrete actions to uniform parameter adjustments, and (3) design an absolute, clinically informed piecewise reward aligned with plan scores. A synchronous multi-process worker system interfaces with the PHOENIX TPS for parallel optimization and accelerated data collection. On a head-and-neck dataset (10 training, 10 testing), the method tuned 45 parameters simultaneously and produced plans comparable to or better than expert manual ones (relative plan score: RL $85.93\\pm7.85%$ vs Manual $85.02\\pm6.92%$), with significant (p-value $<$ 0.05) improvements for five OARs. The framework efficiently explores high-dimensional TPP spaces and generates clinically competitive IMCT plans through direct TPS interaction, notably improving OAR sparing.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02331",
        "abs_url": "https://arxiv.org/abs/2511.02331",
        "pdf_url": "https://arxiv.org/pdf/2511.02331",
        "title": "RoME: Domain-Robust Mixture-of-Experts for MILP Solution Prediction across Domains",
        "authors": [
            "Tianle Pu",
            "Zijie Geng",
            "Haoyang Liu",
            "Shixuan Liu",
            "Jie Wang",
            "Li Zeng",
            "Chao Chen",
            "Changjun Fan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Mixed-Integer Linear Programming (MILP) is a fundamental and powerful framework for modeling complex optimization problems across diverse domains. Recently, learning-based methods have shown great promise in accelerating MILP solvers by predicting high-quality solutions. However, most existing approaches are developed and evaluated in single-domain settings, limiting their ability to generalize to unseen problem distributions. This limitation poses a major obstacle to building scalable and general-purpose learning-based solvers. To address this challenge, we introduce RoME, a domain-Robust Mixture-of-Experts framework for predicting MILP solutions across domains. RoME dynamically routes problem instances to specialized experts based on learned task embeddings. The model is trained using a two-level distributionally robust optimization strategy: inter-domain to mitigate global shifts across domains, and intra-domain to enhance local robustness by introducing perturbations on task embeddings. We reveal that cross-domain training not only enhances the model's generalization capability to unseen domains but also improves performance within each individual domain by encouraging the model to capture more general intrinsic combinatorial patterns. Specifically, a single RoME model trained on three domains achieves an average improvement of 67.7% then evaluated on five diverse domains. We further test the pretrained model on MIPLIB in a zero-shot setting, demonstrating its ability to deliver measurable performance gains on challenging real-world instances where existing learning-based approaches often struggle to generalize.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02336",
        "abs_url": "https://arxiv.org/abs/2511.02336",
        "pdf_url": "https://arxiv.org/pdf/2511.02336",
        "title": "Learning A Universal Crime Predictor with Knowledge-guided Hypernetworks",
        "authors": [
            "Fidan Karimova",
            "Tong Chen",
            "Yu Yang",
            "Shazia Sadiq"
        ],
        "comments": "Accepted by ECAI 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Predicting crimes in urban environments is crucial for public safety, yet existing prediction methods often struggle to align the knowledge across diverse cities that vary dramatically in data availability of specific crime types. We propose HYpernetwork-enhanced Spatial Temporal Learning (HYSTL), a framework that can effectively train a unified, stronger crime predictor without assuming identical crime types in different cities' records. In HYSTL, instead of parameterising a dedicated predictor per crime type, a hypernetwork is designed to dynamically generate parameters for the prediction function conditioned on the crime type of interest. To bridge the semantic gap between different crime types, a structured crime knowledge graph is built, where the learned representations of crimes are used as the input to the hypernetwork to facilitate parameter generation. As such, when making predictions for each crime type, the predictor is additionally guided by its intricate association with other relevant crime types. Extensive experiments are performed on two cities with non-overlapping crime types, and the results demonstrate HYSTL outperforms state-of-the-art baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02345",
        "abs_url": "https://arxiv.org/abs/2511.02345",
        "pdf_url": "https://arxiv.org/pdf/2511.02345",
        "title": "Reducing normalizing flow complexity for MCMC preconditioning",
        "authors": [
            "David Nabergoj",
            "Erik Štrumbelj"
        ],
        "comments": "22 pages, 6 figures",
        "subjects": "Machine Learning (cs.LG); Computation (stat.CO); Machine Learning (stat.ML)",
        "abstract": "Preconditioning is a key component of MCMC algorithms that improves sampling efficiency by facilitating exploration of geometrically complex target distributions through an invertible map. While linear preconditioners are often sufficient for moderately complex target distributions, recent work has explored nonlinear preconditioning with invertible neural networks as components of normalizing flows (NFs). However, empirical and theoretical studies show that overparameterized NF preconditioners can degrade sampling efficiency and fit quality. Moreover, existing NF-based approaches do not adapt their architectures to the target distribution. Related work outside of MCMC similarly finds that suitably parameterized NFs can achieve comparable or superior performance with substantially less training time or data. We propose a factorized preconditioning architecture that reduces NF complexity by combining a linear component with a conditional NF, improving adaptability to target geometry. The linear preconditioner is applied to dimensions that are approximately Gaussian, as estimated from warmup samples, while the conditional NF models more complex dimensions. Our method yields significantly better tail samples on two complex synthetic distributions and consistently better performance on a sparse logistic regression posterior across varying likelihood and prior strengths. It also achieves higher effective sample sizes on hierarchical Bayesian model posteriors with weak likelihoods and strong funnel geometries. This approach is particularly relevant for hierarchical Bayesian model analyses with limited data and could inform current theoretical and software strides in neural MCMC design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02354",
        "abs_url": "https://arxiv.org/abs/2511.02354",
        "pdf_url": "https://arxiv.org/pdf/2511.02354",
        "title": "Evolving Graph Learning for Out-of-Distribution Generalization in Non-stationary Environments",
        "authors": [
            "Qingyun Sun",
            "Jiayi Luo",
            "Haonan Yuan",
            "Xingcheng Fu",
            "Hao Peng",
            "Jianxin Li",
            "Philip S. Yu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph neural networks have shown remarkable success in exploiting the spatial and temporal patterns on dynamic graphs. However, existing GNNs exhibit poor generalization ability under distribution shifts, which is inevitable in dynamic scenarios. As dynamic graph generation progresses amid evolving latent non-stationary environments, it is imperative to explore their effects on out-of-distribution (OOD) generalization. This paper proposes a novel Evolving Graph Learning framework for OOD generalization (EvoOOD) by environment-aware invariant pattern recognition. Specifically, we first design an environment sequential variational auto-encoder to model environment evolution and infer the underlying environment distribution. Then, we introduce a mechanism for environment-aware invariant pattern recognition, tailored to address environmental diversification through inferred distributions. Finally, we conduct fine-grained causal interventions on individual nodes using a mixture of instantiated environment samples. This approach helps to distinguish spatio-temporal invariant patterns for OOD prediction, especially in non-stationary environments. Experimental results demonstrate the superiority of EvoGOOD on both real-world and synthetic dynamic datasets under distribution shifts. To the best of our knowledge, it is the first attempt to study the dynamic graph OOD generalization problem from the environment evolution perspective.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02371",
        "abs_url": "https://arxiv.org/abs/2511.02371",
        "pdf_url": "https://arxiv.org/pdf/2511.02371",
        "title": "LUMA-RAG: Lifelong Multimodal Agents with Provably Stable Streaming Alignment",
        "authors": [
            "Rohan Wandre",
            "Yash Gajewar",
            "Namrata Patel",
            "Vivek Dhalkari"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Retrieval-Augmented Generation (RAG) has emerged as the dominant paradigm for grounding large language model outputs in verifiable evidence. However, as modern AI agents transition from static knowledge bases to continuous multimodal streams encompassing text, images, video, and audio, two critical challenges arise: maintaining index freshness without prohibitive re-indexing costs, and preserving cross-modal semantic consistency across heterogeneous embedding spaces. We present LUMA-RAG, a lifelong multimodal agent architecture featuring three key innovations: (i) a streaming, multi-tier memory system that dynamically spills embeddings from a hot HNSW tier to a compressed IVFPQ tier under strict memory budgets; (ii) a streaming CLAP->CLIP alignment bridge that maintains cross-modal consistency through incremental orthogonal Procrustes updates; and (iii) stability-aware retrieval telemetry providing Safe@k guarantees by jointly bounding alignment drift and quantization error. Experiments demonstrate robust text-to-image retrieval (Recall@10 = 0.94), graceful performance degradation under product quantization offloading, and provably stable audio-to-image rankings (Safe@1 = 1.0), establishing LUMA-RAG as a practical framework for production multimodal RAG systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02398",
        "abs_url": "https://arxiv.org/abs/2511.02398",
        "pdf_url": "https://arxiv.org/pdf/2511.02398",
        "title": "A Spatially Informed Gaussian Process UCB Method for Decentralized Coverage Control",
        "authors": [
            "Gennaro Guidone",
            "Luca Monegaglia",
            "Elia Raimondi",
            "Han Wang",
            "Mattia Bianchi",
            "Florian Dörfler"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present a novel decentralized algorithm for coverage control in unknown spatial environments modeled by Gaussian Processes (GPs). To trade-off between exploration and exploitation, each agent autonomously determines its trajectory by minimizing a local cost function. Inspired by the GP-UCB (Upper Confidence Bound for GPs) acquisition function, the proposed cost combines the expected locational cost with a variance-based exploration term, guiding agents toward regions that are both high in predicted density and model uncertainty. Compared to previous work, our algorithm operates in a fully decentralized fashion, relying only on local observations and communication with neighboring agents. In particular, agents periodically update their inducing points using a greedy selection strategy, enabling scalable online GP updates. We demonstrate the effectiveness of our algorithm in simulation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02435",
        "abs_url": "https://arxiv.org/abs/2511.02435",
        "pdf_url": "https://arxiv.org/pdf/2511.02435",
        "title": "Improving Unlearning with Model Updates Probably Aligned with Gradients",
        "authors": [
            "Virgile Dine",
            "Teddy Furon",
            "Charly Faure"
        ],
        "comments": "Accepted to AISec'25 co-located with the 32nd ACM Conference on Computer and Communications Security",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We formulate the machine unlearning problem as a general constrained optimization problem. It unifies the first-order methods from the approximate machine unlearning literature. This paper then introduces the concept of feasible updates as the model's parameter update directions that help with unlearning while not degrading the utility of the initial model. Our design of feasible updates is based on masking, \\ie\\ a careful selection of the model's parameters worth updating. It also takes into account the estimation noise of the gradients when processing each batch of data to offer a statistical guarantee to derive locally feasible updates. The technique can be plugged in, as an add-on, to any first-order approximate unlearning methods. Experiments with computer vision classifiers validate this approach.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02453",
        "abs_url": "https://arxiv.org/abs/2511.02453",
        "pdf_url": "https://arxiv.org/pdf/2511.02453",
        "title": "Accounting for Underspecification in Statistical Claims of Model Superiority",
        "authors": [
            "Thomas Sanchez",
            "Pedro M. Gordaliza",
            "Meritxell Bach Cuadra"
        ],
        "comments": "Medical Imaging meets EurIPS Workshop: MedEurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Image and Video Processing (eess.IV)",
        "abstract": "Machine learning methods are increasingly applied in medical imaging, yet many reported improvements lack statistical robustness: recent works have highlighted that small but significant performance gains are highly likely to be false positives. However, these analyses do not take \\emph{underspecification} into account -- the fact that models achieving similar validation scores may behave differently on unseen data due to random initialization or training dynamics. Here, we extend a recent statistical framework modeling false outperformance claims to include underspecification as an additional variance component. Our simulations demonstrate that even modest seed variability ($\\sim1\\%$) substantially increases the evidence required to support superiority claims. Our findings underscore the need for explicit modeling of training variance when validating medical imaging systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02460",
        "abs_url": "https://arxiv.org/abs/2511.02460",
        "pdf_url": "https://arxiv.org/pdf/2511.02460",
        "title": "SKGE: Spherical Knowledge Graph Embedding with Geometric Regularization",
        "authors": [
            "Xuan-Truong Quan",
            "Xuan-Son Quan",
            "Duc Do Minh",
            "Vinh Nguyen Van"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Knowledge graph embedding (KGE) has become a fundamental technique for representation learning on multi-relational data. Many seminal models, such as TransE, operate in an unbounded Euclidean space, which presents inherent limitations in modeling complex relations and can lead to inefficient training. In this paper, we propose Spherical Knowledge Graph Embedding (SKGE), a model that challenges this paradigm by constraining entity representations to a compact manifold: a hypersphere. SKGE employs a learnable, non-linear Spherization Layer to map entities onto the sphere and interprets relations as a hybrid translate-then-project transformation. Through extensive experiments on three benchmark datasets, FB15k-237, CoDEx-S, and CoDEx-M, we demonstrate that SKGE consistently and significantly outperforms its strong Euclidean counterpart, TransE, particularly on large-scale benchmarks such as FB15k-237 and CoDEx-M, demonstrating the efficacy of the spherical geometric prior. We provide an in-depth analysis to reveal the sources of this advantage, showing that this geometric constraint acts as a powerful regularizer, leading to comprehensive performance gains across all relation types. More fundamentally, we prove that the spherical geometry creates an \"inherently hard negative sampling\" environment, naturally eliminating trivial negatives and forcing the model to learn more robust and semantically coherent representations. Our findings compellingly demonstrate that the choice of manifold is not merely an implementation detail but a fundamental design principle, advocating for geometric priors as a cornerstone for designing the next generation of powerful and stable KGE models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02481",
        "abs_url": "https://arxiv.org/abs/2511.02481",
        "pdf_url": "https://arxiv.org/pdf/2511.02481",
        "title": "NOWS: Neural Operator Warm Starts for Accelerating Iterative Solvers",
        "authors": [
            "Mohammad Sadegh Eshaghi",
            "Cosmin Anitescu",
            "Navid Valizadeh",
            "Yizheng Wang",
            "Xiaoying Zhuang",
            "Timon Rabczuk"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Partial differential equations (PDEs) underpin quantitative descriptions across the physical sciences and engineering, yet high-fidelity simulation remains a major computational bottleneck for many-query, real-time, and design tasks. Data-driven surrogates can be strikingly fast but are often unreliable when applied outside their training distribution. Here we introduce Neural Operator Warm Starts (NOWS), a hybrid strategy that harnesses learned solution operators to accelerate classical iterative solvers by producing high-quality initial guesses for Krylov methods such as conjugate gradient and GMRES. NOWS leaves existing discretizations and solver infrastructures intact, integrating seamlessly with finite-difference, finite-element, isogeometric analysis, finite volume method, etc. Across our benchmarks, the learned initialization consistently reduces iteration counts and end-to-end runtime, resulting in a reduction of the computational time of up to 90 %, while preserving the stability and convergence guarantees of the underlying numerical algorithms. By combining the rapid inference of neural operators with the rigor of traditional solvers, NOWS provides a practical and trustworthy approach to accelerate high-fidelity PDE simulations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02496",
        "abs_url": "https://arxiv.org/abs/2511.02496",
        "pdf_url": "https://arxiv.org/pdf/2511.02496",
        "title": "Variational Geometric Information Bottleneck: Learning the Shape of Understanding",
        "authors": [
            "Ronald Katende"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose a unified information-geometric framework that formalizes understanding in learning as a trade-off between informativeness and geometric simplicity. An encoder phi is evaluated by U(phi) = I(phi(X); Y) - beta * C(phi), where C(phi) penalizes curvature and intrinsic dimensionality, enforcing smooth, low-complexity manifolds. Under mild manifold and regularity assumptions, we derive non-asymptotic bounds showing that generalization error scales with intrinsic dimension while curvature controls approximation stability, directly linking geometry to sample efficiency. To operationalize this theory, we introduce the Variational Geometric Information Bottleneck (V-GIB), a variational estimator that unifies mutual-information compression and curvature regularization through tractable geometric proxies such as the Hutchinson trace, Jacobian norms, and local PCA. Experiments across synthetic manifolds, few-shot settings, and real-world datasets (Fashion-MNIST, CIFAR-10) reveal a robust information-geometry Pareto frontier, stable estimators, and substantial gains in interpretive efficiency. Fractional-data experiments on CIFAR-10 confirm that curvature-aware encoders maintain predictive power under data scarcity, validating the predicted efficiency-curvature law. Overall, V-GIB provides a principled and measurable route to representations that are geometrically coherent, data-efficient, and aligned with human-understandable structure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02531",
        "abs_url": "https://arxiv.org/abs/2511.02531",
        "pdf_url": "https://arxiv.org/pdf/2511.02531",
        "title": "Causal Graph Neural Networks for Healthcare",
        "authors": [
            "Munib Mesinovic",
            "Max Buhlan",
            "Tingting Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Healthcare artificial intelligence systems routinely fail when deployed across institutions, with documented performance drops and perpetuation of discriminatory patterns embedded in historical data. This brittleness stems, in part, from learning statistical associations rather than causal mechanisms. Causal graph neural networks address this triple crisis of distribution shift, discrimination, and inscrutability by combining graph-based representations of biomedical data with causal inference principles to learn invariant mechanisms rather than spurious correlations. This Review examines methodological foundations spanning structural causal models, disentangled causal representation learning, and techniques for interventional prediction and counterfactual reasoning on graphs. We analyse applications demonstrating clinical value across psychiatric diagnosis through brain network analysis, cancer subtyping via multi-omics causal integration, continuous physiological monitoring with mechanistic interpretation, and drug recommendation correcting prescription bias. These advances establish foundations for patient-specific Causal Digital Twins, enabling in silico clinical experimentation, with integration of large language models for hypothesis generation and causal graph neural networks for mechanistic validation. Substantial barriers remain, including computational requirements precluding real-time deployment, validation challenges demanding multi-modal evidence triangulation beyond cross-validation, and risks of causal-washing where methods employ causal terminology without rigorous evidentiary support. We propose tiered frameworks distinguishing causally-inspired architectures from causally-validated discoveries and identify critical research priorities making causal rather than purely associational claims.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02533",
        "abs_url": "https://arxiv.org/abs/2511.02533",
        "pdf_url": "https://arxiv.org/pdf/2511.02533",
        "title": "Rawlsian many-to-one matching with non-linear utility",
        "authors": [
            "Hortence Nana",
            "Andreas Athanasopoulos",
            "Christos Dimitrakakis"
        ],
        "comments": "17 pages, 7 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study a many-to-one matching problem, such as the college admission problem, where each college can admit multiple students. Unlike classical models, colleges evaluate sets of students through non-linear utility functions that capture diversity between them. In this setting, we show that classical stable matchings may fail to exist. To address this, we propose alternative solution concepts based on Rawlsian fairness, aiming to maximize the minimum utility across colleges. We design both deterministic and stochastic algorithms that iteratively improve the outcome of the worst-off college, offering a practical approach to fair allocation when stability cannot be guaranteed.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02536",
        "abs_url": "https://arxiv.org/abs/2511.02536",
        "pdf_url": "https://arxiv.org/pdf/2511.02536",
        "title": "Theoretical Guarantees for Causal Discovery on Large Random Graphs",
        "authors": [
            "Mathieu Chevalley",
            "Arash Mehrjou",
            "Patrick Schwab"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We investigate theoretical guarantees for the false-negative rate (FNR) -- the fraction of true causal edges whose orientation is not recovered, under single-variable random interventions and an $\\epsilon$-interventional faithfulness assumption that accommodates latent confounding. For sparse Erdős--Rényi directed acyclic graphs, where the edge probability scales as $p_e = \\Theta(1/d)$, we show that the FNR concentrates around its mean at rate $O(\\frac{\\log d}{\\sqrt d})$, implying that large deviations above the expected error become exponentially unlikely as dimensionality increases. This concentration ensures that derived upper bounds hold with high probability in large-scale settings. Extending the analysis to generalized Barabási--Albert graphs reveals an even stronger phenomenon: when the degree exponent satisfies $\\gamma > 3$, the deviation width scales as $O(d^{\\beta - \\frac{1}{2}})$ with $\\beta = 1/(\\gamma - 1) < \\frac{1}{2}$, and hence vanishes in the limit. This demonstrates that realistic scale-free topologies intrinsically regularize causal discovery, reducing variability in orientation error. These finite-dimension results provide the first dimension-adaptive, faithfulness-robust guarantees for causal structure recovery, and challenge the intuition that high dimensionality and network heterogeneity necessarily hinder accurate discovery. Our simulation results corroborate these theoretical predictions, showing that the FNR indeed concentrates and often vanishes in practice as dimensionality grows.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02570",
        "abs_url": "https://arxiv.org/abs/2511.02570",
        "pdf_url": "https://arxiv.org/pdf/2511.02570",
        "title": "Dynamic Priors in Bayesian Optimization for Hyperparameter Optimization",
        "authors": [
            "Lukas Fehring",
            "Marcel Wever",
            "Maximilian Spliethöver",
            "Leona Hennig",
            "Henning Wachsmuth",
            "Marius Lindauer"
        ],
        "comments": "9 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Hyperparameter optimization (HPO), for example, based on Bayesian optimization (BO), supports users in designing models well-suited for a given dataset. HPO has proven its effectiveness on several applications, ranging from classical machine learning for tabular data to deep neural networks for computer vision and transformers for natural language processing. However, HPO still sometimes lacks acceptance by machine learning experts due to its black-box nature and limited user control. Addressing this, first approaches have been proposed to initialize BO methods with expert knowledge. However, these approaches do not allow for online steering during the optimization process. In this paper, we introduce a novel method that enables repeated interventions to steer BO via user input, specifying expert knowledge and user preferences at runtime of the HPO process in the form of prior distributions. To this end, we generalize an existing method, $\\pi$BO, preserving theoretical guarantees. We also introduce a misleading prior detection scheme, which allows protection against harmful user inputs. In our experimental evaluation, we demonstrate that our method can effectively incorporate multiple priors, leveraging informative priors, whereas misleading priors are reliably rejected or overcome. Thereby, we achieve competitiveness to unperturbed BO.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02577",
        "abs_url": "https://arxiv.org/abs/2511.02577",
        "pdf_url": "https://arxiv.org/pdf/2511.02577",
        "title": "Directional-Clamp PPO",
        "authors": [
            "Gilad Karpel",
            "Ruida Zhou",
            "Shoham Sabach",
            "Mohammad Ghavamzadeh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Proximal Policy Optimization (PPO) is widely regarded as one of the most successful deep reinforcement learning algorithms, known for its robustness and effectiveness across a range of problems. The PPO objective encourages the importance ratio between the current and behavior policies to move to the \"right\" direction -- starting from importance sampling ratios equal to 1, increasing the ratios for actions with positive advantages and decreasing those with negative advantages. A clipping function is introduced to prevent over-optimization when updating the importance ratio in these \"right\" direction regions. Many PPO variants have been proposed to extend its success, most of which modify the objective's behavior by altering the clipping in the \"right\" direction regions. However, due to randomness in the rollouts and stochasticity of the policy optimization, we observe that the ratios frequently move to the \"wrong\" direction during the PPO optimization. This is a key factor hindering the improvement of PPO, but it has been largely overlooked. To address this, we propose the Directional-Clamp PPO algorithm (DClamp-PPO), which further penalizes the actions going to the strict \"wrong\" direction regions, where the advantage is positive (negative) and importance ratio falls below (above) $1 - \\beta$ ($1+\\beta$), for a tunable parameter $\\beta \\in (0, 1)$. The penalty is by enforcing a steeper loss slope, i.e., a clamp, in those regions. We demonstrate that DClamp-PPO consistently outperforms PPO, as well as its variants, by focusing on modifying the objective's behavior in the \"right\" direction, across various MuJoCo environments, using different random seeds. The proposed method is shown, both theoretically and empirically, to better avoid \"wrong\" direction updates while keeping the importance ratio closer to 1.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02593",
        "abs_url": "https://arxiv.org/abs/2511.02593",
        "pdf_url": "https://arxiv.org/pdf/2511.02593",
        "title": "A Large Language Model for Corporate Credit Scoring",
        "authors": [
            "Chitro Majumdar",
            "Sergio Scandizzo",
            "Ratanlal Mahanta",
            "Avradip Mandal",
            "Swarnendu Bhattacharjee"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce Omega^2, a Large Language Model-driven framework for corporate credit scoring that combines structured financial data with advanced machine learning to improve predictive reliability and interpretability. Our study evaluates Omega^2 on a multi-agency dataset of 7,800 corporate credit ratings drawn from Moody's, Standard & Poor's, Fitch, and Egan-Jones, each containing detailed firm-level financial indicators such as leverage, profitability, and liquidity ratios. The system integrates CatBoost, LightGBM, and XGBoost models optimized through Bayesian search under temporal validation to ensure forward-looking and reproducible results. Omega^2 achieved a mean test AUC above 0.93 across agencies, confirming its ability to generalize across rating systems and maintain temporal consistency. These results show that combining language-based reasoning with quantitative learning creates a transparent and institution-grade foundation for reliable corporate credit-risk assessment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02610",
        "abs_url": "https://arxiv.org/abs/2511.02610",
        "pdf_url": "https://arxiv.org/pdf/2511.02610",
        "title": "Neural Network Interoperability Across Platforms",
        "authors": [
            "Nadia Daoudi",
            "Ivan Alfonso",
            "Jordi Cabot"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Programming Languages (cs.PL)",
        "abstract": "The development of smart systems (i.e., systems enhanced with AI components) has thrived thanks to the rapid advancements in neural networks (NNs). A wide range of libraries and frameworks have consequently emerged to support NN design and implementation. The choice depends on factors such as available functionalities, ease of use, documentation and community support. After adopting a given NN framework, organizations might later choose to switch to another if performance declines, requirements evolve, or new features are introduced. Unfortunately, migrating NN implementations across libraries is challenging due to the lack of migration approaches specifically tailored for NNs. This leads to increased time and effort to modernize NNs, as manual updates are necessary to avoid relying on outdated implementations and ensure compatibility with new features. In this paper, we propose an approach to automatically migrate neural network code across deep learning frameworks. Our method makes use of a pivot NN model to create an abstraction of the NN prior to migration. We validate our approach using two popular NN frameworks, namely PyTorch and TensorFlow. We also discuss the challenges of migrating code between the two frameworks and how they were approached in our method. Experimental evaluation on five NNs shows that our approach successfully migrates their code and produces NNs that are functionally equivalent to the originals. Artefacts from our work are available online.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02614",
        "abs_url": "https://arxiv.org/abs/2511.02614",
        "pdf_url": "https://arxiv.org/pdf/2511.02614",
        "title": "A Non-Adversarial Approach to Idempotent Generative Modelling",
        "authors": [
            "Mohammed Al-Jaff",
            "Giovanni Luca Marchetti",
            "Michael C Welle",
            "Jens Lundell",
            "Mats G. Gustafsson",
            "Gustav Eje Henter",
            "Hossein Azizpour",
            "Danica Kragic"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Idempotent Generative Networks (IGNs) are deep generative models that also function as local data manifold projectors, mapping arbitrary inputs back onto the manifold. They are trained to act as identity operators on the data and as idempotent operators off the data manifold. However, IGNs suffer from mode collapse, mode dropping, and training instability due to their objectives, which contain adversarial components and can cause the model to cover the data manifold only partially -- an issue shared with generative adversarial networks. We introduce Non-Adversarial Idempotent Generative Networks (NAIGNs) to address these issues. Our loss function combines reconstruction with the non-adversarial generative objective of Implicit Maximum Likelihood Estimation (IMLE). This improves on IGN's ability to restore corrupted data and generate new samples that closely match the data distribution. We moreover demonstrate that NAIGNs implicitly learn the distance field to the data manifold, as well as an energy-based model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02644",
        "abs_url": "https://arxiv.org/abs/2511.02644",
        "pdf_url": "https://arxiv.org/pdf/2511.02644",
        "title": "Recursively Enumerably Representable Classes and Computable Versions of the Fundamental Theorem of Statistical Learning",
        "authors": [
            "David Kattermann",
            "Lothar Sebastian Krapp"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computational Complexity (cs.CC); Logic (math.LO)",
        "abstract": "We study computable probably approximately correct (CPAC) learning, where learners are required to be computable functions. It had been previously observed that the Fundamental Theorem of Statistical Learning, which characterizes PAC learnability by finiteness of the Vapnik-Chervonenkis (VC-)dimension, no longer holds in this framework. Recent works recovered analogs of the Fundamental Theorem in the computable setting, for instance by introducing an effective VC-dimension. Guided by this, we investigate the connection between CPAC learning and recursively enumerable representable (RER) classes, whose members can be algorithmically listed. Our results show that the effective VC-dimensions can take arbitrary values above the traditional one, even for RER classes, which creates a whole family of (non-)examples for various notions of CPAC learning. Yet the two dimensions coincide for classes satisfying sufficiently strong notions of CPAC learning. We then observe that CPAC learnability can also be characterized via containment of RER classes that realize the same samples. Furthermore, it is shown that CPAC learnable classes satisfying a unique identification property are necessarily RER. Finally, we establish that agnostic learnability can be guaranteed for RER classes, by considering the relaxed notion of nonuniform CPAC learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02651",
        "abs_url": "https://arxiv.org/abs/2511.02651",
        "pdf_url": "https://arxiv.org/pdf/2511.02651",
        "title": "Apriel-H1: Towards Efficient Enterprise Reasoning Models",
        "authors": [
            "Oleksiy Ostapenko",
            "Luke Kumar",
            "Raymond Li",
            "Denis Kocetkov",
            "Joel Lamy-Poirier",
            "Shruthan Radhakrishna",
            "Soham Parikh",
            "Shambhavi Mishra",
            "Sebastien Paquet",
            "Srinivas Sunkara",
            "Valérie Bécaert",
            "Sathwik Tejaswi Madhusudhan",
            "Torsten Scholak"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Large Language Models (LLMs) achieve remarkable reasoning capabilities through transformer architectures with attention mechanisms. However, transformers suffer from quadratic time and memory complexity in the attention module (MHA) and require caching key-value states during inference, which severely limits throughput and scalability. High inference throughput is critical for agentic tasks, long-context reasoning, efficient deployment under high request loads, and more efficient test-time compute scaling. State Space Models (SSMs) such as Mamba offer a promising alternative with linear inference complexity and a constant memory footprint via recurrent computation with fixed-size hidden states. In this technical report we introduce the Apriel-H1 family of hybrid LLMs that combine transformer attention and SSM sequence mixers for efficient reasoning at 15B model size. These models are obtained through incremental distillation from a pretrained reasoning transformer, Apriel-Nemotron-15B-Thinker, progressively replacing less critical attention layers with linear Mamba blocks. We release multiple post-distillation variants of Apriel-H1-15B-Thinker with different SSM-to-MHA ratios and analyse how reasoning performance degrades as more Mamba layers replace MHA. Additionally, we release a 30/50 hybrid variant of Apriel-H1, further fine-tuned on a supervised dataset of reasoning traces, achieving over 2x higher inference throughput when deployed in the production-ready vLLM environment, with minimal degradation in reasoning performance. This shows that distilled hybrid SSM-Transformer architectures can deliver substantial efficiency gains over the pretrained transformer equivalent without substantially compromising the reasoning quality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02657",
        "abs_url": "https://arxiv.org/abs/2511.02657",
        "pdf_url": "https://arxiv.org/pdf/2511.02657",
        "title": "Nesterov-Accelerated Robust Federated Learning Over Byzantine Adversaries",
        "authors": [
            "Lihan Xu",
            "Yanjie Dong",
            "Gang Wang",
            "Runhao Zeng",
            "Xiaoyi Fan",
            "Xiping Hu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We investigate robust federated learning, where a group of workers collaboratively train a shared model under the orchestration of a central server in the presence of Byzantine adversaries capable of arbitrary and potentially malicious behaviors. To simultaneously enhance communication efficiency and robustness against such adversaries, we propose a Byzantine-resilient Nesterov-Accelerated Federated Learning (Byrd-NAFL) algorithm. Byrd-NAFL seamlessly integrates Nesterov's momentum into the federated learning process alongside Byzantine-resilient aggregation rules to achieve fast and safeguarding convergence against gradient corruption. We establish a finite-time convergence guarantee for Byrd-NAFL under non-convex and smooth loss functions with relaxed assumption on the aggregated gradients. Extensive numerical experiments validate the effectiveness of Byrd-NAFL and demonstrate the superiority over existing benchmarks in terms of convergence speed, accuracy, and resilience to diverse Byzantine attack strategies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02667",
        "abs_url": "https://arxiv.org/abs/2511.02667",
        "pdf_url": "https://arxiv.org/pdf/2511.02667",
        "title": "Scalable Evaluation and Neural Models for Compositional Generalization",
        "authors": [
            "Giacomo Camposampiero",
            "Pietro Barbiero",
            "Michael Hersche",
            "Roger Wattenhofer",
            "Abbas Rahimi"
        ],
        "comments": "Accepted at the Thirty-ninth Annual Conference on Neural Information Processing Systems (NeurIPS), 2025",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Compositional generalization-a key open challenge in modern machine learning-requires models to predict unknown combinations of known concepts. However, assessing compositional generalization remains a fundamental challenge due to the lack of standardized evaluation protocols and the limitations of current benchmarks, which often favor efficiency over rigor. At the same time, general-purpose vision architectures lack the necessary inductive biases, and existing approaches to endow them compromise scalability. As a remedy, this paper introduces: 1) a rigorous evaluation framework that unifies and extends previous approaches while reducing computational requirements from combinatorial to constant; 2) an extensive and modern evaluation on the status of compositional generalization in supervised vision backbones, training more than 5000 models; 3) Attribute Invariant Networks, a class of models establishing a new Pareto frontier in compositional generalization, achieving a 23.43% accuracy improvement over baselines while reducing parameter overhead from 600% to 16% compared to fully disentangled counterparts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02690",
        "abs_url": "https://arxiv.org/abs/2511.02690",
        "pdf_url": "https://arxiv.org/pdf/2511.02690",
        "title": "Curriculum Design for Trajectory-Constrained Agent: Compressing Chain-of-Thought Tokens in LLMs",
        "authors": [
            "Georgios Tzannetos",
            "Parameswaran Kamalaruban",
            "Adish Singla"
        ],
        "comments": "NeurIPS'25 paper",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Training agents to operate under strict constraints during deployment, such as limited resource budgets or stringent safety requirements, presents significant challenges, especially when these constraints render the task complex. In this work, we propose a curriculum learning strategy that gradually tightens constraints during training, enabling the agent to incrementally master the deployment requirements. Inspired by self-paced learning techniques in unconstrained reinforcement learning (RL), our approach facilitates a smoother transition to challenging environments by initially training on simplified versions of the constraints and progressively introducing the full deployment conditions. We provide a theoretical analysis using an RL agent in a binary-tree Markov Decision Process (MDP) to demonstrate that our curriculum strategy can accelerate training relative to a baseline approach that imposes the trajectory constraints from the outset. Moreover, we empirically validate the effectiveness and generality of our method across both RL and large language model (LLM) agents in diverse settings, including a binary-tree MDP, a multi-task navigation domain, and a math reasoning task with two benchmarks. These results highlight the potential of curriculum design in enhancing the efficiency and performance of agents operating under complex trajectory constraints during deployment. Moreover, when applied to LLMs, our strategy enables compression of output chain-of-thought tokens, achieving a substantial inference speedup on consumer hardware, demonstrating its effectiveness for resource-constrained deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02718",
        "abs_url": "https://arxiv.org/abs/2511.02718",
        "pdf_url": "https://arxiv.org/pdf/2511.02718",
        "title": "Does Interpretability of Knowledge Tracing Models Support Teacher Decision Making?",
        "authors": [
            "Adia Khalid",
            "Alina Deriyeva",
            "Benjamin Paassen"
        ],
        "comments": "in press at the Workshop on Epistemics and Decision-Making in AI-Supported Education, AIED 2025",
        "subjects": "Machine Learning (cs.LG); Human-Computer Interaction (cs.HC)",
        "abstract": "Knowledge tracing (KT) models are a crucial basis for pedagogical decision-making, namely which task to select next for a learner and when to stop teaching a particular skill. Given the high stakes of pedagogical decisions, KT models are typically required to be interpretable, in the sense that they should implement an explicit model of human learning and provide explicit estimates of learners' abilities. However, to our knowledge, no study to date has investigated whether the interpretability of KT models actually helps human teachers to make teaching decisions. We address this gap. First, we perform a simulation study to show that, indeed, decisions based on interpretable KT models achieve mastery faster compared to decisions based on a non-interpretable model. Second, we repeat the study but ask $N=12$ human teachers to make the teaching decisions based on the information provided by KT models. As expected, teachers rate interpretable KT models higher in terms of usability and trustworthiness. However, the number of tasks needed until mastery hardly differs between KT models. This suggests that the relationship between model interpretability and teacher decisions is not straightforward: teachers do not solely rely on KT models to make decisions and further research is needed to investigate how learners and teachers actually understand and use KT models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02738",
        "abs_url": "https://arxiv.org/abs/2511.02738",
        "pdf_url": "https://arxiv.org/pdf/2511.02738",
        "title": "Calibration improves detection of mislabeled examples",
        "authors": [
            "Ilies Chibane",
            "Thomas George",
            "Pierre Nodet",
            "Vincent Lemaire"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Mislabeled data is a pervasive issue that undermines the performance of machine learning systems in real-world applications. An effective approach to mitigate this problem is to detect mislabeled instances and subject them to special treatment, such as filtering or relabeling. Automatic mislabeling detection methods typically rely on training a base machine learning model and then probing it for each instance to obtain a trust score that each provided label is genuine or incorrect. The properties of this base model are thus of paramount importance. In this paper, we investigate the impact of calibrating this model. Our empirical results show that using calibration methods improves the accuracy and robustness of mislabeled instance detection, providing a practical and effective solution for industrial applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02757",
        "abs_url": "https://arxiv.org/abs/2511.02757",
        "pdf_url": "https://arxiv.org/pdf/2511.02757",
        "title": "ConMeZO: Adaptive Descent-Direction Sampling for Gradient-Free Finetuning of Large Language Models",
        "authors": [
            "Lejs Deen Behric",
            "Liang Zhang",
            "Bingcong Li",
            "Kiran Koshy Thekumparampil"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "Zeroth-order or derivative-free optimization (MeZO) is an attractive strategy for finetuning large language models (LLMs) because it eliminates the memory overhead of backpropagation. However, it converges slowly due to the inherent curse of dimensionality when searching for descent directions in the high-dimensional parameter space of billion-scale LLMs. We propose ConMeZO, a novel zeroth-order optimizer that accelerates convergence by adaptive directional sampling. Instead of drawing the direction uniformly at random, ConMeZO restricts the sampling to a cone centered around a momentum estimate. This concentrates the search in directions where the true gradient is more likely to lie and thus reduces the effect of high dimensions. We prove that ConMeZO achieves the same worst-case convergence rate as MeZO. Empirically, when finetuning LLMs on natural language tasks, ConMeZO is up to 2X faster than MeZO while retaining the low-memory footprint of zeroth-order methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02762",
        "abs_url": "https://arxiv.org/abs/2511.02762",
        "pdf_url": "https://arxiv.org/pdf/2511.02762",
        "title": "From Solo to Symphony: Orchestrating Multi-Agent Collaboration with Single-Agent Demos",
        "authors": [
            "Xun Wang",
            "Zhuoran Li",
            "Yanshan Lin",
            "Hai Zhong",
            "Longbo Huang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Training a team of agents from scratch in multi-agent reinforcement learning (MARL) is highly inefficient, much like asking beginners to play a symphony together without first practicing solo. Existing methods, such as offline or transferable MARL, can ease this burden, but they still rely on costly multi-agent data, which often becomes the bottleneck. In contrast, solo experiences are far easier to obtain in many important scenarios, e.g., collaborative coding, household cooperation, and search-and-rescue. To unlock their potential, we propose Solo-to-Collaborative RL (SoCo), a framework that transfers solo knowledge into cooperative learning. SoCo first pretrains a shared solo policy from solo demonstrations, then adapts it for cooperation during multi-agent training through a policy fusion mechanism that combines an MoE-like gating selector and an action editor. Experiments across diverse cooperative tasks show that SoCo significantly boosts the training efficiency and performance of backbone algorithms. These results demonstrate that solo demonstrations provide a scalable and effective complement to multi-agent data, making cooperative learning more practical and broadly applicable.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02765",
        "abs_url": "https://arxiv.org/abs/2511.02765",
        "pdf_url": "https://arxiv.org/pdf/2511.02765",
        "title": "VecComp: Vector Computing via MIMO Digital Over-the-Air Computation",
        "authors": [
            "Saeed Razavikia",
            "José Mairton Barros Da Silva Junior",
            "Carlo Fischione"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Recently, the ChannelComp framework has proposed digital over-the-air computation by designing digital modulations that enable the computation of arbitrary functions. Unlike traditional analog over-the-air computation, which is restricted to nomographic functions, ChannelComp enables a broader range of computational tasks while maintaining compatibility with digital communication systems. This framework is intended for applications that favor local information processing over the mere acquisition of data. However, ChannelComp is currently designed for scalar function computation, while numerous data-centric applications necessitate vector-based computations, and it is susceptible to channel fading. In this work, we introduce a generalization of the ChannelComp framework, called VecComp, by integrating ChannelComp with multiple-antenna technology. This generalization not only enables vector function computation but also ensures scalability in the computational complexity, which increases only linearly with the vector dimension. As such, VecComp remains computationally efficient and robust against channel impairments, making it suitable for high-dimensional, data-centric applications. We establish a non-asymptotic upper bound on the mean squared error of VecComp, affirming its computation efficiency under fading channel conditions. Numerical experiments show the effectiveness of VecComp in improving the computation of vector functions and fading compensation over noisy and fading multiple-access channels.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02773",
        "abs_url": "https://arxiv.org/abs/2511.02773",
        "pdf_url": "https://arxiv.org/pdf/2511.02773",
        "title": "Adam Reduces a Unique Form of Sharpness: Theoretical Insights Near the Minimizer Manifold",
        "authors": [
            "Xinghan Li",
            "Haodong Wen",
            "Kaifeng Lyu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Despite the popularity of the Adam optimizer in practice, most theoretical analyses study Stochastic Gradient Descent (SGD) as a proxy for Adam, and little is known about how the solutions found by Adam differ. In this paper, we show that Adam implicitly reduces a unique form of sharpness measure shaped by its adaptive updates, leading to qualitatively different solutions from SGD. More specifically, when the training loss is small, Adam wanders around the manifold of minimizers and takes semi-gradients to minimize this sharpness measure in an adaptive manner, a behavior we rigorously characterize through a continuous-time approximation using stochastic differential equations. We further demonstrate how this behavior differs from that of SGD in a well-studied setting: when training overparameterized models with label noise, SGD has been shown to minimize the trace of the Hessian matrix, $\\tr(\\mH)$, whereas we prove that Adam minimizes $\\tr(\\Diag(\\mH)^{1/2})$ instead. In solving sparse linear regression with diagonal linear networks, this distinction enables Adam to achieve better sparsity and generalization than SGD. Finally, our analysis framework extends beyond Adam to a broad class of adaptive gradient methods, including RMSProp, Adam-mini, Adalayer and Shampoo, and provides a unified perspective on how these adaptive optimizers reduce sharpness, which we hope will offer insights for future optimizer design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02785",
        "abs_url": "https://arxiv.org/abs/2511.02785",
        "pdf_url": "https://arxiv.org/pdf/2511.02785",
        "title": "Enhancing Federated Learning Privacy with QUBO",
        "authors": [
            "Andras Ferenczi",
            "Sutapa Samanta",
            "Dagen Wang",
            "Todd Hodges"
        ],
        "comments": "8 pages, 9 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated learning (FL) is a widely used method for training machine learning (ML) models in a scalable way while preserving privacy (i.e., without centralizing raw data). Prior research shows that the risk of exposing sensitive data increases cumulatively as the number of iterations where a client's updates are included in the aggregated model increase. Attackers can launch membership inference attacks (MIA; deciding whether a sample or client participated), property inference attacks (PIA; inferring attributes of a client's data), and model inversion attacks (MI; reconstructing inputs), thereby inferring client-specific attributes and, in some cases, reconstructing inputs. In this paper, we mitigate risk by substantially reducing per client exposure using a quantum computing-inspired quadratic unconstrained binary optimization (QUBO) formulation that selects a small subset of client updates most relevant for each training round. In this work, we focus on two threat vectors: (i) information leakage by clients during training and (ii) adversaries who can query or obtain the global model. We assume a trusted central server and do not model server compromise. This method also assumes that the server has access to a validation/test set with global data distribution. Experiments on the MNIST dataset with 300 clients in 20 rounds showed a 95.2% per-round and 49% cumulative privacy exposure reduction, with 147 clients' updates never being used during training while maintaining in general the full-aggregation accuracy or even better. The method proved to be efficient at lower scale and more complex model as well. A CINIC-10 dataset-based experiment with 30 clients resulted in 82% per-round privacy improvement and 33% cumulative privacy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02795",
        "abs_url": "https://arxiv.org/abs/2511.02795",
        "pdf_url": "https://arxiv.org/pdf/2511.02795",
        "title": "Can LLMs subtract numbers?",
        "authors": [
            "Mayank Jobanputra",
            "Nils Philipp Walter",
            "Maitrey Mehta",
            "Blerta Veseli",
            "Evan Parker Kelly Chapple",
            "Yifan Wang",
            "Sneha Chetani",
            "Ellie Pavlick",
            "Antonio Vergari",
            "Vera Demberg"
        ],
        "comments": "Work-in-progress; MathNLP non-archival presentation",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "We present a systematic study of subtraction in large language models (LLMs). While prior benchmarks emphasize addition and multiplication, subtraction has received comparatively little attention despite being structurally distinct as a non-commutative operation. We evaluate eight pretrained LLMs spanning four families on addition and subtraction problems. Our experiments reveal that subtraction accuracy lags behind addition by a wide margin. We find that the errors for ($a-b$) are concentrated in cases where ($a<b$). In such cases, LLMs frequently produce the correct magnitude but omit the negative sign. Probing analyses show that LLMs internally encode whether results should be negative, yet this information is often not reflected in generated outputs. We further test well-known techniques such as few-shot learning and instruction-tuning to see if they can improve the LLMs' performance. Our results suggest that while few-shot prompting yields modest gains, the instruction-tuned models achieve near-perfect accuracies in generating the negative sign. Together, these findings provide a clearer characterization of the limitations and recoverability of LLMs' arithmetic capabilities in subtraction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02797",
        "abs_url": "https://arxiv.org/abs/2511.02797",
        "pdf_url": "https://arxiv.org/pdf/2511.02797",
        "title": "Fast, Private, and Protected: Safeguarding Data Privacy and Defending Against Model Poisoning Attacks in Federated Learning",
        "authors": [
            "Nicolas Riccieri Gardin Assumpcao",
            "Leandro Villas"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated Learning (FL) is a distributed training paradigm wherein participants collaborate to build a global model while ensuring the privacy of the involved data, which remains stored on participant devices. However, proposals aiming to ensure such privacy also make it challenging to protect against potential attackers seeking to compromise the training outcome. In this context, we present Fast, Private, and Protected (FPP), a novel approach that aims to safeguard federated training while enabling secure aggregation to preserve data privacy. This is accomplished by evaluating rounds using participants' assessments and enabling training recovery after an attack. FPP also employs a reputation-based mechanism to mitigate the participation of attackers. We created a dockerized environment to validate the performance of FPP compared to other approaches in the literature (FedAvg, Power-of-Choice, and aggregation via Trimmed Mean and Median). Our experiments demonstrate that FPP achieves a rapid convergence rate and can converge even in the presence of malicious participants performing model poisoning attacks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02815",
        "abs_url": "https://arxiv.org/abs/2511.02815",
        "pdf_url": "https://arxiv.org/pdf/2511.02815",
        "title": "Assessing win strength in MLB win prediction models",
        "authors": [
            "Morgan Allen",
            "Paul Savala"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "In Major League Baseball, strategy and planning are major factors in determining the outcome of a game. Previous studies have aided this by building machine learning models for predicting the winning team of any given game. We extend this work by training a comprehensive set of machine learning models using a common dataset. In addition, we relate the win probabilities produced by these models to win strength as measured by score differential. In doing so we show that the most common machine learning models do indeed demonstrate a relationship between predicted win probability and the strength of the win. Finally, we analyze the results of using predicted win probabilities as a decision making mechanism on run-line betting. We demonstrate positive returns when utilizing appropriate betting strategies, and show that naive use of machine learning models for betting lead to significant loses.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02831",
        "abs_url": "https://arxiv.org/abs/2511.02831",
        "pdf_url": "https://arxiv.org/pdf/2511.02831",
        "title": "GeoCrossBench: Cross-Band Generalization for Remote Sensing",
        "authors": [
            "Hakob Tamazyan",
            "Ani Vanyan",
            "Alvard Barseghyan",
            "Anna Khosrovyan",
            "Evan Shelhamer",
            "Hrant Khachatrian"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The number and diversity of remote sensing satellites grows over time, while the vast majority of labeled data comes from older satellites. As the foundation models for Earth observation scale up, the cost of (re-)training to support new satellites grows too, so the generalization capabilities of the models towards new satellites become increasingly important. In this work we introduce GeoCrossBench, an extension of the popular GeoBench benchmark with a new evaluation protocol: it tests the in-distribution performance; generalization to satellites with no band overlap; and generalization to satellites with additional bands with respect to the training set. We also develop a self-supervised extension of ChannelViT, ChiViT, to improve its cross-satellite performance. First, we show that even the best foundation models for remote sensing (DOFA, TerraFM) do not outperform general purpose models like DINOv3 in the in-distribution setting. Second, when generalizing to new satellites with no band overlap, all models suffer 2-4x drop in performance, and ChiViT significantly outperforms the runner-up DINOv3. Third, the performance of all tested models drops on average by 5-25\\% when given additional bands during test time. Finally, we show that fine-tuning just the last linear layer of these models using oracle labels from all bands can get relatively consistent performance across all satellites, highlighting that the benchmark is far from being saturated. We publicly release the code and the datasets to encourage the development of more future-proof remote sensing models with stronger cross-satellite generalization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02833",
        "abs_url": "https://arxiv.org/abs/2511.02833",
        "pdf_url": "https://arxiv.org/pdf/2511.02833",
        "title": "In Good GRACEs: Principled Teacher Selection for Knowledge Distillation",
        "authors": [
            "Abhishek Panigrahi",
            "Bingbin Liu",
            "Sadhika Malladi",
            "Sham Kakade",
            "Surbhi Goel"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Knowledge distillation is an efficient strategy to use data generated by large \"teacher\" language models to train smaller capable \"student\" models, but selecting the optimal teacher for a specific student-task combination requires expensive trial-and-error. We propose a lightweight score called GRACE to quantify how effective a teacher will be for post-training a student model. GRACE measures distributional properties of the student's gradients without access to a verifier, teacher logits, teacher internals, or test data. From an information-theoretic perspective, GRACE connects to leave-one-out stability of gradient-based algorithms, which controls the generalization performance of the distilled students. On GSM8K and MATH, GRACE correlates strongly (up to 86% Spearman correlation) with the performance of the distilled LLaMA and OLMo students. In particular, training a student using the GRACE-selected teacher can improve the performance by up to 7.4% over naively using the best-performing teacher. Further, GRACE can provide guidance on crucial design choices in distillation, including (1) the best temperature to use when generating from the teacher, (2) the best teacher to use given a size constraint, and (3) the best teacher to use within a specific model family. Altogether, our findings demonstrate that GRACE can efficiently and effectively identify a strongly compatible teacher for a given student and provide fine-grained guidance on how to perform distillation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2503.23098",
        "abs_url": "https://arxiv.org/abs/2503.23098",
        "pdf_url": "https://arxiv.org/pdf/2503.23098",
        "title": "Learning phases with Quantum Monte Carlo simulation cell",
        "authors": [
            "Amrita Ghosh",
            "Mugdha Sarkar",
            "Ying-Jer Kao",
            "Pochung Chen"
        ],
        "comments": "20 pages, 22 figures, updated to published version",
        "subjects": "Strongly Correlated Electrons (cond-mat.str-el); Disordered Systems and Neural Networks (cond-mat.dis-nn); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We propose the use of the ``spin-opstring\", derived from Stochastic Series Expansion Quantum Monte Carlo (QMC) simulations as machine learning (ML) input data. It offers a compact, memory-efficient representation of QMC simulation cells, combining the initial state with an operator string that encodes the state's evolution through imaginary time. Using supervised ML, we demonstrate the input's effectiveness in capturing both conventional and topological phase transitions, and in a regression task to predict non-local observables. We also demonstrate the capability of spin-opstring data in transfer learning by training models on one quantum system and successfully predicting on another, as well as showing that models trained on smaller system sizes generalize well to larger ones. Importantly, we illustrate a clear advantage of spin-opstring over conventional spin configurations in the accurate prediction of a quantum phase transition. Finally, we show how the inherent structure of spin-opstring provides an elegant framework for the interpretability of ML predictions. Using two state-of-the-art interpretability techniques, Layer-wise Relevance Propagation and SHapley Additive exPlanations, we show that the ML models learn and rely on physically meaningful features from the input data. Together, these findings establish the spin-opstring as a broadly-applicable and interpretable input format for ML in quantum many-body physics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01868",
        "abs_url": "https://arxiv.org/abs/2511.01868",
        "pdf_url": "https://arxiv.org/pdf/2511.01868",
        "title": "Condition-Invariant fMRI Decoding of Speech Intelligibility with Deep State Space Model",
        "authors": [
            "Ching-Chih Sung",
            "Shuntaro Suzuki",
            "Francis Pingfan Chien",
            "Komei Sugiura",
            "Yu Tsao"
        ],
        "comments": "",
        "subjects": "Neurons and Cognition (q-bio.NC); Machine Learning (cs.LG); Sound (cs.SD); Audio and Speech Processing (eess.AS); Signal Processing (eess.SP)",
        "abstract": "Clarifying the neural basis of speech intelligibility is critical for computational neuroscience and digital speech processing. Recent neuroimaging studies have shown that intelligibility modulates cortical activity beyond simple acoustics, primarily in the superior temporal and inferior frontal gyri. However, previous studies have been largely confined to clean speech, leaving it unclear whether the brain employs condition-invariant neural codes across diverse listening environments. To address this gap, we propose a novel architecture built upon a deep state space model for decoding intelligibility from fMRI signals, specifically tailored to their high-dimensional temporal structure. We present the first attempt to decode intelligibility across acoustically distinct conditions, showing our method significantly outperforms classical approaches. Furthermore, region-wise analysis highlights contributions from auditory, frontal, and parietal regions, and cross-condition transfer indicates the presence of condition-invariant neural codes, thereby advancing understanding of abstract linguistic representations in the brain.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01869",
        "abs_url": "https://arxiv.org/abs/2511.01869",
        "pdf_url": "https://arxiv.org/pdf/2511.01869",
        "title": "BondBERT: What we learn when assigning sentiment in the bond market",
        "authors": [
            "Toby Barter",
            "Zheng Gao",
            "Eva Christodoulaki",
            "Jing Chen",
            "John Cartlidge"
        ],
        "comments": "11 pages, 4 figures",
        "subjects": "Computational Finance (q-fin.CP); Machine Learning (cs.LG)",
        "abstract": "Bond markets respond differently to macroeconomic news compared to equity markets, yet most sentiment models, including FinBERT, are trained primarily on general financial or equity news data. This mismatch is important because bond prices often move in the opposite direction to economic optimism, making general or equity-based sentiment tools potentially misleading. In this paper, we introduce BondBERT, a transformer-based language model fine-tuned on bond-specific news. BondBERT can act as the perception and reasoning component of a financial decision-support agent, providing sentiment signals that integrate with forecasting models. It is a generalisable framework for adapting transformers to low-volatility, domain-inverse sentiment tasks by compiling and cleaning 30,000 UK bond market articles (2018--2025) for training, validation, and testing. We compare BondBERT's sentiment predictions against FinBERT, FinGPT, and Instruct-FinGPT using event-based correlation, up/down accuracy analyses, and LSTM forecasting across ten UK sovereign bonds. We find that BondBERT consistently produces positive correlations with bond returns, achieves higher alignment and forecasting accuracy than the three baseline models, with lower normalised RMSE and higher information coefficient. These results demonstrate that domain-specific sentiment adaptation better captures fixed income dynamics, bridging a gap between NLP advances and bond market analytics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01872",
        "abs_url": "https://arxiv.org/abs/2511.01872",
        "pdf_url": "https://arxiv.org/pdf/2511.01872",
        "title": "Learned Cost Model for Placement on Reconfigurable Dataflow Hardware",
        "authors": [
            "Etash Guha",
            "Tianxiao Jiang",
            "Andrew Deng",
            "Jian Zhang",
            "Muthu Annamalai"
        ],
        "comments": "7 pages, 2 figures, 2 tables, DAC Conference style (2022)",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG); Programming Languages (cs.PL)",
        "abstract": "Mapping a dataflow-graph of an ML model onto a reconfigurable system is difficult, as different mappings have different throughputs and consume resource constraints differently. To solve this, a model to evaluate the throughput of mappings is necessary as measuring throughput completely is expensive. Many use a hand-designed analytical model, relying on proxy features or intuition, introducing error. We provide a Learned Approach that predicts throughput 31%-52% more accurately over a variety of graphs. In addition, our approach shows no accuracy degradation after removing performance annotations. We show that using this approach results in 5.6% faster compiled graphs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01873",
        "abs_url": "https://arxiv.org/abs/2511.01873",
        "pdf_url": "https://arxiv.org/pdf/2511.01873",
        "title": "Effectiveness of High-Dimensional Distance Metrics on Solar Flare Time Series",
        "authors": [
            "Elaina Rohlfing",
            "Azim Ahmadzadeh",
            "V Aparna"
        ],
        "comments": "",
        "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Machine Learning (cs.LG)",
        "abstract": "Solar-flare forecasting has been extensively researched yet remains an open problem. In this paper, we investigate the contributions of elastic distance measures for detecting patterns in the solar-flare dataset, SWAN-SF. We employ a simple $k$-medoids clustering algorithm to evaluate the effectiveness of advanced, high-dimensional distance metrics. Our results show that, despite thorough optimization, none of the elastic distances outperform Euclidean distance by a significant margin. We demonstrate that, although elastic measures have shown promise for univariate time series, when applied to the multivariate time series of SWAN-SF, characterized by the high stochasticity of solar activity, they effectively collapse to Euclidean distance. We conduct thousands of experiments and present both quantitative and qualitative evidence supporting this finding.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01879",
        "abs_url": "https://arxiv.org/abs/2511.01879",
        "pdf_url": "https://arxiv.org/pdf/2511.01879",
        "title": "Affordable EEG, Actionable Insights: An Open Dataset and Evaluation Framework for Epilepsy Patient Stratification",
        "authors": [
            "HM Shadman Tabib",
            "Md. Hasnaen Adil",
            "Ayesha Rahman",
            "Ahmmad Nur Swapnil",
            "Maoyejatun Hasana",
            "Ahmed Hossain Chowdhury",
            "A. B. M. Alim Al Islam"
        ],
        "comments": "",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "Access to clinical multi-channel EEG remains limited in many regions worldwide. We present NEUROSKY-EPI, the first open dataset of single-channel, consumer-grade EEG for epilepsy, collected in a South Asian clinical setting along with rich contextual metadata. To explore its utility, we introduce EmbedCluster, a patient-stratification pipeline that transfers representations from EEGNet models trained on clinical data and enriches them with contextual autoencoder embeddings, followed by unsupervised clustering of patients based on EEG patterns. Results show that low-cost, single-channel data can support meaningful stratification. Beyond algorithmic performance, we emphasize human-centered concerns such as deployability in resource-constrained environments, interpretability for non-specialists, and safeguards for privacy, inclusivity, and bias. By releasing the dataset and code, we aim to catalyze interdisciplinary research across health technology, human-computer interaction, and machine learning, advancing the goal of affordable and actionable EEG-based epilepsy care.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01894",
        "abs_url": "https://arxiv.org/abs/2511.01894",
        "pdf_url": "https://arxiv.org/pdf/2511.01894",
        "title": "LGCC: Enhancing Flow Matching Based Text-Guided Image Editing with Local Gaussian Coupling and Context Consistency",
        "authors": [
            "Fangbing Liu",
            "Pengfei Duan",
            "Wen Li",
            "Yi He"
        ],
        "comments": "",
        "subjects": "Graphics (cs.GR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Recent advancements have demonstrated the great potential of flow matching-based Multimodal Large Language Models (MLLMs) in image editing. However, state-of-the-art works like BAGEL face limitations, including detail degradation, content inconsistency, and inefficiency due to their reliance on random noise initialization. To address these issues, we propose LGCC, a novel framework with two key components: Local Gaussian Noise Coupling (LGNC) and Content Consistency Loss (CCL). LGNC preserves spatial details by modeling target image embeddings and their locally perturbed counterparts as coupled pairs, while CCL ensures semantic alignment between edit instructions and image modifications, preventing unintended content removal. By integrating LGCC with the BAGEL pre-trained model via curriculum learning, we significantly reduce inference steps, improving local detail scores on I2EBench by 1.60% and overall scores by 0.53%. LGCC achieves 3x -- 5x speedup for lightweight editing and 2x for universal editing, requiring only 40% -- 50% of the inference time of BAGEL or Flux. These results demonstrate LGCC's ability to preserve detail, maintain contextual integrity, and enhance inference speed, offering a cost-efficient solution without compromising editing quality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01913",
        "abs_url": "https://arxiv.org/abs/2511.01913",
        "pdf_url": "https://arxiv.org/pdf/2511.01913",
        "title": "Delta-learned force fields for nonbonded interactions: Addressing the strength mismatch between covalent-nonbonded interaction for global models",
        "authors": [
            "Leonardo Cázares-Trejo",
            "Marco Loreto-Silva",
            "Huziel E. Sauceda"
        ],
        "comments": "12 pages, 8 figures",
        "subjects": "Chemical Physics (physics.chem-ph); Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "Noncovalent interactions--vdW dispersion, hydrogen/halogen bonding, ion-$\\pi$, and $\\pi$-stacking--govern structure, dynamics, and emergent phenomena in materials and molecular systems, yet accurately learning them alongside covalent forces remains a core challenge for machine-learned force fields (MLFFs). This challenge is acute for global models that use Coulomb-matrix (CM) descriptors compared under Euclidean/Frobenius metrics in multifragment settings. We show that the mismatch between predominantly covalent force labels and the CM's overrepresentation of intermolecular features biases single-model training and degrades force-field fidelity. To address this, we introduce \\textit{$\\Delta$-sGDML}, a scale-aware formulation within the sGDML framework that explicitly decouples intra- and intermolecular physics by training fragment-specific models alongside a dedicated binding model, then composing them at inference. Across benzene dimers, host-guest complexes (C$_{60}$@buckycatcher, NO$_3^-$@i-corona[6]arene), benzene-water, and benzene-Na$^+$, \\mbox{$\\Delta$-sGDML} delivers consistent gains over a single global model, with fragment-resolved force-error reductions up to \\textbf{75\\%}, without loss of energy accuracy. Furthermore, molecular-dynamics simulations further confirm that the $\\Delta$-model yields a reliable force field for C$_{60}$@buckycatcher, producing stable trajectories across a wide range of temperatures (10-400~K), unlike the single global model, which loses stability above $\\sim$200~K. The method offers a practical route to homogenize per-fragment errors and recover reliable noncovalent physics in global MLFFs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01958",
        "abs_url": "https://arxiv.org/abs/2511.01958",
        "pdf_url": "https://arxiv.org/pdf/2511.01958",
        "title": "Improving Bayesian inference in PTA data analysis: importance nested sampling with Normalizing Flows",
        "authors": [
            "Eleonora Villa",
            "Golam Mohiuddin Shaifullah",
            "Andrea Possenti",
            "Carmelita Carbone"
        ],
        "comments": "37 pages, 7 figures, 3 tables. Submitted to the Astronomy and Computing special issue HPC in Cosmology and Astrophysics",
        "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Machine Learning (cs.LG)",
        "abstract": "We present a detailed study of Bayesian inference workflows for pulsar timing array data with a focus on enhancing efficiency, robustness and speed through the use of normalizing flow-based nested sampling. Building on the Enterprise framework, we integrate the i-nessai sampler and benchmark its performance on realistic, simulated datasets. We analyze its computational scaling and stability, and show that it achieves accurate posteriors and reliable evidence estimates with substantially reduced runtime, by up to three orders of magnitude depending on the dataset configuration, with respect to conventional single-core parallel-tempering MCMC analyses. These results highlight the potential of flow-based nested sampling to accelerate PTA analyses while preserving the quality of the inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01959",
        "abs_url": "https://arxiv.org/abs/2511.01959",
        "pdf_url": "https://arxiv.org/pdf/2511.01959",
        "title": "Addressing prior dependence in hierarchical Bayesian modeling for PTA data analysis II: Noise and SGWB inference through parameter decorrelation",
        "authors": [
            "Eleonora Villa",
            "Luigi D'Amico",
            "Aldo Barca",
            "Fatima Modica Bittordo",
            "Francesco Alì",
            "Massimo Meneghetti",
            "Luca Naso"
        ],
        "comments": "18 pages, 7 figures. Submitted to the Astronomy and Computing special issue HPC in Cosmology and Astrophysics",
        "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Cosmology and Nongalactic Astrophysics (astro-ph.CO); High Energy Astrophysical Phenomena (astro-ph.HE); Machine Learning (cs.LG)",
        "abstract": "Pulsar Timing Arrays provide a powerful framework to measure low-frequency gravitational waves, but accuracy and robustness of the results are challenged by complex noise processes that must be accurately modeled. Standard PTA analyses assign fixed uniform noise priors to each pulsar, an approach that can introduce systematic biases when combining the array. To overcome this limitation, we adopt a hierarchical Bayesian modeling strategy in which noise priors are parametrized by higher-level hyperparameters. We further address the challenge posed by the correlations between hyperparameters and physical noise parameters, focusing on those describing red noise and dispersion measure variations. To decorrelate these quantities, we introduce an orthogonal reparametrization of the hierarchical model implemented with Normalizing Flows. We also employ i-nessai, a flow-guided nested sampler, to efficiently explore the resulting higher-dimensional parameter space. We apply our method to a minimal 3-pulsar case study, performing a simultaneous inference of noise and SGWB parameters. Despite the limited dataset, the results consistently show that the hierarchical treatment constrains the noise parameters more tightly and partially alleviates the red-noise-SGWB degeneracy, while the orthogonal reparametrization further enhances parameter independence without affecting the correlations intrinsic to the power-law modeling of the physical processes involved.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01976",
        "abs_url": "https://arxiv.org/abs/2511.01976",
        "pdf_url": "https://arxiv.org/pdf/2511.01976",
        "title": "Stability of mixed-state phases under weak decoherence",
        "authors": [
            "Yifan F. Zhang",
            "Sarang Gopalakrishnan"
        ],
        "comments": "25 pages, 3 figures",
        "subjects": "Quantum Physics (quant-ph); Statistical Mechanics (cond-mat.stat-mech); Machine Learning (cs.LG); Mathematical Physics (math-ph)",
        "abstract": "We prove that the Gibbs states of classical, and commuting-Pauli, Hamiltonians are stable under weak local decoherence: i.e., we show that the effect of the decoherence can be locally reversed. In particular, our conclusions apply to finite-temperature equilibrium critical points and ordered low-temperature phases. In these systems the unconditional spatio-temporal correlations are long-range, and local (e.g., Metropolis) dynamics exhibits critical slowing down. Nevertheless, our results imply the existence of local \"decoders\" that undo the decoherence, when the decoherence strength is below a critical value. An implication of these results is that thermally stable quantum memories have a threshold against decoherence that remains nonzero as one approaches the critical temperature. Analogously, in diffusion models, stability of data distributions implies the existence of computationally-efficent local denoisers in the late-time generation dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.01982",
        "abs_url": "https://arxiv.org/abs/2511.01982",
        "pdf_url": "https://arxiv.org/pdf/2511.01982",
        "title": "SEAL - A Symmetry EncourAging Loss for High Energy Physics",
        "authors": [
            "Pradyun Hebbar",
            "Thandikire Madula",
            "Vinicius Mikuni",
            "Benjamin Nachman",
            "Nadav Outmezguine",
            "Inbar Savoray"
        ],
        "comments": "",
        "subjects": "High Energy Physics - Phenomenology (hep-ph); Machine Learning (cs.LG); High Energy Physics - Experiment (hep-ex)",
        "abstract": "Physical symmetries provide a strong inductive bias for constructing functions to analyze data. In particular, this bias may improve robustness, data efficiency, and interpretability of machine learning models. However, building machine learning models that explicitly respect symmetries can be difficult due to the dedicated components required. Moreover, real-world experiments may not exactly respect fundamental symmetries at the level of finite granularities and energy thresholds. In this work, we explore an alternative approach to create symmetry-aware machine learning models. We introduce soft constraints that allow the model to decide the importance of added symmetries during the learning process instead of enforcing exact symmetries. We investigate two complementary approaches, one that penalizes the model based on specific transformations of the inputs and one inspired by group theory and infinitesimal transformations of the inputs. Using top quark jet tagging and Lorentz equivariance as examples, we observe that the addition of the soft constraints leads to more robust performance while requiring negligible changes to current state-of-the-art models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02052",
        "abs_url": "https://arxiv.org/abs/2511.02052",
        "pdf_url": "https://arxiv.org/pdf/2511.02052",
        "title": "Solving cold start in news recommendations: a RippleNet-based system for large scale media outlet",
        "authors": [
            "Karol Radziszewski",
            "Michał Szpunar",
            "Piotr Ociepka",
            "Mateusz Buczyński"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "We present a scalable recommender system implementation based on RippleNet, tailored for the media domain with a production deployment in this http URL, one of Poland's largest online media platforms. Our solution addresses the cold-start problem for newly published content by integrating content-based item embeddings into the knowledge propagation mechanism of RippleNet, enabling effective scoring of previously unseen items. The system architecture leverages Amazon SageMaker for distributed training and inference, and Apache Airflow for orchestrating data pipelines and model retraining workflows. To ensure high-quality training data, we constructed a comprehensive golden dataset consisting of user and item features and a separate interaction table, all enabling flexible extensions and integration of new signals.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02053",
        "abs_url": "https://arxiv.org/abs/2511.02053",
        "pdf_url": "https://arxiv.org/pdf/2511.02053",
        "title": "Data-driven Learning of Interaction Laws in Multispecies Particle Systems with Gaussian Processes: Convergence Theory and Applications",
        "authors": [
            "Jinchao Feng",
            "Charles Kulick",
            "Sui Tang"
        ],
        "comments": "40 pages, Appendix 17 pages",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Numerical Analysis (math.NA); Statistics Theory (math.ST)",
        "abstract": "We develop a Gaussian process framework for learning interaction kernels in multi-species interacting particle systems from trajectory data. Such systems provide a canonical setting for multiscale modeling, where simple microscopic interaction rules generate complex macroscopic behaviors. While our earlier work established a Gaussian process approach and convergence theory for single-species systems, and later extended to second-order models with alignment and energy-type interactions, the multi-species setting introduces new challenges: heterogeneous populations interact both within and across species, the number of unknown kernels grows, and asymmetric interactions such as predator-prey dynamics must be accommodated. We formulate the learning problem in a nonparametric Bayesian setting and establish rigorous statistical guarantees. Our analysis shows recoverability of the interaction kernels, provides quantitative error bounds, and proves statistical optimality of posterior estimators, thereby unifying and generalizing previous single-species theory. Numerical experiments confirm the theoretical predictions and demonstrate the effectiveness of the proposed approach, highlighting its advantages over existing kernel-based methods. This work contributes a complete statistical framework for data-driven inference of interaction laws in multi-species systems, advancing the broader multiscale modeling program of connecting microscopic particle dynamics with emergent macroscopic behavior.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02132",
        "abs_url": "https://arxiv.org/abs/2511.02132",
        "pdf_url": "https://arxiv.org/pdf/2511.02132",
        "title": "Optimizing Attention on GPUs by Exploiting GPU Architectural NUMA Effects",
        "authors": [
            "Mansi Choudhary",
            "Karthik Sangaiah",
            "Sonali Singh",
            "Muhammad Osama",
            "Lisa Wu Wills",
            "Ganesh Dasika"
        ],
        "comments": "11 pages, 14 figures",
        "subjects": "Hardware Architecture (cs.AR); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG); Performance (cs.PF)",
        "abstract": "The rise of disaggregated AI GPUs has exposed a critical bottleneck in large-scale attention workloads: non-uniform memory access (NUMA). As multi-chiplet designs become the norm for scaling compute capabilities, memory latency and bandwidth vary sharply across compute regions, undermining the performance of traditional GPU kernel scheduling strategies that assume uniform memory access. We identify how these NUMA effects distort locality in multi-head attention (MHA) and present Swizzled Head-first Mapping, a spatially-aware scheduling strategy that aligns attention heads with GPU NUMA domains to exploit intra-chiplet cache reuse. On AMD's MI300X architecture, our method achieves up to 50% higher performance over state-of-the-art attention algorithms using conventional scheduling techniques and sustains consistently high L2 cache hit rates of 80-97%. These results demonstrate that NUMA-aware scheduling is now fundamental to achieving full efficiency on next-generation disaggregated GPUs, offering a path forward for scalable AI training and inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02137",
        "abs_url": "https://arxiv.org/abs/2511.02137",
        "pdf_url": "https://arxiv.org/pdf/2511.02137",
        "title": "DoFlow: Causal Generative Flows for Interventional and Counterfactual Time-Series Prediction",
        "authors": [
            "Dongze Wu",
            "Feng Qiu",
            "Yao Xie"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "Time-series forecasting increasingly demands not only accurate observational predictions but also causal forecasting under interventional and counterfactual queries in multivariate systems. We present DoFlow, a flow based generative model defined over a causal DAG that delivers coherent observational and interventional predictions, as well as counterfactuals through the natural encoding and decoding mechanism of continuous normalizing flows (CNFs). We also provide a supporting counterfactual recovery result under certain assumptions. Beyond forecasting, DoFlow provides explicit likelihoods of future trajectories, enabling principled anomaly detection. Experiments on synthetic datasets with various causal DAG and real world hydropower and cancer treatment time series show that DoFlow achieves accurate system-wide observational forecasting, enables causal forecasting over interventional and counterfactual queries, and effectively detects anomalies. This work contributes to the broader goal of unifying causal reasoning and generative modeling for complex dynamical systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02164",
        "abs_url": "https://arxiv.org/abs/2511.02164",
        "pdf_url": "https://arxiv.org/pdf/2511.02164",
        "title": "ScenicProver: A Framework for Compositional Probabilistic Verification of Learning-Enabled Systems",
        "authors": [
            "Eric Vin",
            "Kyle A. Miller",
            "Inigo Incer",
            "Sanjit A. Seshia",
            "Daniel J. Fremont"
        ],
        "comments": "26 pages, 4 figures. Full version (including appendices) of a paper submitted to TACAS 2026",
        "subjects": "Logic in Computer Science (cs.LO); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Programming Languages (cs.PL)",
        "abstract": "Full verification of learning-enabled cyber-physical systems (CPS) has long been intractable due to challenges including black-box components and complex real-world environments. Existing tools either provide formal guarantees for limited types of systems or test the system as a monolith, but no general framework exists for compositional analysis of learning-enabled CPS using varied verification techniques over complex real-world environments. This paper introduces ScenicProver, a verification framework that aims to fill this gap. Built upon the Scenic probabilistic programming language, the framework supports: (1) compositional system description with clear component interfaces, ranging from interpretable code to black boxes; (2) assume-guarantee contracts over those components using an extension of Linear Temporal Logic containing arbitrary Scenic expressions; (3) evidence generation through testing, formal proofs via Lean 4 integration, and importing external assumptions; (4) systematic combination of generated evidence using contract operators; and (5) automatic generation of assurance cases tracking the provenance of system-level guarantees. We demonstrate the framework's effectiveness through a case study on an autonomous vehicle's automatic emergency braking system with sensor fusion. By leveraging manufacturer guarantees for radar and laser sensors and focusing testing efforts on uncertain conditions, our approach enables stronger probabilistic guarantees than monolithic testing with the same computational budget.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02168",
        "abs_url": "https://arxiv.org/abs/2511.02168",
        "pdf_url": "https://arxiv.org/pdf/2511.02168",
        "title": "Eliminating Multi-GPU Performance Taxes: A Systems Approach to Efficient Distributed LLMs",
        "authors": [
            "Octavian Alexandru Trifan",
            "Karthik Sangaiah",
            "Muhammad Awad",
            "Muhammad Osama",
            "Sumanth Gudaparthi",
            "Alexandru Nicolau",
            "Alexander Veidenbaum",
            "Ganesh Dasika"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "As large language models (LLMs) continue to scale, their workloads increasingly rely on distributed execution across multiple GPUs. However, the conventional bulk synchronous parallel~(BSP) model used in such settings introduces significant performance inefficiencies. To characterize these bottlenecks, we introduce the ''Three Taxes'' (Bulk Synchronous, Inter-Kernel Data Locality, and Kernel Launch Overhead) as an analytical framework. We propose moving beyond the rigid BSP model to address key inefficiencies in distributed GPU execution. By exploiting libraries like Iris for Triton, we gain access to in-kernel communication primitives that enable the design of novel fine-grained programming patterns, offering greater flexibility and performance than traditional BSP-based approaches. These patterns systematically eliminate the three taxes by creating direct, tile-level producer-consumer pipelines and replacing global barriers with fine-grained dataflow synchronization. Applying this methodology to critical kernels, from the foundational All-Gather + general matrix multiplication operation to the complex Flash Decode algorithm, we observe a 10-20% speedup in end-to-end latency over BSP-based approaches, establishing a more programmable and efficient paradigm for distributed LLM workloads.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02185",
        "abs_url": "https://arxiv.org/abs/2511.02185",
        "pdf_url": "https://arxiv.org/pdf/2511.02185",
        "title": "PrivGNN: High-Performance Secure Inference for Cryptographic Graph Neural Networks",
        "authors": [
            "Fuyi Wang",
            "Zekai Chen",
            "Mingyuan Fan",
            "Jianying Zhou",
            "Lei Pan",
            "Leo Yu Zhang"
        ],
        "comments": "Accepted to FC'25",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Graph neural networks (GNNs) are powerful tools for analyzing and learning from graph-structured (GS) data, facilitating a wide range of services. Deploying such services in privacy-critical cloud environments necessitates the development of secure inference (SI) protocols that safeguard sensitive GS data. However, existing SI solutions largely focus on convolutional models for image and text data, leaving the challenge of securing GNNs and GS data relatively underexplored. In this work, we design, implement, and evaluate $\\sysname$, a lightweight cryptographic scheme for graph-centric inference in the cloud. By hybridizing additive and function secret sharings within secure two-party computation (2PC), $\\sysname$ is carefully designed based on a series of novel 2PC interactive protocols that achieve $1.5\\times \\sim 1.7\\times$ speedups for linear layers and $2\\times \\sim 15\\times$ for non-linear layers over state-of-the-art (SotA) solutions. A thorough theoretical analysis is provided to prove $\\sysname$'s correctness, security, and lightweight nature. Extensive experiments across four datasets demonstrate $\\sysname$'s superior efficiency with $1.3\\times \\sim 4.7\\times$ faster secure predictions while maintaining accuracy comparable to plaintext graph property inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02208",
        "abs_url": "https://arxiv.org/abs/2511.02208",
        "pdf_url": "https://arxiv.org/pdf/2511.02208",
        "title": "Training Proactive and Personalized LLM Agents",
        "authors": [
            "Weiwei Sun",
            "Xuhui Zhou",
            "Weihua Du",
            "Xingyao Wang",
            "Sean Welleck",
            "Graham Neubig",
            "Maarten Sap",
            "Yiming Yang"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "While existing work focuses primarily on task success, we argue that effective real-world agents require optimizing three dimensions: productivity (task completion), proactivity (asking essential questions), and personalization (adapting to diverse user preferences). We introduce UserVille, an interactive environment with LLM-based user simulators enabling diverse, configurable user preferences. Leveraging UserVille, we introduce PPP, a multi-objective reinforcement learning approach that jointly optimizes all three dimensions: Productivity, Proactivity, and Personalization. Experiments on software engineering and deep research tasks show that agents trained with PPP achieve substantial improvements over strong baselines such as GPT-5 (+21.6 on average), demonstrating the ability to ask strategic clarifying questions, adapt to unseen user preferences, and improve task success through better interaction. This work demonstrates that explicitly optimizing for user-centered interaction is critical for building practical and effective AI agents.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02241",
        "abs_url": "https://arxiv.org/abs/2511.02241",
        "pdf_url": "https://arxiv.org/pdf/2511.02241",
        "title": "Structural Plasticity as Active Inference: A Biologically-Inspired Architecture for Homeostatic Control",
        "authors": [
            "Brennen A. Hill"
        ],
        "comments": "",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Neurons and Cognition (q-bio.NC)",
        "abstract": "Traditional neural networks, while powerful, rely on biologically implausible learning mechanisms such as global backpropagation. This paper introduces the Structurally Adaptive Predictive Inference Network (SAPIN), a novel computational model inspired by the principles of active inference and the morphological plasticity observed in biological neural cultures. SAPIN operates on a 2D grid where processing units, or cells, learn by minimizing local prediction errors. The model features two primary, concurrent learning mechanisms: a local, Hebbian-like synaptic plasticity rule based on the temporal difference between a cell's actual activation and its learned expectation, and a structural plasticity mechanism where cells physically migrate across the grid to optimize their information-receptive fields. This dual approach allows the network to learn both how to process information (synaptic weights) and also where to position its computational resources (network topology). We validated the SAPIN model on the classic Cart Pole reinforcement learning benchmark. Our results demonstrate that the architecture can successfully solve the CartPole task, achieving robust performance. The network's intrinsic drive to minimize prediction error and maintain homeostasis was sufficient to discover a stable balancing policy. We also found that while continual learning led to instability, locking the network's parameters after achieving success resulted in a stable policy. When evaluated for 100 episodes post-locking (repeated over 100 successful agents), the locked networks maintained an average 82% success rate.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02248",
        "abs_url": "https://arxiv.org/abs/2511.02248",
        "pdf_url": "https://arxiv.org/pdf/2511.02248",
        "title": "From Models to Operators: Rethinking Autoscaling Granularity for Large Generative Models",
        "authors": [
            "Xingqi Cui",
            "Chieh-Jan Mike Liang",
            "Jiarong Xing",
            "Haoran Qiu"
        ],
        "comments": "16 pages, 13 figures",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "Serving large generative models such as LLMs and multi- modal transformers requires balancing user-facing SLOs (e.g., time-to-first-token, time-between-tokens) with provider goals of efficiency and cost reduction. Existing solutions rely on static provisioning or model-level autoscaling, both of which treat the model as a monolith. This coarse-grained resource management leads to degraded performance or significant resource underutilization due to poor adaptability to dynamic inference traffic that is common online. The root cause of this inefficiency lies in the internal structure of generative models: they are executed as graphs of interconnected operators. Through detailed characterization and systematic analysis, we find that operators are heterogeneous in their compute and memory footprints and exhibit diverse sensitivity to workload and resource factors such as batch size, sequence length, and traffic rate. This heterogeneity suggests that the operator, rather than the entire model, is the right granularity for scaling decisions. We propose an operator-level autoscaling framework, which allocates resources at finer (operator)-granularity, optimizing the scaling, batching, and placement based on individual operator profiles. Evaluated on production-scale traces, our approach preserves SLOs with up to 40% fewer GPUs and 35% less energy, or under fixed resources achieves 1.6x higher throughput with 5% less energy. These results show that the operator, rather than the model, is fundamentally a more effective unit for scaling large generative workloads.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02258",
        "abs_url": "https://arxiv.org/abs/2511.02258",
        "pdf_url": "https://arxiv.org/pdf/2511.02258",
        "title": "Limit Theorems for Stochastic Gradient Descent in High-Dimensional Single-Layer Networks",
        "authors": [
            "Parsa Rangriz"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Probability (math.PR); Statistics Theory (math.ST)",
        "abstract": "This paper studies the high-dimensional scaling limits of online stochastic gradient descent (SGD) for single-layer networks. Building on the seminal work of Saad and Solla, which analyzed the deterministic (ballistic) scaling limits of SGD corresponding to the gradient flow of the population loss, we focus on the critical scaling regime of the step size. Below this critical scale, the effective dynamics are governed by ballistic (ODE) limits, but at the critical scale, new correction term appears that changes the phase diagram. In this regime, near the fixed points, the corresponding diffusive (SDE) limits of the effective dynamics reduces to an Ornstein-Uhlenbeck process under certain conditions. These results highlight how the information exponent controls sample complexity and illustrates the limitations of deterministic scaling limit in capturing the stochastic fluctuations of high-dimensional learning dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02356",
        "abs_url": "https://arxiv.org/abs/2511.02356",
        "pdf_url": "https://arxiv.org/pdf/2511.02356",
        "title": "An Automated Framework for Strategy Discovery, Retrieval, and Evolution in LLM Jailbreak Attacks",
        "authors": [
            "Xu Liu",
            "Yan Chen",
            "Kan Ling",
            "Yichi Zhu",
            "Hengrun Zhang",
            "Guisheng Fan",
            "Huiqun Yu"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "The widespread deployment of Large Language Models (LLMs) as public-facing web services and APIs has made their security a core concern for the web ecosystem. Jailbreak attacks, as one of the significant threats to LLMs, have recently attracted extensive research. In this paper, we reveal a jailbreak strategy which can effectively evade current defense strategies. It can extract valuable information from failed or partially successful attack attempts and contains self-evolution from attack interactions, resulting in sufficient strategy diversity and adaptability. Inspired by continuous learning and modular design principles, we propose ASTRA, a jailbreak framework that autonomously discovers, retrieves, and evolves attack strategies to achieve more efficient and adaptive attacks. To enable this autonomous evolution, we design a closed-loop \"attack-evaluate-distill-reuse\" core mechanism that not only generates attack prompts but also automatically distills and generalizes reusable attack strategies from every interaction. To systematically accumulate and apply this attack knowledge, we introduce a three-tier strategy library that categorizes strategies into Effective, Promising, and Ineffective based on their performance scores. The strategy library not only provides precise guidance for attack generation but also possesses exceptional extensibility and transferability. We conduct extensive experiments under a black-box setting, and the results show that ASTRA achieves an average Attack Success Rate (ASR) of 82.7%, significantly outperforming baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02373",
        "abs_url": "https://arxiv.org/abs/2511.02373",
        "pdf_url": "https://arxiv.org/pdf/2511.02373",
        "title": "A new class of Markov random fields enabling lightweight sampling",
        "authors": [
            "Jean-Baptiste Courbot",
            "Hugo Gangloff",
            "Bruno Colicchio"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Signal Processing (eess.SP); Computation (stat.CO)",
        "abstract": "This work addresses the problem of efficient sampling of Markov random fields (MRF). The sampling of Potts or Ising MRF is most often based on Gibbs sampling, and is thus computationally expensive. We consider in this work how to circumvent this bottleneck through a link with Gaussian Markov Random fields. The latter can be sampled in several cost-effective ways, and we introduce a mapping from real-valued GMRF to discrete-valued MRF. The resulting new class of MRF benefits from a few theoretical properties that validate the new model. Numerical results show the drastic performance gain in terms of computational efficiency, as we sample at least 35x faster than Gibbs sampling using at least 37x less energy, all the while exhibiting empirical properties close to classical MRFs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02395",
        "abs_url": "https://arxiv.org/abs/2511.02395",
        "pdf_url": "https://arxiv.org/pdf/2511.02395",
        "title": "Self-Supervised Moving Object Segmentation of Sparse and Noisy Radar Point Clouds",
        "authors": [
            "Leon Schwarzer",
            "Matthias Zeller",
            "Daniel Casado Herraez",
            "Simon Dierl",
            "Michael Heidingsfeld",
            "Cyrill Stachniss"
        ],
        "comments": "Accepted for publication at IEEE International Conference on Intelligent Transportation Systems (ITSC 2025), 8 pages, 3 figures",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Moving object segmentation is a crucial task for safe and reliable autonomous mobile systems like self-driving cars, improving the reliability and robustness of subsequent tasks like SLAM or path planning. While the segmentation of camera or LiDAR data is widely researched and achieves great results, it often introduces an increased latency by requiring the accumulation of temporal sequences to gain the necessary temporal context. Radar sensors overcome this problem with their ability to provide a direct measurement of a point's Doppler velocity, which can be exploited for single-scan moving object segmentation. However, radar point clouds are often sparse and noisy, making data annotation for use in supervised learning very tedious, time-consuming, and cost-intensive. To overcome this problem, we address the task of self-supervised moving object segmentation of sparse and noisy radar point clouds. We follow a two-step approach of contrastive self-supervised representation learning with subsequent supervised fine-tuning using limited amounts of annotated data. We propose a novel clustering-based contrastive loss function with cluster refinement based on dynamic points removal to pretrain the network to produce motion-aware representations of the radar data. Our method improves label efficiency after fine-tuning, effectively boosting state-of-the-art performance by self-supervised pretraining.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02406",
        "abs_url": "https://arxiv.org/abs/2511.02406",
        "pdf_url": "https://arxiv.org/pdf/2511.02406",
        "title": "Arithmetic Circuits and Neural Networks for Regular Matroids",
        "authors": [
            "Christoph Hertrich",
            "Stefan Kober",
            "Georg Loho"
        ],
        "comments": "",
        "subjects": "Combinatorics (math.CO); Computational Complexity (cs.CC); Discrete Mathematics (cs.DM); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "We prove that there exist uniform $(+,\\times,/)$-circuits of size $O(n^3)$ to compute the basis generating polynomial of regular matroids on $n$ elements. By tropicalization, this implies that there exist uniform $(\\max,+,-)$-circuits and ReLU neural networks of the same size for weighted basis maximization of regular matroids. As a consequence in linear programming theory, we obtain a first example where taking the difference of two extended formulations can be more efficient than the best known individual extended formulation of size $O(n^6)$ by Aprile and Fiorini. Such differences have recently been introduced as virtual extended formulations. The proof of our main result relies on a fine-tuned version of Seymour's decomposition of regular matroids which allows us to identify and maintain graphic substructures to which we can apply a local version of the star-mesh transformation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02452",
        "abs_url": "https://arxiv.org/abs/2511.02452",
        "pdf_url": "https://arxiv.org/pdf/2511.02452",
        "title": "An Adaptive Sampling Framework for Detecting Localized Concept Drift under Label Scarcity",
        "authors": [
            "Junghee Pyeon",
            "Davide Cacciarelli",
            "Kamran Paynabar"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Concept drift and label scarcity are two critical challenges limiting the robustness of predictive models in dynamic industrial environments. Existing drift detection methods often assume global shifts and rely on dense supervision, making them ill-suited for regression tasks with local drifts and limited labels. This paper proposes an adaptive sampling framework that combines residual-based exploration and exploitation with EWMA monitoring to efficiently detect local concept drift under labeling budget constraints. Empirical results on synthetic benchmarks and a case study on electricity market demonstrate superior performance in label efficiency and drift detection accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02487",
        "abs_url": "https://arxiv.org/abs/2511.02487",
        "pdf_url": "https://arxiv.org/pdf/2511.02487",
        "title": "Learning CNF formulas from uniform random solutions in the local lemma regime",
        "authors": [
            "Weiming Feng",
            "Xiongxin Yang",
            "Yixiao Yu",
            "Yiyao Zhang"
        ],
        "comments": "",
        "subjects": "Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study the problem of learning a $n$-variables $k$-CNF formula $\\Phi$ from its i.i.d. uniform random solutions, which is equivalent to learning a Boolean Markov random field (MRF) with $k$-wise hard constraints. Revisiting Valiant's algorithm (Commun. ACM'84), we show that it can exactly learn (1) $k$-CNFs with bounded clause intersection size under Lovász local lemma type conditions, from $O(\\log n)$ samples; and (2) random $k$-CNFs near the satisfiability threshold, from $\\widetilde{O}(n^{\\exp(-\\sqrt{k})})$ samples. These results significantly improve the previous $O(n^k)$ sample complexity. We further establish new information-theoretic lower bounds on sample complexity for both exact and approximate learning from i.i.d. uniform random solutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02526",
        "abs_url": "https://arxiv.org/abs/2511.02526",
        "pdf_url": "https://arxiv.org/pdf/2511.02526",
        "title": "Many-vs-Many Missile Guidance via Virtual Targets",
        "authors": [
            "Marc Schneider",
            "Walter Fichter"
        ],
        "comments": "will be submitted to Journal of Guidance, Control, and Dynamics as Technical Note",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "This paper presents a novel approach to many-vs-many missile guidance using virtual targets (VTs) generated by a Normalizing Flows-based trajectory predictor. Rather than assigning n interceptors directly to m physical targets through conventional weapon target assignment algorithms, we propose a centralized strategy that constructs n VT trajectories representing probabilistic predictions of maneuvering target behavior. Each interceptor is guided toward its assigned VT using Zero-Effort-Miss guidance during midcourse flight, transitioning to Proportional Navigation guidance for terminal interception. This approach treats many-vs-many engagements as many-vs-distribution scenarios, exploiting numerical superiority (n > m) by distributing interceptors across diverse trajectory hypotheses rather than pursuing identical deterministic predictions. Monte Carlo simulations across various target-interceptor configurations (1-6 targets, 1-8 interceptors) demonstrate that the VT method matches or exceeds baseline straight-line prediction performance by 0-4.1% when n = m, with improvements increasing to 5.8-14.4% when n > m. The results confirm that probabilistic VTs enable effective exploitation of numerical superiority, significantly increasing interception probability in many-vs-many scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02558",
        "abs_url": "https://arxiv.org/abs/2511.02558",
        "pdf_url": "https://arxiv.org/pdf/2511.02558",
        "title": "Forecasting Future Anatomies: Longitudianl Brain Mri-to-Mri Prediction",
        "authors": [
            "Ali Farki",
            "Elaheh Moradi",
            "Deepika Koundal",
            "Jussi Tohka"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Neurons and Cognition (q-bio.NC)",
        "abstract": "Predicting future brain state from a baseline magnetic resonance image (MRI) is a central challenge in neuroimaging and has important implications for studying neurodegenerative diseases such as Alzheimer's disease (AD). Most existing approaches predict future cognitive scores or clinical outcomes, such as conversion from mild cognitive impairment to dementia. Instead, here we investigate longitudinal MRI image-to-image prediction that forecasts a participant's entire brain MRI several years into the future, intrinsically modeling complex, spatially distributed neurodegenerative patterns. We implement and evaluate five deep learning architectures (UNet, U2-Net, UNETR, Time-Embedding UNet, and ODE-UNet) on two longitudinal cohorts (ADNI and AIBL). Predicted follow-up MRIs are directly compared with the actual follow-up scans using metrics that capture global similarity and local differences. The best performing models achieve high-fidelity predictions, and all models generalize well to an independent external dataset, demonstrating robust cross-cohort performance. Our results indicate that deep learning can reliably predict participant-specific brain MRI at the voxel level, offering new opportunities for individualized prognosis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02573",
        "abs_url": "https://arxiv.org/abs/2511.02573",
        "pdf_url": "https://arxiv.org/pdf/2511.02573",
        "title": "RIS-Assisted 3D Spherical Splatting for Object Composition Visualization using Detection Transformers",
        "authors": [
            "Anastasios T. Sotiropoulos",
            "Stavros Tsimpoukis",
            "Dimitrios Tyrovolas",
            "Sotiris Ioannidis",
            "George K. Karagiannidis",
            "Christos K. Liaskos"
        ],
        "comments": "Submitted to IEEE ICC 2026",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "The pursuit of immersive and structurally aware multimedia experiences has intensified interest in sensing modalities that reconstruct objects beyond the limits of visible light. Conventional optical pipelines degrade under occlusion or low illumination, motivating the use of radio-frequency (RF) sensing, whose electromagnetic waves penetrate materials and encode both geometric and compositional information. Yet, uncontrolled multipath propagation restricts reconstruction accuracy. Recent advances in Programmable Wireless Environments (PWEs) mitigate this limitation by enabling software-defined manipulation of propagation through Reconfigurable Intelligent Surfaces (RISs), thereby providing controllable illumination diversity. Building on this capability, this work introduces a PWE-driven RF framework for three-dimensional object reconstruction using material-aware spherical primitives. The proposed approach combines RIS-enabled field synthesis with a Detection Transformer (DETR) that infers spatial and material parameters directly from extracted RF features. Simulation results confirm the framework's ability to approximate object geometries and classify material composition with an overall accuracy of 79.35%, marking an initial step toward programmable and physically grounded RF-based 3D object composition visualization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02584",
        "abs_url": "https://arxiv.org/abs/2511.02584",
        "pdf_url": "https://arxiv.org/pdf/2511.02584",
        "title": "Redundancy Maximization as a Principle of Associative Memory Learning",
        "authors": [
            "Mark Blümel",
            "Andreas C. Schneider",
            "Valentin Neuhaus",
            "David A. Ehrlich",
            "Marcel Graetz",
            "Michael Wibral",
            "Abdullah Makkeh",
            "Viola Priesemann"
        ],
        "comments": "21 pages, 8 figures",
        "subjects": "Information Theory (cs.IT); Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE); Computational Physics (physics.comp-ph)",
        "abstract": "Associative memory, traditionally modeled by Hopfield networks, enables the retrieval of previously stored patterns from partial or noisy cues. Yet, the local computational principles which are required to enable this function remain incompletely understood. To formally characterize the local information processing in such systems, we employ a recent extension of information theory - Partial Information Decomposition (PID). PID decomposes the contribution of different inputs to an output into unique information from each input, redundant information across inputs, and synergistic information that emerges from combining different inputs. Applying this framework to individual neurons in classical Hopfield networks we find that below the memory capacity, the information in a neuron's activity is characterized by high redundancy between the external pattern input and the internal recurrent input, while synergy and unique information are close to zero until the memory capacity is surpassed and performance drops steeply. Inspired by this observation, we use redundancy as an information-theoretic learning goal, which is directly optimized for each neuron, dramatically increasing the network's memory capacity to 1.59, a more than tenfold improvement over the 0.14 capacity of classical Hopfield networks and even outperforming recent state-of-the-art implementations of Hopfield networks. Ultimately, this work establishes redundancy maximization as a new design principle for associative memories and opens pathways for new associative memory models based on information-theoretic goals.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02620",
        "abs_url": "https://arxiv.org/abs/2511.02620",
        "pdf_url": "https://arxiv.org/pdf/2511.02620",
        "title": "Verifying LLM Inference to Prevent Model Weight Exfiltration",
        "authors": [
            "Roy Rinberg",
            "Adam Karvonen",
            "Alex Hoover",
            "Daniel Reuter",
            "Keri Warr"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "As large AI models become increasingly valuable assets, the risk of model weight exfiltration from inference servers grows accordingly. An attacker controlling an inference server may exfiltrate model weights by hiding them within ordinary model outputs, a strategy known as steganography. This work investigates how to verify model responses to defend against such attacks and, more broadly, to detect anomalous or buggy behavior during inference. We formalize model exfiltration as a security game, propose a verification framework that can provably mitigate steganographic exfiltration, and specify the trust assumptions associated with our scheme. To enable verification, we characterize valid sources of non-determinism in large language model inference and introduce two practical estimators for them. We evaluate our detection framework on several open-weight models ranging from 3B to 30B parameters. On MOE-Qwen-30B, our detector reduces exfiltratable information to <0.5% with false-positive rate of 0.01%, corresponding to a >200x slowdown for adversaries. Overall, this work further establishes a foundation for defending against model weight exfiltration and demonstrates that strong protection can be achieved with minimal additional cost to inference providers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02625",
        "abs_url": "https://arxiv.org/abs/2511.02625",
        "pdf_url": "https://arxiv.org/pdf/2511.02625",
        "title": "The stability of shallow neural networks on spheres: A sharp spectral analysis",
        "authors": [
            "Xinliang Liu",
            "Tong Mao",
            "Jinchao Xu"
        ],
        "comments": "",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "We present an estimation of the condition numbers of the \\emph{mass} and \\emph{stiffness} matrices arising from shallow ReLU$^k$ neural networks defined on the unit sphere~$\\mathbb{S}^d$. In particular, when $\\{\\theta_j^*\\}_{j=1}^n \\subset \\mathbb{S}^d$ is \\emph{antipodally quasi-uniform}, the condition number is sharp. Indeed, in this case, we obtain sharp asymptotic estimates for the full spectrum of eigenvalues and characterize the structure of the corresponding eigenspaces, showing that the smallest eigenvalues are associated with an eigenbasis of low-degree polynomials while the largest eigenvalues are linked to high-degree polynomials. This spectral analysis establishes a precise correspondence between the approximation power of the network and its numerical stability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02672",
        "abs_url": "https://arxiv.org/abs/2511.02672",
        "pdf_url": "https://arxiv.org/pdf/2511.02672",
        "title": "RL-Aided Cognitive ISAC: Robust Detection and Sensing-Communication Trade-offs",
        "authors": [
            "Adam Umra",
            "Aya M. Ahmed",
            "Aydin Sezgin"
        ],
        "comments": "29 pages, 14 figures. Invited paper, submitted to the EURASIP Journal on Wireless Communications and Networking (JWCN)",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "This paper proposes a reinforcement learning (RL)-aided cognitive framework for massive MIMO-based integrated sensing and communication (ISAC) systems employing a uniform planar array (UPA). The focus is on enhancing radar sensing performance in environments with unknown and dynamic disturbance characteristics. A Wald-type detector is employed for robust target detection under non-Gaussian clutter, while a SARSA-based RL algorithm enables adaptive estimation of target positions without prior environmental knowledge. Based on the RL-derived sensing information, a joint waveform optimization strategy is formulated to balance radar sensing accuracy and downlink communication throughput. The resulting design provides an adaptive trade-off between detection performance and achievable sum rate through an analytically derived closed-form solution. Monte Carlo simulations demonstrate that the proposed cognitive ISAC framework achieves significantly improved detection probability compared to orthogonal and non-learning adaptive baselines, while maintaining competitive communication performance. These results underline the potential of RL-assisted sensing for robust and spectrum-efficient ISAC in next-generation wireless networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02706",
        "abs_url": "https://arxiv.org/abs/2511.02706",
        "pdf_url": "https://arxiv.org/pdf/2511.02706",
        "title": "Optimizing Kernel Discrepancies via Subset Selection",
        "authors": [
            "Deyao Chen",
            "François Clément",
            "Carola Doerr",
            "Nathan Kirk"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Computational Geometry (cs.CG); Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "Kernel discrepancies are a powerful tool for analyzing worst-case errors in quasi-Monte Carlo (QMC) methods. Building on recent advances in optimizing such discrepancy measures, we extend the subset selection problem to the setting of kernel discrepancies, selecting an m-element subset from a large population of size $n \\gg m$. We introduce a novel subset selection algorithm applicable to general kernel discrepancies to efficiently generate low-discrepancy samples from both the uniform distribution on the unit hypercube, the traditional setting of classical QMC, and from more general distributions $F$ with known density functions by employing the kernel Stein discrepancy. We also explore the relationship between the classical $L_2$ star discrepancy and its $L_\\infty$ counterpart.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02748",
        "abs_url": "https://arxiv.org/abs/2511.02748",
        "pdf_url": "https://arxiv.org/pdf/2511.02748",
        "title": "Agentic World Modeling for 6G: Near-Real-Time Generative State-Space Reasoning",
        "authors": [
            "Farhad Rezazadeh",
            "Hatim Chergui",
            "Merouane Debbah",
            "Houbing Song",
            "Dusit Niyato",
            "Lingjia Liu"
        ],
        "comments": "13 Pages, 3 Figures, 4 Tables",
        "subjects": "Networking and Internet Architecture (cs.NI); Machine Learning (cs.LG)",
        "abstract": "We argue that sixth-generation (6G) intelligence is not fluent token prediction but the capacity to imagine and choose -- to simulate future scenarios, weigh trade-offs, and act with calibrated uncertainty. We reframe open radio access network (O-RAN) near-real-time (Near-RT) control via counterfactual dynamics and a world modeling (WM) paradigm that learns an action-conditioned generative state space. This enables quantitative \"what-if\" forecasting beyond large language models (LLMs) as the primary modeling primitive. Actions such as physical resource blocks (PRBs) are treated as first-class control inputs in a causal world model, and both aleatoric and epistemic uncertainty are modeled for prediction and what-if analysis. An agentic, model predictive control (MPC)-based cross-entropy method (CEM) planner operates over short horizons, using prior-mean rollouts within data-driven PRB bounds to maximize a deterministic reward. The model couples multi-scale structured state-space mixtures (MS3M) with a compact stochastic latent to form WM-MS3M, summarizing key performance indicators (KPIs) histories and predicting next-step KPIs under hypothetical PRB sequences. On realistic O-RAN traces, WM-MS3M cuts mean absolute error (MAE) by 1.69% versus MS3M with 32% fewer parameters and similar latency, and achieves 35-80% lower root mean squared error (RMSE) than attention/hybrid baselines with 2.3-4.1x faster inference, enabling rare-event simulation and offline policy screening.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02754",
        "abs_url": "https://arxiv.org/abs/2511.02754",
        "pdf_url": "https://arxiv.org/pdf/2511.02754",
        "title": "DANIEL: A Distributed and Scalable Approach for Global Representation Learning with EHR Applications",
        "authors": [
            "Zebin Wang",
            "Ziming Gan",
            "Weijing Tang",
            "Zongqi Xia",
            "Tianrun Cai",
            "Tianxi Cai",
            "Junwei Lu"
        ],
        "comments": "",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG)",
        "abstract": "Classical probabilistic graphical models face fundamental challenges in modern data environments, which are characterized by high dimensionality, source heterogeneity, and stringent data-sharing constraints. In this work, we revisit the Ising model, a well-established member of the Markov Random Field (MRF) family, and develop a distributed framework that enables scalable and privacy-preserving representation learning from large-scale binary data with inherent low-rank structure. Our approach optimizes a non-convex surrogate loss function via bi-factored gradient descent, offering substantial computational and communication advantages over conventional convex approaches. We evaluate our algorithm on multi-institutional electronic health record (EHR) datasets from 58,248 patients across the University of Pittsburgh Medical Center (UPMC) and Mass General Brigham (MGB), demonstrating superior performance in global representation learning and downstream clinical tasks, including relationship detection, patient phenotyping, and patient clustering. These results highlight a broader potential for statistical inference in federated, high-dimensional settings while addressing the practical challenges of data complexity and multi-institutional integration.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02821",
        "abs_url": "https://arxiv.org/abs/2511.02821",
        "pdf_url": "https://arxiv.org/pdf/2511.02821",
        "title": "Accelerated Frank-Wolfe Algorithms: Complementarity Conditions and Sparsity",
        "authors": [
            "Dan Garber"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "We develop new accelerated first-order algorithms in the Frank-Wolfe (FW) family for minimizing smooth convex functions over compact convex sets, with a focus on two prominent constraint classes: (1) polytopes and (2) matrix domains given by the spectrahedron and the unit nuclear-norm ball. A key technical ingredient is a complementarity condition that captures solution sparsity -- face dimension for polytopes and rank for matrices. We present two algorithms: (1) a purely linear optimization oracle (LOO) method for polytopes that has optimal worst-case first-order (FO) oracle complexity and, aside of a finite \\emph{burn-in} phase and up to a logarithmic factor, has LOO complexity that scales with $r/\\sqrt{\\epsilon}$, where $\\epsilon$ is the target accuracy and $r$ is the solution sparsity $r$ (independently of the ambient dimension), and (2) a hybrid scheme that combines FW with a sparse projection oracle (e.g., low-rank SVDs for matrix domains with low-rank solutions), which also has optimal FO oracle complexity, and after a finite burn-in phase, only requires $O(1/\\sqrt{\\epsilon})$ sparse projections and LOO calls (independently of both the ambient dimension and the rank of optimal solutions). Our results close a gap on how to accelerate recent advancements in linearly-converging FW algorithms for strongly convex optimization, without paying the price of the dimension.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2025-11-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-11-05?abs=True",
        "arxiv_id": "2511.02834",
        "abs_url": "https://arxiv.org/abs/2511.02834",
        "pdf_url": "https://arxiv.org/pdf/2511.02834",
        "title": "Agent-Omni: Test-Time Multimodal Reasoning via Model Coordination for Understanding Anything",
        "authors": [
            "Huawei Lin",
            "Yunzhi Shi",
            "Tong Geng",
            "Weijie Zhao",
            "Wei Wang",
            "Ravender Pal Singh"
        ],
        "comments": "16 pages, 7 figures, 14 tables. Under Review",
        "subjects": "Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Multimodal large language models (MLLMs) have shown strong capabilities but remain limited to fixed modality pairs and require costly fine-tuning with large aligned datasets. Building fully omni-capable models that can integrate text, images, audio, and video remains impractical and lacks robust reasoning support. In this paper, we propose an Agent-Omni framework that coordinates existing foundation models through a master-agent system, enabling flexible multimodal reasoning without retraining. The master agent interprets user intent, delegates subtasks to modality-specific agents, and integrates their outputs into coherent responses. Extensive experiments across text, image, audio, video, and omni benchmarks show that Agent-Omni consistently achieves state-of-the-art performance, particularly on tasks requiring complex cross-modal reasoning. Its agent-based design enables seamless integration of specialized foundation models, ensuring adaptability to diverse inputs while maintaining transparency and interpretability. In addition, the framework is modular and easily extensible, allowing future improvements as stronger models become available. %We release an open-source implementation to support continued research on scalable and reliable omni-modal reasoning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]