[
    {
        "order": 1,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13705",
        "abs_url": "https://arxiv.org/abs/2512.13705",
        "pdf_url": "https://arxiv.org/pdf/2512.13705",
        "title": "Scaling and Transferability of Annealing Strategies in Large Language Model Training",
        "authors": [
            "Siqi Wang",
            "Zhengyu Chen",
            "Teng Xiao",
            "Zheqi Lv",
            "Jinluan Yang",
            "Xunliang Cai",
            "Jingang Wang",
            "Xiaomeng Li"
        ],
        "comments": "Accepted to AAAI 2026 (camera-ready version)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Learning rate scheduling is crucial for training large language models, yet understanding the optimal annealing strategies across different model configurations remains challenging. In this work, we investigate the transferability of annealing dynamics in large language model training and refine a generalized predictive framework for optimizing annealing strategies under the Warmup-Steady-Decay (WSD) scheduler. Our improved framework incorporates training steps, maximum learning rate, and annealing behavior, enabling more efficient optimization of learning rate schedules. Our work provides a practical guidance for selecting optimal annealing strategies without exhaustive hyperparameter searches, demonstrating that smaller models can serve as reliable proxies for optimizing the training dynamics of larger models. We validate our findings on extensive experiments using both Dense and Mixture-of-Experts (MoE) models, demonstrating that optimal annealing ratios follow consistent patterns and can be transferred across different training configurations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13706",
        "abs_url": "https://arxiv.org/abs/2512.13706",
        "pdf_url": "https://arxiv.org/pdf/2512.13706",
        "title": "Mitigating Catastrophic Forgetting in Mathematical Reasoning Finetuning through Mixed Training",
        "authors": [
            "John Graham Reynolds"
        ],
        "comments": "11 pages, 2 figures. Code available at this https URL. Models available at this https URL",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "When finetuning large language models for specialized tasks such as mathematical reasoning, models exhibit catastrophic forgetting, losing previously learned capabilities. We investigate this by finetuning Flan-T5-Base (250M parameters) on the DeepMind Mathematics dataset and measuring forgetting on MultiNLI. Math-only training improves mathematical accuracy from 3.1\\% to 12.0\\% but causes NLI accuracy to collapse from 81.0\\% to 16.5\\%--a 64.5 percentage point drop occurring within the first 1,000 training steps. We propose mixed training strategies that interleave mathematical and NLI examples during training. Our results demonstrate that mixed training completely eliminates catastrophic forgetting while maintaining equivalent mathematical performance: the balanced 1:1 ratio achieves 12.0\\% math accuracy (matching math-only) while preserving 86.2\\% NLI accuracy. We systematically explore mixing ratios from 1:1 to 15:1, finding that even minimal NLI exposure (6.2\\%) provides effective regularization. These findings demonstrate that specialization need not require forgetting general capabilities, with implications for scaling to larger models where mixed training may confer additional benefits beyond forgetting prevention.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13708",
        "abs_url": "https://arxiv.org/abs/2512.13708",
        "pdf_url": "https://arxiv.org/pdf/2512.13708",
        "title": "Variational Physics-Informed Ansatz for Reconstructing Hidden Interaction Networks from Steady States",
        "authors": [
            "Kaiming Luo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The interaction structure of a complex dynamical system governs its collective behavior, yet existing reconstruction methods struggle with nonlinear, heterogeneous, and higher-order couplings, especially when only steady states are observable. We propose a Variational Physics-Informed Ansatz (VPIA) that infers general interaction operators directly from heterogeneous steady-state data. VPIA embeds the steady-state constraints of the dynamics into a differentiable variational representation and reconstructs the underlying couplings by minimizing a physics-derived steady-state residual, without requiring temporal trajectories, derivative estimation, or supervision. Residual sampling combined with natural-gradient optimization enables scalable learning of large and higher-order networks. Across diverse nonlinear systems, VPIA accurately recovers directed, weighted, and multi-body structures under substantial noise, providing a unified and robust framework for physics-constrained inference of complex interaction networks in settings where only snapshot observations are available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13710",
        "abs_url": "https://arxiv.org/abs/2512.13710",
        "pdf_url": "https://arxiv.org/pdf/2512.13710",
        "title": "Predictive Modeling of Flood-Prone Areas Using SAR and Environmental Variables",
        "authors": [
            "Edwin Oluoch Awino",
            "Denis Machanda"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Flooding is one of the most destructive natural hazards worldwide, posing serious risks to ecosystems, infrastructure, and human livelihoods. This study combines Synthetic Aperture Radar (SAR) imagery with environmental and hydrological data to model flood susceptibility in the River Nyando watershed, western Kenya. Sentinel-1 dual-polarization SAR data from the May 2024 flood event were processed to produce a binary flood inventory, which served as training data for machine learning (ML) models. Six conditioning factors -- slope, elevation, aspect, land use/land cover, soil type, and distance from streams -- were integrated with the SAR-derived flood inventory to train four supervised classifiers: Logistic Regression (LR), Classification and Regression Trees (CART), Support Vector Machines (SVM), and Random Forest (RF). Model performance was assessed using accuracy, Cohen's Kappa, and Receiver Operating Characteristic (ROC) analysis. Results indicate that RF achieved the highest predictive performance (accuracy = 0.762; Kappa = 0.480), outperforming LR, CART, and SVM. The RF-based susceptibility map showed that low-lying Kano Plains near Lake Victoria have the highest flood vulnerability, consistent with historical flood records and the impacts of the May 2024 event. These findings demonstrate the value of combining SAR data and ensemble ML methods for flood susceptibility mapping in regions with limited data. The resulting maps offer important insights for disaster risk reduction, land-use planning, and early warning system development.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13711",
        "abs_url": "https://arxiv.org/abs/2512.13711",
        "pdf_url": "https://arxiv.org/pdf/2512.13711",
        "title": "Delete and Retain: Efficient Unlearning for Document Classification",
        "authors": [
            "Aadya Goel",
            "Mayuri Sridhar"
        ],
        "comments": "18 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine unlearning aims to efficiently remove the influence of specific training data from a model without full retraining. While much progress has been made in unlearning for LLMs, document classification models remain relatively understudied. In this paper, we study class-level unlearning for document classifiers and present Hessian Reassignment, a two-step, model-agnostic solution. First, we perform a single influence-style update that subtracts the contribution of all training points from the target class by solving a Hessian-vector system with conjugate gradients, requiring only gradient and Hessian-vector products. Second, in contrast to common unlearning baselines that randomly reclassify deleted-class samples, we enforce a decision-space guarantee via Top-1 classification. On standard text benchmarks, Hessian Reassignment achieves retained-class accuracy close to full retrain-without-class while running orders of magnitude faster. Additionally, it consistently lowers membership-inference advantage on the removed class, measured with pooled multi-shadow attacks. These results demonstrate a practical, principled path to efficient class unlearning in document classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13712",
        "abs_url": "https://arxiv.org/abs/2512.13712",
        "pdf_url": "https://arxiv.org/pdf/2512.13712",
        "title": "Prediction of Respiratory Syncytial Virus-Associated Hospitalizations Using Machine Learning Models Based on Environmental Data",
        "authors": [
            "Eric Guo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP); Methodology (stat.ME)",
        "abstract": "Respiratory syncytial virus (RSV) is a leading cause of hospitalization among young children, with outbreaks strongly influenced by environmental conditions. This study developed a machine learning framework to predict RSV-associated hospitalizations in the United States (U.S.) by integrating wastewater surveillance, meteorological, and air quality data. The dataset combined weekly hospitalization rates, wastewater RSV levels, daily meteorological measurements, and air pollutant concentrations. Classification models, including CART, Random Forest, and Boosting, were trained to predict weekly RSV-associated hospitalization rates classified as \\textit{Low risk}, \\textit{Alert}, and \\textit{Epidemic} levels. The wastewater RSV level was identified as the strongest predictor, followed by meteorological and air quality variables such as temperature, ozone levels, and specific humidity. Notably, the analysis also revealed significantly higher RSV-associated hospitalization rates among Native Americans and Alaska Natives. Further research is needed to better understand the drivers of RSV disparity in these communities to improve prevention strategies. Furthermore, states at high altitudes, characterized by lower surface pressure, showed consistently higher RSV-associated hospitalization rates. These findings highlight the value of combining environmental and community surveillance data to forecast RSV outbreaks, enabling more timely public health interventions and resource allocation. In order to provide accessibility and practical use of the models, we have developed an interactive R Shiny dashboard (this https URL), which allows users to explore RSV-associated hospitalization risk levels across different states, visualize the impact of key predictors, and interactively generate RSV outbreak forecasts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13726",
        "abs_url": "https://arxiv.org/abs/2512.13726",
        "pdf_url": "https://arxiv.org/pdf/2512.13726",
        "title": "Time-Constrained Recommendations: Reinforcement Learning Strategies for E-Commerce",
        "authors": [
            "Sayak Chakrabarty",
            "Souradip Pal"
        ],
        "comments": "9 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Unlike traditional recommendation tasks, finite user time budgets introduce a critical resource constraint, requiring the recommender system to balance item relevance and evaluation cost. For example, in a mobile shopping interface, users interact with recommendations by scrolling, where each scroll triggers a list of items called slate. Users incur an evaluation cost - time spent assessing item features before deciding to click. Highly relevant items having higher evaluation costs may not fit within the user's time budget, affecting engagement. In this position paper, our objective is to evaluate reinforcement learning algorithms that learn patterns in user preferences and time budgets simultaneously, crafting recommendations with higher engagement potential under resource constraints. Our experiments explore the use of reinforcement learning to recommend items for users using Alibaba's Personalized Re-ranking dataset supporting slate optimization in e-commerce contexts. Our contributions include (i) a unified formulation of time-constrained slate recommendation modeled as Markov Decision Processes (MDPs) with budget-aware utilities; (ii) a simulation framework to study policy behavior on re-ranking data; and (iii) empirical evidence that on-policy and off-policy control can improve performance under tight time budgets than traditional contextual bandit-based methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13727",
        "abs_url": "https://arxiv.org/abs/2512.13727",
        "pdf_url": "https://arxiv.org/pdf/2512.13727",
        "title": "RAST-MoE-RL: A Regime-Aware Spatio-Temporal MoE Framework for Deep Reinforcement Learning in Ride-Hailing",
        "authors": [
            "Yuhan Tang",
            "Kangxin Cui",
            "Jung Ho Park",
            "Yibo Zhao",
            "Xuan Jiang",
            "Haoze He",
            "Dingyi Zhuang",
            "Shenhao Wang",
            "Jiangbo Yu",
            "Haris Koutsopoulos",
            "Jinhua Zhao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Ride-hailing platforms face the challenge of balancing passenger waiting times with overall system efficiency under highly uncertain supply-demand conditions. Adaptive delayed matching creates a trade-off between matching and pickup delays by deciding whether to assign drivers immediately or batch requests. Since outcomes accumulate over long horizons with stochastic dynamics, reinforcement learning (RL) is a suitable framework. However, existing approaches often oversimplify traffic dynamics or use shallow encoders that miss complex spatiotemporal patterns. We introduce the Regime-Aware Spatio-Temporal Mixture-of-Experts (RAST-MoE), which formalizes adaptive delayed matching as a regime-aware MDP equipped with a self-attention MoE encoder. Unlike monolithic networks, our experts specialize automatically, improving representation capacity while maintaining computational efficiency. A physics-informed congestion surrogate preserves realistic density-speed feedback, enabling millions of efficient rollouts, while an adaptive reward scheme guards against pathological strategies. With only 12M parameters, our framework outperforms strong baselines. On real-world Uber trajectory data (San Francisco), it improves total reward by over 13%, reducing average matching and pickup delays by 10% and 15% respectively. It demonstrates robustness across unseen demand regimes and stable training. These findings highlight the potential of MoE-enhanced RL for large-scale decision-making with complex spatiotemporal dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13729",
        "abs_url": "https://arxiv.org/abs/2512.13729",
        "pdf_url": "https://arxiv.org/pdf/2512.13729",
        "title": "Composite Classifier-Free Guidance for Multi-Modal Conditioning in Wind Dynamics Super-Resolution",
        "authors": [
            "Jacob Schnell",
            "Aditya Makkar",
            "Gunadi Gani",
            "Aniket Srinivasan Ashok",
            "Darren Lo",
            "Mike Optis",
            "Alexander Wong",
            "Yuhao Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "Various weather modelling problems (e.g., weather forecasting, optimizing turbine placements, etc.) require ample access to high-resolution, highly accurate wind data. Acquiring such high-resolution wind data, however, remains a challenging and expensive endeavour. Traditional reconstruction approaches are typically either cost-effective or accurate, but not both. Deep learning methods, including diffusion models, have been proposed to resolve this trade-off by leveraging advances in natural image super-resolution. Wind data, however, is distinct from natural images, and wind super-resolvers often use upwards of 10 input channels, significantly more than the usual 3-channel RGB inputs in natural images. To better leverage a large number of conditioning variables in diffusion models, we present a generalization of classifier-free guidance (CFG) to multiple conditioning inputs. Our novel composite classifier-free guidance (CCFG) can be dropped into any pre-trained diffusion model trained with standard CFG dropout. We demonstrate that CCFG outputs are higher-fidelity than those from CFG on wind super-resolution tasks. We present WindDM, a diffusion model trained for industrial-scale wind dynamics reconstruction and leveraging CCFG. WindDM achieves state-of-the-art reconstruction quality among deep learning models and costs up to $1000\\times$ less than classical methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13732",
        "abs_url": "https://arxiv.org/abs/2512.13732",
        "pdf_url": "https://arxiv.org/pdf/2512.13732",
        "title": "PIS: A Generalized Physical Inversion Solver for Arbitrary Sparse Observations via Set-Conditioned Diffusion",
        "authors": [
            "Weijie Yang",
            "Xun Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Estimation of PDE-constrained physical parameters from limited indirect measurements is inherently ill-posed, particularly when observations are sparse, irregular, and constrained by real-world sensor placement. This challenge is ubiquitous in fields such as fluid mechanics, seismic inversion, and structural health monitoring. Existing deep and operator-learning models collapse under these conditions: fixed-grid assumptions fail, reconstruction deteriorates sharply, and inversion becomes unreliable with limited robustness and no uncertainty quantification (UQ).We propose the Physical Inversion Solver (PIS), a set-conditioned diffusion framework enabling inversion from truly arbitrary observation sets. PIS employs a Set Transformer-based encoder to handle measurements of any number or geometry, and a cosine-annealed sparsity curriculum for exceptional robustness. An accompanying information-theoretic analysis provides insight into the limits of inversion under extreme sparsity by revealing how observation entropy varies across physical this http URL is evaluated on three challenging PDE inverse problems: Darcy flow, wavefield inversion (Helmholtz), and structural health monitoring (Hooke's Law). Across all tasks and sparsity regimes -- including extreme cases with an observation rate of only $0.29\\%$ -- existing operator-learning baselines fail to reconstruct meaningful fields, often diverging or collapsing this http URL stark contrast, PIS remains stable and accurate, reducing inversion error by $12.28\\%$--$88.73\\%$ and reliably producing calibrated posterior samples. These samples accurately reflect both data scarcity and intrinsic physical ambiguity. These results position PIS as a powerful, general-purpose, and uniquely sparsity-resilient solution for physical inversion under arbitrary and severely undersampled observations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13734",
        "abs_url": "https://arxiv.org/abs/2512.13734",
        "pdf_url": "https://arxiv.org/pdf/2512.13734",
        "title": "Plug-and-Play Parameter-Efficient Tuning of Embeddings for Federated Recommendation",
        "authors": [
            "Haochen Yuan",
            "Yang Zhang",
            "Xiang He",
            "Quan Z. Sheng",
            "Zhongjie Wang"
        ],
        "comments": "This paper has been accepted for publication at AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "With the rise of cloud-edge collaboration, recommendation services are increasingly trained in distributed environments. Federated Recommendation (FR) enables such multi-end collaborative training while preserving privacy by sharing model parameters instead of raw data. However, the large number of parameters, primarily due to the massive item embeddings, significantly hampers communication efficiency. While existing studies mainly focus on improving the efficiency of FR models, they largely overlook the issue of embedding parameter overhead. To address this gap, we propose a FR training framework with Parameter-Efficient Fine-Tuning (PEFT) based embedding designed to reduce the volume of embedding parameters that need to be transmitted. Our approach offers a lightweight, plugin-style solution that can be seamlessly integrated into existing FR methods. In addition to incorporating common PEFT techniques such as LoRA and Hash-based encoding, we explore the use of Residual Quantized Variational Autoencoders (RQ-VAE) as a novel PEFT strategy within our framework. Extensive experiments across various FR model backbones and datasets demonstrate that our framework significantly reduces communication overhead while improving accuracy. The source code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13736",
        "abs_url": "https://arxiv.org/abs/2512.13736",
        "pdf_url": "https://arxiv.org/pdf/2512.13736",
        "title": "TF-MCL: Time-frequency Fusion and Multi-domain Cross-Loss for Self-supervised Depression Detection",
        "authors": [
            "Li-Xuan Zhao",
            "Chen-Yang Xu",
            "Wen-Qiang Li",
            "Bo Wang",
            "Rong-Xing Wei",
            "Qing-Hao Menga"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "In recent years, there has been a notable increase in the use of supervised detection methods of major depressive disorder (MDD) based on electroencephalogram (EEG) signals. However, the process of labeling MDD remains challenging. As a self-supervised learning method, contrastive learning could address the shortcomings of supervised learning methods, which are unduly reliant on labels in the context of MDD detection. However, existing contrastive learning methods are not specifically designed to characterize the time-frequency distribution of EEG signals, and their capacity to acquire low-semantic data representations is still inadequate for MDD detection tasks. To address the problem of contrastive learning method, we propose a time-frequency fusion and multi-domain cross-loss (TF-MCL) model for MDD detection. TF-MCL generates time-frequency hybrid representations through the use of a fusion mapping head (FMH), which efficiently remaps time-frequency domain information to the fusion domain, and thus can effectively enhance the model's capacity to synthesize time-frequency information. Moreover, by optimizing the multi-domain cross-loss function, the distribution of the representations in the time-frequency domain and the fusion domain is reconstructed, thereby improving the model's capacity to acquire fusion representations. We evaluated the performance of our model on the publicly available datasets MODMA and PRED+CT and show a significant improvement in accuracy, outperforming the existing state-of-the-art (SOTA) method by 5.87% and 9.96%, respectively.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13741",
        "abs_url": "https://arxiv.org/abs/2512.13741",
        "pdf_url": "https://arxiv.org/pdf/2512.13741",
        "title": "The Laminar Flow Hypothesis: Detecting Jailbreaks via Semantic Turbulence in Large Language Models",
        "authors": [
            "Md. Hasib Ur Rahman"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "As Large Language Models (LLMs) become ubiquitous, the challenge of securing them against adversarial \"jailbreaking\" attacks has intensified. Current defense strategies often rely on computationally expensive external classifiers or brittle lexical filters, overlooking the intrinsic dynamics of the model's reasoning process. In this work, the Laminar Flow Hypothesis is introduced, which posits that benign inputs induce smooth, gradual transitions in an LLM's high-dimensional latent space, whereas adversarial prompts trigger chaotic, high-variance trajectories - termed Semantic Turbulence - resulting from the internal conflict between safety alignment and instruction-following objectives. This phenomenon is formalized through a novel, zero-shot metric: the variance of layer-wise cosine velocity. Experimental evaluation across diverse small language models reveals a striking diagnostic capability. The RLHF-aligned Qwen2-1.5B exhibits a statistically significant 75.4% increase in turbulence under attack (p less than 0.001), validating the hypothesis of internal conflict. Conversely, Gemma-2B displays a 22.0% decrease in turbulence, characterizing a distinct, low-entropy \"reflex-based\" refusal mechanism. These findings demonstrate that Semantic Turbulence serves not only as a lightweight, real-time jailbreak detector but also as a non-invasive diagnostic tool for categorizing the underlying safety architecture of black-box models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13749",
        "abs_url": "https://arxiv.org/abs/2512.13749",
        "pdf_url": "https://arxiv.org/pdf/2512.13749",
        "title": "Comparative Evaluation of Embedding Representations for Financial News Sentiment Analysis",
        "authors": [
            "Joyjit Roy",
            "Samaresh Kumar Singh"
        ],
        "comments": "6 pages, 2 figures. Submitted to IEEE IATMSI-2026 (Track: AI, IoT and Computer Vision Enabled Technologies)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Financial sentiment analysis enhances market understanding; however, standard natural language processing approaches encounter significant challenges when applied to small datasets. This study provides a comparative evaluation of embedding-based methods for financial news sentiment classification in resource-constrained environments. Word2Vec, GloVe, and sentence transformer representations are evaluated in combination with gradient boosting on manually labeled headlines. Experimental results identify a substantial gap between validation and test performance, with models performing worse than trivial baselines despite strong validation metrics. The analysis demonstrates that pretrained embeddings yield diminishing returns below a critical data sufficiency threshold, and that small validation sets contribute to overfitting during model selection. Practical application is illustrated through weekly sentiment aggregation and narrative summarization for market monitoring workflows. The findings offer empirical evidence that embedding quality alone cannot address fundamental data scarcity in sentiment classification. For practitioners operating with limited resources, the results indicate the need to consider alternative approaches such as few-shot learning, data augmentation, or lexicon-enhanced hybrid methods when labeled samples are scarce.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13758",
        "abs_url": "https://arxiv.org/abs/2512.13758",
        "pdf_url": "https://arxiv.org/pdf/2512.13758",
        "title": "Network-Wide Traffic Volume Estimation from Speed Profiles using a Spatio-Temporal Graph Neural Network with Directed Spatial Attention",
        "authors": [
            "Léo Hein",
            "Giovanni de Nunzio",
            "Giovanni Chierchia",
            "Aurélie Pirayre",
            "Laurent Najman"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Existing traffic volume estimation methods typically address either forecasting traffic on sensor-equipped roads or spatially imputing missing volumes using nearby sensors. While forecasting models generally disregard unmonitored roads by design, spatial imputation methods explicitly address network-wide estimation; yet this approach relies on volume data at inference time, limiting its applicability in sensor-scarce cities. Unlike traffic volume data, probe vehicle speeds and static road attributes are more broadly accessible and support full coverage of road segments in most urban networks. In this work, we present the Hybrid Directed-Attention Spatio-Temporal Graph Neural Network (HDA-STGNN), an inductive deep learning framework designed to tackle the network-wide volume estimation problem. Our approach leverages speed profiles, static road attributes, and road network topology to predict daily traffic volume profiles across all road segments in the network. To evaluate the effectiveness of our approach, we perform extensive ablation studies that demonstrate the model's capacity to capture complex spatio-temporal dependencies and highlight the value of topological information for accurate network-wide traffic volume estimation without relying on volume data at inference time.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13788",
        "abs_url": "https://arxiv.org/abs/2512.13788",
        "pdf_url": "https://arxiv.org/pdf/2512.13788",
        "title": "Constrained Policy Optimization via Sampling-Based Weight-Space Projection",
        "authors": [
            "Shengfan Cao",
            "Francesco Borrelli"
        ],
        "comments": "Submitted to IFAC World Congress 2026",
        "subjects": "Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "Safety-critical learning requires policies that improve performance without leaving the safe operating regime. We study constrained policy learning where model parameters must satisfy unknown, rollout-based safety constraints. We propose SCPO, a sampling-based weight-space projection method that enforces safety directly in parameter space without requiring gradient access to the constraint functions. Our approach constructs a local safe region by combining trajectory rollouts with smoothness bounds that relate parameter changes to shifts in safety metrics. Each gradient update is then projected via a convex SOCP, producing a safe first-order step. We establish a safe-by-induction guarantee: starting from any safe initialization, all intermediate policies remain safe given feasible projections. In constrained control settings with a stabilizing backup policy, our approach further ensures closed-loop stability and enables safe adaptation beyond the conservative backup. On regression with harmful supervision and a constrained double-integrator task with malicious expert, our approach consistently rejects unsafe updates, maintains feasibility throughout training, and achieves meaningful primal objective improvement.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13821",
        "abs_url": "https://arxiv.org/abs/2512.13821",
        "pdf_url": "https://arxiv.org/pdf/2512.13821",
        "title": "The Double Life of Code World Models: Provably Unmasking Malicious Behavior Through Execution Traces",
        "authors": [
            "Subramanyam Sahoo",
            "Jared Junkin"
        ],
        "comments": "13 Pages, Initial Work on AI Control. A Preprint",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) increasingly generate code with minimal human oversight, raising critical concerns about backdoor injection and malicious behavior. We present Cross-Trace Verification Protocol (CTVP), a novel AI control framework that verifies untrusted code-generating models through semantic orbit analysis. Rather than directly executing potentially malicious code, CTVP leverages the model's own predictions of execution traces across semantically equivalent program transformations. By analyzing consistency patterns in these predicted traces, we detect behavioral anomalies indicative of backdoors. Our approach introduces the Adversarial Robustness Quotient (ARQ), which quantifies the computational cost of verification relative to baseline generation, demonstrating exponential growth with orbit size. Theoretical analysis establishes information-theoretic bounds showing non-gamifiability -- adversaries cannot improve through training due to fundamental space complexity constraints. This work demonstrates that semantic orbit analysis provides a scalable, theoretically grounded approach to AI control for code generation tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13837",
        "abs_url": "https://arxiv.org/abs/2512.13837",
        "pdf_url": "https://arxiv.org/pdf/2512.13837",
        "title": "Explainable reinforcement learning from human feedback to improve alignment",
        "authors": [
            "Shicheng Liu",
            "Siyuan Xu",
            "Wenjie Qiu",
            "Hangfan Zhang",
            "Minghui Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "A common and effective strategy for humans to improve an unsatisfactory outcome in daily life is to find a cause of this outcome and correct the cause. In this paper, we investigate whether this human improvement strategy can be applied to improving reinforcement learning from human feedback (RLHF) for alignment of language models (LMs). In particular, it is observed in the literature that LMs tuned by RLHF can still output unsatisfactory responses. This paper proposes a method to improve the unsatisfactory responses by correcting their causes. Our method has two parts. The first part proposes a post-hoc explanation method to explain why an unsatisfactory response is generated to a prompt by identifying the training data that lead to this response. We formulate this problem as a constrained combinatorial optimization problem where the objective is to find a set of training data closest to this prompt-response pair in a feature representation space, and the constraint is that the prompt-response pair can be decomposed as a convex combination of this set of training data in the feature space. We propose an efficient iterative data selection algorithm to solve this problem. The second part proposes an unlearning method that improves unsatisfactory responses to some prompts by unlearning the training data that lead to these unsatisfactory responses and, meanwhile, does not significantly degrade satisfactory responses to other prompts. Experimental results demonstrate that our algorithm can improve RLHF.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13852",
        "abs_url": "https://arxiv.org/abs/2512.13852",
        "pdf_url": "https://arxiv.org/pdf/2512.13852",
        "title": "Topologically-Stabilized Graph Neural Networks: Empirical Robustness Across Domains",
        "authors": [
            "Jelena Losic"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Social and Information Networks (cs.SI)",
        "abstract": "Graph Neural Networks (GNNs) have become the standard for graph representation learning but remain vulnerable to structural perturbations. We propose a novel framework that integrates persistent homology features with stability regularization to enhance robustness. Building on the stability theorems of persistent homology \\cite{cohen2007stability}, our method combines GIN architectures with multi-scale topological features extracted from persistence images, enforced by Hiraoka-Kusano-inspired stability constraints. Across six diverse datasets spanning biochemical, social, and collaboration networks , our approach demonstrates exceptional robustness to edge perturbations while maintaining competitive accuracy. Notably, we observe minimal performance degradation (0-4\\% on most datasets) under perturbation, significantly outperforming baseline stability. Our work provides both a theoretically-grounded and empirically-validated approach to robust graph learning that aligns with recent advances in topological regularization",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13853",
        "abs_url": "https://arxiv.org/abs/2512.13853",
        "pdf_url": "https://arxiv.org/pdf/2512.13853",
        "title": "Dropout Neural Network Training Viewed from a Percolation Perspective",
        "authors": [
            "Finley Devlin",
            "Jaron Sanders"
        ],
        "comments": "22 pages, 14 figures",
        "subjects": "Machine Learning (cs.LG); Statistical Mechanics (cond-mat.stat-mech); Probability (math.PR); Machine Learning (stat.ML)",
        "abstract": "In this work, we investigate the existence and effect of percolation in training deep Neural Networks (NNs) with dropout. Dropout methods are regularisation techniques for training NNs, first introduced by G. Hinton et al. (2012). These methods temporarily remove connections in the NN, randomly at each stage of training, and update the remaining subnetwork with Stochastic Gradient Descent (SGD). The process of removing connections from a network at random is similar to percolation, a paradigm model of statistical physics. If dropout were to remove enough connections such that there is no path between the input and output of the NN, then the NN could not make predictions informed by the data. We study new percolation models that mimic dropout in NNs and characterise the relationship between network topology and this path problem. The theory shows the existence of a percolative effect in dropout. We also show that this percolative effect can cause a breakdown when training NNs without biases with dropout; and we argue heuristically that this breakdown extends to NNs with biases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13872",
        "abs_url": "https://arxiv.org/abs/2512.13872",
        "pdf_url": "https://arxiv.org/pdf/2512.13872",
        "title": "Measuring Uncertainty Calibration",
        "authors": [
            "Kamil Ciosek",
            "Nicolò Felicioni",
            "Sina Ghiassian",
            "Juan Elenter Litwin",
            "Francesco Tonolini",
            "David Gustaffson",
            "Eva Garcia Martin",
            "Carmen Barcena Gonzales",
            "Raphaëlle Bertrand-Lalo"
        ],
        "comments": "28 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We make two contributions to the problem of estimating the $L_1$ calibration error of a binary classifier from a finite dataset. First, we provide an upper bound for any classifier where the calibration function has bounded variation. Second, we provide a method of modifying any classifier so that its calibration error can be upper bounded efficiently without significantly impacting classifier performance and without any restrictive assumptions. All our results are non-asymptotic and distribution-free. We conclude by providing advice on how to measure calibration error in practice. Our methods yield practical procedures that can be run on real-world datasets with modest overhead.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13886",
        "abs_url": "https://arxiv.org/abs/2512.13886",
        "pdf_url": "https://arxiv.org/pdf/2512.13886",
        "title": "OPTIMA: Optimal One-shot Pruning for LLMs via Quadratic Programming Reconstruction",
        "authors": [
            "Mohammad Mozaffari",
            "Samuel Kushnir",
            "Maryam Mehri Dehnavi",
            "Amir Yazdanbakhsh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Performance (cs.PF)",
        "abstract": "Post-training model pruning is a promising solution, yet it faces a trade-off: simple heuristics that zero weights are fast but degrade accuracy, while principled joint optimization methods recover accuracy but are computationally infeasible at modern scale. One-shot methods such as SparseGPT offer a practical trade-off in optimality by applying efficient, approximate heuristic weight updates. To close this gap, we introduce OPTIMA, a practical one-shot post-training pruning method that balances accuracy and scalability. OPTIMA casts layer-wise weight reconstruction after mask selection as independent, row-wise Quadratic Programs (QPs) that share a common layer Hessian. Solving these QPs yields the per-row globally optimal update with respect to the reconstruction objective given the estimated Hessian. The shared-Hessian structure makes the problem highly amenable to batching on accelerators. We implement an accelerator-friendly QP solver that accumulates one Hessian per layer and solves many small QPs in parallel, enabling one-shot post-training pruning at scale on a single accelerator without fine-tuning. OPTIMA integrates with existing mask selectors and consistently improves zero-shot performance across multiple LLM families and sparsity regimes, yielding up to 3.97% absolute accuracy improvement. On an NVIDIA H100, OPTIMA prunes a 8B-parameter transformer end-to-end in 40 hours with 60GB peak memory. Together, these results set a new state-of-the-art accuracy-efficiency trade-offs for one-shot post-training pruning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13898",
        "abs_url": "https://arxiv.org/abs/2512.13898",
        "pdf_url": "https://arxiv.org/pdf/2512.13898",
        "title": "Let's (not) just put things in Context: Test-Time Training for Long-Context LLMs",
        "authors": [
            "Rachit Bansal",
            "Aston Zhang",
            "Rishabh Tiwari",
            "Lovish Madaan",
            "Sai Surya Duvvuri",
            "Devvrit Khatri",
            "David Brandfonbrener",
            "David Alvarez-Melis",
            "Prajjwal Bhargava",
            "Mihir Sanjay Kale",
            "Samy Jelassi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Progress on training and architecture strategies has enabled LLMs with millions of tokens in context length. However, empirical evidence suggests that such long-context LLMs can consume far more text than they can reliably use. On the other hand, it has been shown that inference-time compute can be used to scale performance of LLMs, often by generating thinking tokens, on challenging tasks involving multi-step reasoning. Through controlled experiments on sandbox long-context tasks, we find that such inference-time strategies show rapidly diminishing returns and fail at long context. We attribute these failures to score dilution, a phenomenon inherent to static self-attention. Further, we show that current inference-time strategies cannot retrieve relevant long-context signals under certain conditions. We propose a simple method that, through targeted gradient updates on the given context, provably overcomes limitations of static self-attention. We find that this shift in how inference-time compute is spent leads to consistently large performance improvements across models and long-context benchmarks. Our method leads to large 12.6 and 14.1 percentage point improvements for Qwen3-4B on average across subsets of LongBench-v2 and ZeroScrolls benchmarks. The takeaway is practical: for long context, a small amount of context-specific training is a better use of inference compute than current inference-time scaling strategies like producing more thinking tokens.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13913",
        "abs_url": "https://arxiv.org/abs/2512.13913",
        "pdf_url": "https://arxiv.org/pdf/2512.13913",
        "title": "Capturing reduced-order quantum many-body dynamics out of equilibrium via neural ordinary differential equations",
        "authors": [
            "Patrick Egenlauf",
            "Iva Březinová",
            "Sabine Andergassen",
            "Miriam Klopotek"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Statistical Mechanics (cond-mat.stat-mech); Quantum Physics (quant-ph)",
        "abstract": "Out-of-equilibrium quantum many-body systems exhibit rapid correlation buildup that underlies many emerging phenomena. Exact wave-function methods to describe this scale exponentially with particle number; simpler mean-field approaches neglect essential two-particle correlations. The time-dependent two-particle reduced density matrix (TD2RDM) formalism offers a middle ground by propagating the two-particle reduced density matrix (2RDM) and closing the BBGKY hierarchy with a reconstruction of the three-particle cumulant. But the validity and existence of time-local reconstruction functionals ignoring memory effects remain unclear across different dynamical regimes. We show that a neural ODE model trained on exact 2RDM data (no dimensionality reduction) can reproduce its dynamics without any explicit three-particle information -- but only in parameter regions where the Pearson correlation between the two- and three-particle cumulants is large. In the anti-correlated or uncorrelated regime, the neural ODE fails, indicating that no simple time-local functional of the instantaneous two-particle cumulant can capture the evolution. The magnitude of the time-averaged three-particle-correlation buildup appears to be the primary predictor of success: For a moderate correlation buildup, both neural ODE predictions and existing TD2RDM reconstructions are accurate, whereas stronger values lead to systematic breakdowns. These findings pinpoint the need for memory-dependent kernels in the three-particle cumulant reconstruction for the latter regime. Our results place the neural ODE as a model-agnostic diagnostic tool that maps the regime of applicability of cumulant expansion methods and guides the development of non-local closure schemes. More broadly, the ability to learn high-dimensional RDM dynamics from limited data opens a pathway to fast, data-driven simulation of correlated quantum matter.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13919",
        "abs_url": "https://arxiv.org/abs/2512.13919",
        "pdf_url": "https://arxiv.org/pdf/2512.13919",
        "title": "Adaptive digital twins for predictive decision-making: Online Bayesian learning of transition dynamics",
        "authors": [
            "Eugenio Varetti",
            "Matteo Torzoni",
            "Marco Tezzele",
            "Andrea Manzoni"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "This work shows how adaptivity can enhance value realization of digital twins in civil engineering. We focus on adapting the state transition models within digital twins represented through probabilistic graphical models. The bi-directional interaction between the physical and virtual domains is modeled using dynamic Bayesian networks. By treating state transition probabilities as random variables endowed with conjugate priors, we enable hierarchical online learning of transition dynamics from a state to another through effortless Bayesian updates. We provide the mathematical framework to account for a larger class of distributions with respect to the current literature. To compute dynamic policies with precision updates we solve parametric Markov decision processes through reinforcement learning. The proposed adaptive digital twin framework enjoys enhanced personalization, increased robustness, and improved cost-effectiveness. We assess our approach on a case study involving structural health monitoring and maintenance planning of a railway bridge.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13921",
        "abs_url": "https://arxiv.org/abs/2512.13921",
        "pdf_url": "https://arxiv.org/pdf/2512.13921",
        "title": "Sliding Window Recurrences for Sequence Models",
        "authors": [
            "Dragos Secrieru",
            "Garyk Brixi",
            "Yoshua Bengio",
            "Taiji Suzuki",
            "Michael Poli",
            "Stefano Massaroli"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multi-hybrid architectures are poised to take over language modeling due to better quality and performance. We introduce a hierarchical decomposition framework for linear recurrences that allows us to develop algorithms aligned with GPU memory hierarchies, yielding Sliding Window Recurrences. We focus specifically on truncating recurrences to hardware-aligned windows which are naturally jagged, limiting costly inter-warp communication. Using SWR, we develop Phalanx layers that serve as drop-in replacements for windowed attention or linear recurrences. In 1B parameter multi-hybrid models, Phalanx achieves over 10-40% speedup across 4K to 32K context length over optimized Transformers while matching perplexity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13927",
        "abs_url": "https://arxiv.org/abs/2512.13927",
        "pdf_url": "https://arxiv.org/pdf/2512.13927",
        "title": "A Complete Guide to Spherical Equivariant Graph Transformers",
        "authors": [
            "Sophia Tang"
        ],
        "comments": "This paper is a technical version of the article originally published in Alchemy Bio (99 pages, 46 figures)",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Spherical equivariant graph neural networks (EGNNs) provide a principled framework for learning on three-dimensional molecular and biomolecular systems, where predictions must respect the rotational symmetries inherent in physics. These models extend traditional message-passing GNNs and Transformers by representing node and edge features as spherical tensors that transform under irreducible representations of the rotation group SO(3), ensuring that predictions change in physically meaningful ways under rotations of the input. This guide develops a complete, intuitive foundation for spherical equivariant modeling - from group representations and spherical harmonics, to tensor products, Clebsch-Gordan decomposition, and the construction of SO(3)-equivariant kernels. Building on this foundation, we construct the Tensor Field Network and SE(3)-Transformer architectures and explain how they perform equivariant message-passing and attention on geometric graphs. Through clear mathematical derivations and annotated code excerpts, this guide serves as a self-contained introduction for researchers and learners seeking to understand or implement spherical EGNNs for applications in chemistry, molecular property prediction, protein structure modeling, and generative modeling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13945",
        "abs_url": "https://arxiv.org/abs/2512.13945",
        "pdf_url": "https://arxiv.org/pdf/2512.13945",
        "title": "Pattern-Guided Diffusion Models",
        "authors": [
            "Vivian Lin",
            "Kuk Jin Jang",
            "Wenwen Si",
            "Insup Lee"
        ],
        "comments": "Under review",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Diffusion models have shown promise in forecasting future data from multivariate time series. However, few existing methods account for recurring structures, or patterns, that appear within the data. We present Pattern-Guided Diffusion Models (PGDM), which leverage inherent patterns within temporal data for forecasting future time steps. PGDM first extracts patterns using archetypal analysis and estimates the most likely next pattern in the sequence. By guiding predictions with this pattern estimate, PGDM makes more realistic predictions that fit within the set of known patterns. We additionally introduce a novel uncertainty quantification technique based on archetypal analysis, and we dynamically scale the guidance level based on the pattern estimate uncertainty. We apply our method to two well-motivated forecasting applications, predicting visual field measurements and motion capture frames. On both, we show that pattern guidance improves PGDM's performance (MAE / CRPS) by up to 40.67% / 56.26% and 14.12% / 14.10%, respectively. PGDM also outperforms baselines by up to 65.58% / 84.83% and 93.64% / 92.55%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13989",
        "abs_url": "https://arxiv.org/abs/2512.13989",
        "pdf_url": "https://arxiv.org/pdf/2512.13989",
        "title": "A Single Architecture for Representing Invariance Under Any Space Group",
        "authors": [
            "Cindy Y. Zhang",
            "Elif Ertekin",
            "Peter Orbanz",
            "Ryan P. Adams"
        ],
        "comments": "24 pages, 7 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Incorporating known symmetries in data into machine learning models has consistently improved predictive accuracy, robustness, and generalization. However, achieving exact invariance to specific symmetries typically requires designing bespoke architectures for each group of symmetries, limiting scalability and preventing knowledge transfer across related symmetries. In the case of the space groups, symmetries critical to modeling crystalline solids in materials science and condensed matter physics, this challenge is particularly salient as there are 230 such groups in three dimensions. In this work we present a new approach to such crystallographic symmetries by developing a single machine learning architecture that is capable of adapting its weights automatically to enforce invariance to any input space group. Our approach is based on constructing symmetry-adapted Fourier bases through an explicit characterization of constraints that group operations impose on Fourier coefficients. Encoding these constraints into a neural network layer enables weight sharing across different space groups, allowing the model to leverage structural similarities between groups and overcome data sparsity when limited measurements are available for specific groups. We demonstrate the effectiveness of this approach in achieving competitive performance on material property prediction tasks and performing zero-shot learning to generalize to unseen groups.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14011",
        "abs_url": "https://arxiv.org/abs/2512.14011",
        "pdf_url": "https://arxiv.org/pdf/2512.14011",
        "title": "Accelerating MHC-II Epitope Discovery via Multi-Scale Prediction in Antigen Presentation",
        "authors": [
            "Yue Wan",
            "Jiayi Yuan",
            "Zhiwei Feng",
            "Xiaowei Jia"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Antigenic epitope presented by major histocompatibility complex II (MHC-II) proteins plays an essential role in immunotherapy. However, compared to the more widely studied MHC-I in computational immunotherapy, the study of MHC-II antigenic epitope poses significantly more challenges due to its complex binding specificity and ambiguous motif patterns. Consequently, existing datasets for MHC-II interactions are smaller and less standardized than those available for MHC-I. To address these challenges, we present a well-curated dataset derived from the Immune Epitope Database (IEDB) and other public sources. It not only extends and standardizes existing peptide-MHC-II datasets, but also introduces a novel antigen-MHC-II dataset with richer biological context. Leveraging this dataset, we formulate three major machine learning (ML) tasks of peptide binding, peptide presentation, and antigen presentation, which progressively capture the broader biological processes within the MHC-II antigen presentation pathway. We further employ a multi-scale evaluation framework to benchmark existing models, along with a comprehensive analysis over various modeling designs to this problem with a modular framework. Overall, this work serves as a valuable resource for advancing computational immunotherapy, providing a foundation for future research in ML guided epitope discovery and predictive modeling of immune responses.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14019",
        "abs_url": "https://arxiv.org/abs/2512.14019",
        "pdf_url": "https://arxiv.org/pdf/2512.14019",
        "title": "EXAONE Path 2.5: Pathology Foundation Model with Multi-Omics Alignment",
        "authors": [
            "Juseung Yun",
            "Sunwoo Yu",
            "Sumin Ha",
            "Jonghyun Kim",
            "Janghyeon Lee",
            "Jongseong Jang",
            "Soonyoung Lee"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Cancer progression arises from interactions across multiple biological layers, especially beyond morphological and across molecular layers that remain invisible to image-only models. To capture this broader biological landscape, we present EXAONE Path 2.5, a pathology foundation model that jointly models histologic, genomic, epigenetic and transcriptomic modalities, producing an integrated patient representation that reflects tumor biology more comprehensively. Our approach incorporates three key components: (1) multimodal SigLIP loss enabling all-pairwise contrastive learning across heterogeneous modalities, (2) a fragment-aware rotary positional encoding (F-RoPE) module that preserves spatial structure and tissue-fragment topology in WSI, and (3) domain-specialized internal foundation models for both WSI and RNA-seq to provide biologically grounded embeddings for robust multimodal alignment. We evaluate EXAONE Path 2.5 against six leading pathology foundation models across two complementary benchmarks: an internal real-world clinical dataset and the Patho-Bench benchmark covering 80 tasks. Our framework demonstrates high data and parameter efficiency, achieving on-par performance with state-of-the-art foundation models on Patho-Bench while exhibiting the highest adaptability in the internal clinical setting. These results highlight the value of biologically informed multimodal design and underscore the potential of integrated genotype-to-phenotype modeling for next-generation precision oncology.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14023",
        "abs_url": "https://arxiv.org/abs/2512.14023",
        "pdf_url": "https://arxiv.org/pdf/2512.14023",
        "title": "Multivariate Time Series Forecasting with Hybrid Euclidean-SPD Manifold Graph Neural Networks",
        "authors": [
            "Yong Fang",
            "Na Li",
            "Hangguan Shan",
            "Eryun Liu",
            "Xinyu Li",
            "Wei Ni",
            "Er-Ping Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multivariate Time Series (MTS) forecasting plays a vital role in various real-world applications, such as traffic management and predictive maintenance. Existing approaches typically model MTS data in either Euclidean or Riemannian space, limiting their ability to capture the diverse geometric structures and complex spatio-temporal dependencies inherent in real-world data. To overcome this limitation, we propose the Hybrid Symmetric Positive-Definite Manifold Graph Neural Network (HSMGNN), a novel graph neural network-based model that captures data geometry within a hybrid Euclidean-Riemannian framework. To the best of our knowledge, this is the first work to leverage hybrid geometric representations for MTS forecasting, enabling expressive and comprehensive modeling of geometric properties. Specifically, we introduce a Submanifold-Cross-Segment (SCS) embedding to project input MTS into both Euclidean and Riemannian spaces, thereby capturing spatio-temporal variations across distinct geometric domains. To alleviate the high computational cost of Riemannian distance, we further design an Adaptive-Distance-Bank (ADB) layer with a trainable memory mechanism. Finally, a Fusion Graph Convolutional Network (FGCN) is devised to integrate features from the dual spaces via a learnable fusion operator for accurate prediction. Experiments on three benchmark datasets demonstrate that HSMGNN achieves up to a 13.8 percent improvement over state-of-the-art baselines in forecasting accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14078",
        "abs_url": "https://arxiv.org/abs/2512.14078",
        "pdf_url": "https://arxiv.org/pdf/2512.14078",
        "title": "FusAD: Time-Frequency Fusion with Adaptive Denoising for General Time Series Analysis",
        "authors": [
            "Da Zhang",
            "Bingyu Li",
            "Zhiyuan Zhao",
            "Feiping Nie",
            "Junyu Gao",
            "Xuelong Li"
        ],
        "comments": "Paper has been accepted by ICDE2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series analysis plays a vital role in fields such as finance, healthcare, industry, and meteorology, underpinning key tasks including classification, forecasting, and anomaly detection. Although deep learning models have achieved remarkable progress in these areas in recent years, constructing an efficient, multi-task compatible, and generalizable unified framework for time series analysis remains a significant challenge. Existing approaches are often tailored to single tasks or specific data types, making it difficult to simultaneously handle multi-task modeling and effectively integrate information across diverse time series types. Moreover, real-world data are often affected by noise, complex frequency components, and multi-scale dynamic patterns, which further complicate robust feature extraction and analysis. To ameliorate these challenges, we propose FusAD, a unified analysis framework designed for diverse time series tasks. FusAD features an adaptive time-frequency fusion mechanism, integrating both Fourier and Wavelet transforms to efficiently capture global-local and multi-scale dynamic features. With an adaptive denoising mechanism, FusAD automatically senses and filters various types of noise, highlighting crucial sequence variations and enabling robust feature extraction in complex environments. In addition, the framework integrates a general information fusion and decoding structure, combined with masked pre-training, to promote efficient learning and transfer of multi-granularity representations. Extensive experiments demonstrate that FusAD consistently outperforms state-of-the-art models on mainstream time series benchmarks for classification, forecasting, and anomaly detection tasks, while maintaining high efficiency and scalability. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14080",
        "abs_url": "https://arxiv.org/abs/2512.14080",
        "pdf_url": "https://arxiv.org/pdf/2512.14080",
        "title": "SonicMoE: Accelerating MoE with IO and Tile-aware Optimizations",
        "authors": [
            "Wentao Guo",
            "Mayank Mishra",
            "Xinle Cheng",
            "Ion Stoica",
            "Tri Dao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Mixture of Experts (MoE) models have emerged as the de facto architecture for scaling up language models without significantly increasing the computational cost. Recent MoE models demonstrate a clear trend towards high expert granularity (smaller expert intermediate dimension) and higher sparsity (constant number of activated experts with higher number of total experts), which improve model quality per FLOP. However, fine-grained MoEs suffer from increased activation memory footprint and reduced hardware efficiency due to higher IO costs, while sparser MoEs suffer from wasted computations due to padding in Grouped GEMM kernels. In response, we propose a memory-efficient algorithm to compute the forward and backward passes of MoEs with minimal activation caching for the backward pass. We also design GPU kernels that overlap memory IO with computation benefiting all MoE architectures. Finally, we propose a novel \"token rounding\" method that minimizes the wasted compute due to padding in Grouped GEMM kernels. As a result, our method SonicMoE reduces activation memory by 45% and achieves a 1.86x compute throughput improvement on Hopper GPUs compared to ScatterMoE's BF16 MoE kernel for a fine-grained 7B MoE. Concretely, SonicMoE on 64 H100s achieves a training throughput of 213 billion tokens per day comparable to ScatterMoE's 225 billion tokens per day on 96 H100s for a 7B MoE model training with FSDP-2 using the lm-engine codebase. Under high MoE sparsity settings, our tile-aware token rounding algorithm yields an additional 1.16x speedup on kernel execution time compared to vanilla top-$K$ routing while maintaining similar downstream performance. We open-source all our kernels to enable faster MoE model training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14086",
        "abs_url": "https://arxiv.org/abs/2512.14086",
        "pdf_url": "https://arxiv.org/pdf/2512.14086",
        "title": "Derivative-Informed Fourier Neural Operator: Universal Approximation and Applications to PDE-Constrained Optimization",
        "authors": [
            "Boyuan Yao",
            "Dingcheng Luo",
            "Lianghao Cao",
            "Nikola Kovachki",
            "Thomas O'Leary-Roseberry",
            "Omar Ghattas"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "We present approximation theories and efficient training methods for derivative-informed Fourier neural operators (DIFNOs) with applications to PDE-constrained optimization. A DIFNO is an FNO trained by minimizing its prediction error jointly on output and Fréchet derivative samples of a high-fidelity operator (e.g., a parametric PDE solution operator). As a result, a DIFNO can closely emulate not only the high-fidelity operator's response but also its sensitivities. To motivate the use of DIFNOs instead of conventional FNOs as surrogate models, we show that accurate surrogate-driven PDE-constrained optimization requires accurate surrogate Fréchet derivatives. Then, for continuously differentiable operators, we establish (i) simultaneous universal approximation of FNOs and their Fréchet derivatives on compact sets, and (ii) universal approximation of FNOs in weighted Sobolev spaces with input measures that have unbounded supports. Our theoretical results certify the capability of FNOs for accurate derivative-informed operator learning and accurate solution of PDE-constrained optimization. Furthermore, we develop efficient training schemes using dimension reduction and multi-resolution techniques that significantly reduce memory and computational costs for Fréchet derivative learning. Numerical examples on nonlinear diffusion--reaction, Helmholtz, and Navier--Stokes equations demonstrate that DIFNOs are superior in sample complexity for operator learning and solving infinite-dimensional PDE-constrained inverse problems, achieving high accuracy at low training sample sizes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14098",
        "abs_url": "https://arxiv.org/abs/2512.14098",
        "pdf_url": "https://arxiv.org/pdf/2512.14098",
        "title": "Cornserve: Efficiently Serving Any-to-Any Multimodal Models",
        "authors": [
            "Jeff J. Ma",
            "Jae-Won Chung",
            "Jisang Ahn",
            "Yizhuo Liang",
            "Akshay Jajoo",
            "Myungjin Lee",
            "Mosharaf Chowdhury"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "We present Cornserve, an efficient online serving system for an emerging class of multimodal models called Any-to-Any models. Any-to-Any models accept combinations of text and multimodal data (e.g., image, video, audio) as input and also generate combinations of text and multimodal data as output, introducing request type, computation path, and computation scaling heterogeneity in model serving. Cornserve allows model developers to describe the computation graph of generic Any-to-Any models, which consists of heterogeneous components such as multimodal encoders, autoregressive models like Large Language Models (LLMs), and multimodal generators like Diffusion Transformers (DiTs). Given this, Cornserve's planner automatically finds an optimized deployment plan for the model, including whether and how to disaggregate the model into smaller components based on model and workload characteristics. Cornserve's distributed runtime then executes the model per the plan, efficiently handling Any-to-Any model heterogeneity during online serving. Evaluations show that Cornserve can efficiently serve diverse Any-to-Any models and workloads, delivering up to 3.81$\\times$ throughput improvement and up to 5.79$\\times$ tail latency reduction over existing solutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14100",
        "abs_url": "https://arxiv.org/abs/2512.14100",
        "pdf_url": "https://arxiv.org/pdf/2512.14100",
        "title": "A First-Order Logic-Based Alternative to Reward Models in RLHF",
        "authors": [
            "Chunjin Jian",
            "Xinhua Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Logic in Computer Science (cs.LO)",
        "abstract": "Reinforcement Learning from Human Feedback (RLHF) plays a crucial role in aligning large language models (LLMs) with human values and preferences. However, the quality and stability of the trained reward model largely determine the final alignment performance. Existing approaches such as Proximal Policy Optimization (PPO) rely heavily on reward models to guide LLMs toward human-aligned behaviors. In this work, we propose a logic-similarity-based reward mechanism as an alternative to conventional reward modeling. Instead of relying on heuristic reward estimation, our method leverages formal logical consistency to steer model alignment with human preferences. Since real-world questions can be interpreted from multiple perspectives, to ensure that logic-based reinforcement learning does not cause model collapse, we introduce S-GRPO, a supervised variant of the GRPO framework. S-GRPO incorporates an additional supervised component and jointly optimizes the generation term, KL-divergence regularization, and label-based objective during training. Experimental results demonstrate that S-GRPO consistently outperforms standard supervised fine-tuning (SFT) in both performance and robustness. Furthermore, it extends existing preference-learning frameworks such as GRPO and DPO, offering a more flexible and task-adaptive approach to alignment training. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14150",
        "abs_url": "https://arxiv.org/abs/2512.14150",
        "pdf_url": "https://arxiv.org/pdf/2512.14150",
        "title": "PathFinder: Advancing Path Loss Prediction for Single-to-Multi-Transmitter Scenario",
        "authors": [
            "Zhijie Zhong",
            "Zhiwen Yu",
            "Pengyu Li",
            "Jianming Lv",
            "C. L. Philip Chen",
            "Min Chen"
        ],
        "comments": "34 pages, 14 figures, 4 tables. Under review",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Radio path loss prediction (RPP) is critical for optimizing 5G networks and enabling IoT, smart city, and similar applications. However, current deep learning-based RPP methods lack proactive environmental modeling, struggle with realistic multi-transmitter scenarios, and generalize poorly under distribution shifts, particularly when training/testing environments differ in building density or transmitter configurations. This paper identifies three key issues: (1) passive environmental modeling that overlooks transmitters and key environmental features; (2) overemphasis on single-transmitter scenarios despite real-world multi-transmitter prevalence; (3) excessive focus on in-distribution performance while neglecting distribution shift challenges. To address these, we propose PathFinder, a novel architecture that actively models buildings and transmitters via disentangled feature encoding and integrates Mask-Guided Low-rank Attention to independently focus on receiver and building regions. We also introduce a Transmitter-Oriented Mixup strategy for robust training and a new benchmark, single-to-multi-transmitter RPP (S2MT-RPP), tailored to evaluate extrapolation performance (multi-transmitter testing after single-transmitter training). Experimental results show PathFinder outperforms state-of-the-art methods significantly, especially in challenging multi-transmitter scenarios. Our code and project site are available at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14170",
        "abs_url": "https://arxiv.org/abs/2512.14170",
        "pdf_url": "https://arxiv.org/pdf/2512.14170",
        "title": "On Improving Deep Active Learning with Formal Verification",
        "authors": [
            "Jonathan Spiegelman",
            "Guy Amir",
            "Guy Katz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Logic in Computer Science (cs.LO)",
        "abstract": "Deep Active Learning (DAL) aims to reduce labeling costs in neural-network training by prioritizing the most informative unlabeled samples for annotation. Beyond selecting which samples to label, several DAL approaches further enhance data efficiency by augmenting the training set with synthetic inputs that do not require additional manual labeling. In this work, we investigate how augmenting the training data with adversarial inputs that violate robustness constraints can improve DAL performance. We show that adversarial examples generated via formal verification contribute substantially more than those produced by standard, gradient-based attacks. We apply this extension to multiple modern DAL techniques, as well as to a new technique that we propose, and show that it yields significant improvements in model generalization across standard benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14188",
        "abs_url": "https://arxiv.org/abs/2512.14188",
        "pdf_url": "https://arxiv.org/pdf/2512.14188",
        "title": "Optimizing the Adversarial Perturbation with a Momentum-based Adaptive Matrix",
        "authors": [
            "Wei Tao",
            "Sheng Long",
            "Xin Liu",
            "Wei Li",
            "Qing Tao"
        ],
        "comments": "IEEE Transactions on Dependable and Secure Computing",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Generating adversarial examples (AEs) can be formulated as an optimization problem. Among various optimization-based attacks, the gradient-based PGD and the momentum-based MI-FGSM have garnered considerable interest. However, all these attacks use the sign function to scale their perturbations, which raises several theoretical concerns from the point of view of optimization. In this paper, we first reveal that PGD is actually a specific reformulation of the projected gradient method using only the current gradient to determine its step-size. Further, we show that when we utilize a conventional adaptive matrix with the accumulated gradients to scale the perturbation, PGD becomes AdaGrad. Motivated by this analysis, we present a novel momentum-based attack AdaMI, in which the perturbation is optimized with an interesting momentum-based adaptive matrix. AdaMI is proved to attain optimal convergence for convex problems, indicating that it addresses the non-convergence issue of MI-FGSM, thereby ensuring stability of the optimization process. The experiments demonstrate that the proposed momentum-based adaptive matrix can serve as a general and effective technique to boost adversarial transferability over the state-of-the-art methods across different networks while maintaining better stability and imperceptibility.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14190",
        "abs_url": "https://arxiv.org/abs/2512.14190",
        "pdf_url": "https://arxiv.org/pdf/2512.14190",
        "title": "Random-Bridges as Stochastic Transports for Generative Models",
        "authors": [
            "Stefano Goria",
            "Levent A. Mengütürk",
            "Murat C. Mengütürk",
            "Berkan Sesen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Probability (math.PR)",
        "abstract": "This paper motivates the use of random-bridges -- stochastic processes conditioned to take target distributions at fixed timepoints -- in the realm of generative modelling. Herein, random-bridges can act as stochastic transports between two probability distributions when appropriately initialized, and can display either Markovian or non-Markovian, and either continuous, discontinuous or hybrid patterns depending on the driving process. We show how one can start from general probabilistic statements and then branch out into specific representations for learning and simulation algorithms in terms of information processing. Our empirical results, built on Gaussian random bridges, produce high-quality samples in significantly fewer steps compared to traditional approaches, while achieving competitive Frechet inception distance scores. Our analysis provides evidence that the proposed framework is computationally cheap and suitable for high-speed generation tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14220",
        "abs_url": "https://arxiv.org/abs/2512.14220",
        "pdf_url": "https://arxiv.org/pdf/2512.14220",
        "title": "Estimating problem difficulty without ground truth using Large Language Model comparisons",
        "authors": [
            "Marthe Ballon",
            "Andres Algaba",
            "Brecht Verbeken",
            "Vincent Ginis"
        ],
        "comments": "19 pages, 10 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Recent advances in the finetuning of large language models (LLMs) have significantly improved their performance on established benchmarks, emphasizing the need for increasingly difficult, synthetic data. A key step in this data generation pipeline is a method for estimating problem difficulty. Current approaches, such as human calibration or performance-based scoring, fail to generalize to out-of-distribution problems, i.e. problems currently unsolvable by humans and LLMs, because they are not scalable, time-consuming, and ground truth dependent. Therefore, we propose a new method for estimating problem difficulty, LLM compare, that addresses these limitations. An LLM performs pairwise difficulty comparisons, and then Bradley-Terry scores are computed based on the outcomes. To validate our method, we first propose a conceptual framework that positions existing approaches on three orthogonal planes--construction, scale and dependence--identifying which quadrants a measure needs to occupy to score out-of-distribution problems. LLM compare naturally occupies all desirable quadrants as the first measure that is continuous and dynamic, model-agnostic and independent of ground truth information. As a second validation, we show that LLM compare demonstrates strong alignment with human annotations: Pearson $r \\geq 0.80$ for $n=1876$. Thirdly, we show that LLM compare is robust to hallucinations, with less than $6\\%$ degradation in Pearson correlation for $10\\%$ noise injection. Our work represents a significant step towards replacing time-consuming human annotations and synthetic data generation, and will be an important driver for curriculum design, model evaluation, and AI-assisted research ideation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14230",
        "abs_url": "https://arxiv.org/abs/2512.14230",
        "pdf_url": "https://arxiv.org/pdf/2512.14230",
        "title": "Understanding the Gain from Data Filtering in Multimodal Contrastive Learning",
        "authors": [
            "Divyansh Pareek",
            "Sewoong Oh",
            "Simon S. Du"
        ],
        "comments": "40 pages, 8 figures, 1 table. This work is accepted to the Thirty-ninth Annual Conference on Neural Information Processing Systems, 2025",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "The success of modern multimodal representation learning relies on internet-scale datasets. Due to the low quality of a large fraction of raw web data, data curation has become a critical step in the training pipeline. Filtering using a trained model (i.e., teacher-based filtering) has emerged as a successful solution, leveraging a pre-trained model to compute quality scores. To explain the empirical success of teacher-based filtering, we characterize the performance of filtered contrastive learning under the standard bimodal data generation model. Denoting $\\eta\\in(0,1]$ as the fraction of data with correctly matched modalities among $n$ paired samples, we utilize a linear contrastive learning setup to show a provable benefit of data filtering: $(i)$ the error without filtering is upper and lower bounded by $\\frac{1}{\\eta \\sqrt{n}}$, and $(ii)$ the error with teacher-based filtering is upper bounded by $\\frac{1}{\\sqrt{\\eta n}}$ in the large $\\eta$ regime, and by $\\frac{1}{\\sqrt{n}}$ in the small $\\eta$ regime.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14240",
        "abs_url": "https://arxiv.org/abs/2512.14240",
        "pdf_url": "https://arxiv.org/pdf/2512.14240",
        "title": "Physically consistent model learning for reaction-diffusion systems",
        "authors": [
            "Erion Morina",
            "Martin Holler"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Analysis of PDEs (math.AP); Optimization and Control (math.OC)",
        "abstract": "This paper addresses the problem of learning reaction-diffusion (RD) systems from data while ensuring physical consistency and well-posedness of the learned models. Building on a regularization-based framework for structured model learning, we focus on learning parameterized reaction terms and investigate how to incorporate key physical properties, such as mass conservation and quasipositivity, directly into the learning process. Our main contributions are twofold: First, we propose techniques to systematically modify a given class of parameterized reaction terms such that the resulting terms inherently satisfy mass conservation and quasipositivity, ensuring that the learned RD systems preserve non-negativity and adhere to physical principles. These modifications also guarantee well-posedness of the resulting PDEs under additional regularity and growth conditions. Second, we extend existing theoretical results on regularization-based model learning to RD systems using these physically consistent reaction terms. Specifically, we prove that solutions to the learning problem converge to a unique, regularization-minimizing solution of a limit system even when conservation laws and quasipositivity are enforced. In addition, we provide approximation results for quasipositive functions, essential for constructing physically consistent parameterizations. These results advance the development of interpretable and reliable data-driven models for RD systems that align with fundamental physical laws.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14253",
        "abs_url": "https://arxiv.org/abs/2512.14253",
        "pdf_url": "https://arxiv.org/pdf/2512.14253",
        "title": "FLAME: Flow Enhanced Legendre Memory Models for General Time Series Forecasting",
        "authors": [
            "Xingjian Wu",
            "Hanyin Cheng",
            "Xiangfei Qiu",
            "Zhengyu Li",
            "Jilin Hu",
            "Chenjuan Guo",
            "Bin Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In this work, we introduce FLAME, a family of extremely lightweight and capable Time Series Foundation Models, which support both deterministic and probabilistic forecasting via generative probabilistic modeling, thus ensuring both efficiency and robustness. FLAME utilizes the Legendre Memory for strong generalization capabilities. Through adapting variants of Legendre Memory, i.e., translated Legendre (LegT) and scaled Legendre (LegS), in the Encoding and Decoding phases, FLAME can effectively capture the inherent inductive bias within data and make efficient long-range inferences. To enhance the accuracy of probabilistic forecasting while keeping efficient, FLAME adopts a Normalization Flow based forecasting head, which can model the arbitrarily intricate distributions over the forecasting horizon in a generative manner. Comprehensive experiments on well-recognized benchmarks, including TSFM-Bench and ProbTS, demonstrate the consistent state-of-the-art zero-shot performance of FLAME on both deterministic and probabilistic forecasting tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14338",
        "abs_url": "https://arxiv.org/abs/2512.14338",
        "pdf_url": "https://arxiv.org/pdf/2512.14338",
        "title": "Implicit Bias and Invariance: How Hopfield Networks Efficiently Learn Graph Orbits",
        "authors": [
            "Michael Murray",
            "Tenzin Chan",
            "Kedar Karhadker",
            "Christopher J. Hillar"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Many learning problems involve symmetries, and while invariance can be built into neural architectures, it can also emerge implicitly when training on group-structured data. We study this phenomenon in classical Hopfield networks and show they can infer the full isomorphism class of a graph from a small random sample. Our results reveal that: (i) graph isomorphism classes can be represented within a three-dimensional invariant subspace, (ii) using gradient descent to minimize energy flow (MEF) has an implicit bias toward norm-efficient solutions, which underpins a polynomial sample complexity bound for learning isomorphism classes, and (iii) across multiple learning rules, parameters converge toward the invariant subspace as sample sizes grow. Together, these findings highlight a unifying mechanism for generalization in Hopfield networks: a bias toward norm efficiency in learning drives the emergence of approximate invariance under group-structured data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14361",
        "abs_url": "https://arxiv.org/abs/2512.14361",
        "pdf_url": "https://arxiv.org/pdf/2512.14361",
        "title": "Causal Structure Learning for Dynamical Systems with Theoretical Score Analysis",
        "authors": [
            "Nicholas Tagliapietra",
            "Katharina Ensinger",
            "Christoph Zimmer",
            "Osman Mian"
        ],
        "comments": "Accepted as Oral at AAAI 2026 Conference",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Dynamical Systems (math.DS)",
        "abstract": "Real world systems evolve in continuous-time according to their underlying causal relationships, yet their dynamics are often unknown. Existing approaches to learning such dynamics typically either discretize time -- leading to poor performance on irregularly sampled data -- or ignore the underlying causality. We propose CaDyT, a novel method for causal discovery on dynamical systems addressing both these challenges. In contrast to state-of-the-art causal discovery methods that model the problem using discrete-time Dynamic Bayesian networks, our formulation is grounded in Difference-based causal models, which allow milder assumptions for modeling the continuous nature of the system. CaDyT leverages exact Gaussian Process inference for modeling the continuous-time dynamics which is more aligned with the underlying dynamical process. We propose a practical instantiation that identifies the causal structure via a greedy search guided by the Algorithmic Markov Condition and Minimum Description Length principle. Our experiments show that CaDyT outperforms state-of-the-art methods on both regularly and irregularly-sampled data, discovering causal networks closer to the true underlying dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14388",
        "abs_url": "https://arxiv.org/abs/2512.14388",
        "pdf_url": "https://arxiv.org/pdf/2512.14388",
        "title": "Black-Box Auditing of Quantum Model: Lifted Differential Privacy with Quantum Canaries",
        "authors": [
            "Baobao Song",
            "Shiva Raj Pokhrel",
            "Athanasios V. Vasilakos",
            "Tianqing Zhu",
            "Gang Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Quantum machine learning (QML) promises significant computational advantages, yet models trained on sensitive data risk memorizing individual records, creating serious privacy vulnerabilities. While Quantum Differential Privacy (QDP) mechanisms provide theoretical worst-case guarantees, they critically lack empirical verification tools for deployed models. We introduce the first black-box privacy auditing framework for QML based on Lifted Quantum Differential Privacy, leveraging quantum canaries (strategically offset-encoded quantum states) to detect memorization and precisely quantify privacy leakage during training. Our framework establishes a rigorous mathematical connection between canary offset and trace distance bounds, deriving empirical lower bounds on privacy budget consumption that bridge the critical gap between theoretical guarantees and practical privacy verification. Comprehensive evaluations across both simulated and physical quantum hardware demonstrate our framework's effectiveness in measuring actual privacy loss in QML models, enabling robust privacy verification in QML systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14397",
        "abs_url": "https://arxiv.org/abs/2512.14397",
        "pdf_url": "https://arxiv.org/pdf/2512.14397",
        "title": "SuperWing: a comprehensive transonic wing dataset for data-driven aerodynamic design",
        "authors": [
            "Yunjia Yang",
            "Weishao Tang",
            "Mengxin Liu",
            "Nils Thuerey",
            "Yufei Zhang",
            "Haixin Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Fluid Dynamics (physics.flu-dyn)",
        "abstract": "Machine-learning surrogate models have shown promise in accelerating aerodynamic design, yet progress toward generalizable predictors for three-dimensional wings has been limited by the scarcity and restricted diversity of existing datasets. Here, we present SuperWing, a comprehensive open dataset of transonic swept-wing aerodynamics comprising 4,239 parameterized wing geometries and 28,856 Reynolds-averaged Navier-Stokes flow field solutions. The wing shapes in the dataset are generated using a simplified yet expressive geometry parameterization that incorporates spanwise variations in airfoil shape, twist, and dihedral, allowing for an enhanced diversity without relying on perturbations of a baseline wing. All shapes are simulated under a broad range of Mach numbers and angles of attack covering the typical flight envelope. To demonstrate the dataset's utility, we benchmark two state-of-the-art Transformers that accurately predict surface flow and achieve a 2.5 drag-count error on held-out samples. Models pretrained on SuperWing further exhibit strong zero-shot generalization to complex benchmark wings such as DLR-F6 and NASA CRM, underscoring the dataset's diversity and potential for practical usage.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14400",
        "abs_url": "https://arxiv.org/abs/2512.14400",
        "pdf_url": "https://arxiv.org/pdf/2512.14400",
        "title": "GRAFT: Grid-Aware Load Forecasting with Multi-Source Textual Alignment and Fusion",
        "authors": [
            "Fangzhou Lin",
            "Guoshun He",
            "Zhenyu Guo",
            "Zhe Huang",
            "Jinsong Tao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Electric load is simultaneously affected across multiple time scales by exogenous factors such as weather and calendar rhythms, sudden events, and policies. Therefore, this paper proposes GRAFT (GRid-Aware Forecasting with Text), which modifies and improves STanHOP to better support grid-aware forecasting and multi-source textual interventions. Specifically, GRAFT strictly aligns daily-aggregated news, social media, and policy texts with half-hour load, and realizes text-guided fusion to specific time positions via cross-attention during both training and rolling forecasting. In addition, GRAFT provides a plug-and-play external-memory interface to accommodate different information sources in real-world deployment. We construct and release a unified aligned benchmark covering 2019--2021 for five Australian states (half-hour load, daily-aligned weather/calendar variables, and three categories of external texts), and conduct systematic, reproducible evaluations at three scales -- hourly, daily, and monthly -- under a unified protocol for comparison across regions, external sources, and time scales. Experimental results show that GRAFT significantly outperforms strong baselines and reaches or surpasses the state of the art across multiple regions and forecasting horizons. Moreover, the model is robust in event-driven scenarios and enables temporal localization and source-level interpretation of text-to-load effects through attention read-out. We release the benchmark, preprocessing scripts, and forecasting results to facilitate standardized empirical evaluation and reproducibility in power grid load forecasting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14418",
        "abs_url": "https://arxiv.org/abs/2512.14418",
        "pdf_url": "https://arxiv.org/pdf/2512.14418",
        "title": "Dual-Axis RCCL: Representation-Complete Convergent Learning for Organic Chemical Space",
        "authors": [
            "Dejun Hu",
            "Zhiming Li",
            "Jia-Rui Shen",
            "Jia-Ning Tu",
            "Zi-Hao Ye",
            "Junliang Zhang"
        ],
        "comments": "33 pages, 10 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine learning is profoundly reshaping molecular and materials modeling; however, given the vast scale of chemical space (10^30-10^60), it remains an open scientific question whether models can achieve convergent learning across this space. We introduce a Dual-Axis Representation-Complete Convergent Learning (RCCL) strategy, enabled by a molecular representation that integrates graph convolutional network (GCN) encoding of local valence environments, grounded in modern valence bond theory, together with no-bridge graph (NBG) encoding of ring/cage topologies, providing a quantitative measure of chemical-space coverage. This framework formalizes representation completeness, establishing a principled basis for constructing datasets that support convergent learning for large models. Guided by this RCCL framework, we develop the FD25 dataset, systematically covering 13,302 local valence units and 165,726 ring/cage topologies, achieving near-complete combinatorial coverage of organic molecules with H/C/N/O/F elements. Graph neural networks trained on FD25 exhibit representation-complete convergent learning and strong out-of-distribution generalization, with an overall prediction error of approximately 1.0 kcal/mol MAE across external benchmarks. Our results establish a quantitative link between molecular representation, structural completeness, and model generalization, providing a foundation for interpretable, transferable, and data-efficient molecular intelligence.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14444",
        "abs_url": "https://arxiv.org/abs/2512.14444",
        "pdf_url": "https://arxiv.org/pdf/2512.14444",
        "title": "Bridging Artificial Intelligence and Data Assimilation: The Data-driven Ensemble Forecasting System ClimaX-LETKF",
        "authors": [
            "Akira Takeshima",
            "Kenta Shiraishi",
            "Atsushi Okazaki",
            "Tadashi Tsuyuki",
            "Shunji Kotsuki"
        ],
        "comments": "14 pages and 5 figures for the main text and 13 pages and 7 figures as supplementary materials",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "While machine learning-based weather prediction (MLWP) has achieved significant advancements, research on assimilating real observations or ensemble forecasts within MLWP models remains limited. We introduce ClimaX-LETKF, the first purely data-driven ML-based ensemble weather forecasting system. It operates stably over multiple years, independently of numerical weather prediction (NWP) models, by assimilating the NCEP ADP Global Upper Air and Surface Weather Observations. The system demonstrates greater stability and accuracy with relaxation to prior perturbation (RTPP) than with relaxation to prior spread (RTPS), while NWP models tend to be more stable with RTPS. RTPP replaces an analysis perturbation with a weighted blend of analysis and background perturbations, whereas RTPS simply rescales the analysis perturbation. Our experiments reveal that MLWP models are less capable of restoring the atmospheric field to its attractor than NWP models. This work provides valuable insights for enhancing MLWP ensemble forecasting systems and represents a substantial step toward their practical applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14461",
        "abs_url": "https://arxiv.org/abs/2512.14461",
        "pdf_url": "https://arxiv.org/pdf/2512.14461",
        "title": "AnySleep: a channel-agnostic deep learning system for high-resolution sleep staging in multi-center cohorts",
        "authors": [
            "Niklas Grieger",
            "Jannik Raskob",
            "Siamak Mehrkanoon",
            "Stephan Bialonski"
        ],
        "comments": "18 pages, 6 figures, 2 tables",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP); Quantitative Methods (q-bio.QM)",
        "abstract": "Sleep is essential for good health throughout our lives, yet studying its dynamics requires manual sleep staging, a labor-intensive step in sleep research and clinical care. Across centers, polysomnography (PSG) recordings are traditionally scored in 30-s epochs for pragmatic, not physiological, reasons and can vary considerably in electrode count, montage, and subject characteristics. These constraints present challenges in conducting harmonized multi-center sleep studies and discovering novel, robust biomarkers on shorter timescales. Here, we present AnySleep, a deep neural network model that uses any electroencephalography (EEG) or electrooculography (EOG) data to score sleep at adjustable temporal resolutions. We trained and validated the model on over 19,000 overnight recordings from 21 datasets collected across multiple clinics, spanning nearly 200,000 hours of EEG and EOG data, to promote robust generalization across sites. The model attains state-of-the-art performance and surpasses or equals established baselines at 30-s epochs. Performance improves as more channels are provided, yet remains strong when EOG is absent or when only EOG or single EEG derivations (frontal, central, or occipital) are available. On sub-30-s timescales, the model captures short wake intrusions consistent with arousals and improves prediction of physiological characteristics (age, sex) and pathophysiological conditions (sleep apnea), relative to standard 30-s scoring. We make the model publicly available to facilitate large-scale studies with heterogeneous electrode setups and to accelerate the discovery of novel biomarkers in sleep.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14471",
        "abs_url": "https://arxiv.org/abs/2512.14471",
        "pdf_url": "https://arxiv.org/pdf/2512.14471",
        "title": "Kinetic-Mamba: Mamba-Assisted Predictions of Stiff Chemical Kinetics",
        "authors": [
            "Additi Pandey",
            "Liang Wei",
            "Hessam Babaee",
            "George Em Karniadakis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate chemical kinetics modeling is essential for combustion simulations, as it governs the evolution of complex reaction pathways and thermochemical states. In this work, we introduce Kinetic-Mamba, a Mamba-based neural operator framework that integrates the expressive power of neural operators with the efficient temporal modeling capabilities of Mamba architectures. The framework comprises three complementary models: (i) a standalone Mamba model that predicts the time evolution of thermochemical state variables from given initial conditions; (ii) a constrained Mamba model that enforces mass conservation while learning the state dynamics; and (iii) a regime-informed architecture employing two standalone Mamba models to capture dynamics across temperature-dependent regimes. We additionally develop a latent Kinetic-Mamba variant that evolves dynamics in a reduced latent space and reconstructs the full state on the physical manifold. We evaluate the accuracy and robustness of Kinetic-Mamba using both time-decomposition and recursive-prediction strategies. We further assess the extrapolation capabilities of the model on varied out-of-distribution datasets. Computational experiments on Syngas and GRI-Mech 3.0 reaction mechanisms demonstrate that our framework achieves high fidelity in predicting complex kinetic behavior using only the initial conditions of the state variables.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14522",
        "abs_url": "https://arxiv.org/abs/2512.14522",
        "pdf_url": "https://arxiv.org/pdf/2512.14522",
        "title": "Improving Slow Transfer Predictions: Generative Methods Compared",
        "authors": [
            "Jacob Taegon Kim",
            "Alex Sim",
            "Kesheng Wu",
            "Jinoh Kim"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC); Networking and Internet Architecture (cs.NI)",
        "abstract": "Monitoring data transfer performance is a crucial task in scientific computing networks. By predicting performance early in the communication phase, potentially sluggish transfers can be identified and selectively monitored, optimizing network usage and overall performance. A key bottleneck to improving the predictive power of machine learning (ML) models in this context is the issue of class imbalance. This project focuses on addressing the class imbalance problem to enhance the accuracy of performance predictions. In this study, we analyze and compare various augmentation strategies, including traditional oversampling methods and generative techniques. Additionally, we adjust the class imbalance ratios in training datasets to evaluate their impact on model performance. While augmentation may improve performance, as the imbalance ratio increases, the performance does not significantly improve. We conclude that even the most advanced technique, such as CTGAN, does not significantly improve over simple stratified sampling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14537",
        "abs_url": "https://arxiv.org/abs/2512.14537",
        "pdf_url": "https://arxiv.org/pdf/2512.14537",
        "title": "Synthetic Electrogram Generation with Variational Autoencoders for ECGI",
        "authors": [
            "Miriam Gutiérrez Fernández",
            "Karen López-Linares",
            "Carlos Fambuena Santos",
            "María S. Guillem",
            "Andreu M. Climent",
            "Óscar Barquero Pérez"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Atrial fibrillation (AF) is the most prevalent sustained cardiac arrhythmia, and its clinical assessment requires accurate characterization of atrial electrical activity. Noninvasive electrocardiographic imaging (ECGI) combined with deep learning (DL) approaches for estimating intracardiac electrograms (EGMs) from body surface potentials (BSPMs) has shown promise, but progress is hindered by the limited availability of paired BSPM-EGM datasets. To address this limitation, we investigate variational autoencoders (VAEs) for the generation of synthetic multichannel atrial EGMs. Two models are proposed: a sinus rhythm-specific VAE (VAE-S) and a class-conditioned VAE (VAE-C) trained on both sinus rhythm and AF signals. Generated EGMs are evaluated using morphological, spectral, and distributional similarity metrics. VAE-S achieves higher fidelity with respect to in silico EGMs, while VAE-C enables rhythm-specific generation at the expense of reduced sinus reconstruction quality. As a proof of concept, the generated EGMs are used for data augmentation in a downstream noninvasive EGM reconstruction task, where moderate augmentation improves estimation performance. These results demonstrate the potential of VAE-based generative modeling to alleviate data scarcity and enhance deep learning-based ECGI pipelines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14559",
        "abs_url": "https://arxiv.org/abs/2512.14559",
        "pdf_url": "https://arxiv.org/pdf/2512.14559",
        "title": "Counterfactual Explanations for Time Series Should be Human-Centered and Temporally Coherent in Interventions",
        "authors": [
            "Emmanuel C. Chukwu",
            "Rianne M. Schouten",
            "Monique Tabak",
            "Mykola Pechenizkiy"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Counterfactual explanations are increasingly proposed as interpretable mechanisms to achieve algorithmic recourse. However, current counterfactual techniques for time series classification are predominantly designed with static data assumptions and focus on generating minimal input perturbations to flip model predictions. This paper argues that such approaches are fundamentally insufficient in clinical recommendation settings, where interventions unfold over time and must be causally plausible and temporally coherent. We advocate for a shift towards counterfactuals that reflect sustained, goal-directed interventions aligned with clinical reasoning and patient-specific dynamics. We identify critical gaps in existing methods that limit their practical applicability, specifically, temporal blind spots and the lack of user-centered considerations in both method design and evaluation metrics. To support our position, we conduct a robustness analysis of several state-of-the-art methods for time series and show that the generated counterfactuals are highly sensitive to stochastic noise. This finding highlights their limited reliability in real-world clinical settings, where minor measurement variations are inevitable. We conclude by calling for methods and evaluation frameworks that go beyond mere prediction changes without considering feasibility or actionability. We emphasize the need for actionable, purpose-driven interventions that are feasible in real-world contexts for the users of such applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14596",
        "abs_url": "https://arxiv.org/abs/2512.14596",
        "pdf_url": "https://arxiv.org/pdf/2512.14596",
        "title": "Hybrid Iterative Solvers with Geometry-Aware Neural Preconditioners for Parametric PDEs",
        "authors": [
            "Youngkyu Lee",
            "Francesc Levrero Florencio",
            "Jay Pathak",
            "George Em Karniadakis"
        ],
        "comments": "19 pages, 10 figures, 3 tables",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "The convergence behavior of classical iterative solvers for parametric partial differential equations (PDEs) is often highly sensitive to the domain and specific discretization of PDEs. Previously, we introduced hybrid solvers by combining the classical solvers with neural operators for a specific geometry 1, but they tend to under-perform in geometries not encountered during training. To address this challenge, we introduce Geo-DeepONet, a geometry-aware deep operator network that incorporates domain information extracted from finite element discretizations. Geo-DeepONet enables accurate operator learning across arbitrary unstructured meshes without requiring retraining. Building on this, we develop a class of geometry-aware hybrid preconditioned iterative solvers by coupling Geo-DeepONet with traditional methods such as relaxation schemes and Krylov subspace algorithms. Through numerical experiments on parametric PDEs posed over diverse unstructured domains, we demonstrate the enhanced robustness and efficiency of the proposed hybrid solvers for multiple real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14615",
        "abs_url": "https://arxiv.org/abs/2512.14615",
        "pdf_url": "https://arxiv.org/pdf/2512.14615",
        "title": "Hierarchical Persistence Velocity for Network Anomaly Detection: Theory and Applications to Cryptocurrency Markets",
        "authors": [
            "Omid Khormali"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce the Overlap-Weighted Hierarchical Normalized Persistence Velocity (OW-HNPV), a novel topological data analysis method for detecting anomalies in time-varying networks. Unlike existing methods that measure cumulative topological presence, we introduce the first velocity-based perspective on persistence diagrams, measuring the rate at which features appear and disappear, automatically downweighting noise through overlap-based weighting. We also prove that OW-HNPV is mathematically stable. It behaves in a controlled, predictable way, even when comparing persistence diagrams from networks with different feature types. Applied to Ethereum transaction networks (May 2017-May 2018), OW-HNPV demonstrates superior performance for cryptocurrency anomaly detection, achieving up to 10.4% AUC gain over baseline models for 7-day price movement predictions. Compared with established methods, including Vector of Averaged Bettis (VAB), persistence landscapes, and persistence images, velocity-based summaries excel at medium- to long-range forecasting (4-7 days), with OW-HNPV providing the most consistent and stable performance across prediction horizons. Our results show that modeling topological velocity is crucial for detecting structural anomalies in dynamic networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14617",
        "abs_url": "https://arxiv.org/abs/2512.14617",
        "pdf_url": "https://arxiv.org/pdf/2512.14617",
        "title": "Model-Based Reinforcement Learning in Discrete-Action Non-Markovian Reward Decision Processes",
        "authors": [
            "Alessandro Trapasso",
            "Luca Iocchi",
            "Fabio Patrizi"
        ],
        "comments": "19 pages, 32 figures, includes appendix",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Many practical decision-making problems involve tasks whose success depends on the entire system history, rather than on achieving a state with desired properties. Markovian Reinforcement Learning (RL) approaches are not suitable for such tasks, while RL with non-Markovian reward decision processes (NMRDPs) enables agents to tackle temporal-dependency tasks. This approach has long been known to lack formal guarantees on both (near-)optimality and sample efficiency. We contribute to solving both issues with QR-MAX, a novel model-based algorithm for discrete NMRDPs that factorizes Markovian transition learning from non-Markovian reward handling via reward machines. To the best of our knowledge, this is the first model-based RL algorithm for discrete-action NMRDPs that exploits this factorization to obtain PAC convergence to $\\varepsilon$-optimal policies with polynomial sample complexity. We then extend QR-MAX to continuous state spaces with Bucket-QR-MAX, a SimHash-based discretiser that preserves the same factorized structure and achieves fast and stable learning without manual gridding or function approximation. We experimentally compare our method with modern state-of-the-art model-based RL approaches on environments of increasing complexity, showing a significant improvement in sample efficiency and increased robustness in finding optimal policies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14619",
        "abs_url": "https://arxiv.org/abs/2512.14619",
        "pdf_url": "https://arxiv.org/pdf/2512.14619",
        "title": "ParaFormer: A Generalized PageRank Graph Transformer for Graph Representation Learning",
        "authors": [
            "Chaohao Yuan",
            "Zhenjie Song",
            "Ercan Engin Kuruoglu",
            "Kangfei Zhao",
            "Yang Liu",
            "Deli Zhao",
            "Hong Cheng",
            "Yu Rong"
        ],
        "comments": "Accepted by WSDM 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph Transformers (GTs) have emerged as a promising graph learning tool, leveraging their all-pair connected property to effectively capture global information. To address the over-smoothing problem in deep GNNs, global attention was initially introduced, eliminating the necessity for using deep GNNs. However, through empirical and theoretical analysis, we verify that the introduced global attention exhibits severe over-smoothing, causing node representations to become indistinguishable due to its inherent low-pass filtering. This effect is even stronger than that observed in GNNs. To mitigate this, we propose PageRank Transformer (ParaFormer), which features a PageRank-enhanced attention module designed to mimic the behavior of deep Transformers. We theoretically and empirically demonstrate that ParaFormer mitigates over-smoothing by functioning as an adaptive-pass filter. Experiments show that ParaFormer achieves consistent performance improvements across both node classification and graph classification tasks on 11 datasets ranging from thousands to millions of nodes, validating its efficacy. The supplementary material, including code and appendix, can be found in this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14658",
        "abs_url": "https://arxiv.org/abs/2512.14658",
        "pdf_url": "https://arxiv.org/pdf/2512.14658",
        "title": "gridfm-datakit-v1: A Python Library for Scalable and Realistic Power Flow and Optimal Power Flow Data Generation",
        "authors": [
            "Alban Puech",
            "Matteo Mazzonelli",
            "Celia Cintas",
            "Tamara R. Govindasamy",
            "Mangaliso Mngomezulu",
            "Jonas Weiss",
            "Matteo Baù",
            "Anna Varbella",
            "François Mirallès",
            "Kibaek Kim",
            "Le Xie",
            "Hendrik F. Hamann",
            "Etienne Vos",
            "Thomas Brunschwiler"
        ],
        "comments": "Main equal contributors: Alban Puech, Matteo Mazzonelli. Other equal contributors: Celia Cintas, Tamara R. Govindasamy, Mangaliso Mngomezulu, Jonas Weiss",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Systems and Control (eess.SY); Optimization and Control (math.OC)",
        "abstract": "We introduce gridfm-datakit-v1, a Python library for generating realistic and diverse Power Flow (PF) and Optimal Power Flow (OPF) datasets for training Machine Learning (ML) solvers. Existing datasets and libraries face three main challenges: (1) lack of realistic stochastic load and topology perturbations, limiting scenario diversity; (2) PF datasets are restricted to OPF-feasible points, hindering generalization of ML solvers to cases that violate operating limits (e.g., branch overloads or voltage violations); and (3) OPF datasets use fixed generator cost functions, limiting generalization across varying costs. gridfm-datakit addresses these challenges by: (1) combining global load scaling from real-world profiles with localized noise and supporting arbitrary N-k topology perturbations to create diverse yet realistic datasets; (2) generating PF samples beyond operating limits; and (3) producing OPF data with varying generator costs. It also scales efficiently to large grids (up to 10,000 buses). Comparisons with OPFData, OPF-Learn, PGLearn, and PF$\\Delta$ are provided. Available on GitHub at this https URL under Apache 2.0 and via `pip install gridfm-datakit`.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14675",
        "abs_url": "https://arxiv.org/abs/2512.14675",
        "pdf_url": "https://arxiv.org/pdf/2512.14675",
        "title": "Beyond Lipschitz Continuity and Monotonicity: Fractal and Chaotic Activation Functions in Echo State Networks",
        "authors": [
            "Rae Chipera",
            "Jenny Du",
            "Irene Tsapara"
        ],
        "comments": "50 pages, 21 figures. Extended version with full proofs, parameter sweeps, and appendices",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Contemporary reservoir computing relies heavily on smooth, globally Lipschitz continuous activation functions, limiting applications in defense, disaster response, and pharmaceutical modeling where robust operation under extreme conditions is critical. We systematically investigate non-smooth activation functions, including chaotic, stochastic, and fractal variants, in echo state networks. Through comprehensive parameter sweeps across 36,610 reservoir configurations, we demonstrate that several non-smooth functions not only maintain the Echo State Property (ESP) but outperform traditional smooth activations in convergence speed and spectral radius tolerance. Notably, the Cantor function (continuous everywhere and flat almost everywhere) maintains ESP-consistent behavior up to spectral radii of rho ~ 10, an order of magnitude beyond typical bounds for smooth functions, while achieving 2.6x faster convergence than tanh and ReLU. We introduce a theoretical framework for quantized activation functions, defining a Degenerate Echo State Property (d-ESP) that captures stability for discrete-output functions and proving that d-ESP implies traditional ESP. We identify a critical crowding ratio Q=N/k (reservoir size / quantization levels) that predicts failure thresholds for discrete activations. Our analysis reveals that preprocessing topology, rather than continuity per se, determines stability: monotone, compressive preprocessing maintains ESP across scales, while dispersive or discontinuous preprocessing triggers sharp failures. While our findings challenge assumptions about activation function design in reservoir computing, the mechanism underlying the exceptional performance of certain fractal functions remains unexplained, suggesting fundamental gaps in our understanding of how geometric properties of activation functions influence reservoir dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14683",
        "abs_url": "https://arxiv.org/abs/2512.14683",
        "pdf_url": "https://arxiv.org/pdf/2512.14683",
        "title": "Early Warning Index for Patient Deteriorations in Hospitals",
        "authors": [
            "Dimitris Bertsimas",
            "Yu Ma",
            "Kimberly Villalobos Carballo",
            "Gagan Singh",
            "Michal Laskowski",
            "Jeff Mather",
            "Dan Kombert",
            "Howard Haronian"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Hospitals lack automated systems to harness the growing volume of heterogeneous clinical and operational data to effectively forecast critical events. Early identification of patients at risk for deterioration is essential not only for patient care quality monitoring but also for physician care management. However, translating varied data streams into accurate and interpretable risk assessments poses significant challenges due to inconsistent data formats. We develop a multimodal machine learning framework, the Early Warning Index (EWI), to predict the aggregate risk of ICU admission, emergency response team dispatch, and mortality. Key to EWI's design is a human-in-the-loop process: clinicians help determine alert thresholds and interpret model outputs, which are enhanced by explainable outputs using Shapley Additive exPlanations (SHAP) to highlight clinical and operational factors (e.g., scheduled surgeries, ward census) driving each patient's risk. We deploy EWI in a hospital dashboard that stratifies patients into three risk tiers. Using a dataset of 18,633 unique patients at a large U.S. hospital, our approach automatically extracts features from both structured and unstructured electronic health record (EHR) data and achieves C-statistics of 0.796. It is currently used as a triage tool for proactively managing at-risk patients. The proposed approach saves physicians valuable time by automatically sorting patients of varying risk levels, allowing them to concentrate on patient care rather than sifting through complex EHR data. By further pinpointing specific risk drivers, the proposed model provides data-informed adjustments to caregiver scheduling and allocation of critical resources. As a result, clinicians and administrators can avert downstream complications, including costly procedures or high readmission rates and improve overall patient flow.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14686",
        "abs_url": "https://arxiv.org/abs/2512.14686",
        "pdf_url": "https://arxiv.org/pdf/2512.14686",
        "title": "Bias-Variance Trade-off for Clipped Stochastic First-Order Methods: From Bounded Variance to Infinite Mean",
        "authors": [
            "Chuan He"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Optimization and Control (math.OC); Computation (stat.CO); Machine Learning (stat.ML)",
        "abstract": "Stochastic optimization is fundamental to modern machine learning. Recent research has extended the study of stochastic first-order methods (SFOMs) from light-tailed to heavy-tailed noise, which frequently arises in practice, with clipping emerging as a key technique for controlling heavy-tailed gradients. Extensive theoretical advances have further shown that the oracle complexity of SFOMs depends on the tail index $\\alpha$ of the noise. Nonetheless, existing complexity results often cover only the case $\\alpha \\in (1,2]$, that is, the regime where the noise has a finite mean, while the complexity bounds tend to infinity as $\\alpha$ approaches $1$. This paper tackles the general case of noise with tail index $\\alpha\\in(0,2]$, covering regimes ranging from noise with bounded variance to noise with an infinite mean, where the latter case has been scarcely studied. Through a novel analysis of the bias-variance trade-off in gradient clipping, we show that when a symmetry measure of the noise tail is controlled, clipped SFOMs achieve improved complexity guarantees in the presence of heavy-tailed noise for any tail index $\\alpha \\in (0,2]$. Our analysis of the bias-variance trade-off not only yields new unified complexity guarantees for clipped SFOMs across this full range of tail indices, but is also straightforward to apply and can be combined with classical analyses under light-tailed noise to establish oracle complexity guarantees under heavy-tailed noise. Finally, numerical experiments validate our theoretical findings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.08589",
        "abs_url": "https://arxiv.org/abs/2512.08589",
        "pdf_url": "https://arxiv.org/pdf/2512.08589",
        "title": "Automated Pollen Recognition in Optical and Holographic Microscopy Images",
        "authors": [
            "Swarn Singh Warshaneyan",
            "Maksims Ivanovs",
            "Blaž Cugmas",
            "Inese Bērziņa",
            "Laura Goldberga",
            "Mindaugas Tamosiunas",
            "Roberts Kadiķis"
        ],
        "comments": "08 pages, 10 figures, 04 tables, 20 references. Date of Conference: 13-14 June 2025 Date Added to IEEE Xplore: 10 July 2025 Electronic ISBN: 979-8-3315-0969-9 Print on Demand(PoD) ISBN: 979-8-3315-0970-5 DOI: https://doi.org/10.1109/AICCONF64766.2025.11064260 Conference Location: Prague, Czech Republic Online Access: this https URL",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "This study explores the application of deep learning to improve and automate pollen grain detection and classification in both optical and holographic microscopy images, with a particular focus on veterinary cytology use cases. We used YOLOv8s for object detection and MobileNetV3L for the classification task, evaluating their performance across imaging modalities. The models achieved 91.3% mAP50 for detection and 97% overall accuracy for classification on optical images, whereas the initial performance on greyscale holographic images was substantially lower. We addressed the performance gap issue through dataset expansion using automated labeling and bounding box area enlargement. These techniques, applied to holographic images, improved detection performance from 2.49% to 13.3% mAP50 and classification performance from 42% to 54%. Our work demonstrates that, at least for image classification tasks, it is possible to pair deep learning techniques with cost-effective lensless digital holographic microscopy devices.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.12101",
        "abs_url": "https://arxiv.org/abs/2512.12101",
        "pdf_url": "https://arxiv.org/pdf/2512.12101",
        "title": "AI-Augmented Pollen Recognition in Optical and Holographic Microscopy for Veterinary Imaging",
        "authors": [
            "Swarn S. Warshaneyan",
            "Maksims Ivanovs",
            "Blaž Cugmas",
            "Inese Bērziņa",
            "Laura Goldberga",
            "Mindaugas Tamosiunas",
            "Roberts Kadiķis"
        ],
        "comments": "10 pages, 10 figures, 2 tables, 22 references. Journal submission undergoing peer review",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "We present a comprehensive study on fully automated pollen recognition across both conventional optical and digital in-line holographic microscopy (DIHM) images of sample slides. Visually recognizing pollen in unreconstructed holographic images remains challenging due to speckle noise, twin-image artifacts and substantial divergence from bright-field appearances. We establish the performance baseline by training YOLOv8s for object detection and MobileNetV3L for classification on a dual-modality dataset of automatically annotated optical and affinely aligned DIHM images. On optical data, detection mAP50 reaches 91.3% and classification accuracy reaches 97%, whereas on DIHM data, we achieve only 8.15% for detection mAP50 and 50% for classification accuracy. Expanding the bounding boxes of pollens in DIHM images over those acquired in aligned optical images achieves 13.3% for detection mAP50 and 54% for classification accuracy. To improve object detection in DIHM images, we employ a Wasserstein GAN with spectral normalization (WGAN-SN) to create synthetic DIHM images, yielding an FID score of 58.246. Mixing real-world and synthetic data at the 1.0 : 1.5 ratio for DIHM images improves object detection up to 15.4%. These results demonstrate that GAN-based augmentation can reduce the performance divide, bringing fully automated DIHM workflows for veterinary imaging a small but important step closer to practice.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.12437",
        "abs_url": "https://arxiv.org/abs/2512.12437",
        "pdf_url": "https://arxiv.org/pdf/2512.12437",
        "title": "Sim2Real Reinforcement Learning for Soccer skills",
        "authors": [
            "Jonathan Spraggett"
        ],
        "comments": "Undergrad Thesis",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "This thesis work presents a more efficient and effective approach to training control-related tasks for humanoid robots using Reinforcement Learning (RL). The traditional RL methods are limited in adapting to real-world environments, complexity, and natural motions, but the proposed approach overcomes these limitations by using curriculum training and Adversarial Motion Priors (AMP) technique. The results show that the developed RL policies for kicking, walking, and jumping are more dynamic, and adaptive, and outperformed previous methods. However, the transfer of the learned policy from simulation to the real world was unsuccessful, highlighting the limitations of current RL methods in fully adapting to real-world scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13707",
        "abs_url": "https://arxiv.org/abs/2512.13707",
        "pdf_url": "https://arxiv.org/pdf/2512.13707",
        "title": "Modular connectivity in neural networks emerges from Poisson noise-motivated regularisation, and promotes robustness and compositional generalisation",
        "authors": [
            "Daoyuan Qian",
            "Qiyao Liang",
            "Ila Fiete"
        ],
        "comments": "",
        "subjects": "Biological Physics (physics.bio-ph); Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE); Machine Learning (stat.ML)",
        "abstract": "Circuits in the brain commonly exhibit modular architectures that factorise complex tasks, resulting in the ability to compositionally generalise and reduce catastrophic forgetting. In contrast, artificial neural networks (ANNs) appear to mix all processing, because modular solutions are difficult to find as they are vanishing subspaces in the space of possible solutions. Here, we draw inspiration from fault-tolerant computation and the Poisson-like firing of real neurons to show that activity-dependent neural noise, combined with nonlinear neural responses, drives the emergence of solutions that reflect an accurate understanding of modular tasks, corresponding to acquisition of a correct world model. We find that noise-driven modularisation can be recapitulated by a deterministic regulariser that multiplicatively combines weights and activations, revealing rich phenomenology not captured in linear networks or by standard regularisation methods. Though the emergence of modular structure requires sufficiently many training samples (exponential in the number of modular task dimensions), we show that pre-modularised ANNs exhibit superior noise-robustness and the ability to generalise and extrapolate well beyond training data, compared to ANNs without such inductive biases. Together, our work demonstrates a regulariser and architectures that could encourage modularity emergence to yield functional benefits.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13709",
        "abs_url": "https://arxiv.org/abs/2512.13709",
        "pdf_url": "https://arxiv.org/pdf/2512.13709",
        "title": "Smart Surveillance: Identifying IoT Device Behaviours using ML-Powered Traffic Analysis",
        "authors": [
            "Reza Ryan",
            "Napoleon Paciente",
            "Cahil Youngs",
            "Nickson Karie",
            "Qian Li",
            "Nasim Ferdosian"
        ],
        "comments": "6 pages, 1 figures, conference",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "The proliferation of Internet of Things (IoT) devices has grown exponentially in recent years, introducing significant security challenges. Accurate identification of the types of IoT devices and their associated actions through network traffic analysis is essential to mitigate potential threats. By monitoring and analysing packet flows between IoT devices and connected networks, anomalous or malicious behaviours can be detected. Existing research focuses primarily on device identification within local networks using methods such as protocol fingerprinting and wireless frequency scanning. However, these approaches are limited in their ability to monitor or classify IoT devices externally. To address this gap, we investigate the use of machine learning (ML) techniques, specifically Random Forest (RF), Multilayer Perceptron (MLP), and K-Nearest Neighbours (KNN), in conjunction with targeted network traffic monitoring to classify IoT device types and their actions. We constructed a testbed comprising an NPAT-enabled router and a diverse set of IoT devices, including smart cameras, controller hubs, home appliances, power controllers, and streaming devices. Experimental results demonstrate that IoT device and action recognition is feasible using our proposed ML-driven approach, with the RF classifier achieving the highest accuracy of 91%, while the MLP recorded the lowest accuracy at 56%. Notably, all device categories were successfully classified except for certain actions associated with security cameras, underscoring both the potential and the limitations of the proposed method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13715",
        "abs_url": "https://arxiv.org/abs/2512.13715",
        "pdf_url": "https://arxiv.org/pdf/2512.13715",
        "title": "Meta Hierarchical Reinforcement Learning for Scalable Resource Management in O-RAN",
        "authors": [
            "Fatemeh Lotfi",
            "Fatemeh Afghah"
        ],
        "comments": "This paper is submitted to IEEE Open Journal of the Communications Society",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "The increasing complexity of modern applications demands wireless networks capable of real time adaptability and efficient resource management. The Open Radio Access Network (O-RAN) architecture, with its RAN Intelligent Controller (RIC) modules, has emerged as a pivotal solution for dynamic resource management and network slicing. While artificial intelligence (AI) driven methods have shown promise, most approaches struggle to maintain performance under unpredictable and highly dynamic conditions. This paper proposes an adaptive Meta Hierarchical Reinforcement Learning (Meta-HRL) framework, inspired by Model Agnostic Meta Learning (MAML), to jointly optimize resource allocation and network slicing in O-RAN. The framework integrates hierarchical control with meta learning to enable both global and local adaptation: the high-level controller allocates resources across slices, while low level agents perform intra slice scheduling. The adaptive meta-update mechanism weights tasks by temporal difference error variance, improving stability and prioritizing complex network scenarios. Theoretical analysis establishes sublinear convergence and regret guarantees for the two-level learning process. Simulation results demonstrate a 19.8% improvement in network management efficiency compared with baseline RL and meta-RL approaches, along with faster adaptation and higher QoS satisfaction across eMBB, URLLC, and mMTC slices. Additional ablation and scalability studies confirm the method's robustness, achieving up to 40% faster adaptation and consistent fairness, latency, and throughput performance as network scale increases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13746",
        "abs_url": "https://arxiv.org/abs/2512.13746",
        "pdf_url": "https://arxiv.org/pdf/2512.13746",
        "title": "Probabilistic Predictions of Process-Induced Deformation in Carbon/Epoxy Composites Using a Deep Operator Network",
        "authors": [
            "Elham Kiyani",
            "Amit Makarand Deshpande",
            "Madhura Limaye",
            "Zhiwei Gao",
            "Sai Aditya Pradeep",
            "Srikanth Pilla",
            "Gang Li",
            "Zhen Li",
            "George Em Karniadakis"
        ],
        "comments": "21 pages, 13 figures",
        "subjects": "Computational Engineering, Finance, and Science (cs.CE); Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG)",
        "abstract": "Fiber reinforcement and polymer matrix respond differently to manufacturing conditions due to mismatch in coefficient of thermal expansion and matrix shrinkage during curing of thermosets. These heterogeneities generate residual stresses over multiple length scales, whose partial release leads to process-induced deformation (PID), requiring accurate prediction and mitigation via optimized non-isothermal cure cycles. This study considers a unidirectional AS4 carbon fiber/amine bi-functional epoxy prepreg and models PID using a two-mechanism framework that accounts for thermal expansion/shrinkage and cure shrinkage. The model is validated against manufacturing trials to identify initial and boundary conditions, then used to generate PID responses for a diverse set of non-isothermal cure cycles (time-temperature profiles). Building on this physics-based foundation, we develop a data-driven surrogate based on Deep Operator Networks (DeepONets). A DeepONet is trained on a dataset combining high-fidelity simulations with targeted experimental measurements of PID. We extend this to a Feature-wise Linear Modulation (FiLM) DeepONet, where branch-network features are modulated by external parameters, including the initial degree of cure, enabling prediction of time histories of degree of cure, viscosity, and deformation. Because experimental data are available only at limited time instances (for example, final deformation), we use transfer learning: simulation-trained trunk and branch networks are fixed and only the final layer is updated using measured final deformation. Finally, we augment the framework with Ensemble Kalman Inversion (EKI) to quantify uncertainty under experimental conditions and to support optimization of cure schedules for reduced PID in composites.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13757",
        "abs_url": "https://arxiv.org/abs/2512.13757",
        "pdf_url": "https://arxiv.org/pdf/2512.13757",
        "title": "Improving the Plausibility of Pressure Distributions Synthesized from Depth through Generative Modeling",
        "authors": [
            "Neevkumar Manavar",
            "Hanno Gerd Meyer",
            "Joachim Waßmuth",
            "Barbara Hammer",
            "Axel Schneider"
        ],
        "comments": "",
        "subjects": "Image and Video Processing (eess.IV); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Monitoring contact pressure in hospital beds is essential for preventing pressure ulcers and enabling real-time patient assessment. Current methods can predict pressure maps but often lack physical plausibility, limiting clinical reliability. This work proposes a framework that enhances plausibility via Informed Latent Space (ILS) and Weight Optimization Loss (WOL) with generative modeling to produce high-fidelity, physically consistent pressure estimates. This study also applies diffusion based conditional Brownian Bridge Diffusion Model (BBDM) and proposes training strategy for its latent counterpart Latent Brownian Bridge Diffusion Model (LBBDM) tailored for pressure synthesis in lying postures. Experiment results shows proposed method improves physical plausibility and performance over baselines: BBDM with ILS delivers highly detailed maps at higher computational cost and large inference time, whereas LBBDM provides faster inference with competitive performance. Overall, the approach supports non-invasive, vision-based, real-time patient monitoring in clinical environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13765",
        "abs_url": "https://arxiv.org/abs/2512.13765",
        "pdf_url": "https://arxiv.org/pdf/2512.13765",
        "title": "Towards Deep Learning Surrogate for the Forward Problem in Electrocardiology: A Scalable Alternative to Physics-Based Models",
        "authors": [
            "Shaheim Ogbomo-Harmitt",
            "Cesare Magnetti",
            "Chiara Spota",
            "Jakub Grzelak",
            "Oleg Aslanidi"
        ],
        "comments": "Accepted to CinC conference 2025",
        "subjects": "Image and Video Processing (eess.IV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "The forward problem in electrocardiology, computing body surface potentials from cardiac electrical activity, is traditionally solved using physics-based models such as the bidomain or monodomain equations. While accurate, these approaches are computationally expensive, limiting their use in real-time and large-scale clinical applications. We propose a proof-of-concept deep learning (DL) framework as an efficient surrogate for forward solvers. The model adopts a time-dependent, attention-based sequence-to-sequence architecture to predict electrocardiogram (ECG) signals from cardiac voltage propagation maps. A hybrid loss combining Huber loss with a spectral entropy term was introduced to preserve both temporal and frequency-domain fidelity. Using 2D tissue simulations incorporating healthy, fibrotic, and gap junction-remodelled conditions, the model achieved high accuracy (mean $R^2 = 0.99 \\pm 0.01$). Ablation studies confirmed the contributions of convolutional encoders, time-aware attention, and spectral entropy loss. These findings highlight DL as a scalable, cost-effective alternative to physics-based solvers, with potential for clinical and digital twin applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13825",
        "abs_url": "https://arxiv.org/abs/2512.13825",
        "pdf_url": "https://arxiv.org/pdf/2512.13825",
        "title": "Unreasonable effectiveness of unsupervised learning in identifying Majorana topology",
        "authors": [
            "Jacob Taylor",
            "Haining Pan",
            "Sankar Das Sarma"
        ],
        "comments": "7 pages, 4 figures",
        "subjects": "Disordered Systems and Neural Networks (cond-mat.dis-nn); Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Machine Learning (cs.LG)",
        "abstract": "In unsupervised learning, the training data for deep learning does not come with any labels, thus forcing the algorithm to discover hidden patterns in the data for discerning useful information. This, in principle, could be a powerful tool in identifying topological order since topology does not always manifest in obvious physical ways (e.g., topological superconductivity) for its decisive confirmation. The problem, however, is that unsupervised learning is a difficult challenge, necessitating huge computing resources, which may not always work. In the current work, we combine unsupervised and supervised learning using an autoencoder to establish that unlabeled data in the Majorana splitting in realistic short disordered nanowires may enable not only a distinction between `topological' and `trivial', but also where their crossover happens in the relevant parameter space. This may be a useful tool in identifying topology in Majorana nanowires.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13848",
        "abs_url": "https://arxiv.org/abs/2512.13848",
        "pdf_url": "https://arxiv.org/pdf/2512.13848",
        "title": "BiCoRec: Bias-Mitigated Context-Aware Sequential Recommendation Model",
        "authors": [
            "Mufhumudzi Muthivhi",
            "Terence L van Zyl",
            "Hairong Wang"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Sequential recommendation models aim to learn from users evolving preferences. However, current state-of-the-art models suffer from an inherent popularity bias. This study developed a novel framework, BiCoRec, that adaptively accommodates users changing preferences for popular and niche items. Our approach leverages a co-attention mechanism to obtain a popularity-weighted user sequence representation, facilitating more accurate predictions. We then present a new training scheme that learns from future preferences using a consistency loss function. BiCoRec aimed to improve the recommendation performance of users who preferred niche items. For these users, BiCoRec achieves a 26.00% average improvement in NDCG@10 over state-of-the-art baselines. When ranking the relevant item against the entire collection, BiCoRec achieves NDCG@10 scores of 0.0102, 0.0047, 0.0021, and 0.0005 for the Movies, Fashion, Games and Music datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13868",
        "abs_url": "https://arxiv.org/abs/2512.13868",
        "pdf_url": "https://arxiv.org/pdf/2512.13868",
        "title": "Safe Online Control-Informed Learning",
        "authors": [
            "Tianyu Zhou",
            "Zihao Liang",
            "Zehui Lu",
            "Shaoshuai Mou"
        ],
        "comments": "",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "This paper proposes a Safe Online Control-Informed Learning framework for safety-critical autonomous systems. The framework unifies optimal control, parameter estimation, and safety constraints into an online learning process. It employs an extended Kalman filter to incrementally update system parameters in real time, enabling robust and data-efficient adaptation under uncertainty. A softplus barrier function enforces constraint satisfaction during learning and control while eliminating the dependence on high-quality initial guesses. Theoretical analysis establishes convergence and safety guarantees, and the framework's effectiveness is demonstrated on cart-pole and robot-arm systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13870",
        "abs_url": "https://arxiv.org/abs/2512.13870",
        "pdf_url": "https://arxiv.org/pdf/2512.13870",
        "title": "Simultaneous and Proportional Finger Motion Decoding Using Spatial Features from High-Density Surface Electromyography",
        "authors": [
            "Ricardo Gonçalves Molinari",
            "Leonardo Abdala Elias"
        ],
        "comments": "39 pages, 13 figures, 2 tables",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Restoring natural and intuitive hand function requires simultaneous and proportional control (SPC) of multiple degrees of freedom (DoFs). This study systematically evaluated the multichannel linear descriptors-based block field method (MLD-BFM) for continuous decoding of five finger-joint DoFs by leveraging the rich spatial information of high-density surface electromyography (HD sEMG). Twenty-one healthy participants performed dynamic sinusoidal finger movements while HD sEMG signals were recorded from the \\textit{extensor digitorum communis} (EDC) and \\textit{flexor digitorum superficialis} (FDS) muscles. MLD-BFM extracted region-specific spatial features, including effective field strength ($\\Sigma$), field-strength variation rate ($\\Phi$), and spatial complexity ($\\Omega$). Model performance was optimized (block size: $2 \\times 2$; window: 0.15 s) and compared with conventional time-domain features and dimensionality reduction approaches when applied to multi-output regression models. MLD-BFM consistently achieved the highest $\\mathrm{R}^2_{\\mathrm{vw}}$ values across all models. The multilayer perceptron (MLP) combined with MLD-BFM yielded the best performance ($\\mathrm{R}^2_{\\mathrm{vw}} = 86.68\\% \\pm 0.33$). Time-domain features also showed strong predictive capability and were statistically comparable to MLD-BFM in some models, whereas dimensionality reduction techniques exhibited lower accuracy. Decoding accuracy was higher for the middle and ring fingers than for the thumb. Overall, MLD-BFM improved continuous finger movement decoding accuracy, underscoring the importance of taking advantage of the spatial richness of HD sEMG. These findings suggest that spatially structured features enhance SPC and provide practical guidance for designing robust, real-time, and responsive myoelectric interfaces.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13890",
        "abs_url": "https://arxiv.org/abs/2512.13890",
        "pdf_url": "https://arxiv.org/pdf/2512.13890",
        "title": "Group-Theoretic Reinforcement Learning of Dynamical Decoupling Sequences",
        "authors": [
            "Charles Marrder",
            "Shuo Sun",
            "Murray J. Holland"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Dynamical decoupling seeks to mitigate phase decoherence in qubits by applying a carefully designed sequence of effectively instantaneous electromagnetic pulses. Although analytic solutions exist for pulse timings that are optimal under specific noise regimes, identifying the optimal timings for a realistic noise spectrum remains challenging. We propose a reinforcement learning (RL)-based method for designing pulse sequences on qubits. Our novel action set enables the RL agent to efficiently navigate this inherently non-convex optimization landscape. The action set, derived from Thompson's group $F$, is applicable to a broad class of sequential decision problems whose states can be represented as bounded sequences. We demonstrate that our RL agent can learn pulse sequences that minimize dephasing without requiring explicit knowledge of the underlying noise spectrum. This work opens the possibility for real-time learning of optimal dynamical decoupling sequences on qubits which are dephasing-limited. The model-free nature of our algorithm suggests that the agent may ultimately learn optimal pulse sequences even in the presence of unmodeled physical effects, such as pulse errors or non-Gaussian noise.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13902",
        "abs_url": "https://arxiv.org/abs/2512.13902",
        "pdf_url": "https://arxiv.org/pdf/2512.13902",
        "title": "KLO-Net: A Dynamic K-NN Attention U-Net with CSP Encoder for Efficient Prostate Gland Segmentation from MRI",
        "authors": [
            "Anning Tian",
            "Byunghyun Ko",
            "Kaichen Qu",
            "Mengyuan Liu",
            "Jeongkyu Lee"
        ],
        "comments": "Preprint. Accepted to SPIE Medical Imaging 2026: Image Processing",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Real-time deployment of prostate MRI segmentation on clinical workstations is often bottlenecked by computational load and memory footprint. Deep learning-based prostate gland segmentation approaches remain challenging due to anatomical variability. To bridge this efficiency gap while still maintaining reliable segmentation accuracy, we propose KLO-Net, a dynamic K-Nearest Neighbor attention U-Net with Cross Stage Partial, i.e., CSP, encoder for efficient prostate gland segmentation from MRI scan. Unlike the regular K-NN attention mechanism, the proposed dynamic K-NN attention mechanism allows the model to adaptively determine the number of attention connections for each spatial location within a slice. In addition, CSP blocks address the computational load to reduce memory consumption. To evaluate the model's performance, comprehensive experiments and ablation studies are conducted on two public datasets, i.e., PROMISE12 and PROSTATEx, to validate the proposed architecture. The detailed comparative analysis demonstrates the model's advantage in computational efficiency and segmentation quality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13930",
        "abs_url": "https://arxiv.org/abs/2512.13930",
        "pdf_url": "https://arxiv.org/pdf/2512.13930",
        "title": "Hierarchical Multi-agent Large Language Model Reasoning for Autonomous Functional Materials Discovery",
        "authors": [
            "Samuel Rothfarb",
            "Megan C. Davis",
            "Ivana Matanovic",
            "Baikun Li",
            "Edward F. Holby",
            "Wilton J.M. Kort-Kamp"
        ],
        "comments": "Keywords: Multi-agent reasoning; Large language models; Active learning; AI-driven simulation; Materials discovery; Density functional theory; Surface chemistry",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Artificial intelligence is reshaping scientific exploration, but most methods automate procedural tasks without engaging in scientific reasoning, limiting autonomy in discovery. We introduce Materials Agents for Simulation and Theory in Electronic-structure Reasoning (MASTER), an active learning framework where large language models autonomously design, execute, and interpret atomistic simulations. In MASTER, a multimodal system translates natural language into density functional theory workflows, while higher-level reasoning agents guide discovery through a hierarchy of strategies, including a single agent baseline and three multi-agent approaches: peer review, triage-ranking, and triage-forms. Across two chemical applications, CO adsorption on Cu-surface transition metal (M) adatoms and on M-N-C catalysts, reasoning-driven exploration reduces required atomistic simulations by up to 90% relative to trial-and-error selection. Reasoning trajectories reveal chemically grounded decisions that cannot be explained by stochastic sampling or semantic bias. Altogether, multi-agent collaboration accelerates materials discovery and marks a new paradigm for autonomous scientific exploration.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13961",
        "abs_url": "https://arxiv.org/abs/2512.13961",
        "pdf_url": "https://arxiv.org/pdf/2512.13961",
        "title": "Olmo 3",
        "authors": [
            "Team Olmo",
            "Allyson Ettinger",
            "Amanda Bertsch",
            "Bailey Kuehl",
            "David Graham",
            "David Heineman",
            "Dirk Groeneveld",
            "Faeze Brahman",
            "Finbarr Timbers",
            "Hamish Ivison",
            "Jacob Morrison",
            "Jake Poznanski",
            "Kyle Lo",
            "Luca Soldaini",
            "Matt Jordan",
            "Mayee Chen",
            "Michael Noukhovitch",
            "Nathan Lambert",
            "Pete Walsh",
            "Pradeep Dasigi",
            "Robert Berry",
            "Saumya Malik",
            "Saurabh Shah",
            "Scott Geng",
            "Shane Arora",
            "Shashank Gupta",
            "Taira Anderson",
            "Teng Xiao",
            "Tyler Murray",
            "Tyler Romero",
            "Victoria Graf",
            "Akari Asai",
            "Akshita Bhagia",
            "Alexander Wettig",
            "Alisa Liu",
            "Aman Rangapur",
            "Chloe Anastasiades",
            "Costa Huang",
            "Dustin Schwenk",
            "Harsh Trivedi",
            "Ian Magnusson",
            "Jaron Lochner",
            "Jiacheng Liu",
            "Lester James V. Miranda",
            "Maarten Sap",
            "Malia Morgan",
            "Michael Schmitz",
            "Michal Guerquin",
            "Michael Wilson",
            "Regan Huff",
            "Ronan Le Bras",
            "Rui Xin",
            "Rulin Shao",
            "Sam Skjonsberg",
            "Shannon Zejiang Shen",
            "Shuyue Stella Li",
            "Tucker Wilde",
            "Valentina Pyatkin",
            "Will Merrill",
            "Yapei Chang",
            "Yuling Gu",
            "Zhiyuan Zeng",
            "Ashish Sabharwal",
            "Luke Zettlemoyer",
            "Pang Wei Koh",
            "Ali Farhadi",
            "Noah A. Smith",
            "Hannaneh Hajishirzi"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "We introduce Olmo 3, a family of state-of-the-art, fully-open language models at the 7B and 32B parameter scales. Olmo 3 model construction targets long-context reasoning, function calling, coding, instruction following, general chat, and knowledge recall. This release includes the entire model flow, i.e., the full lifecycle of the family of models, including every stage, checkpoint, data point, and dependency used to build it. Our flagship model, Olmo 3 Think 32B, is the strongest fully-open thinking model released to-date.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.13997",
        "abs_url": "https://arxiv.org/abs/2512.13997",
        "pdf_url": "https://arxiv.org/pdf/2512.13997",
        "title": "Maximum Mean Discrepancy with Unequal Sample Sizes via Generalized U-Statistics",
        "authors": [
            "Aaron Wei",
            "Milad Jalali",
            "Danica J. Sutherland"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST); Methodology (stat.ME)",
        "abstract": "Existing two-sample testing techniques, particularly those based on choosing a kernel for the Maximum Mean Discrepancy (MMD), often assume equal sample sizes from the two distributions. Applying these methods in practice can require discarding valuable data, unnecessarily reducing test power. We address this long-standing limitation by extending the theory of generalized U-statistics and applying it to the usual MMD estimator, resulting in new characterization of the asymptotic distributions of the MMD estimator with unequal sample sizes (particularly outside the proportional regimes required by previous partial results). This generalization also provides a new criterion for optimizing the power of an MMD test with unequal sample sizes. Our approach preserves all available data, enhancing test accuracy and applicability in realistic settings. Along the way, we give much cleaner characterizations of the variance of MMD estimators, revealing something that might be surprising to those in the area: while zero MMD implies a degenerate estimator, it is sometimes possible to have a degenerate estimator with nonzero MMD as well; we give a construction and a proof that it does not happen in common situations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14000",
        "abs_url": "https://arxiv.org/abs/2512.14000",
        "pdf_url": "https://arxiv.org/pdf/2512.14000",
        "title": "On the Hardness of Conditional Independence Testing In Practice",
        "authors": [
            "Zheng He",
            "Roman Pogodin",
            "Yazhe Li",
            "Namrata Deka",
            "Arthur Gretton",
            "Danica J. Sutherland"
        ],
        "comments": "Published at NeurIPS 2025: this https URL",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "Tests of conditional independence (CI) underpin a number of important problems in machine learning and statistics, from causal discovery to evaluation of predictor fairness and out-of-distribution robustness. Shah and Peters (2020) showed that, contrary to the unconditional case, no universally finite-sample valid test can ever achieve nontrivial power. While informative, this result (based on \"hiding\" dependence) does not seem to explain the frequent practical failures observed with popular CI tests. We investigate the Kernel-based Conditional Independence (KCI) test - of which we show the Generalized Covariance Measure underlying many recent tests is nearly a special case - and identify the major factors underlying its practical behavior. We highlight the key role of errors in the conditional mean embedding estimate for the Type-I error, while pointing out the importance of selecting an appropriate conditioning kernel (not recognized in previous work) as being necessary for good test power but also tending to inflate Type-I error.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14010",
        "abs_url": "https://arxiv.org/abs/2512.14010",
        "pdf_url": "https://arxiv.org/pdf/2512.14010",
        "title": "Physics-Informed Machine Learning for Two-Phase Moving-Interface and Stefan Problems",
        "authors": [
            "Che-Chia Chang",
            "Te-Sheng Lin",
            "Ming-Chih Lai"
        ],
        "comments": "",
        "subjects": "Computational Physics (physics.comp-ph); Machine Learning (cs.LG)",
        "abstract": "The Stefan problem is a classical free-boundary problem that models phase-change processes and poses computational challenges due to its moving interface and nonlinear temperature-phase coupling. In this work, we develop a physics-informed neural network framework for solving two-phase Stefan problems. The proposed method explicitly tracks the interface motion and enforces the discontinuity in the temperature gradient across the interface while maintaining global consistency of the temperature field. Our approach employs two neural networks: one representing the moving interface and the other for the temperature field. The interface network allows rapid categorization of thermal diffusivity in the spatial domain, which is a crucial step for selecting training points for the temperature network. The temperature network's input is augmented with a modified zero-level set function to accurately capture the jump in its normal derivative across the interface. Numerical experiments on two-phase dynamical Stefan problems demonstrate the superior accuracy and effectiveness of our proposed method compared with the ones obtained by other neural network methodology in literature. The results indicate that the proposed framework offers a robust and flexible alternative to traditional numerical methods for solving phase-change problems governed by moving boundaries. In addition, the proposed method can capture an unstable interface evolution associated with the Mullins-Sekerka instability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14045",
        "abs_url": "https://arxiv.org/abs/2512.14045",
        "pdf_url": "https://arxiv.org/pdf/2512.14045",
        "title": "A Deep Dive into Function Inlining and its Security Implications for ML-based Binary Analysis",
        "authors": [
            "Omar Abusabha",
            "Jiyong Uhm",
            "Tamer Abuhmed",
            "Hyungjoon Koo"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG); Programming Languages (cs.PL)",
        "abstract": "A function inlining optimization is a widely used transformation in modern compilers, which replaces a call site with the callee's body in need. While this transformation improves performance, it significantly impacts static features such as machine instructions and control flow graphs, which are crucial to binary analysis. Yet, despite its broad impact, the security impact of function inlining remains underexplored to date. In this paper, we present the first comprehensive study of function inlining through the lens of machine learning-based binary analysis. To this end, we dissect the inlining decision pipeline within the LLVM's cost model and explore the combinations of the compiler options that aggressively promote the function inlining ratio beyond standard optimization levels, which we term extreme inlining. We focus on five ML-assisted binary analysis tasks for security, using 20 unique models to systematically evaluate their robustness under extreme inlining scenarios. Our extensive experiments reveal several significant findings: i) function inlining, though a benign transformation in intent, can (in)directly affect ML model behaviors, being potentially exploited by evading discriminative or generative ML models; ii) ML models relying on static features can be highly sensitive to inlining; iii) subtle compiler settings can be leveraged to deliberately craft evasive binary variants; and iv) inlining ratios vary substantially across applications and build configurations, undermining assumptions of consistency in training and evaluation of ML models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14083",
        "abs_url": "https://arxiv.org/abs/2512.14083",
        "pdf_url": "https://arxiv.org/pdf/2512.14083",
        "title": "Scalable Frameworks for Real-World Audio-Visual Speech Recognition",
        "authors": [
            "Sungnyun Kim"
        ],
        "comments": "PhD Dissertation",
        "subjects": "Audio and Speech Processing (eess.AS); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "The practical deployment of Audio-Visual Speech Recognition (AVSR) systems is fundamentally challenged by significant performance degradation in real-world environments, characterized by unpredictable acoustic noise and visual interference. This dissertation posits that a systematic, hierarchical approach is essential to overcome these challenges, achieving the robust scalability at the representation, architecture, and system levels. At the representation level, we investigate methods for building a unified model that learns audio-visual features inherently robust to diverse real-world corruptions, thereby enabling generalization to new environments without specialized modules. To address architectural scalability, we explore how to efficiently expand model capacity while ensuring the adaptive and reliable use of multimodal inputs, developing a framework that intelligently allocates computational resources based on the input characteristics. Finally, at the system level, we present methods to expand the system's functionality through modular integration with large-scale foundation models, leveraging their powerful cognitive and generative capabilities to maximize final recognition accuracy. By systematically providing solutions at each of these three levels, this dissertation aims to build a next-generation, robust, and scalable AVSR system with high reliability in real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14115",
        "abs_url": "https://arxiv.org/abs/2512.14115",
        "pdf_url": "https://arxiv.org/pdf/2512.14115",
        "title": "Joint Multimodal Contrastive Learning for Robust Spoken Term Detection and Keyword Spotting",
        "authors": [
            "Ramesh Gundluru",
            "Shubham Gupta",
            "Sri Rama Murty K"
        ],
        "comments": "",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG)",
        "abstract": "Acoustic Word Embeddings (AWEs) improve the efficiency of speech retrieval tasks such as Spoken Term Detection (STD) and Keyword Spotting (KWS). However, existing approaches suffer from limitations, including unimodal supervision, disjoint optimization of audio-audio and audio-text alignment, and the need for task-specific models. To address these shortcomings, we propose a joint multimodal contrastive learning framework that unifies both acoustic and cross-modal supervision in a shared embedding space. Our approach simultaneously optimizes: (i) audio-text contrastive learning, inspired by the CLAP loss, to align audio and text representations and (ii) audio-audio contrastive learning, via Deep Word Discrimination (DWD) loss, to enhance intra-class compactness and inter-class separation. The proposed method outperforms existing AWE baselines on word discrimination task while flexibly supporting both STD and KWS. To our knowledge, this is the first comprehensive approach of its kind.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14221",
        "abs_url": "https://arxiv.org/abs/2512.14221",
        "pdf_url": "https://arxiv.org/pdf/2512.14221",
        "title": "Weighted Conformal Prediction Provides Adaptive and Valid Mask-Conditional Coverage for General Missing Data Mechanisms",
        "authors": [
            "Jiarong Fan",
            "Juhyun Park. Thi Phuong Thuy Vo",
            "Nicolas Brunel"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Conformal prediction (CP) offers a principled framework for uncertainty quantification, but it fails to guarantee coverage when faced with missing covariates. In addressing the heterogeneity induced by various missing patterns, Mask-Conditional Valid (MCV) Coverage has emerged as a more desirable property than Marginal Coverage. In this work, we adapt split CP to handle missing values by proposing a preimpute-mask-then-correct framework that can offer valid coverage. We show that our method provides guaranteed Marginal Coverage and Mask-Conditional Validity for general missing data mechanisms. A key component of our approach is a reweighted conformal prediction procedure that corrects the prediction sets after distributional imputation (multiple imputation) of the calibration dataset, making our method compatible with standard imputation pipelines. We derive two algorithms, and we show that they are approximately marginally valid and MCV. We evaluate them on synthetic and real-world datasets. It reduces significantly the width of prediction intervals w.r.t standard MCV methods, while maintaining the target guarantees.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14237",
        "abs_url": "https://arxiv.org/abs/2512.14237",
        "pdf_url": "https://arxiv.org/pdf/2512.14237",
        "title": "Ladder Up, Memory Down: Low-Cost Fine-Tuning With Side Nets",
        "authors": [
            "Estelle Zheng",
            "Nathan Cerisara",
            "Sébastien Warichet",
            "Emmanuel Helbert",
            "Christophe Cerisara"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Fine-tuning large language models (LLMs) is often limited by the memory available on commodity GPUs. Parameter-efficient fine-tuning (PEFT) methods such as QLoRA reduce the number of trainable parameters, yet still incur high memory usage induced by the backward pass in the full model. We revisit Ladder Side Tuning (LST), a rarely explored PEFT technique that adds a lightweight side network, and show that it matches QLoRA's compute scaling slope while cutting peak memory by 50\\%. Across different downstream benchmarks spanning natural language understanding, mathematical and LLM-critic tasks, LST has competitive performance with QLoRA's accuracy on average while being much more memory-efficient. This efficiency enables fine-tuning of 7B-parameter models on a single 12 GB consumer GPU with 2k-token contexts, requiring no gradient checkpointing\\textemdash conditions under which QLoRA exhausts memory. Beyond memory efficiency, we also establish scaling laws showing that LST scales similarly to QLoRA. We exploit Ladder's architectural flexibility by introducing xLadder, a depth-extended variant that increases effective depth via cross-connections and shortens chain-of-thought (CoT) at fixed parameter count. Ladder is strong when memory is the bottleneck; xLadder builds on this by enabling deeper reasoning without additional memory overhead.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14274",
        "abs_url": "https://arxiv.org/abs/2512.14274",
        "pdf_url": "https://arxiv.org/pdf/2512.14274",
        "title": "TUN: Detecting Significant Points in Persistence Diagrams with Deep Learning",
        "authors": [
            "Yu Chen",
            "Hongwei Lin"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Algebraic Topology (math.AT)",
        "abstract": "Persistence diagrams (PDs) provide a powerful tool for understanding the topology of the underlying shape of a point cloud. However, identifying which points in PDs encode genuine signals remains challenging. This challenge directly hinders the practical adoption of topological data analysis in many applications, where automated and reliable interpretation of persistence diagrams is essential for downstream decision-making. In this paper, we study automatic significance detection for one-dimensional persistence diagrams. Specifically, we propose Topology Understanding Net (TUN), a multi-modal network that combines enhanced PD descriptors with self-attention, a PointNet-style point cloud encoder, learned fusion, and per-point classification, alongside stable preprocessing and imbalance-aware training. It provides an automated and effective solution for identifying significant points in PDs, which are critical for downstream applications. Experiments show that TUN outperforms classic methods in detecting significant points in PDs, illustrating its effectiveness in real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14308",
        "abs_url": "https://arxiv.org/abs/2512.14308",
        "pdf_url": "https://arxiv.org/pdf/2512.14308",
        "title": "Improving the Accuracy of Amortized Model Comparison with Self-Consistency",
        "authors": [
            "Šimon Kucharský",
            "Aayush Mishra",
            "Daniel Habermann",
            "Stefan T. Radev",
            "Paul-Christian Bürkner"
        ],
        "comments": "17 pages, 9 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Computation (stat.CO)",
        "abstract": "Amortized Bayesian inference (ABI) offers fast, scalable approximations to posterior densities by training neural surrogates on data simulated from the statistical model. However, ABI methods are highly sensitive to model misspecification: when observed data fall outside the training distribution (generative scope of the statistical models), neural surrogates can behave unpredictably. This makes it a challenge in a model comparison setting, where multiple statistical models are considered, of which at least some are misspecified. Recent work on self-consistency (SC) provides a promising remedy to this issue, accessible even for empirical data (without ground-truth labels). In this work, we investigate how SC can improve amortized model comparison conceptualized in four different ways. Across two synthetic and two real-world case studies, we find that approaches for model comparison that estimate marginal likelihoods through approximate parameter posteriors consistently outperform methods that directly approximate model evidence or posterior model probabilities. SC training improves robustness when the likelihood is available, even under severe model misspecification. The benefits of SC for methods without access of analytic likelihoods are more limited and inconsistent. Our results suggest practical guidance for reliable amortized Bayesian model comparison: prefer parameter posterior-based methods and augment them with SC training on empirical datasets to mitigate extrapolation bias under model misspecification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14311",
        "abs_url": "https://arxiv.org/abs/2512.14311",
        "pdf_url": "https://arxiv.org/pdf/2512.14311",
        "title": "Continual Learning at the Edge: An Agnostic IIoT Architecture",
        "authors": [
            "Pablo García-Santaclara",
            "Bruno Fernández-Castro",
            "Rebeca P. Díaz-Redondo",
            "Carlos Calvo-Moa",
            "Henar Mariño-Bodelón"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "The exponential growth of Internet-connected devices has presented challenges to traditional centralized computing systems due to latency and bandwidth limitations. Edge computing has evolved to address these difficulties by bringing computations closer to the data source. Additionally, traditional machine learning algorithms are not suitable for edge-computing systems, where data usually arrives in a dynamic and continual way. However, incremental learning offers a good solution for these settings. We introduce a new approach that applies the incremental learning philosophy within an edge-computing scenario for the industrial sector with a specific purpose: real time quality control in a manufacturing system. Applying continual learning we reduce the impact of catastrophic forgetting and provide an efficient and effective solution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14333",
        "abs_url": "https://arxiv.org/abs/2512.14333",
        "pdf_url": "https://arxiv.org/pdf/2512.14333",
        "title": "Dual Attention Guided Defense Against Malicious Edits",
        "authors": [
            "Jie Zhang",
            "Shuai Dong",
            "Shiguang Shan",
            "Xilin Chen"
        ],
        "comments": "11 pages, 7 figures",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Computers and Society (cs.CY); Machine Learning (cs.LG)",
        "abstract": "Recent progress in text-to-image diffusion models has transformed image editing via text prompts, yet this also introduces significant ethical challenges from potential misuse in creating deceptive or harmful content. While current defenses seek to mitigate this risk by embedding imperceptible perturbations, their effectiveness is limited against malicious tampering. To address this issue, we propose a Dual Attention-Guided Noise Perturbation (DANP) immunization method that adds imperceptible perturbations to disrupt the model's semantic understanding and generation process. DANP functions over multiple timesteps to manipulate both cross-attention maps and the noise prediction process, using a dynamic threshold to generate masks that identify text-relevant and irrelevant regions. It then reduces attention in relevant areas while increasing it in irrelevant ones, thereby misguides the edit towards incorrect regions and preserves the intended targets. Additionally, our method maximizes the discrepancy between the injected noise and the model's predicted noise to further interfere with the generation. By targeting both attention and noise prediction mechanisms, DANP exhibits impressive immunity against malicious edits, and extensive experiments confirm that our method achieves state-of-the-art performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14404",
        "abs_url": "https://arxiv.org/abs/2512.14404",
        "pdf_url": "https://arxiv.org/pdf/2512.14404",
        "title": "From STLS to Projection-based Dictionary Selection in Sparse Regression for System Identification",
        "authors": [
            "Hangjun Cho",
            "Fabio V.G. Amaral",
            "Andrei A. Klishin",
            "Cassio M. Oishi",
            "Steven L. Brunton"
        ],
        "comments": "34 pages, 11 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Optimization and Control (math.OC); Computational Physics (physics.comp-ph)",
        "abstract": "In this work, we revisit dictionary-based sparse regression, in particular, Sequential Threshold Least Squares (STLS), and propose a score-guided library selection to provide practical guidance for data-driven modeling, with emphasis on SINDy-type algorithms. STLS is an algorithm to solve the $\\ell_0$ sparse least-squares problem, which relies on splitting to efficiently solve the least-squares portion while handling the sparse term via proximal methods. It produces coefficient vectors whose components depend on both the projected reconstruction errors, here referred to as the scores, and the mutual coherence of dictionary terms. The first contribution of this work is a theoretical analysis of the score and dictionary-selection strategy. This could be understood in both the original and weak SINDy regime. Second, numerical experiments on ordinary and partial differential equations highlight the effectiveness of score-based screening, improving both accuracy and interpretability in dynamical system identification. These results suggest that integrating score-guided methods to refine the dictionary more accurately may help SINDy users in some cases to enhance their robustness for data-driven discovery of governing equations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14410",
        "abs_url": "https://arxiv.org/abs/2512.14410",
        "pdf_url": "https://arxiv.org/pdf/2512.14410",
        "title": "Pattern Recognition of Aluminium Arbitrage in Global Trade Data",
        "authors": [
            "Muhammad Sukri Bin Ramli"
        ],
        "comments": "",
        "subjects": "General Economics (econ.GN); Machine Learning (cs.LG)",
        "abstract": "As the global economy transitions toward decarbonization, the aluminium sector has become a focal point for strategic resource management. While policies such as the Carbon Border Adjustment Mechanism (CBAM) aim to reduce emissions, they have inadvertently widened the price arbitrage between primary metal, scrap, and semi-finished goods, creating new incentives for market optimization. This study presents a unified, unsupervised machine learning framework to detect and classify emerging trade anomalies within UN Comtrade data (2020 to 2024). Moving beyond traditional rule-based monitoring, we apply a four-layer analytical pipeline utilizing Forensic Statistics, Isolation Forests, Network Science, and Deep Autoencoders. Contrary to the hypothesis that Sustainability Arbitrage would be the primary driver, empirical results reveal a contradictory and more severe phenomenon of Hardware Masking. Illicit actors exploit bi-directional tariff incentives by misclassifying scrap as high-count heterogeneous goods to justify extreme unit-price outliers of >$160/kg, a 1,900% markup indicative of Trade-Based Money Laundering (TBML) rather than commercial arbitrage. Topologically, risk is not concentrated in major exporters but in high-centrality Shadow Hubs that function as pivotal nodes for illicit rerouting. These actors execute a strategy of Void-Shoring, systematically suppressing destination data to Unspecified Code to fracture mirror statistics and sever forensic trails. Validated by SHAP (Shapley Additive Explanations), the results confirm that price deviation is the dominant predictor of anomalies, necessitating a paradigm shift in customs enforcement from physical volume checks to dynamic, algorithmic valuation auditing.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14422",
        "abs_url": "https://arxiv.org/abs/2512.14422",
        "pdf_url": "https://arxiv.org/pdf/2512.14422",
        "title": "Hybrid Ensemble Method for Detecting Cyber-Attacks in Water Distribution Systems Using the BATADAL Dataset",
        "authors": [
            "Waqas Ahmed"
        ],
        "comments": "18 pages, & figures",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "The cybersecurity of Industrial Control Systems that manage critical infrastructure such as Water Distribution Systems has become increasingly important as digital connectivity expands. BATADAL benchmark data is a good source of testing intrusion detection techniques, but it presents several important problems, such as imbalance in the number of classes, multivariate time dependence, and stealthy attacks. We consider a hybrid ensemble learning model that will enhance the detection ability of cyber-attacks in WDS by using the complementary capabilities of machine learning and deep learning models. Three base learners, namely, Random Forest , eXtreme Gradient Boosting , and Long Short-Term Memory network, have been strictly compared and seven ensemble types using simple averaged and stacked learning with a logistic regression meta-learner. Random Forest analysis identified top predictors turned into temporal and statistical features, and Synthetic Minority Oversampling Technique (SMOTE) was used to overcome the class imbalance issue. The analyics indicates that the single Long Short-Term Memory network model is of poor performance (F1 = 0.000, AUC = 0.4460), but tree-based models, especially eXtreme Gradient Boosting, perform well (F1 = 0.7470, AUC=0.9684). The hybrid stacked ensemble of Random Forest , eXtreme Gradient Boosting , and Long Short-Term Memory network scored the highest, with the attack class of 0.7205 with an F1-score and a AUC of 0.9826 indicating that the heterogeneous stacking between model precision and generalization can work. The proposed framework establishes a robust and scalable solution for cyber-attack detection in time-dependent industrial systems, integrating temporal learning and ensemble diversity to support the secure operation of critical infrastructure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14427",
        "abs_url": "https://arxiv.org/abs/2512.14427",
        "pdf_url": "https://arxiv.org/pdf/2512.14427",
        "title": "Effect of Document Packing on the Latent Multi-Hop Reasoning Capabilities of Large Language Models",
        "authors": [
            "Gabriele Prato",
            "Shagun Sodhani",
            "Alessandro Sordoni",
            "Sarath Chandar"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "The standard practice for training large language models involves packing multiple documents together to optimize computational efficiency. However, the impact of this process on the models' capabilities remains largely unexplored. To address this gap, we investigate how different document-packing strategies influence the latent multi-hop reasoning abilities of LLMs. Our findings indicate that packing can improve model performance compared to training on individual documents, at the expense of more compute. To further understand the underlying mechanisms, we conduct an ablation study, identifying key factors that explain the advantages of packing. Ultimately, our research deepens the understanding of LLM training dynamics and provides practical insights for optimizing model development.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14500",
        "abs_url": "https://arxiv.org/abs/2512.14500",
        "pdf_url": "https://arxiv.org/pdf/2512.14500",
        "title": "C-ing Clearly: Enhanced Binary Code Explanations using C code",
        "authors": [
            "Teodor Poncu",
            "Ioana Pintilie",
            "Marius Dragoi",
            "Dragos Tantaru",
            "Florin Brad"
        ],
        "comments": "18 pages, 5 figures",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) typically excel at coding tasks involving high-level programming languages, as opposed to lower-level programming languages, such as assembly. We propose a synthetic data generation method named C-ing Clearly, which leverages the corresponding C code to enhance an LLM's understanding of assembly. By fine-tuning on data generated through our method, we demonstrate improved LLM performance for binary code summarization and vulnerability detection. Our approach demonstrates consistent gains across different LLM families and model sizes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14602",
        "abs_url": "https://arxiv.org/abs/2512.14602",
        "pdf_url": "https://arxiv.org/pdf/2512.14602",
        "title": "Sound and Music Biases in Deep Music Transcription Models: A Systematic Analysis",
        "authors": [
            "Lukáš Samuel Marták",
            "Patricia Hu",
            "Gerhard Widmer"
        ],
        "comments": "pre-print of the upcoming EURASIP JASM journal article",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG)",
        "abstract": "Automatic Music Transcription (AMT) -- the task of converting music audio into note representations -- has seen rapid progress, driven largely by deep learning systems. Due to the limited availability of richly annotated music datasets, much of the progress in AMT has been concentrated on classical piano music, and even a few very specific datasets. Whether these systems can generalize effectively to other musical contexts remains an open question. Complementing recent studies on distribution shifts in sound (e.g., recording conditions), in this work we investigate the musical dimension -- specifically, variations in genre, dynamics, and polyphony levels. To this end, we introduce the MDS corpus, comprising three distinct subsets -- (1) Genre, (2) Random, and (3) MAEtest -- to emulate different axes of distribution shift. We evaluate the performance of several state-of-the-art AMT systems on the MDS corpus using both traditional information-retrieval and musically-informed performance metrics. Our extensive evaluation isolates and exposes varying degrees of performance degradation under specific distribution shifts. In particular, we measure a note-level F1 performance drop of 20 percentage points due to sound, and 14 due to genre. Generally, we find that dynamics estimation proves more vulnerable to musical variation than onset prediction. Musically informed evaluation metrics, particularly those capturing harmonic structure, help identify potential contributing factors. Furthermore, experiments with randomly generated, non-musical sequences reveal clear limitations in system performance under extreme musical distribution shifts. Altogether, these findings offer new evidence of the persistent impact of the Corpus Bias problem in deep AMT systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14604",
        "abs_url": "https://arxiv.org/abs/2512.14604",
        "pdf_url": "https://arxiv.org/pdf/2512.14604",
        "title": "LLmFPCA-detect: LLM-powered Multivariate Functional PCA for Anomaly Detection in Sparse Longitudinal Texts",
        "authors": [
            "Prasanjit Dubey",
            "Aritra Guha",
            "Zhengyi Zhou",
            "Qiong Wu",
            "Xiaoming Huo",
            "Paromita Dubey"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Sparse longitudinal (SL) textual data arises when individuals generate text repeatedly over time (e.g., customer reviews, occasional social media posts, electronic medical records across visits), but the frequency and timing of observations vary across individuals. These complex textual data sets have immense potential to inform future policy and targeted recommendations. However, because SL text data lack dedicated methods and are noisy, heterogeneous, and prone to anomalies, detecting and inferring key patterns is challenging. We introduce LLmFPCA-detect, a flexible framework that pairs LLM-based text embeddings with functional data analysis to detect clusters and infer anomalies in large SL text datasets. First, LLmFPCA-detect embeds each piece of text into an application-specific numeric space using LLM prompts. Sparse multivariate functional principal component analysis (mFPCA) conducted in the numeric space forms the workhorse to recover primary population characteristics, and produces subject-level scores which, together with baseline static covariates, facilitate data segmentation, unsupervised anomaly detection and inference, and enable other downstream tasks. In particular, we leverage LLMs to perform dynamic keyword profiling guided by the data segments and anomalies discovered by LLmFPCA-detect, and we show that cluster-specific functional PC scores from LLmFPCA-detect, used as features in existing pipelines, help boost prediction performance. We support the stability of LLmFPCA-detect with experiments and evaluate it on two different applications using public datasets, Amazon customer-review trajectories, and Wikipedia talk-page comment streams, demonstrating utility across domains and outperforming state-of-the-art baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14645",
        "abs_url": "https://arxiv.org/abs/2512.14645",
        "pdf_url": "https://arxiv.org/pdf/2512.14645",
        "title": "TiME: Tiny Monolingual Encoders for Efficient NLP Pipelines",
        "authors": [
            "David Schulmeister",
            "Valentin Hartmann",
            "Lars Klein",
            "Robert West"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Today, a lot of research on language models is focused on large, general-purpose models. However, many NLP pipelines only require models with a well-defined, small set of capabilities. While large models are capable of performing the tasks of those smaller models, they are simply not fast enough to process large amounts of data or offer real-time responses. Furthermore, they often use unnecessarily large amounts of energy, leading to sustainability concerns and problems when deploying them on battery-powered devices. In our work, we show how to train small models for such efficiency-critical applications. As opposed to many off-the-shelf NLP pipelines, our models use modern training techniques such as distillation, and offer support for low-resource languages. We call our models TiME (Tiny Monolingual Encoders) and comprehensively evaluate them on a range of common NLP tasks, observing an improved trade-off between benchmark performance on one hand, and throughput, latency and energy consumption on the other. Along the way, we show that distilling monolingual models from multilingual teachers is possible, and likewise distilling models with absolute positional embeddings from teachers with relative positional embeddings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2025-12-17",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-17?abs=True",
        "arxiv_id": "2512.14689",
        "abs_url": "https://arxiv.org/abs/2512.14689",
        "pdf_url": "https://arxiv.org/pdf/2512.14689",
        "title": "CHIP: Adaptive Compliance for Humanoid Control through Hindsight Perturbation",
        "authors": [
            "Sirui Chen",
            "Zi-ang Cao",
            "Zhengyi Luo",
            "Fernando Castañeda",
            "Chenran Li",
            "Tingwu Wang",
            "Ye Yuan",
            "Linxi \"Jim\" Fan",
            "C. Karen Liu",
            "Yuke Zhu"
        ],
        "comments": "The first two authors contributed equally. Project page: this https URL",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Recent progress in humanoid robots has unlocked agile locomotion skills, including backflipping, running, and crawling. Yet it remains challenging for a humanoid robot to perform forceful manipulation tasks such as moving objects, wiping, and pushing a cart. We propose adaptive Compliance Humanoid control through hIsight Perturbation (CHIP), a plug-and-play module that enables controllable end-effector stiffness while preserving agile tracking of dynamic reference motions. CHIP is easy to implement and requires neither data augmentation nor additional reward tuning. We show that a generalist motion-tracking controller trained with CHIP can perform a diverse set of forceful manipulation tasks that require different end-effector compliance, such as multi-robot collaboration, wiping, box delivery, and door opening.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]