[
    {
        "order": 1,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07844",
        "abs_url": "https://arxiv.org/abs/2512.07844",
        "pdf_url": "https://arxiv.org/pdf/2512.07844",
        "title": "Space Alignment Matters: The Missing Piece for Inducing Neural Collapse in Long-Tailed Learning",
        "authors": [
            "Jinping Wang",
            "Zhiqiang Gao",
            "Zhiwu Xie"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Recent studies on Neural Collapse (NC) reveal that, under class-balanced conditions, the class feature means and classifier weights spontaneously align into a simplex equiangular tight frame (ETF). In long-tailed regimes, however, severe sample imbalance tends to prevent the emergence of the NC phenomenon, resulting in poor generalization performance. Current efforts predominantly seek to recover the ETF geometry by imposing constraints on features or classifier weights, yet overlook a critical problem: There is a pronounced misalignment between the feature and the classifier weight spaces. In this paper, we theoretically quantify the harm of such misalignment through an optimal error exponent analysis. Built on this insight, we propose three explicit alignment strategies that plug-and-play into existing long-tail methods without architectural change. Extensive experiments on the CIFAR-10-LT, CIFAR-100-LT, and ImageNet-LT datasets consistently boost examined baselines and achieve the state-of-the-art performances.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07847",
        "abs_url": "https://arxiv.org/abs/2512.07847",
        "pdf_url": "https://arxiv.org/pdf/2512.07847",
        "title": "CarBench: A Comprehensive Benchmark for Neural Surrogates on High-Fidelity 3D Car Aerodynamics",
        "authors": [
            "Mohamed Elrefaie",
            "Dule Shu",
            "Matt Klenk",
            "Faez Ahmed"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Benchmarking has been the cornerstone of progress in computer vision, natural language processing, and the broader deep learning domain, driving algorithmic innovation through standardized datasets and reproducible evaluation protocols. The growing availability of large-scale Computational Fluid Dynamics (CFD) datasets has opened new opportunities for applying machine learning to aerodynamic and engineering design. Yet, despite this progress, there exists no standardized benchmark for large-scale numerical simulations in engineering design. In this work, we introduce CarBench, the first comprehensive benchmark dedicated to large-scale 3D car aerodynamics, performing a large-scale evaluation of state-of-the-art models on DrivAerNet++, the largest public dataset for automotive aerodynamics, containing over 8,000 high-fidelity car simulations. We assess eleven architectures spanning neural operator methods (e.g., Fourier Neural Operator), geometric deep learning (PointNet, RegDGCNN, PointMAE, PointTransformer), transformer-based neural solvers (Transolver, Transolver++, AB-UPT), and implicit field networks (TripNet). Beyond standard interpolation tasks, we perform cross-category experiments in which transformer-based solvers trained on a single car archetype are evaluated on unseen categories. Our analysis covers predictive accuracy, physical consistency, computational efficiency, and statistical uncertainty. To accelerate progress in data-driven engineering, we open-source the benchmark framework, including training pipelines, uncertainty estimation routines based on bootstrap resampling, and pretrained model weights, establishing the first reproducible foundation for large-scale learning from high-fidelity CFD simulations, available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07848",
        "abs_url": "https://arxiv.org/abs/2512.07848",
        "pdf_url": "https://arxiv.org/pdf/2512.07848",
        "title": "RaX-Crash: A Resource Efficient and Explainable Small Model Pipeline with an Application to City Scale Injury Severity Prediction",
        "authors": [
            "Di Zhu",
            "Chen Xie",
            "Ziwei Wang",
            "Haoyun Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "New York City reports over one hundred thousand motor vehicle collisions each year, creating substantial injury and public health burden. We present RaX-Crash, a resource efficient and explainable small model pipeline for structured injury severity prediction on the official NYC Motor Vehicle Collisions dataset. RaX-Crash integrates three linked tables with tens of millions of records, builds a unified feature schema in partitioned storage, and trains compact tree based ensembles (Random Forest and XGBoost) on engineered tabular features, which are compared against locally deployed small language models (SLMs) prompted with textual summaries. On a temporally held out test set, XGBoost and Random Forest achieve accuracies of 0.7828 and 0.7794, clearly outperforming SLMs (0.594 and 0.496); class imbalance analysis shows that simple class weighting improves fatal recall with modest accuracy trade offs, and SHAP attribution highlights human vulnerability factors, timing, and location as dominant drivers of predicted severity. Overall, RaX-Crash indicates that interpretable small model ensembles remain strong baselines for city scale injury analytics, while hybrid pipelines that pair tabular predictors with SLM generated narratives improve communication without sacrificing scalability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07853",
        "abs_url": "https://arxiv.org/abs/2512.07853",
        "pdf_url": "https://arxiv.org/pdf/2512.07853",
        "title": "GPU Memory Prediction for Multimodal Model Training",
        "authors": [
            "Jinwoo Jeong",
            "Minchul Kang",
            "Younghun Go",
            "Changyong Shin",
            "Hyunho Lee",
            "Junho Yoon",
            "Gyeongsik Yang",
            "Chuck Yoo"
        ],
        "comments": "1st Workshop on Systems for Agentic AI (SAA '25), co-located with SOSP 2025",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "As deep learning models in agentic AI systems grow in scale and complexity, GPU memory requirements increase and often exceed the available GPU memory capacity, so that out-of-memory (OoM) errors occur. It is well known that OoM interrupts the whole training itself and wastes substantial computational resources. Therefore, to prevent OoM, accurate prediction of GPU memory usage is essential. However, previous studies focus only on unimodal architectures and fail to generalize to multimodal models, even though the multimodal models are a common choice in agentic AI systems. To address this limitation, we propose a framework that predicts the peak GPU memory usage by analyzing the model architecture and training behavior of multimodal models. Specifically, the framework decomposes the multimodal model into its constituent layers and applies factorization to estimate the memory usage of each layer. Our evaluation shows that our framework achieves high prediction accuracy of ~8.7% average MAPE.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07854",
        "abs_url": "https://arxiv.org/abs/2512.07854",
        "pdf_url": "https://arxiv.org/pdf/2512.07854",
        "title": "HSTMixer: A Hierarchical MLP-Mixer for Large-Scale Traffic Forecasting",
        "authors": [
            "Yongyao Wang",
            "Jingyuan Wang",
            "Xie Yu",
            "Jiahao Ji",
            "Chao Li"
        ],
        "comments": "10 pages, 9 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Traffic forecasting task is significant to modern urban management. Recently, there is growing attention on large-scale forecasting, as it better reflects the complexity of real-world traffic networks. However, existing models often exhibit quadratic computational complexity, making them impractical for large-scale real-world scenarios. In this paper, we propose a novel framework, Hierarchical Spatio-Temporal Mixer (HSTMixer), which leverages an all-MLP architecture for efficient and effective large-scale traffic forecasting. HSTMixer employs a hierarchical spatiotemporal mixing block to extract multi-resolution features through bottom-up aggregation and top-down propagation. Furthermore, an adaptive region mixer generates transformation matrices based on regional semantics, enabling our model to dynamically capture evolving spatiotemporal patterns for different regions. Extensive experiments conducted on four large-scale real-world datasets demonstrate that the proposed method not only achieves state-of-the-art performance but also exhibits competitive computational efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07856",
        "abs_url": "https://arxiv.org/abs/2512.07856",
        "pdf_url": "https://arxiv.org/pdf/2512.07856",
        "title": "Medical Test-free Disease Detection Based on Big Data",
        "authors": [
            "Haokun Zhao",
            "Yingzhe Bai",
            "Qingyang Xu",
            "Lixin Zhou",
            "Jianxin Chen",
            "Jicong Fan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate disease detection is of paramount importance for effective medical treatment and patient care. However, the process of disease detection is often associated with extensive medical testing and considerable costs, making it impractical to perform all possible medical tests on a patient to diagnose or predict hundreds or thousands of diseases. In this work, we propose Collaborative Learning for Disease Detection (CLDD), a novel graph-based deep learning model that formulates disease detection as a collaborative learning task by exploiting associations among diseases and similarities among patients adaptively. CLDD integrates patient-disease interactions and demographic features from electronic health records to detect hundreds or thousands of diseases for every patient, with little to no reliance on the corresponding medical tests. Extensive experiments on a processed version of the MIMIC-IV dataset comprising 61,191 patients and 2,000 diseases demonstrate that CLDD consistently outperforms representative baselines across multiple metrics, achieving a 6.33\\% improvement in recall and 7.63\\% improvement in precision. Furthermore, case studies on individual patients illustrate that CLDD can successfully recover masked diseases within its top-ranked predictions, demonstrating both interpretability and reliability in disease prediction. By reducing diagnostic costs and improving accessibility, CLDD holds promise for large-scale disease screening and social health security.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07857",
        "abs_url": "https://arxiv.org/abs/2512.07857",
        "pdf_url": "https://arxiv.org/pdf/2512.07857",
        "title": "SA^2GFM: Enhancing Robust Graph Foundation Models with Structure-Aware Semantic Augmentation",
        "authors": [
            "Junhua Shi",
            "Qingyun Sun",
            "Haonan Yuan",
            "Xingcheng Fu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present Graph Foundation Models (GFMs) which have made significant progress in various tasks, but their robustness against domain noise, structural perturbations, and adversarial attacks remains underexplored. A key limitation is the insufficient modeling of hierarchical structural semantics, which are crucial for generalization. In this paper, we propose SA^2GFM, a robust GFM framework that improves domain-adaptive representations through Structure-Aware Semantic Augmentation. First, we encode hierarchical structural priors by transforming entropy-based encoding trees into structure-aware textual prompts for feature augmentation. The enhanced inputs are processed by a self-supervised Information Bottleneck mechanism that distills robust, transferable representations via structure-guided compression. To address negative transfer in cross-domain adaptation, we introduce an expert adaptive routing mechanism, combining a mixture-of-experts architecture with a null expert design. For efficient downstream adaptation, we propose a fine-tuning module that optimizes hierarchical structures through joint intra- and inter-community structure learning. Extensive experiments demonstrate that SA^2GFM outperforms 9 state-of-the-art baselines in terms of effectiveness and robustness against random noise and adversarial perturbations for node and graph classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07858",
        "abs_url": "https://arxiv.org/abs/2512.07858",
        "pdf_url": "https://arxiv.org/pdf/2512.07858",
        "title": "FAIM: Frequency-Aware Interactive Mamba for Time Series Classification",
        "authors": [
            "Da Zhang",
            "Bingyu Li",
            "Zhiyuan Zhao",
            "Yanhan Zhang",
            "Junyu Gao",
            "Feiping Nie",
            "Xuelong Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series classification (TSC) is crucial in numerous real-world applications, such as environmental monitoring, medical diagnosis, and posture recognition. TSC tasks require models to effectively capture discriminative information for accurate class identification. Although deep learning architectures excel at capturing temporal dependencies, they often suffer from high computational cost, sensitivity to noise perturbations, and susceptibility to overfitting on small-scale datasets. To address these challenges, we propose FAIM, a lightweight Frequency-Aware Interactive Mamba model. Specifically, we introduce an Adaptive Filtering Block (AFB) that leverages Fourier Transform to extract frequency-domain features from time series data. The AFB incorporates learnable adaptive thresholds to dynamically suppress noise and employs element-wise coupling of global and local semantic adaptive filtering, enabling in-depth modeling of the synergy among different frequency components. Furthermore, we design an Interactive Mamba Block (IMB) to facilitate efficient multi-granularity information interaction, balancing the extraction of fine-grained discriminative features and comprehensive global contextual information, thereby endowing FAIM with powerful and expressive representations for TSC tasks. Additionally, we incorporate a self-supervised pre-training mechanism to enhance FAIM's understanding of complex temporal patterns and improve its robustness across various domains and high-noise scenarios. Extensive experiments on multiple benchmarks demonstrate that FAIM consistently outperforms existing state-of-the-art (SOTA) methods, achieving a superior trade-off between accuracy and efficiency and exhibits outstanding performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07863",
        "abs_url": "https://arxiv.org/abs/2512.07863",
        "pdf_url": "https://arxiv.org/pdf/2512.07863",
        "title": "SetAD: Semi-Supervised Anomaly Learning in Contextual Sets",
        "authors": [
            "Jianling Gao",
            "Chongyang Tao",
            "Xuelian Lin",
            "Junfeng Liu",
            "Shuai Ma"
        ],
        "comments": "9 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Semi-supervised anomaly detection (AD) has shown great promise by effectively leveraging limited labeled data. However, existing methods are typically structured around scoring individual points or simple pairs. Such {point- or pair-centric} view not only overlooks the contextual nature of anomalies, which are defined by their deviation from a collective group, but also fails to exploit the rich supervisory signals that can be generated from the combinatorial composition of sets. Consequently, such models struggle to exploit the high-order interactions within the data, which are critical for learning discriminative representations. To address these limitations, we propose SetAD, a novel framework that reframes semi-supervised AD as a Set-level Anomaly Detection task. SetAD employs an attention-based set encoder trained via a graded learning objective, where the model learns to quantify the degree of anomalousness within an entire set. This approach directly models the complex group-level interactions that define anomalies. Furthermore, to enhance robustness and score calibration, we propose a context-calibrated anomaly scoring mechanism, which assesses a point's anomaly score by aggregating its normalized deviations from peer behavior across multiple, diverse contextual sets. Extensive experiments on 10 real-world datasets demonstrate that SetAD significantly outperforms state-of-the-art models. Notably, we show that our model's performance consistently improves with increasing set size, providing strong empirical support for the set-based formulation of anomaly detection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07864",
        "abs_url": "https://arxiv.org/abs/2512.07864",
        "pdf_url": "https://arxiv.org/pdf/2512.07864",
        "title": "Pattern Recognition of Ozone-Depleting Substance Exports in Global Trade Data",
        "authors": [
            "Muhammad Sukri Bin Ramli"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Econometrics (econ.EM); General Economics (econ.GN)",
        "abstract": "New methods are needed to monitor environmental treaties, like the Montreal Protocol, by reviewing large, complex customs datasets. This paper introduces a framework using unsupervised machine learning to systematically detect suspicious trade patterns and highlight activities for review. Our methodology, applied to 100,000 trade records, combines several ML techniques. Unsupervised Clustering (K-Means) discovers natural trade archetypes based on shipment value and weight. Anomaly Detection (Isolation Forest and IQR) identifies rare \"mega-trades\" and shipments with commercially unusual price-per-kilogram values. This is supplemented by Heuristic Flagging to find tactics like vague shipment descriptions. These layers are combined into a priority score, which successfully identified 1,351 price outliers and 1,288 high-priority shipments for customs review. A key finding is that high-priority commodities show a different and more valuable value-to-weight ratio than general goods. This was validated using Explainable AI (SHAP), which confirmed vague descriptions and high value as the most significant risk predictors. The model's sensitivity was validated by its detection of a massive spike in \"mega-trades\" in early 2021, correlating directly with the real-world regulatory impact of the US AIM Act. This work presents a repeatable unsupervised learning pipeline to turn raw trade data into prioritized, usable intelligence for regulatory groups.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07865",
        "abs_url": "https://arxiv.org/abs/2512.07865",
        "pdf_url": "https://arxiv.org/pdf/2512.07865",
        "title": "Using Text-Based Life Trajectories from Swedish Register Data to Predict Residential Mobility with Pretrained Transformers",
        "authors": [
            "Philipp Stark",
            "Alexandros Sopasakis",
            "Ola Hall",
            "Markus Grillitsch"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We transform large-scale Swedish register data into textual life trajectories to address two long-standing challenges in data analysis: high cardinality of categorical variables and inconsistencies in coding schemes over time. Leveraging this uniquely comprehensive population register, we convert register data from 6.9 million individuals (2001-2013) into semantically rich texts and predict individuals' residential mobility in later years (2013-2017). These life trajectories combine demographic information with annual changes in residence, work, education, income, and family circumstances, allowing us to assess how effectively such sequences support longitudinal prediction. We compare multiple NLP architectures (including LSTM, DistilBERT, BERT, and Qwen) and find that sequential and transformer-based models capture temporal and semantic structure more effectively than baseline models. The results show that textualized register data preserves meaningful information about individual pathways and supports complex, scalable modeling. Because few countries maintain longitudinal microdata with comparable coverage and precision, this dataset enables analyses and methodological tests that would be difficult or impossible elsewhere, offering a rigorous testbed for developing and evaluating new sequence-modeling approaches. Overall, our findings demonstrate that combining semantically rich register data with modern language models can substantially advance longitudinal analysis in social sciences.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07868",
        "abs_url": "https://arxiv.org/abs/2512.07868",
        "pdf_url": "https://arxiv.org/pdf/2512.07868",
        "title": "Bayesian Optimization for Function-Valued Responses under Min-Max Criteria",
        "authors": [
            "Pouya Ahadi",
            "Reza Marzban",
            "Ali Adibi",
            "Kamran Paynabar"
        ],
        "comments": "25 pages, 6 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Machine Learning (stat.ML)",
        "abstract": "Bayesian optimization is widely used for optimizing expensive black box functions, but most existing approaches focus on scalar responses. In many scientific and engineering settings the response is functional, varying smoothly over an index such as time or wavelength, which makes classical formulations inadequate. Existing methods often minimize integrated error, which captures average performance but neglects worst case deviations. To address this limitation we propose min-max Functional Bayesian Optimization (MM-FBO), a framework that directly minimizes the maximum error across the functional domain. Functional responses are represented using functional principal component analysis, and Gaussian process surrogates are constructed for the principal component scores. Building on this representation, MM-FBO introduces an integrated uncertainty acquisition function that balances exploitation of worst case expected error with exploration across the functional domain. We provide two theoretical guarantees: a discretization bound for the worst case objective, and a consistency result showing that as the surrogate becomes accurate and uncertainty vanishes, the acquisition converges to the true min-max objective. We validate the method through experiments on synthetic benchmarks and physics inspired case studies involving electromagnetic scattering by metaphotonic devices and vapor phase infiltration. Results show that MM-FBO consistently outperforms existing baselines and highlights the importance of explicitly modeling functional uncertainty in Bayesian optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07874",
        "abs_url": "https://arxiv.org/abs/2512.07874",
        "pdf_url": "https://arxiv.org/pdf/2512.07874",
        "title": "Controllable risk scenario generation from human crash data for autonomous vehicle testing",
        "authors": [
            "Qiujing Lu",
            "Xuanhan Wang",
            "Runze Yuan",
            "Wei Lu",
            "Xinyi Gong",
            "Shuo Feng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Ensuring the safety of autonomous vehicles (AV) requires rigorous testing under both everyday driving and rare, safety-critical conditions. A key challenge lies in simulating environment agents, including background vehicles (BVs) and vulnerable road users (VRUs), that behave realistically in nominal traffic while also exhibiting risk-prone behaviors consistent with real-world accidents. We introduce Controllable Risk Agent Generation (CRAG), a framework designed to unify the modeling of dominant nominal behaviors and rare safety-critical behaviors. CRAG constructs a structured latent space that disentangles normal and risk-related behaviors, enabling efficient use of limited crash data. By combining risk-aware latent representations with optimization-based mode-transition mechanisms, the framework allows agents to shift smoothly and plausibly from safe to risk states over extended horizons, while maintaining high fidelity in both regimes. Extensive experiments show that CRAG improves diversity compared to existing baselines, while also enabling controllable generation of risk scenarios for targeted and efficient evaluation of AV robustness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07875",
        "abs_url": "https://arxiv.org/abs/2512.07875",
        "pdf_url": "https://arxiv.org/pdf/2512.07875",
        "title": "Softly Symbolifying Kolmogorov-Arnold Networks",
        "authors": [
            "James Bagrow",
            "Josh Bongard"
        ],
        "comments": "13 pages, 5 figures, 3 tables",
        "subjects": "Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE); Data Analysis, Statistics and Probability (physics.data-an); Machine Learning (stat.ML)",
        "abstract": "Kolmogorov-Arnold Networks (KANs) offer a promising path toward interpretable machine learning: their learnable activations can be studied individually, while collectively fitting complex data accurately. In practice, however, trained activations often lack symbolic fidelity, learning pathological decompositions with no meaningful correspondence to interpretable forms. We propose Softly Symbolified Kolmogorov-Arnold Networks (S2KAN), which integrate symbolic primitives directly into training. Each activation draws from a dictionary of symbolic and dense terms, with learnable gates that sparsify the representation. Crucially, this sparsification is differentiable, enabling end-to-end optimization, and is guided by a principled Minimum Description Length objective. When symbolic terms suffice, S2KAN discovers interpretable forms; when they do not, it gracefully degrades to dense splines. We demonstrate competitive or superior accuracy with substantially smaller models across symbolic benchmarks, dynamical systems forecasting, and real-world prediction tasks, and observe evidence of emergent self-sparsification even without regularization pressure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07876",
        "abs_url": "https://arxiv.org/abs/2512.07876",
        "pdf_url": "https://arxiv.org/pdf/2512.07876",
        "title": "Fourier-Enhanced Recurrent Neural Networks for Electrical Load Time Series Downscaling",
        "authors": [
            "Qi Chen",
            "Mihai Anitescu"
        ],
        "comments": "Submitted to IEEE PES General Meeting 2026",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We present a Fourier-enhanced recurrent neural network (RNN) for downscaling electrical loads. The model combines (i) a recurrent backbone driven by low-resolution inputs, (ii) explicit Fourier seasonal embeddings fused in latent space, and (iii) a self-attention layer that captures dependencies among high-resolution components within each period. Across four PJM territories, the approach yields RMSE lower and flatter horizon-wise than classical Prophet baselines (with and without seasonality/LAA) and than RNN ablations without attention or Fourier features.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07878",
        "abs_url": "https://arxiv.org/abs/2512.07878",
        "pdf_url": "https://arxiv.org/pdf/2512.07878",
        "title": "Graph Contrastive Learning via Spectral Graph Alignment",
        "authors": [
            "Manh Nguyen",
            "Joshua Cape"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Given augmented views of each input graph, contrastive learning methods (e.g., InfoNCE) optimize pairwise alignment of graph embeddings across views while providing no mechanism to control the global structure of the view specific graph-of-graphs built from these embeddings. We introduce SpecMatch-CL, a novel loss function that aligns the view specific graph-of-graphs by minimizing the difference between their normalized Laplacians. Theoretically, we show that under certain assumptions, the difference between normalized Laplacians provides an upper bound not only for the difference between the ideal Perfect Alignment contrastive loss and the current loss, but also for the Uniformly loss. Empirically, SpecMatch-CL establishes new state of the art on eight TU benchmarks under unsupervised learning and semi-supervised learning at low label rates, and yields consistent gains in transfer learning on PPI-306K and ZINC 2M datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07879",
        "abs_url": "https://arxiv.org/abs/2512.07879",
        "pdf_url": "https://arxiv.org/pdf/2512.07879",
        "title": "Nonnegative Matrix Factorization through Cone Collapse",
        "authors": [
            "Manh Nguyen",
            "Daniel Pimentel-Alarcón"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Nonnegative matrix factorization (NMF) is a widely used tool for learning parts-based, low-dimensional representations of nonnegative data, with applications in vision, text, and bioinformatics. In clustering applications, orthogonal NMF (ONMF) variants further impose (approximate) orthogonality on the representation matrix so that its rows behave like soft cluster indicators. Existing algorithms, however, are typically derived from optimization viewpoints and do not explicitly exploit the conic geometry induced by NMF: data points lie in a convex cone whose extreme rays encode fundamental directions or \"topics\". In this work we revisit NMF from this geometric perspective and propose Cone Collapse, an algorithm that starts from the full nonnegative orthant and iteratively shrinks it toward the minimal cone generated by the data. We prove that, under mild assumptions on the data, Cone Collapse terminates in finitely many steps and recovers the minimal generating cone of $\\mathbf{X}^\\top$ . Building on this basis, we then derive a cone-aware orthogonal NMF model (CC-NMF) by applying uni-orthogonal NMF to the recovered extreme rays. Across 16 benchmark gene-expression, text, and image datasets, CC-NMF consistently matches or outperforms strong NMF baselines-including multiplicative updates, ANLS, projective NMF, ONMF, and sparse NMF-in terms of clustering purity. These results demonstrate that explicitly recovering the data cone can yield both theoretically grounded and empirically strong NMF-based clustering methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07880",
        "abs_url": "https://arxiv.org/abs/2512.07880",
        "pdf_url": "https://arxiv.org/pdf/2512.07880",
        "title": "Semi-Supervised Contrastive Learning with Orthonormal Prototypes",
        "authors": [
            "Huanran Li",
            "Manh Nguyen",
            "Daniel Pimentel-Alarcón"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Contrastive learning has emerged as a powerful method in deep learning, excelling at learning effective representations through contrasting samples from different distributions. However, dimensional collapse, where embeddings converge into a lower-dimensional space, poses a significant challenge, especially in semi-supervised and self-supervised setups. In this paper, we first identify a critical learning-rate threshold, beyond which standard contrastive losses converge to collapsed solutions. Building on these insights, we propose CLOP, a novel semi-supervised loss function designed to prevent dimensional collapse by promoting the formation of orthogonal linear subspaces among class embeddings. Through extensive experiments on real and synthetic datasets, we demonstrate that CLOP improves performance in image classification and object detection tasks while also exhibiting greater stability across different learning rates and batch sizes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07885",
        "abs_url": "https://arxiv.org/abs/2512.07885",
        "pdf_url": "https://arxiv.org/pdf/2512.07885",
        "title": "ByteStorm: a multi-step data-driven approach for Tropical Cyclones detection and tracking",
        "authors": [
            "Davide Donno",
            "Donatello Elia",
            "Gabriele Accarino",
            "Marco De Carlo",
            "Enrico Scoccimarro",
            "Silvio Gualdi"
        ],
        "comments": "21 pages, 10 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Accurate tropical cyclones (TCs) tracking represents a critical challenge in the context of weather and climate science. Traditional tracking schemes mainly rely on subjective thresholds, which may introduce biases in their skills on the geographical region of application. We present ByteStorm, an efficient data-driven framework for reconstructing TC tracks without threshold tuning. It leverages deep learning networks to detect TC centers (via classification and localization), using only relative vorticity (850 mb) and mean sea-level pressure. Then, detected centers are linked into TC tracks through the BYTE algorithm. ByteStorm is evaluated against state-of-the-art deterministic trackers in the East- and West-North Pacific basins (ENP and WNP). The proposed framework achieves superior performance in terms of Probability of Detection ($85.05\\%$ ENP, $79.48\\%$ WNP), False Alarm Rate ($23.26\\%$ ENP, $16.14\\%$ WNP), and high Inter-Annual Variability correlations ($0.75$ ENP and $0.69$ WNP). These results highlight the potential of integrating deep learning and computer vision for fast and accurate TC tracking, offering a robust alternative to traditional approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07961",
        "abs_url": "https://arxiv.org/abs/2512.07961",
        "pdf_url": "https://arxiv.org/pdf/2512.07961",
        "title": "Towards symbolic regression for interpretable clinical decision scores",
        "authors": [
            "Guilherme Seidyo Imai Aldeia",
            "Joseph D. Romano",
            "Fabricio Olivetti de Franca",
            "Daniel S. Herman",
            "William G. La Cava"
        ],
        "comments": "15 pages, 5 figures. Accepted for publication in Philosophical Transactions A. Autor Accepted Manuscript version",
        "subjects": "Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Medical decision-making makes frequent use of algorithms that combine risk equations with rules, providing clear and standardized treatment pathways. Symbolic regression (SR) traditionally limits its search space to continuous function forms and their parameters, making it difficult to model this decision-making. However, due to its ability to derive data-driven, interpretable models, SR holds promise for developing data-driven clinical risk scores. To that end we introduce Brush, an SR algorithm that combines decision-tree-like splitting algorithms with non-linear constant optimization, allowing for seamless integration of rule-based logic into symbolic regression and classification models. Brush achieves Pareto-optimal performance on SRBench, and was applied to recapitulate two widely used clinical scoring systems, achieving high accuracy and interpretable models. Compared to decision trees, random forests, and other SR methods, Brush achieves comparable or superior predictive performance while producing simpler models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07988",
        "abs_url": "https://arxiv.org/abs/2512.07988",
        "pdf_url": "https://arxiv.org/pdf/2512.07988",
        "title": "HOLE: Homological Observation of Latent Embeddings for Neural Network Interpretability",
        "authors": [
            "Sudhanva Manjunath Athreya",
            "Paul Rosen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Graphics (cs.GR); Human-Computer Interaction (cs.HC)",
        "abstract": "Deep learning models have achieved remarkable success across various domains, yet their learned representations and decision-making processes remain largely opaque and hard to interpret. This work introduces HOLE (Homological Observation of Latent Embeddings), a method for analyzing and interpreting deep neural networks through persistent homology. HOLE extracts topological features from neural activations and presents them using a suite of visualization techniques, including Sankey diagrams, heatmaps, dendrograms, and blob graphs. These tools facilitate the examination of representation structure and quality across layers. We evaluate HOLE on standard datasets using a range of discriminative models, focusing on representation quality, interpretability across layers, and robustness to input perturbations and model compression. The results indicate that topological analysis reveals patterns associated with class separation, feature disentanglement, and model robustness, providing a complementary perspective for understanding and improving deep learning systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07992",
        "abs_url": "https://arxiv.org/abs/2512.07992",
        "pdf_url": "https://arxiv.org/pdf/2512.07992",
        "title": "Bridging the Clinical Expertise Gap: Development of a Web-Based Platform for Accessible Time Series Forecasting and Analysis",
        "authors": [
            "Aaron D. Mullen",
            "Daniel R. Harris",
            "Svetla Slavova",
            "V.K. Cody Bumgardner"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Software Engineering (cs.SE)",
        "abstract": "Time series forecasting has applications across domains and industries, especially in healthcare, but the technical expertise required to analyze data, build models, and interpret results can be a barrier to using these techniques. This article presents a web platform that makes the process of analyzing and plotting data, training forecasting models, and interpreting and viewing results accessible to researchers and clinicians. Users can upload data and generate plots to showcase their variables and the relationships between them. The platform supports multiple forecasting models and training techniques which are highly customizable according to the user's needs. Additionally, recommendations and explanations can be generated from a large language model that can help the user choose appropriate parameters for their data and understand the results for each model. The goal is to integrate this platform into learning health systems for continuous data collection and inference from clinical pipelines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08012",
        "abs_url": "https://arxiv.org/abs/2512.08012",
        "pdf_url": "https://arxiv.org/pdf/2512.08012",
        "title": "Benchmarking Offline Multi-Objective Reinforcement Learning in Critical Care",
        "authors": [
            "Aryaman Bansal",
            "Divya Sharma"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In critical care settings such as the Intensive Care Unit, clinicians face the complex challenge of balancing conflicting objectives, primarily maximizing patient survival while minimizing resource utilization (e.g., length of stay). Single-objective Reinforcement Learning approaches typically address this by optimizing a fixed scalarized reward function, resulting in rigid policies that fail to adapt to varying clinical priorities. Multi-objective Reinforcement Learning (MORL) offers a solution by learning a set of optimal policies along the Pareto Frontier, allowing for dynamic preference selection at test time. However, applying MORL in healthcare necessitates strict offline learning from historical data. In this paper, we benchmark three offline MORL algorithms, Conditioned Conservative Pareto Q-Learning (CPQL), Adaptive CPQL, and a modified Pareto Efficient Decision Agent (PEDA) Decision Transformer (PEDA DT), against three scalarized single-objective baselines (BC, CQL, and DDQN) on the MIMIC-IV dataset. Using Off-Policy Evaluation (OPE) metrics, we demonstrate that PEDA DT algorithm offers superior flexibility compared to static scalarized baselines. Notably, our results extend previous findings on single-objective Decision Transformers in healthcare, confirming that sequence modeling architectures remain robust and effective when scaled to multi-objective conditioned generation. These findings suggest that offline MORL is a promising framework for enabling personalized, adjustable decision-making in critical care without the need for retraining.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08061",
        "abs_url": "https://arxiv.org/abs/2512.08061",
        "pdf_url": "https://arxiv.org/pdf/2512.08061",
        "title": "LUNA: Linear Universal Neural Attention with Generalization Guarantees",
        "authors": [
            "Ashkan Shahbazi",
            "Ping He",
            "Ali Abbasi",
            "Yikun Bai",
            "Xinran Liu",
            "Elaheh Akbari",
            "Darian Salehi",
            "Navid NaderiAlizadeh",
            "Soheil Kolouri"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Scaling attention faces a critical bottleneck: the $\\mathcal{O}(n^2)$ quadratic computational cost of softmax attention, which limits its application in long-sequence domains. While linear attention mechanisms reduce this cost to $\\mathcal{O}(n)$, they typically rely on fixed random feature maps, such as random Fourier features or hand-crafted functions. This reliance on static, data-agnostic kernels creates a fundamental trade-off, forcing practitioners to sacrifice significant model accuracy for computational efficiency. We introduce \\textsc{LUNA}, a kernelized linear attention mechanism that eliminates this trade-off, retaining linear cost while matching and surpassing the accuracy of quadratic attention. \\textsc{LUNA} is built on the key insight that the kernel feature map itself should be learned rather than fixed a priori. By parameterizing the kernel, \\textsc{LUNA} learns a feature basis tailored to the specific data and task, overcoming the expressive limitations of fixed-feature methods. \\textsc{Luna} implements this with a learnable feature map that induces a positive-definite kernel and admits a streaming form, yielding linear time and memory scaling in the sequence length. Empirical evaluations validate our approach across diverse settings. On the Long Range Arena (LRA), \\textsc{Luna} achieves state-of-the-art average accuracy among efficient Transformers under compute parity, using the same parameter count, training steps, and approximate FLOPs. \\textsc{Luna} also excels at post-hoc conversion: replacing softmax in fine-tuned BERT and ViT-B/16 checkpoints and briefly fine-tuning recovers most of the original performance, substantially outperforming fixed linearizations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08063",
        "abs_url": "https://arxiv.org/abs/2512.08063",
        "pdf_url": "https://arxiv.org/pdf/2512.08063",
        "title": "Deep Kernel Aalen-Johansen Estimator: An Interpretable and Flexible Neural Net Framework for Competing Risks",
        "authors": [
            "Xiaobin Shen",
            "George H. Chen"
        ],
        "comments": "Machine Learning for Health (ML4H) 2025 Spotlight",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose an interpretable deep competing risks model called the Deep Kernel Aalen-Johansen (DKAJ) estimator, which generalizes the classical Aalen-Johansen nonparametric estimate of cumulative incidence functions (CIFs). Each data point (e.g., patient) is represented as a weighted combination of clusters. If a data point has nonzero weight only for one cluster, then its predicted CIFs correspond to those of the classical Aalen-Johansen estimator restricted to data points from that cluster. These weights come from an automatically learned kernel function that measures how similar any two data points are. On four standard competing risks datasets, we show that DKAJ is competitive with state-of-the-art baselines while being able to provide visualizations to assist model interpretation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08071",
        "abs_url": "https://arxiv.org/abs/2512.08071",
        "pdf_url": "https://arxiv.org/pdf/2512.08071",
        "title": "CAMO: Causality-Guided Adversarial Multimodal Domain Generalization for Crisis Classification",
        "authors": [
            "Pingchuan Ma",
            "Chengshuai Zhao",
            "Bohan Jiang",
            "Saketh Vishnubhatla",
            "Ujun Jeong",
            "Alimohammad Beigi",
            "Adrienne Raglin",
            "Huan Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Crisis classification in social media aims to extract actionable disaster-related information from multimodal posts, which is a crucial task for enhancing situational awareness and facilitating timely emergency responses. However, the wide variation in crisis types makes achieving generalizable performance across unseen disasters a persistent challenge. Existing approaches primarily leverage deep learning to fuse textual and visual cues for crisis classification, achieving numerically plausible results under in-domain settings. However, they exhibit poor generalization across unseen crisis types because they 1. do not disentangle spurious and causal features, resulting in performance degradation under domain shift, and 2. fail to align heterogeneous modality representations within a shared space, which hinders the direct adaptation of established single-modality domain generalization (DG) techniques to the multimodal setting. To address these issues, we introduce a causality-guided multimodal domain generalization (MMDG) framework that combines adversarial disentanglement with unified representation learning for crisis classification. The adversarial objective encourages the model to disentangle and focus on domain-invariant causal features, leading to more generalizable classifications grounded in stable causal mechanisms. The unified representation aligns features from different modalities within a shared latent space, enabling single-modality DG strategies to be seamlessly extended to multimodal learning. Experiments on the different datasets demonstrate that our approach achieves the best performance in unseen disaster scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08077",
        "abs_url": "https://arxiv.org/abs/2512.08077",
        "pdf_url": "https://arxiv.org/pdf/2512.08077",
        "title": "Unveiling Latent Knowledge in Chemistry Language Models through Sparse Autoencoders",
        "authors": [
            "Jaron Cohen",
            "Alexander G. Hasson",
            "Sara Tanovic"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Since the advent of machine learning, interpretability has remained a persistent challenge, becoming increasingly urgent as generative models support high-stakes applications in drug and material discovery. Recent advances in large language model (LLM) architectures have yielded chemistry language models (CLMs) with impressive capabilities in molecular property prediction and molecular generation. However, how these models internally represent chemical knowledge remains poorly understood. In this work, we extend sparse autoencoder techniques to uncover and examine interpretable features within CLMs. Applying our methodology to the Foundation Models for Materials (FM4M) SMI-TED chemistry foundation model, we extract semantically meaningful latent features and analyse their activation patterns across diverse molecular datasets. Our findings reveal that these models encode a rich landscape of chemical concepts. We identify correlations between specific latent features and distinct domains of chemical knowledge, including structural motifs, physicochemical properties, and pharmacological drug classes. Our approach provides a generalisable framework for uncovering latent knowledge in chemistry-focused AI systems. This work has implications for both foundational understanding and practical deployment; with the potential to accelerate computational chemistry research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08091",
        "abs_url": "https://arxiv.org/abs/2512.08091",
        "pdf_url": "https://arxiv.org/pdf/2512.08091",
        "title": "Complexity of One-Dimensional ReLU DNNs",
        "authors": [
            "Jonathan Kogan",
            "Hayden Jananthan",
            "Jeremy Kepner"
        ],
        "comments": "Presented at IEEE MIT URTC 2025",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study the expressivity of one-dimensional (1D) ReLU deep neural networks through the lens of their linear regions. For randomly initialized, fully connected 1D ReLU networks (He scaling with nonzero bias) in the infinite-width limit, we prove that the expected number of linear regions grows as $\\sum_{i = 1}^L n_i + \\mathop{o}\\left(\\sum_{i = 1}^L{n_i}\\right) + 1$, where $n_\\ell$ denotes the number of neurons in the $\\ell$-th hidden layer. We also propose a function-adaptive notion of sparsity that compares the expected regions used by the network to the minimal number needed to approximate a target within a fixed tolerance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08108",
        "abs_url": "https://arxiv.org/abs/2512.08108",
        "pdf_url": "https://arxiv.org/pdf/2512.08108",
        "title": "Scalable Offline Model-Based RL with Action Chunks",
        "authors": [
            "Kwanyoung Park",
            "Seohong Park",
            "Youngwoon Lee",
            "Sergey Levine"
        ],
        "comments": "22 pages, 7 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "In this paper, we study whether model-based reinforcement learning (RL), in particular model-based value expansion, can provide a scalable recipe for tackling complex, long-horizon tasks in offline RL. Model-based value expansion fits an on-policy value function using length-n imaginary rollouts generated by the current policy and a learned dynamics model. While larger n reduces bias in value bootstrapping, it amplifies accumulated model errors over long horizons, degrading future predictions. We address this trade-off with an \\emph{action-chunk} model that predicts a future state from a sequence of actions (an \"action chunk\") instead of a single action, which reduces compounding errors. In addition, instead of directly training a policy to maximize rewards, we employ rejection sampling from an expressive behavioral action-chunk policy, which prevents model exploitation from out-of-distribution actions. We call this recipe \\textbf{Model-Based RL with Action Chunks (MAC)}. Through experiments on highly challenging tasks with large-scale datasets of up to 100M transitions, we show that MAC achieves the best performance among offline model-based RL algorithms, especially on challenging long-horizon tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08124",
        "abs_url": "https://arxiv.org/abs/2512.08124",
        "pdf_url": "https://arxiv.org/pdf/2512.08124",
        "title": "Long-only cryptocurrency portfolio management by ranking the assets: a neural network approach",
        "authors": [
            "Zijiang Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "This paper will propose a novel machine learning based portfolio management method in the context of the cryptocurrency market. Previous researchers mainly focus on the prediction of the movement for specific cryptocurrency such as the bitcoin(BTC) and then trade according to the prediction. In contrast to the previous work that treats the cryptocurrencies independently, this paper manages a group of cryptocurrencies by analyzing the relative relationship. Specifically, in each time step, we utilize the neural network to predict the rank of the future return of the managed cryptocurrencies and place weights accordingly. By incorporating such cross-sectional information, the proposed methods is shown to profitable based on the backtesting experiments on the real daily cryptocurrency market data from May, 2020 to Nov, 2023. During this 3.5 years, the market experiences the full cycle of bullish, bearish and stagnant market conditions. Despite under such complex market conditions, the proposed method outperforms the existing methods and achieves a Sharpe ratio of 1.01 and annualized return of 64.26%. Additionally, the proposed method is shown to be robust to the increase of transaction fee.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08129",
        "abs_url": "https://arxiv.org/abs/2512.08129",
        "pdf_url": "https://arxiv.org/pdf/2512.08129",
        "title": "Improving the Sensitivity of Backdoor Detectors via Class Subspace Orthogonalization",
        "authors": [
            "Guangmingmei Yang",
            "David J. Miller",
            "George Kesidis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Most post-training backdoor detection methods rely on attacked models exhibiting extreme outlier detection statistics for the target class of an attack, compared to non-target classes. However, these approaches may fail: (1) when some (non-target) classes are easily discriminable from all others, in which case they may naturally achieve extreme detection statistics (e.g., decision confidence); and (2) when the backdoor is subtle, i.e., with its features weak relative to intrinsic class-discriminative features. A key observation is that the backdoor target class has contributions to its detection statistic from both the backdoor trigger and from its intrinsic features, whereas non-target classes only have contributions from their intrinsic features. To achieve more sensitive detectors, we thus propose to suppress intrinsic features while optimizing the detection statistic for a given class. For non-target classes, such suppression will drastically reduce the achievable statistic, whereas for the target class the (significant) contribution from the backdoor trigger remains. In practice, we formulate a constrained optimization problem, leveraging a small set of clean examples from a given class, and optimizing the detection statistic while orthogonalizing with respect to the class's intrinsic features. We dub this plug-and-play approach Class Subspace Orthogonalization (CSO) and assess it against challenging mixed-label and adaptive attacks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08139",
        "abs_url": "https://arxiv.org/abs/2512.08139",
        "pdf_url": "https://arxiv.org/pdf/2512.08139",
        "title": "Robust Agents in Open-Ended Worlds",
        "authors": [
            "Mikayel Samvelyan"
        ],
        "comments": "PhD Thesis",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The growing prevalence of artificial intelligence (AI) in various applications underscores the need for agents that can successfully navigate and adapt to an ever-changing, open-ended world. A key challenge is ensuring these AI agents are robust, excelling not only in familiar settings observed during training but also effectively generalising to previously unseen and varied scenarios. In this thesis, we harness methodologies from open-endedness and multi-agent learning to train and evaluate robust AI agents capable of generalising to novel environments, out-of-distribution inputs, and interactions with other co-player agents. We begin by introducing MiniHack, a sandbox framework for creating diverse environments through procedural content generation. Based on the game of NetHack, MiniHack enables the construction of new tasks for reinforcement learning (RL) agents with a focus on generalisation. We then present Maestro, a novel approach for generating adversarial curricula that progressively enhance the robustness and generality of RL agents in two-player zero-sum games. We further probe robustness in multi-agent domains, utilising quality-diversity methods to systematically identify vulnerabilities in state-of-the-art, pre-trained RL policies within the complex video game football domain, characterised by intertwined cooperative and competitive dynamics. Finally, we extend our exploration of robustness to the domain of LLMs. Here, our focus is on diagnosing and enhancing the robustness of LLMs against adversarial prompts, employing evolutionary search to generate a diverse range of effective inputs that aim to elicit undesirable outputs from an LLM. This work collectively paves the way for future advancements in AI robustness, enabling the development of agents that not only adapt to an ever-evolving world but also thrive in the face of unforeseen challenges and interactions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08143",
        "abs_url": "https://arxiv.org/abs/2512.08143",
        "pdf_url": "https://arxiv.org/pdf/2512.08143",
        "title": "PolyLingua: Margin-based Inter-class Transformer for Robust Cross-domain Language Detection",
        "authors": [
            "Ali Lotfi Rezaabad",
            "Bikram Khanal",
            "Shashwat Chaurasia",
            "Lu Zeng",
            "Dezhi Hong",
            "Hossein Beshashati",
            "Thomas Butler",
            "Megan Ganji"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Language identification is a crucial first step in multilingual systems such as chatbots and virtual assistants, enabling linguistically and culturally accurate user experiences. Errors at this stage can cascade into downstream failures, setting a high bar for accuracy. Yet, existing language identification tools struggle with key cases--such as music requests where the song title and user language differ. Open-source tools like LangDetect, FastText are fast but less accurate, while large language models, though effective, are often too costly for low-latency or low-resource settings. We introduce PolyLingua, a lightweight Transformer-based model for in-domain language detection and fine-grained language classification. It employs a two-level contrastive learning framework combining instance-level separation and class-level alignment with adaptive margins, yielding compact and well-separated embeddings even for closely related languages. Evaluated on two challenging datasets--Amazon Massive (multilingual digital assistant utterances) and a Song dataset (music requests with frequent code-switching)--PolyLingua achieves 99.25% F1 and 98.15% F1, respectively, surpassing Sonnet 3.5 while using 10x fewer parameters, making it ideal for compute- and latency-constrained environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08160",
        "abs_url": "https://arxiv.org/abs/2512.08160",
        "pdf_url": "https://arxiv.org/pdf/2512.08160",
        "title": "LayerPipe2: Multistage Pipelining and Weight Recompute via Improved Exponential Moving Average for Training Neural Networks",
        "authors": [
            "Nanda K. Unnikrishnan",
            "Keshab K. Parhi"
        ],
        "comments": "Proc. of 2025 Asilomar Conference on Signals, Systems, and Computers, October 2025, Pacific Grove, CA",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Hardware Architecture (cs.AR)",
        "abstract": "In our prior work, LayerPipe, we had introduced an approach to accelerate training of convolutional, fully connected, and spiking neural networks by overlapping forward and backward computation. However, despite empirical success, a principled understanding of how much gradient delay needs to be introduced at each layer to achieve desired level of pipelining was not addressed. This paper, LayerPipe2, fills that gap by formally deriving LayerPipe using variable delayed gradient adaptation and retiming. We identify where delays may be legally inserted and show that the required amount of delay follows directly from the network structure where inner layers require fewer delays and outer layers require longer delays. When pipelining is applied at every layer, the amount of delay depends only on the number of remaining downstream stages. When layers are pipelined in groups, all layers in the group share the same assignment of delays. These insights not only explain previously observed scheduling patterns but also expose an often overlooked challenge that pipelining implicitly requires storage of historical weights. We overcome this storage bottleneck by developing a pipeline--aware moving average that reconstructs the required past states rather than storing them explicitly. This reduces memory cost without sacrificing the accuracy guarantees that makes pipelined learning viable. The result is a principled framework that illustrates how to construct LayerPipe architectures, predicts their delay requirements, and mitigates their storage burden, thereby enabling scalable pipelined training with controlled communication computation tradeoffs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08211",
        "abs_url": "https://arxiv.org/abs/2512.08211",
        "pdf_url": "https://arxiv.org/pdf/2512.08211",
        "title": "MobileFineTuner: A Unified End-to-End Framework for Fine-Tuning LLMs on Mobile Phones",
        "authors": [
            "Jiaxiang Geng",
            "Lunyu Zhao",
            "Yiyi Lu",
            "Bing Luo"
        ],
        "comments": "15 pages, 9 figures, submitted to Mobisys 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Mobile phones are the most ubiquitous end devices, generating vast amounts of human-authored data and serving as the primary platform for end-side applications. As high-quality public data for large language models (LLMs) approaches exhaustion, on-device fine-tuning provides an opportunity to leverage private user data while preserving privacy. However, existing approaches are predominantly simulation-based or rely on IoT devices and PCs, leaving commodity mobile phones largely unexplored. A key gap is the absence of an open-source framework that enables practical LLM fine-tuning on mobile phones. We present MobileFineTuner, a unified open-source framework that enables end-to-end LLM fine-tuning directly on commodity mobile phones. MobileFineTuner is designed for efficiency, scalability, and usability, supporting full-parameters fine-tuning (Full-FT) and parameter-efficient fine-tuning (PEFT). To address the memory and energy limitations inherent to mobile phones, we introduce system-level optimizations including parameter sharding, gradient accumulation, and energy-aware computation scheduling. We demonstrate the practicality of MobileFineTuner by fine-tuning GPT-2, Gemma 3, and Qwen 2.5 on real mobile phones. Extensive experiments and ablation studies validate the effectiveness of the proposed optimizations and establish MobileFineTuner as a viable foundation for future research on on-device LLM training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08217",
        "abs_url": "https://arxiv.org/abs/2512.08217",
        "pdf_url": "https://arxiv.org/pdf/2512.08217",
        "title": "Correction of Decoupled Weight Decay",
        "authors": [
            "Jason Chuan-Chih Chou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Decoupled weight decay, solely responsible for the performance advantage of AdamW over Adam, has long been set to proportional to learning rate $\\gamma$ without questioning. Some researchers have recently challenged such assumption and argued that decoupled weight decay should be set $\\propto \\gamma^2$ instead based on orthogonality arguments at steady state. To the contrary, we find that eliminating the contribution of the perpendicular component of the update to the weight norm leads to little change to the training dynamics. Instead, we derive that decoupled weight decay $\\propto \\gamma^2$ results in stable weight norm based on the simple assumption that updates become independent of the weights at steady state, regardless of the nature of the optimizer. Based on the same assumption, we derive and empirically verify that the Total Update Contribution (TUC) of a minibatch under the Scion optimizer is better characterized by the momentum-dependent effective learning rate whose optimal value transfers and we show that decoupled weight decay $\\propto \\gamma^2$ leads to stable weight and gradient norms and allows us to better control the training dynamics and improve the model performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08241",
        "abs_url": "https://arxiv.org/abs/2512.08241",
        "pdf_url": "https://arxiv.org/pdf/2512.08241",
        "title": "Persistent Topological Structures and Cohomological Flows as a Mathematical Framework for Brain-Inspired Representation Learning",
        "authors": [
            "Preksha Girish",
            "Rachana Mysore",
            "Mahanthesha U",
            "Shrey Kumar",
            "Shipra Prashant"
        ],
        "comments": "6 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper presents a mathematically rigorous framework for brain-inspired representation learning founded on the interplay between persistent topological structures and cohomological flows. Neural computation is reformulated as the evolution of cochain maps over dynamic simplicial complexes, enabling representations that capture invariants across temporal, spatial, and functional brain states. The proposed architecture integrates algebraic topology with differential geometry to construct cohomological operators that generalize gradient-based learning within a homological landscape. Synthetic data with controlled topological signatures and real neural datasets are jointly analyzed using persistent homology, sheaf cohomology, and spectral Laplacians to quantify stability, continuity, and structural preservation. Empirical results demonstrate that the model achieves superior manifold consistency and noise resilience compared to graph neural and manifold-based deep architectures, establishing a coherent mathematical foundation for topology-driven representation learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08246",
        "abs_url": "https://arxiv.org/abs/2512.08246",
        "pdf_url": "https://arxiv.org/pdf/2512.08246",
        "title": "SPROCKET: Extending ROCKET to Distance-Based Time-Series Transformations With Prototypes",
        "authors": [
            "Nicholas Harner"
        ],
        "comments": "63 Pages, 28 in main body with 3 appendices for supplemental figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Classical Time Series Classification algorithms are dominated by feature engineering strategies. One of the most prominent of these transforms is ROCKET, which achieves strong performance through random kernel features. We introduce SPROCKET (Selected Prototype Random Convolutional Kernel Transform), which implements a new feature engineering strategy based on prototypes. On a majority of the UCR and UEA Time Series Classification archives, SPROCKET achieves performance comparable to existing convolutional algorithms and the new MR-HY-SP ( MultiROCKET-HYDRA-SPROCKET) ensemble's average accuracy ranking exceeds HYDRA-MR, the previous best convolutional ensemble's performance. These experimental results demonstrate that prototype-based feature transformation can enhance both accuracy and robustness in time series classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08256",
        "abs_url": "https://arxiv.org/abs/2512.08256",
        "pdf_url": "https://arxiv.org/pdf/2512.08256",
        "title": "Wavelet-Accelerated Physics-Informed Quantum Neural Network for Multiscale Partial Differential Equations",
        "authors": [
            "Deepak Gupta",
            "Himanshu Pandey",
            "Ratikanta Behera"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Analysis of PDEs (math.AP); Quantum Algebra (math.QA)",
        "abstract": "This work proposes a wavelet-based physics-informed quantum neural network framework to efficiently address multiscale partial differential equations that involve sharp gradients, stiffness, rapid local variations, and highly oscillatory behavior. Traditional physics-informed neural networks (PINNs) have demonstrated substantial potential in solving differential equations, and their quantum counterparts, quantum-PINNs, exhibit enhanced representational capacity with fewer trainable parameters. However, both approaches face notable challenges in accurately solving multiscale features. Furthermore, their reliance on automatic differentiation for constructing loss functions introduces considerable computational overhead, resulting in longer training times. To overcome these challenges, we developed a wavelet-accelerated physics-informed quantum neural network that eliminates the need for automatic differentiation, significantly reducing computational complexity. The proposed framework incorporates the multiresolution property of wavelets within the quantum neural network architecture, thereby enhancing the network's ability to effectively capture both local and global features of multiscale problems. Numerical experiments demonstrate that our proposed method achieves superior accuracy while requiring less than five percent of the trainable parameters compared to classical wavelet-based PINNs, resulting in faster convergence. Moreover, it offers a speedup of three to five times compared to existing quantum PINNs, highlighting the potential of the proposed approach for efficiently solving challenging multiscale and oscillatory problems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08257",
        "abs_url": "https://arxiv.org/abs/2512.08257",
        "pdf_url": "https://arxiv.org/pdf/2512.08257",
        "title": "Geometric-Stochastic Multimodal Deep Learning for Predictive Modeling of SUDEP and Stroke Vulnerability",
        "authors": [
            "Preksha Girish",
            "Rachana Mysore",
            "Mahanthesha U",
            "Shrey Kumar",
            "Misbah Fatimah Annigeri",
            "Tanish Jain"
        ],
        "comments": "7 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG); Image and Video Processing (eess.IV)",
        "abstract": "Sudden Unexpected Death in Epilepsy (SUDEP) and acute ischemic stroke are life-threatening conditions involving complex interactions across cortical, brainstem, and autonomic systems. We present a unified geometric-stochastic multimodal deep learning framework that integrates EEG, ECG, respiration, SpO2, EMG, and fMRI signals to model SUDEP and stroke vulnerability. The approach combines Riemannian manifold embeddings, Lie-group invariant feature representations, fractional stochastic dynamics, Hamiltonian energy-flow modeling, and cross-modal attention mechanisms. Stroke propagation is modeled using fractional epidemic diffusion over structural brain graphs. Experiments on the MULTI-CLARID dataset demonstrate improved predictive accuracy and interpretable biomarkers derived from manifold curvature, fractional memory indices, attention entropy, and diffusion centrality. The proposed framework provides a mathematically principled foundation for early detection, risk stratification, and interpretable multimodal modeling in neural-autonomic disorders.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08264",
        "abs_url": "https://arxiv.org/abs/2512.08264",
        "pdf_url": "https://arxiv.org/pdf/2512.08264",
        "title": "Mathematical Foundations of Neural Tangents and Infinite-Width Networks",
        "authors": [
            "Rachana Mysore",
            "Preksha Girish",
            "Kavitha Jayaram",
            "Shrey Kumar",
            "Preksha Girish",
            "Shravan Sanjeev Bagal",
            "Kavitha Jayaram",
            "Shreya Aravind Shastry"
        ],
        "comments": "7 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We investigate the mathematical foundations of neural networks in the infinite-width regime through the Neural Tangent Kernel (NTK). We propose the NTK-Eigenvalue-Controlled Residual Network (NTK-ECRN), an architecture integrating Fourier feature embeddings, residual connections with layerwise scaling, and stochastic depth to enable rigorous analysis of kernel evolution during training. Our theoretical contributions include deriving bounds on NTK dynamics, characterizing eigenvalue evolution, and linking spectral properties to generalization and optimization stability. Empirical results on synthetic and benchmark datasets validate the predicted kernel behavior and demonstrate improved training stability and generalization. This work provides a comprehensive framework bridging infinite-width theory and practical deep-learning architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08267",
        "abs_url": "https://arxiv.org/abs/2512.08267",
        "pdf_url": "https://arxiv.org/pdf/2512.08267",
        "title": "SOFA-FL: Self-Organizing Hierarchical Federated Learning with Adaptive Clustered Data Sharing",
        "authors": [
            "Yi Ni",
            "Xinkun Wang",
            "Han Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated Learning (FL) faces significant challenges in evolving environments, particularly regarding data heterogeneity and the rigidity of fixed network topologies. To address these issues, this paper proposes \\textbf{SOFA-FL} (Self-Organizing Hierarchical Federated Learning with Adaptive Clustered Data Sharing), a novel framework that enables hierarchical federated systems to self-organize and adapt over time. The framework is built upon three core mechanisms: (1) \\textbf{Dynamic Multi-branch Agglomerative Clustering (DMAC)}, which constructs an initial efficient hierarchical structure; (2) \\textbf{Self-organizing Hierarchical Adaptive Propagation and Evolution (SHAPE)}, which allows the system to dynamically restructure its topology through atomic operations -- grafting, pruning, consolidation, and purification -- to adapt to changes in data distribution; and (3) \\textbf{Adaptive Clustered Data Sharing}, which mitigates data heterogeneity by enabling controlled partial data exchange between clients and cluster nodes. By integrating these mechanisms, SOFA-FL effectively captures dynamic relationships among clients and enhances personalization capabilities without relying on predetermined cluster structures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08274",
        "abs_url": "https://arxiv.org/abs/2512.08274",
        "pdf_url": "https://arxiv.org/pdf/2512.08274",
        "title": "gHAWK: Local and Global Structure Encoding for Scalable Training of Graph Neural Networks on Knowledge Graphs",
        "authors": [
            "Humera Sabir",
            "Fatima Farooq",
            "Ashraf Aboulnaga"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Databases (cs.DB)",
        "abstract": "Knowledge Graphs (KGs) are a rich source of structured, heterogeneous data, powering a wide range of applications. A common approach to leverage this data is to train a graph neural network (GNN) on the KG. However, existing message-passing GNNs struggle to scale to large KGs because they rely on the iterative message passing process to learn the graph structure, which is inefficient, especially under mini-batch training, where a node sees only a partial view of its neighborhood. In this paper, we address this problem and present gHAWK, a novel and scalable GNN training framework for large KGs. The key idea is to precompute structural features for each node that capture its local and global structure before GNN training even begins. Specifically, gHAWK introduces a preprocessing step that computes: (a)~Bloom filters to compactly encode local neighborhood structure, and (b)~TransE embeddings to represent each node's global position in the graph. These features are then fused with any domain-specific features (e.g., text embeddings), producing a node feature vector that can be incorporated into any GNN technique. By augmenting message-passing training with structural priors, gHAWK significantly reduces memory usage, accelerates convergence, and improves model accuracy. Extensive experiments on large datasets from the Open Graph Benchmark (OGB) demonstrate that gHAWK achieves state-of-the-art accuracy and lower training time on both node property prediction and link prediction tasks, topping the OGB leaderboard for three graphs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08306",
        "abs_url": "https://arxiv.org/abs/2512.08306",
        "pdf_url": "https://arxiv.org/pdf/2512.08306",
        "title": "Jacobian Aligned Random Forests",
        "authors": [
            "Sarwesh Rauniyar"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Axis-aligned decision trees are fast and stable but struggle on datasets with rotated or interaction-dependent decision boundaries, where informative splits require linear combinations of features rather than single-feature thresholds. Oblique forests address this with per-node hyperplane splits, but at added computational cost and implementation complexity. We propose a simple alternative: JARF, Jacobian-Aligned Random Forests. Concretely, we first fit an axis-aligned forest to estimate class probabilities or regression outputs, compute finite-difference gradients of these predictions with respect to each feature, aggregate them into an expected Jacobian outer product that generalizes the expected gradient outer product (EGOP), and use it as a single global linear preconditioner for all inputs. This supervised preconditioner applies a single global rotation of the feature space, then hands the transformed data back to a standard axis-aligned forest, preserving off-the-shelf training pipelines while capturing oblique boundaries and feature interactions that would otherwise require many axis-aligned splits to approximate. The same construction applies to any model that provides gradients, though we focus on random forests and gradient-boosted trees in this work. On tabular classification and regression benchmarks, this preconditioning consistently improves axis-aligned forests and often matches or surpasses oblique baselines while improving training time. Our experimental results and theoretical analysis together indicate that supervised preconditioning can recover much of the accuracy of oblique forests while retaining the simplicity and robustness of axis-aligned trees.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08314",
        "abs_url": "https://arxiv.org/abs/2512.08314",
        "pdf_url": "https://arxiv.org/pdf/2512.08314",
        "title": "Minimizing Layerwise Activation Norm Improves Generalization in Federated Learning",
        "authors": [
            "M Yashwanth",
            "Gaurav Kumar Nayak",
            "Harsh Rangwani",
            "Arya Singh",
            "R. Venkatesh Babu",
            "Anirban Chakraborty"
        ],
        "comments": "Accepted to WACV 2024",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated Learning (FL) is an emerging machine learning framework that enables multiple clients (coordinated by a server) to collaboratively train a global model by aggregating the locally trained models without sharing any client's training data. It has been observed in recent works that learning in a federated manner may lead the aggregated global model to converge to a 'sharp minimum' thereby adversely affecting the generalizability of this FL-trained model. Therefore, in this work, we aim to improve the generalization performance of models trained in a federated setup by introducing a 'flatness' constrained FL optimization problem. This flatness constraint is imposed on the top eigenvalue of the Hessian computed from the training loss. As each client trains a model on its local data, we further re-formulate this complex problem utilizing the client loss functions and propose a new computationally efficient regularization technique, dubbed 'MAN,' which Minimizes Activation's Norm of each layer on client-side models. We also theoretically show that minimizing the activation norm reduces the top eigenvalue of the layer-wise Hessian of the client's loss, which in turn decreases the overall Hessian's top eigenvalue, ensuring convergence to a flat minimum. We apply our proposed flatness-constrained optimization to the existing FL techniques and obtain significant improvements, thereby establishing new state-of-the-art.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08371",
        "abs_url": "https://arxiv.org/abs/2512.08371",
        "pdf_url": "https://arxiv.org/pdf/2512.08371",
        "title": "A Multivariate Bernoulli-Based Sampling Method for Multi-Label Data with Application to Meta-Research",
        "authors": [
            "Simon Chung",
            "Colby J. Vorland",
            "Donna L. Maney",
            "Andrew W. Brown"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Datasets may contain observations with multiple labels. If the labels are not mutually exclusive, and if the labels vary greatly in frequency, obtaining a sample that includes sufficient observations with scarcer labels to make inferences about those labels, and which deviates from the population frequencies in a known manner, creates challenges. In this paper, we consider a multivariate Bernoulli distribution as our underlying distribution of a multi-label problem. We present a novel sampling algorithm that takes label dependencies into account. It uses observed label frequencies to estimate multivariate Bernoulli distribution parameters and calculate weights for each label combination. This approach ensures the weighted sampling acquires target distribution characteristics while accounting for label dependencies. We applied this approach to a sample of research articles from Web of Science labeled with 64 biomedical topic categories. We aimed to preserve category frequency order, reduce frequency differences between most and least common categories, and account for category dependencies. This approach produced a more balanced sub-sample, enhancing the representation of minority categories.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08443",
        "abs_url": "https://arxiv.org/abs/2512.08443",
        "pdf_url": "https://arxiv.org/pdf/2512.08443",
        "title": "Fully Decentralized Certified Unlearning",
        "authors": [
            "Hithem Lamri",
            "Michail Maniatakos"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine unlearning (MU) seeks to remove the influence of specified data from a trained model in response to privacy requests or data poisoning. While certified unlearning has been analyzed in centralized and server-orchestrated federated settings (via guarantees analogous to differential privacy, DP), the decentralized setting -- where peers communicate without a coordinator remains underexplored. We study certified unlearning in decentralized networks with fixed topologies and propose RR-DU, a random-walk procedure that performs one projected gradient ascent step on the forget set at the unlearning client and a geometrically distributed number of projected descent steps on the retained data elsewhere, combined with subsampled Gaussian noise and projection onto a trust region around the original model. We provide (i) convergence guarantees in the convex case and stationarity guarantees in the nonconvex case, (ii) $(\\varepsilon,\\delta)$ network-unlearning certificates on client views via subsampled Gaussian $Rényi$ DP (RDP) with segment-level subsampling, and (iii) deletion-capacity bounds that scale with the forget-to-local data ratio and quantify the effect of decentralization (network mixing and randomized subsampling) on the privacy--utility trade-off. Empirically, on image benchmarks (MNIST, CIFAR-10), RR-DU matches a given $(\\varepsilon,\\delta)$ while achieving higher test accuracy than decentralized DP baselines and reducing forget accuracy to random guessing ($\\approx 10\\%$).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08459",
        "abs_url": "https://arxiv.org/abs/2512.08459",
        "pdf_url": "https://arxiv.org/pdf/2512.08459",
        "title": "Biothreat Benchmark Generation Framework for Evaluating Frontier AI Models III: Implementing the Bacterial Biothreat Benchmark (B3) Dataset",
        "authors": [
            "Gary Ackerman",
            "Theodore Wilson",
            "Zachary Kallenborn",
            "Olivia Shoemaker",
            "Anna Wetzel",
            "Hayley Peterson",
            "Abigail Danfora",
            "Jenna LaTourette",
            "Brandon Behlendorf",
            "Douglas Clifford"
        ],
        "comments": "19 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computers and Society (cs.CY); Emerging Technologies (cs.ET)",
        "abstract": "The potential for rapidly-evolving frontier artificial intelligence (AI) models, especially large language models (LLMs), to facilitate bioterrorism or access to biological weapons has generated significant policy, academic, and public concern. Both model developers and policymakers seek to quantify and mitigate any risk, with an important element of such efforts being the development of model benchmarks that can assess the biosecurity risk posed by a particular model. This paper discusses the pilot implementation of the Bacterial Biothreat Benchmark (B3) dataset. It is the third in a series of three papers describing an overall Biothreat Benchmark Generation (BBG) framework, with previous papers detailing the development of the B3 dataset. The pilot involved running the benchmarks through a sample frontier AI model, followed by human evaluation of model responses, and an applied risk analysis of the results along several dimensions. Overall, the pilot demonstrated that the B3 dataset offers a viable, nuanced method for rapidly assessing the biosecurity risk posed by a LLM, identifying the key sources of that risk and providing guidance for priority areas of mitigation priority.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08462",
        "abs_url": "https://arxiv.org/abs/2512.08462",
        "pdf_url": "https://arxiv.org/pdf/2512.08462",
        "title": "Transformers for Multimodal Brain State Decoding: Integrating Functional Magnetic Resonance Imaging Data and Medical Metadata",
        "authors": [
            "Danial Jafarzadeh Jazi",
            "Maryam Hajiesmaeili"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Decoding brain states from functional magnetic resonance imaging (fMRI) data is vital for advancing neuroscience and clinical applications. While traditional machine learning and deep learning approaches have made strides in leveraging the high-dimensional and complex nature of fMRI data, they often fail to utilize the contextual richness provided by Digital Imaging and Communications in Medicine (DICOM) metadata. This paper presents a novel framework integrating transformer-based architectures with multimodal inputs, including fMRI data and DICOM metadata. By employing attention mechanisms, the proposed method captures intricate spatial-temporal patterns and contextual relationships, enhancing model accuracy, interpretability, and robustness. The potential of this framework spans applications in clinical diagnostics, cognitive neuroscience, and personalized medicine. Limitations, such as metadata variability and computational demands, are addressed, and future directions for optimizing scalability and generalizability are discussed.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08475",
        "abs_url": "https://arxiv.org/abs/2512.08475",
        "pdf_url": "https://arxiv.org/pdf/2512.08475",
        "title": "Solving Over-Smoothing in GNNs via Nonlocal Message Passing: Algebraic Smoothing and Depth Scalability",
        "authors": [
            "Weiqi Guan",
            "Junlin He"
        ],
        "comments": "18 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The relationship between Layer Normalization (LN) placement and the over-smoothing phenomenon remains underexplored. We identify a critical dilemma: Pre-LN architectures avoid over-smoothing but suffer from the curse of depth, while Post-LN architectures bypass the curse of depth but experience over-smoothing. To resolve this, we propose a new method based on Post-LN that induces algebraic smoothing, preventing over-smoothing without the curse of depth. Empirical results across five benchmarks demonstrate that our approach supports deeper networks (up to 256 layers) and improves performance, requiring no additional parameters. Key contributions: Theoretical Characterization: Analysis of LN dynamics and their impact on over-smoothing and the curse of depth. A Principled Solution: A parameter-efficient method that induces algebraic smoothing and avoids over-smoothing and the curse of depth. Empirical Validation: Extensive experiments showing the effectiveness of the method in deeper GNNs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08485",
        "abs_url": "https://arxiv.org/abs/2512.08485",
        "pdf_url": "https://arxiv.org/pdf/2512.08485",
        "title": "Optimal Perturbation Budget Allocation for Data Poisoning in Offline Reinforcement Learning",
        "authors": [
            "Junnan Qiu",
            "Jie Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Offline Reinforcement Learning (RL) enables policy optimization from static datasets but is inherently vulnerable to data poisoning attacks. Existing attack strategies typically rely on locally uniform perturbations, which treat all samples indiscriminately. This approach is inefficient, as it wastes the perturbation budget on low-impact samples, and lacks stealthiness due to significant statistical deviations. In this paper, we propose a novel Global Budget Allocation attack strategy. Leveraging the theoretical insight that a sample's influence on value function convergence is proportional to its Temporal Difference (TD) error, we formulate the attack as a global resource allocation problem. We derive a closed-form solution where perturbation magnitudes are assigned proportional to the TD-error sensitivity under a global L2 constraint. Empirical results on D4RL benchmarks demonstrate that our method significantly outperforms baseline strategies, achieving up to 80% performance degradation with minimal perturbations that evade detection by state-of-the-art statistical and spectral defenses.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08567",
        "abs_url": "https://arxiv.org/abs/2512.08567",
        "pdf_url": "https://arxiv.org/pdf/2512.08567",
        "title": "A Hybrid Model for Stock Market Forecasting: Integrating News Sentiment and Time Series Data with Graph Neural Networks",
        "authors": [
            "Nader Sadek",
            "Mirette Moawad",
            "Christina Naguib",
            "Mariam Elzahaby"
        ],
        "comments": "11 pages, 6 figures. Published in the Proceedings of the 5th International Conference on Artificial Intelligence Research (ICAIR 2025). Published version available at: this https URL",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Stock market prediction is a long-standing challenge in finance, as accurate forecasts support informed investment decisions. Traditional models rely mainly on historical prices, but recent work shows that financial news can provide useful external signals. This paper investigates a multimodal approach that integrates companies' news articles with their historical stock data to improve prediction performance. We compare a Graph Neural Network (GNN) model with a baseline LSTM model. Historical data for each company is encoded using an LSTM, while news titles are embedded with a language model. These embeddings form nodes in a heterogeneous graph, and GraphSAGE is used to capture interactions between articles, companies, and industries. We evaluate two targets: a binary direction-of-change label and a significance-based label. Experiments on the US equities and Bloomberg datasets show that the GNN outperforms the LSTM baseline, achieving 53% accuracy on the first target and a 4% precision gain on the second. Results also indicate that companies with more associated news yield higher prediction accuracy. Moreover, headlines contain stronger predictive signals than full articles, suggesting that concise news summaries play an important role in short-term market reactions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08591",
        "abs_url": "https://arxiv.org/abs/2512.08591",
        "pdf_url": "https://arxiv.org/pdf/2512.08591",
        "title": "Long-Sequence LSTM Modeling for NBA Game Outcome Prediction Using a Novel Multi-Season Dataset",
        "authors": [
            "Charles Rios",
            "Longzhen Han",
            "Almas Baimagambetov",
            "Nikolaos Polatidis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Predicting the outcomes of professional basketball games, particularly in the National Basketball Association (NBA), has become increasingly important for coaching strategy, fan engagement, and sports betting. However, many existing prediction models struggle with concept drift, limited temporal context, and instability across seasons. To advance forecasting in this domain, we introduce a newly constructed longitudinal NBA dataset covering the 2004-05 to 2024-25 seasons and present a deep learning framework designed to model long-term performance trends. Our primary contribution is a Long Short-Term Memory (LSTM) architecture that leverages an extended sequence length of 9,840 games equivalent to eight full NBA seasons to capture evolving team dynamics and season-over-season dependencies. We compare this model against several traditional Machine Learning (ML) and Deep Learning (DL) baselines, including Logistic Regression, Random Forest, Multi-Layer Perceptron (MLP), and Convolutional Neural Network (CNN). The LSTM achieves the best performance across all metrics, with 72.35 accuracy, 73.15 precision and 76.13 AUC-ROC. These results demonstrate the importance of long-sequence temporal modeling in basketball outcome prediction and highlight the value of our new multi-season dataset for developing robust, generalizable NBA forecasting systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08671",
        "abs_url": "https://arxiv.org/abs/2512.08671",
        "pdf_url": "https://arxiv.org/pdf/2512.08671",
        "title": "DS FedProxGrad: Asymptotic Stationarity Without Noise Floor in Fair Federated Learning",
        "authors": [
            "Huzaifa Arif"
        ],
        "comments": "8 pages",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Recent work \\cite{arifgroup} introduced Federated Proximal Gradient \\textbf{(\\texttt{FedProxGrad})} for solving non-convex composite optimization problems in group fair federated learning. However, the original analysis established convergence only to a \\textit{noise-dominated neighborhood of stationarity}, with explicit dependence on a variance-induced noise floor. In this work, we provide an improved asymptotic convergence analysis for a generalized \\texttt{FedProxGrad}-type analytical framework with inexact local proximal solutions and explicit fairness regularization. We call this extended analytical framework \\textbf{DS \\texttt{FedProxGrad}} (Decay Step Size \\texttt{FedProxGrad}). Under a Robbins-Monro step-size schedule \\cite{robbins1951stochastic} and a mild decay condition on local inexactness, we prove that $\\liminf_{r\\to\\infty} \\mathbb{E}[\\|\\nabla F(\\mathbf{x}^r)\\|^2] = 0$, i.e., the algorithm is asymptotically stationary and the convergence rate does not depend on a variance-induced noise floor.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08699",
        "abs_url": "https://arxiv.org/abs/2512.08699",
        "pdf_url": "https://arxiv.org/pdf/2512.08699",
        "title": "An Additive Manufacturing Part Qualification Framework: Transferring Knowledge of Stress-strain Behaviors from Additively Manufactured Polymers to Metals",
        "authors": [
            "Chenglong Duan",
            "Dazhong Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Part qualification is crucial in additive manufacturing (AM) because it ensures that additively manufactured parts can be consistently produced and reliably used in critical applications. Part qualification aims at verifying that an additively manufactured part meets performance requirements; therefore, predicting the complex stress-strain behaviors of additively manufactured parts is critical. We develop a dynamic time warping (DTW)-transfer learning (TL) framework for additive manufacturing part qualification by transferring knowledge of the stress-strain behaviors of additively manufactured low-cost polymers to metals. Specifically, the framework employs DTW to select a polymer dataset as the source domain that is the most relevant to the target metal dataset. Using a long short-term memory (LSTM) model, four source polymers (i.e., Nylon, PLA, CF-ABS, and Resin) and three target metals (i.e., AlSi10Mg, Ti6Al4V, and carbon steel) that are fabricated by different AM techniques are utilized to demonstrate the effectiveness of the DTW-TL framework. Experimental results show that the DTW-TL framework identifies the closest match between polymers and metals to select one single polymer dataset as the source domain. The DTW-TL model achieves the lowest mean absolute percentage error of 12.41% and highest coefficient of determination of 0.96 when three metals are used as the target domain, respectively, outperforming the vanilla LSTM model without TL as well as the TL model pre-trained on four polymer datasets as the source domain.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08724",
        "abs_url": "https://arxiv.org/abs/2512.08724",
        "pdf_url": "https://arxiv.org/pdf/2512.08724",
        "title": "Exposing Hidden Biases in Text-to-Image Models via Automated Prompt Search",
        "authors": [
            "Manos Plitsis",
            "Giorgos Bouritsas",
            "Vassilis Katsouros",
            "Yannis Panagakis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Text-to-image (TTI) diffusion models have achieved remarkable visual quality, yet they have been repeatedly shown to exhibit social biases across sensitive attributes such as gender, race and age. To mitigate these biases, existing approaches frequently depend on curated prompt datasets - either manually constructed or generated with large language models (LLMs) - as part of their training and/or evaluation procedures. Beside the curation cost, this also risks overlooking unanticipated, less obvious prompts that trigger biased generation, even in models that have undergone debiasing. In this work, we introduce Bias-Guided Prompt Search (BGPS), a framework that automatically generates prompts that aim to maximize the presence of biases in the resulting images. BGPS comprises two components: (1) an LLM instructed to produce attribute-neutral prompts and (2) attribute classifiers acting on the TTI's internal representations that steer the decoding process of the LLM toward regions of the prompt space that amplify the image attributes of interest. We conduct extensive experiments on Stable Diffusion 1.5 and a state-of-the-art debiased model and discover an array of subtle and previously undocumented biases that severely deteriorate fairness metrics. Crucially, the discovered prompts are interpretable, i.e they may be entered by a typical user, quantitatively improving the perplexity metric compared to a prominent hard prompt optimization counterpart. Our findings uncover TTI vulnerabilities, while BGPS expands the bias search space and can act as a new evaluation tool for bias mitigation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08732",
        "abs_url": "https://arxiv.org/abs/2512.08732",
        "pdf_url": "https://arxiv.org/pdf/2512.08732",
        "title": "Neural Ordinary Differential Equations for Simulating Metabolic Pathway Dynamics from Time-Series Multiomics Data",
        "authors": [
            "Udesh Habaraduwa",
            "Andrei Lixandru"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Subcellular Processes (q-bio.SC)",
        "abstract": "The advancement of human healthspan and bioengineering relies heavily on predicting the behavior of complex biological systems. While high-throughput multiomics data is becoming increasingly abundant, converting this data into actionable predictive models remains a bottleneck. High-capacity, datadriven simulation systems are critical in this landscape; unlike classical mechanistic models restricted by prior knowledge, these architectures can infer latent interactions directly from observational data, allowing for the simulation of temporal trajectories and the anticipation of downstream intervention effects in personalized medicine and synthetic biology. To address this challenge, we introduce Neural Ordinary Differential Equations (NODEs) as a dynamic framework for learning the complex interplay between the proteome and metabolome. We applied this framework to time-series data derived from engineered Escherichia coli strains, modeling the continuous dynamics of metabolic pathways. The proposed NODE architecture demonstrates superior performance in capturing system dynamics compared to traditional machine learning pipelines. Our results show a greater than 90% improvement in root mean squared error over baselines across both Limonene (up to 94.38% improvement) and Isopentenol (up to 97.65% improvement) pathway datasets. Furthermore, the NODE models demonstrated a 1000x acceleration in inference time, establishing them as a scalable, high-fidelity tool for the next generation of metabolic engineering and biological discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08763",
        "abs_url": "https://arxiv.org/abs/2512.08763",
        "pdf_url": "https://arxiv.org/pdf/2512.08763",
        "title": "Learning and Editing Universal Graph Prompt Tuning via Reinforcement Learning",
        "authors": [
            "Jinfeng Xu",
            "Zheyu Chen",
            "Shuo Yang",
            "Jinze Li",
            "Hewei Wang",
            "Yijie Li",
            "Edith C. H. Ngai"
        ],
        "comments": "Accepted by KDD 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Early graph prompt tuning approaches relied on task-specific designs for Graph Neural Networks (GNNs), limiting their adaptability across diverse pre-training strategies. In contrast, another promising line of research has investigated universal graph prompt tuning, which operates directly in the input graph's feature space and builds a theoretical foundation that universal graph prompt tuning can theoretically achieve an equivalent effect of any prompting function, eliminating dependence on specific pre-training strategies. Recent works propose selective node-based graph prompt tuning to pursue more ideal prompts. However, we argue that selective node-based graph prompt tuning inevitably compromises the theoretical foundation of universal graph prompt tuning. In this paper, we strengthen the theoretical foundation of universal graph prompt tuning by introducing stricter constraints, demonstrating that adding prompts to all nodes is a necessary condition for achieving the universality of graph prompts. To this end, we propose a novel model and paradigm, Learning and Editing Universal GrAph Prompt Tuning (LEAP), which preserves the theoretical foundation of universal graph prompt tuning while pursuing more ideal prompts. Specifically, we first build the basic universal graph prompts to preserve the theoretical foundation and then employ actor-critic reinforcement learning to select nodes and edit prompts. Extensive experiments on graph- and node-level tasks across various pre-training strategies in both full-shot and few-shot scenarios show that LEAP consistently outperforms fine-tuning and other prompt-based approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08772",
        "abs_url": "https://arxiv.org/abs/2512.08772",
        "pdf_url": "https://arxiv.org/pdf/2512.08772",
        "title": "De novo generation of functional terpene synthases using TpsGPT",
        "authors": [
            "Hamsini Ramanathan",
            "Roman Bushuiev",
            "Matouš Soldát",
            "Jirí Kohout",
            "Téo Hebra",
            "Joshua David Smith",
            "Josef Sivic",
            "Tomáš Pluskal"
        ],
        "comments": "11 pages, 8 figures, Accepted at the NeurIPS 2025 AI for Science and MLSB 2025 workshops",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Terpene synthases (TPS) are a key family of enzymes responsible for generating the diverse terpene scaffolds that underpin many natural products, including front-line anticancer drugs such as Taxol. However, de novo TPS design through directed evolution is costly and slow. We introduce TpsGPT, a generative model for scalable TPS protein design, built by fine-tuning the protein language model ProtGPT2 on 79k TPS sequences mined from UniProt. TpsGPT generated de novo enzyme candidates in silico and we evaluated them using multiple validation metrics, including EnzymeExplorer classification, ESMFold structural confidence (pLDDT), sequence diversity, CLEAN classification, InterPro domain detection, and Foldseek structure alignment. From an initial pool of 28k generated sequences, we identified seven putative TPS enzymes that satisfied all validation criteria. Experimental validation confirmed TPS enzymatic activity in at least two of these sequences. Our results show that fine-tuning of a protein language model on a carefully curated, enzyme-class-specific dataset, combined with rigorous filtering, can enable the de novo generation of functional, evolutionarily distant enzymes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08798",
        "abs_url": "https://arxiv.org/abs/2512.08798",
        "pdf_url": "https://arxiv.org/pdf/2512.08798",
        "title": "Can TabPFN Compete with GNNs for Node Classification via Graph Tabularization?",
        "authors": [
            "Jeongwhan Choi",
            "Woosung Kang",
            "Minseo Kim",
            "Jongwoo Kim",
            "Noseong Park"
        ],
        "comments": "Rejected from LoG 2025 (submitted August 2025)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Foundation models pretrained on large data have demonstrated remarkable zero-shot generalization capabilities across domains. Building on the success of TabPFN for tabular data and its recent extension to time series, we investigate whether graph node classification can be effectively reformulated as a tabular learning problem. We introduce TabPFN-GN, which transforms graph data into tabular features by extracting node attributes, structural properties, positional encodings, and optionally smoothed neighborhood features. This enables TabPFN to perform direct node classification without any graph-specific training or language model dependencies. Our experiments on 12 benchmark datasets reveal that TabPFN-GN achieves competitive performance with GNNs on homophilous graphs and consistently outperforms them on heterophilous graphs. These results demonstrate that principled feature engineering can bridge the gap between tabular and graph domains, providing a practical alternative to task-specific GNN training and LLM-dependent graph foundation models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08805",
        "abs_url": "https://arxiv.org/abs/2512.08805",
        "pdf_url": "https://arxiv.org/pdf/2512.08805",
        "title": "Identifying counterfactual probabilities using bivariate distributions and uplift modeling",
        "authors": [
            "Théo Verhelst",
            "Gianluca Bontempi"
        ],
        "comments": "7 pages. Submitted to the 34th European Symposium on Artificial Neural Networks, Computational Intelligence and Machine Learning",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Uplift modeling estimates the causal effect of an intervention as the difference between potential outcomes under treatment and control, whereas counterfactual identification aims to recover the joint distribution of these potential outcomes (e.g., \"Would this customer still have churned had we given them a marketing offer?\"). This joint counterfactual distribution provides richer information than the uplift but is harder to estimate. However, the two approaches are synergistic: uplift models can be leveraged for counterfactual estimation. We propose a counterfactual estimator that fits a bivariate beta distribution to predicted uplift scores, yielding posterior distributions over counterfactual outcomes. Our approach requires no causal assumptions beyond those of uplift modeling. Simulations show the efficacy of the approach, which can be applied, for example, to the problem of customer churn in telecom, where it reveals insights unavailable to standard ML or uplift models alone.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08832",
        "abs_url": "https://arxiv.org/abs/2512.08832",
        "pdf_url": "https://arxiv.org/pdf/2512.08832",
        "title": "Forecasting Fails: Unveiling Evasion Attacks in Weather Prediction Models",
        "authors": [
            "Huzaifa Arif",
            "Pin-Yu Chen",
            "Alex Gittens",
            "James Diffenderfer",
            "Bhavya Kailkhura"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "With the increasing reliance on AI models for weather forecasting, it is imperative to evaluate their vulnerability to adversarial perturbations. This work introduces Weather Adaptive Adversarial Perturbation Optimization (WAAPO), a novel framework for generating targeted adversarial perturbations that are both effective in manipulating forecasts and stealthy to avoid detection. WAAPO achieves this by incorporating constraints for channel sparsity, spatial localization, and smoothness, ensuring that perturbations remain physically realistic and imperceptible. Using the ERA5 dataset and FourCastNet (Pathak et al. 2022), we demonstrate WAAPO's ability to generate adversarial trajectories that align closely with predefined targets, even under constrained conditions. Our experiments highlight critical vulnerabilities in AI-driven forecasting models, where small perturbations to initial conditions can result in significant deviations in predicted weather patterns. These findings underscore the need for robust safeguards to protect against adversarial exploitation in operational forecasting systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08855",
        "abs_url": "https://arxiv.org/abs/2512.08855",
        "pdf_url": "https://arxiv.org/pdf/2512.08855",
        "title": "Reinforcement Learning From State and Temporal Differences",
        "authors": [
            "Lex Weaver",
            "Jonathan Baxter"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "TD($\\lambda$) with function approximation has proved empirically successful for some complex reinforcement learning problems. For linear approximation, TD($\\lambda$) has been shown to minimise the squared error between the approximate value of each state and the true value. However, as far as policy is concerned, it is error in the relative ordering of states that is critical, rather than error in the state values. We illustrate this point, both in simple two-state and three-state systems in which TD($\\lambda$)--starting from an optimal policy--converges to a sub-optimal policy, and also in backgammon. We then present a modified form of TD($\\lambda$), called STD($\\lambda$), in which function approximators are trained with respect to relative state values on binary decision problems. A theoretical analysis, including a proof of monotonic policy improvement for STD($\\lambda$) in the context of the two-state system, is presented, along with a comparison with Bertsekas' differential training method [1]. This is followed by successful demonstrations of STD($\\lambda$) on the two-state system and a variation on the well known acrobot problem.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08859",
        "abs_url": "https://arxiv.org/abs/2512.08859",
        "pdf_url": "https://arxiv.org/pdf/2512.08859",
        "title": "Refining Diffusion Models for Motion Synthesis with an Acceleration Loss to Generate Realistic IMU Data",
        "authors": [
            "Lars Ole Häusler",
            "Lena Uhlenberg",
            "Göran Köber",
            "Diyora Salimova",
            "Oliver Amft"
        ],
        "comments": "7 pages, 3 figures, 1 table",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose a text-to-IMU (inertial measurement unit) motion-synthesis framework to obtain realistic IMU data by fine-tuning a pretrained diffusion model with an acceleration-based second-order loss (L_acc). L_acc enforces consistency in the discrete second-order temporal differences of the generated motion, thereby aligning the diffusion prior with IMU-specific acceleration patterns. We integrate L_acc into the training objective of an existing diffusion model, finetune the model to obtain an IMU-specific motion prior, and evaluate the model with an existing text-to-IMU framework that comprises surface modelling and virtual sensor simulation. We analysed acceleration signal fidelity and differences between synthetic motion representation and actual IMU recordings. As a downstream application, we evaluated Human Activity Recognition (HAR) and compared the classification performance using data of our method with the earlier diffusion model and two additional diffusion model baselines. When we augmented the earlier diffusion model objective with L_acc and continued training, L_acc decreased by 12.7% relative to the original model. The improvements were considerably larger in high-dynamic activities (i.e., running, jumping) compared to low-dynamic activities~(i.e., sitting, standing). In a low-dimensional embedding, the synthetic IMU data produced by our refined model shifts closer to the distribution of real IMU recordings. HAR classification trained exclusively on our refined synthetic IMU data improved performance by 8.7% compared to the earlier diffusion model and by 7.6% over the best-performing comparison diffusion model. We conclude that acceleration-aware diffusion refinement provides an effective approach to align motion generation and IMU synthesis and highlights how flexible deep learning pipelines are for specialising generic text-to-motion priors to sensor-specific tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08870",
        "abs_url": "https://arxiv.org/abs/2512.08870",
        "pdf_url": "https://arxiv.org/pdf/2512.08870",
        "title": "Fed-SE: Federated Self-Evolution for Privacy-Constrained Multi-Environment LLM Agents",
        "authors": [
            "Xiang Chen",
            "Yuling Shi",
            "Qizhen Lan",
            "Yuchao Qiu",
            "Xiaodong Gu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "LLM agents are widely deployed in complex interactive tasks, yet privacy constraints often preclude centralized optimization and co-evolution across dynamic environments. While Federated Learning (FL) has proven effective on static datasets, its extension to the open-ended self-evolution of agents remains underexplored. Directly applying standard FL is challenging: heterogeneous tasks and sparse, trajectory-level rewards introduce severe gradient conflicts, destabilizing the global optimization process. To bridge this gap, we propose Fed-SE, a Federated Self-Evolution framework for LLM agents. Fed-SE establishes a local evolution-global aggregation paradigm. Locally, agents employ parameter-efficient fine-tuning on filtered, high-return trajectories to achieve stable gradient updates. Globally, Fed-SE aggregates updates within a low-rank subspace that disentangles environment-specific dynamics, effectively reducing negative transfer across clients. Experiments across five heterogeneous environments demonstrate that Fed-SE improves average task success rates by approximately 18% over federated baselines, validating its effectiveness in robust cross-environment knowledge transfer in privacy-constrained deployments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08875",
        "abs_url": "https://arxiv.org/abs/2512.08875",
        "pdf_url": "https://arxiv.org/pdf/2512.08875",
        "title": "When Tables Leak: Attacking String Memorization in LLM-Based Tabular Data Generation",
        "authors": [
            "Joshua Ward",
            "Bochao Gu",
            "Chi-Hua Wang",
            "Guang Cheng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Large Language Models (LLMs) have recently demonstrated remarkable performance in generating high-quality tabular synthetic data. In practice, two primary approaches have emerged for adapting LLMs to tabular data generation: (i) fine-tuning smaller models directly on tabular datasets, and (ii) prompting larger models with examples provided in context. In this work, we show that popular implementations from both regimes exhibit a tendency to compromise privacy by reproducing memorized patterns of numeric digits from their training data. To systematically analyze this risk, we introduce a simple No-box Membership Inference Attack (MIA) called LevAtt that assumes adversarial access to only the generated synthetic data and targets the string sequences of numeric digits in synthetic observations. Using this approach, our attack exposes substantial privacy leakage across a wide range of models and datasets, and in some cases, is even a perfect membership classifier on state-of-the-art models. Our findings highlight a unique privacy vulnerability of LLM-based synthetic data generation and the need for effective defenses. To this end, we propose two methods, including a novel sampling strategy that strategically perturbs digits during generation. Our evaluation demonstrates that this approach can defeat these attacks with minimal loss of fidelity and utility of the synthetic data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08885",
        "abs_url": "https://arxiv.org/abs/2512.08885",
        "pdf_url": "https://arxiv.org/pdf/2512.08885",
        "title": "Explainable Anomaly Detection for Industrial IoT Data Streams",
        "authors": [
            "Ana Rita Paupério",
            "Diogo Risca",
            "Afonso Lourenço",
            "Goreti Marreiros",
            "Ricardo Martins"
        ],
        "comments": "Accepted at 41st ACM/SIGAPP Symposium On Applied Computing (SAC 2026)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Industrial maintenance is being transformed by the Internet of Things and edge computing, generating continuous data streams that demand real-time, adaptive decision-making under limited computational resources. While data stream mining (DSM) addresses this challenge, most methods assume fully supervised settings, yet in practice, ground-truth labels are often delayed or unavailable. This paper presents a collaborative DSM framework that integrates unsupervised anomaly detection with interactive, human-in-the-loop learning to support maintenance decisions. We employ an online Isolation Forest and enhance interpretability using incremental Partial Dependence Plots and a feature importance score, derived from deviations of Individual Conditional Expectation curves from a fading average, enabling users to dynamically reassess feature relevance and adjust anomaly thresholds. We describe the real-time implementation and provide initial results for fault detection in a Jacquard loom unit. Ongoing work targets continuous monitoring to predict and explain imminent bearing failures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08895",
        "abs_url": "https://arxiv.org/abs/2512.08895",
        "pdf_url": "https://arxiv.org/pdf/2512.08895",
        "title": "Unsupervised Learning of Density Estimates with Topological Optimization",
        "authors": [
            "Suina Tanweer",
            "Firas A. Khasawneh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Kernel density estimation is a key component of a wide variety of algorithms in machine learning, Bayesian inference, stochastic dynamics and signal processing. However, the unsupervised density estimation technique requires tuning a crucial hyperparameter: the kernel bandwidth. The choice of bandwidth is critical as it controls the bias-variance trade-off by over- or under-smoothing the topological features. Topological data analysis provides methods to mathematically quantify topological characteristics, such as connected components, loops, voids et cetera, even in high dimensions where visualization of density estimates is impossible. In this paper, we propose an unsupervised learning approach using a topology-based loss function for the automated and unsupervised selection of the optimal bandwidth and benchmark it against classical techniques -- demonstrating its potential across different dimensions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08896",
        "abs_url": "https://arxiv.org/abs/2512.08896",
        "pdf_url": "https://arxiv.org/pdf/2512.08896",
        "title": "Open Polymer Challenge: Post-Competition Report",
        "authors": [
            "Gang Liu",
            "Sobin Alosious",
            "Subhamoy Mahajan",
            "Eric Inae",
            "Yihan Zhu",
            "Yuhan Liu",
            "Renzheng Zhang",
            "Jiaxin Xu",
            "Addison Howard",
            "Ying Li",
            "Tengfei Luo",
            "Meng Jiang"
        ],
        "comments": "The report for the competition: \"NeurIPS - Open Polymer Prediction 2025\". Kaggle Page: this https URL. Website: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine learning (ML) offers a powerful path toward discovering sustainable polymer materials, but progress has been limited by the lack of large, high-quality, and openly accessible polymer datasets. The Open Polymer Challenge (OPC) addresses this gap by releasing the first community-developed benchmark for polymer informatics, featuring a dataset with 10K polymers and 5 properties: thermal conductivity, radius of gyration, density, fractional free volume, and glass transition temperature. The challenge centers on multi-task polymer property prediction, a core step in virtual screening pipelines for materials discovery. Participants developed models under realistic constraints that include small data, label imbalance, and heterogeneous simulation sources, using techniques such as feature-based augmentation, transfer learning, self-supervised pretraining, and targeted ensemble strategies. The competition also revealed important lessons about data preparation, distribution shifts, and cross-group simulation consistency, informing best practices for future large-scale polymer datasets. The resulting models, analysis, and released data create a new foundation for molecular AI in polymer science and are expected to accelerate the development of sustainable and energy-efficient materials. Along with the competition, we release the test dataset at this https URL. We also release the data generation pipeline at this https URL, which simulates more than 25 properties, including thermal conductivity, radius of gyration, and density.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07785",
        "abs_url": "https://arxiv.org/abs/2512.07785",
        "pdf_url": "https://arxiv.org/pdf/2512.07785",
        "title": "Automating High Energy Physics Data Analysis with LLM-Powered Agents",
        "authors": [
            "Eli Gendreau-Distler",
            "Joshua Ho",
            "Dongwon Kim",
            "Luc Tomas Le Pottier",
            "Haichen Wang",
            "Chengxi Yang"
        ],
        "comments": "16 pages, 6 figures, 2 tables, the 39th Conference on Neural Information Processing Systems (NeurIPS 2025) - Machine Learning and the Physical Sciences (ML4PS) workshop (poster)",
        "subjects": "Data Analysis, Statistics and Probability (physics.data-an); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); High Energy Physics - Experiment (hep-ex)",
        "abstract": "We present a proof-of-principle study demonstrating the use of large language model (LLM) agents to automate a representative high energy physics (HEP) analysis. Using the Higgs boson diphoton cross-section measurement as a case study with ATLAS Open Data, we design a hybrid system that combines an LLM-based supervisor-coder agent with the Snakemake workflow manager. In this architecture, the workflow manager enforces reproducibility and determinism, while the agent autonomously generates, executes, and iteratively corrects analysis code in response to user instructions. We define quantitative evaluation metrics including success rate, error distribution, costs per specific task, and average number of API calls, to assess agent performance across multi-stage workflows. To characterize variability across architectures, we benchmark a representative selection of state-of-the-art LLMs spanning the Gemini and GPT-5 series, the Claude family, and leading open-weight models. While the workflow manager ensures deterministic execution of all analysis steps, the final outputs still show stochastic variation. Although we set the temperature to zero, other sampling parameters (e.g., top-p, top-k) remained at their defaults, and some reasoning-oriented models internally adjust these settings. Consequently, the models do not produce fully deterministic results. This study establishes the first LLM-agent-driven automated data-analysis framework in HEP, enabling systematic benchmarking of model capabilities, stability, and limitations in real-world scientific computing environments. The baseline code used in this work is available at this https URL. This work was accepted as a poster at the Machine Learning and the Physical Sciences (ML4PS) workshop at NeurIPS 2025. The initial submission was made on August 30, 2025.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07846",
        "abs_url": "https://arxiv.org/abs/2512.07846",
        "pdf_url": "https://arxiv.org/pdf/2512.07846",
        "title": "MixLM: High-Throughput and Effective LLM Ranking via Text-Embedding Mix-Interaction",
        "authors": [
            "Guoyao Li",
            "Ran He",
            "Shusen Jing",
            "Kayhan Behdin",
            "Yubo Wang",
            "Sundara Raman Ramachandran",
            "Chanh Nguyen",
            "Jian Sheng",
            "Xiaojing Ma",
            "Chuanrui Zhu",
            "Sriram Vasudevan",
            "Muchen Wu",
            "Sayan Ghosh",
            "Lin Su",
            "Qingquan Song",
            "Xiaoqing Wang",
            "Zhipeng Wang",
            "Qing Lan",
            "Yanning Chen",
            "Jingwei Wu",
            "Luke Simon",
            "Wenjing Zhang",
            "Qi Guo",
            "Fedor Borisyuk"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) excel at capturing semantic nuances and therefore show impressive relevance ranking performance in modern recommendation and search systems. However, they suffer from high computational overhead under industrial latency and throughput requirements. In particular, cross-encoder ranking systems often create long context prefill-heavy workloads, as the model has to be presented with the user, query and item information. To this end, we propose MixLM, a novel LLM-based ranking framework, which significantly improves the system throughput via reducing the input context length, while preserving the semantic strength of cross-encoder rankers. In contrast to a standard ranking system where the context is presented to the model as pure text, we propose to use mix-interaction, a mixture of text and embedding tokens to represent the input. Specifically, MixLM encodes all items in the catalog into a few embedding tokens and stores in a nearline cache. The encoded item descriptions are used during online inference, effectively reducing the item length from a few thousand text tokens to a few embedding tokens. We share insights from deploying our MixLM framework to a real-world search application at LinkedIn, including a detailed discussion of our training pipelines, as well as a thorough analysis of our online serving infrastructure optimization. Comparing with strong baselines, MixLM increased throughput by 10.0x under the same latency budget, while maintaining relevance metrics. The efficiency gains delivered by MixLM enabled full-traffic deployment of LLM-powered search, which resulted in a significant 0.47% increase in Daily Active Users (DAU) in online A/B tests.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07860",
        "abs_url": "https://arxiv.org/abs/2512.07860",
        "pdf_url": "https://arxiv.org/pdf/2512.07860",
        "title": "Integrating LSTM Networks with Neural Levy Processes for Financial Forecasting",
        "authors": [
            "Mohammed Alruqimi",
            "Luca Di Persio"
        ],
        "comments": "",
        "subjects": "Statistical Finance (q-fin.ST); Machine Learning (cs.LG)",
        "abstract": "This paper investigates an optimal integration of deep learning with financial models for robust asset price forecasting. Specifically, we developed a hybrid framework combining a Long Short-Term Memory (LSTM) network with the Merton-Lévy jump-diffusion model. To optimise this framework, we employed the Grey Wolf Optimizer (GWO) for the LSTM hyperparameter tuning, and we explored three calibration methods for the Merton-Levy model parameters: Artificial Neural Networks (ANNs), the Marine Predators Algorithm (MPA), and the PyTorch-based TorchSDE library. To evaluate the predictive performance of our hybrid model, we compared it against several benchmark models, including a standard LSTM and an LSTM combined with the Fractional Heston model. This evaluation used three real-world financial datasets: Brent oil prices, the STOXX 600 index, and the IT40 index. Performance was assessed using standard metrics, including Mean Squared Error (MSE), Mean Absolute Error(MAE), Mean Squared Percentage Error (MSPE), and the coefficient of determination (R2). Our experimental results demonstrate that the hybrid model, combining a GWO-optimized LSTM network with the Levy-Merton Jump-Diffusion model calibrated using an ANN, outperformed the base LSTM model and all other models developed in this study.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07890",
        "abs_url": "https://arxiv.org/abs/2512.07890",
        "pdf_url": "https://arxiv.org/pdf/2512.07890",
        "title": "CrowdLLM: Building LLM-Based Digital Populations Augmented with Generative Models",
        "authors": [
            "Ryan Feng Lin",
            "Keyu Tian",
            "Hanming Zheng",
            "Congjing Zhang",
            "Li Zeng",
            "Shuai Huang"
        ],
        "comments": "",
        "subjects": "Multiagent Systems (cs.MA); Machine Learning (cs.LG); Methodology (stat.ME); Machine Learning (stat.ML)",
        "abstract": "The emergence of large language models (LLMs) has sparked much interest in creating LLM-based digital populations that can be applied to many applications such as social simulation, crowdsourcing, marketing, and recommendation systems. A digital population can reduce the cost of recruiting human participants and alleviate many concerns related to human subject study. However, research has found that most of the existing works rely solely on LLMs and could not sufficiently capture the accuracy and diversity of a real human population. To address this limitation, we propose CrowdLLM that integrates pretrained LLMs and generative models to enhance the diversity and fidelity of the digital population. We conduct theoretical analysis of CrowdLLM regarding its great potential in creating cost-effective, sufficiently representative, scalable digital populations that can match the quality of a real crowd. Comprehensive experiments are also conducted across multiple domains (e.g., crowdsourcing, voting, user rating) and simulation studies which demonstrate that CrowdLLM achieves promising performance in both accuracy and distributional fidelity to human data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07946",
        "abs_url": "https://arxiv.org/abs/2512.07946",
        "pdf_url": "https://arxiv.org/pdf/2512.07946",
        "title": "Conformal Defects in Neural Network Field Theories",
        "authors": [
            "Pietro Capuozzo",
            "Brandon Robinson",
            "Benjamin Suzzoni"
        ],
        "comments": "23 pages, 1 figure",
        "subjects": "High Energy Physics - Theory (hep-th); Machine Learning (cs.LG)",
        "abstract": "Neural Network Field Theories (NN-FTs) represent a novel construction of arbitrary field theories, including those of conformal fields, through the specification of the network architecture and prior distribution for the network parameters. In this work, we present a formalism for the construction of conformally invariant defects in these NN-FTs. We demonstrate this new formalism in two toy models of NN scalar field theories. We develop an NN interpretation of an expansion akin to the defect OPE in two-point correlation functions in these models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.07997",
        "abs_url": "https://arxiv.org/abs/2512.07997",
        "pdf_url": "https://arxiv.org/pdf/2512.07997",
        "title": "A Comparative Study of EMG- and IMU-based Gesture Recognition at the Wrist and Forearm",
        "authors": [
            "Soroush Baghernezhad",
            "Elaheh Mohammadreza",
            "Vinicius Prado da Fonseca",
            "Ting Zou",
            "Xianta Jiang"
        ],
        "comments": "",
        "subjects": "Human-Computer Interaction (cs.HC); Machine Learning (cs.LG)",
        "abstract": "Gestures are an integral part of our daily interactions with the environment. Hand gesture recognition (HGR) is the process of interpreting human intent through various input modalities, such as visual data (images and videos) and bio-signals. Bio-signals are widely used in HGR due to their ability to be captured non-invasively via sensors placed on the arm. Among these, surface electromyography (sEMG), which measures the electrical activity of muscles, is the most extensively studied modality. However, less-explored alternatives such as inertial measurement units (IMUs) can provide complementary information on subtle muscle movements, which makes them valuable for gesture recognition. In this study, we investigate the potential of using IMU signals from different muscle groups to capture user intent. Our results demonstrate that IMU signals contain sufficient information to serve as the sole input sensor for static gesture recognition. Moreover, we compare different muscle groups and check the quality of pattern recognition on individual muscle groups. We further found that tendon-induced micro-movement captured by IMUs is a major contributor to static gesture recognition. We believe that leveraging muscle micro-movement information can enhance the usability of prosthetic arms for amputees. This approach also offers new possibilities for hand gesture recognition in fields such as robotics, teleoperation, sign language interpretation, and beyond.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08013",
        "abs_url": "https://arxiv.org/abs/2512.08013",
        "pdf_url": "https://arxiv.org/pdf/2512.08013",
        "title": "Learning Dynamics from Infrequent Output Measurements for Uncertainty-Aware Optimal Control",
        "authors": [
            "Robert Lefringhausen",
            "Theodor Springer",
            "Sandra Hirche"
        ],
        "comments": "Submitted to the 2026 IFAC World Congress",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Reliable optimal control is challenging when the dynamics of a nonlinear system are unknown and only infrequent, noisy output measurements are available. This work addresses this setting of limited sensing by formulating a Bayesian prior over the continuous-time dynamics and latent state trajectory in state-space form and updating it through a targeted marginal Metropolis-Hastings sampler equipped with a numerical ODE integrator. The resulting posterior samples are used to formulate a scenario-based optimal control problem that accounts for both model and measurement uncertainty and is solved using standard nonlinear programming methods. The approach is validated in a numerical case study on glucose regulation using a Type 1 diabetes model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08022",
        "abs_url": "https://arxiv.org/abs/2512.08022",
        "pdf_url": "https://arxiv.org/pdf/2512.08022",
        "title": "Provable Diffusion Posterior Sampling for Bayesian Inversion",
        "authors": [
            "Jinyuan Chang",
            "Chenguang Duan",
            "Yuling Jiao",
            "Ruoxuan Li",
            "Jerry Zhijian Yang",
            "Cheng Yuan"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Numerical Analysis (math.NA); Probability (math.PR); Statistics Theory (math.ST)",
        "abstract": "This paper proposes a novel diffusion-based posterior sampling method within a plug-and-play (PnP) framework. Our approach constructs a probability transport from an easy-to-sample terminal distribution to the target posterior, using a warm-start strategy to initialize the particles. To approximate the posterior score, we develop a Monte Carlo estimator in which particles are generated using Langevin dynamics, avoiding the heuristic approximations commonly used in prior work. The score governing the Langevin dynamics is learned from data, enabling the model to capture rich structural features of the underlying prior distribution. On the theoretical side, we provide non-asymptotic error bounds, showing that the method converges even for complex, multi-modal target posterior distributions. These bounds explicitly quantify the errors arising from posterior score estimation, the warm-start initialization, and the posterior sampling procedure. Our analysis further clarifies how the prior score-matching error and the condition number of the Bayesian inverse problem influence overall performance. Finally, we present numerical experiments demonstrating the effectiveness of the proposed method across a range of inverse problems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08052",
        "abs_url": "https://arxiv.org/abs/2512.08052",
        "pdf_url": "https://arxiv.org/pdf/2512.08052",
        "title": "An Introduction to Deep Reinforcement and Imitation Learning",
        "authors": [
            "Pedro Santana"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Embodied agents, such as robots and virtual characters, must continuously select actions to execute tasks effectively, solving complex sequential decision-making problems. Given the difficulty of designing such controllers manually, learning-based approaches have emerged as promising alternatives, most notably Deep Reinforcement Learning (DRL) and Deep Imitation Learning (DIL). DRL leverages reward signals to optimize behavior, while DIL uses expert demonstrations to guide learning. This document introduces DRL and DIL in the context of embodied agents, adopting a concise, depth-first approach to the literature. It is self-contained, presenting all necessary mathematical and machine learning concepts as they are needed. It is not intended as a survey of the field; rather, it focuses on a small set of foundational algorithms and techniques, prioritizing in-depth understanding over broad coverage. The material ranges from Markov Decision Processes to REINFORCE and Proximal Policy Optimization (PPO) for DRL, and from Behavioral Cloning to Dataset Aggregation (DAgger) and Generative Adversarial Imitation Learning (GAIL) for DIL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08055",
        "abs_url": "https://arxiv.org/abs/2512.08055",
        "pdf_url": "https://arxiv.org/pdf/2512.08055",
        "title": "Fairness-aware PageRank via Edge Reweighting",
        "authors": [
            "Honglian Wang",
            "Haoyun Chen",
            "Aristides Gionis"
        ],
        "comments": "",
        "subjects": "Social and Information Networks (cs.SI); Machine Learning (cs.LG)",
        "abstract": "Link-analysis algorithms, such as PageRank, are instrumental in understanding the structural dynamics of networks by evaluating the importance of individual vertices based on their connectivity. Recently, with the rising importance of responsible AI, the question of fairness in link-analysis algorithms has gained traction. In this paper, we present a new approach for incorporating group fairness into the PageRank algorithm by reweighting the transition probabilities in the underlying transition matrix. We formulate the problem of achieving fair PageRank by seeking to minimize the fairness loss, which is the difference between the original group-wise PageRank distribution and a target PageRank distribution. We further define a group-adapted fairness notion, which accounts for group homophily by considering random walks with group-biased restart for each group. Since the fairness loss is non-convex, we propose an efficient projected gradient-descent method for computing locally-optimal edge weights. Unlike earlier approaches, we do not recommend adding new edges to the network, nor do we adjust the restart vector. Instead, we keep the topology of the underlying network unchanged and only modify the relative importance of existing edges. We empirically compare our approach with state-of-the-art baselines and demonstrate the efficacy of our method, where very small changes in the transition matrix lead to significant improvement in the fairness of the PageRank algorithm.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08132",
        "abs_url": "https://arxiv.org/abs/2512.08132",
        "pdf_url": "https://arxiv.org/pdf/2512.08132",
        "title": "Multi-agent learning under uncertainty: Recurrence vs. concentration",
        "authors": [
            "Kyriakos Lotidis",
            "Panayotis Mertikopoulos",
            "Nicholas Bambos",
            "Jose Blanchet"
        ],
        "comments": "44 pages, 17 figures",
        "subjects": "Computer Science and Game Theory (cs.GT); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "In this paper, we examine the convergence landscape of multi-agent learning under uncertainty. Specifically, we analyze two stochastic models of regularized learning in continuous games -- one in continuous and one in discrete time with the aim of characterizing the long-run behavior of the induced sequence of play. In stark contrast to deterministic, full-information models of learning (or models with a vanishing learning rate), we show that the resulting dynamics do not converge in general. In lieu of this, we ask instead which actions are played more often in the long run, and by how much. We show that, in strongly monotone games, the dynamics of regularized learning may wander away from equilibrium infinitely often, but they always return to its vicinity in finite time (which we estimate), and their long-run distribution is sharply concentrated around a neighborhood thereof. We quantify the degree of this concentration, and we show that these favorable properties may all break down if the underlying game is not strongly monotone -- underscoring in this way the limits of regularized learning in the presence of persistent randomness and uncertainty.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08138",
        "abs_url": "https://arxiv.org/abs/2512.08138",
        "pdf_url": "https://arxiv.org/pdf/2512.08138",
        "title": "Robust equilibria in continuous games: From strategic to dynamic robustness",
        "authors": [
            "Kyriakos Lotidis",
            "Panayotis Mertikopoulos",
            "Nicholas Bambos",
            "Jose Blanchet"
        ],
        "comments": "33 pages, 5 figures",
        "subjects": "Computer Science and Game Theory (cs.GT); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "In this paper, we examine the robustness of Nash equilibria in continuous games, under both strategic and dynamic uncertainty. Starting with the former, we introduce the notion of a robust equilibrium as those equilibria that remain invariant to small -- but otherwise arbitrary -- perturbations to the game's payoff structure, and we provide a crisp geometric characterization thereof. Subsequently, we turn to the question of dynamic robustness, and we examine which equilibria may arise as stable limit points of the dynamics of \"follow the regularized leader\" (FTRL) in the presence of randomness and uncertainty. Despite their very distinct origins, we establish a structural correspondence between these two notions of robustness: strategic robustness implies dynamic robustness, and, conversely, the requirement of strategic robustness cannot be relaxed if dynamic robustness is to be maintained. Finally, we examine the rate of convergence to robust equilibria as a function of the underlying regularizer, and we show that entropically regularized learning converges at a geometric rate in games with affinely constrained action spaces.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08176",
        "abs_url": "https://arxiv.org/abs/2512.08176",
        "pdf_url": "https://arxiv.org/pdf/2512.08176",
        "title": "Worst-case generation via minimax optimization in Wasserstein space",
        "authors": [
            "Xiuyuan Cheng",
            "Yao Xie",
            "Linglingzhi Zhu",
            "Yunqin Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Worst-case generation plays a critical role in evaluating robustness and stress-testing systems under distribution shifts, in applications ranging from machine learning models to power grids and medical prediction systems. We develop a generative modeling framework for worst-case generation for a pre-specified risk, based on min-max optimization over continuous probability distributions, namely the Wasserstein space. Unlike traditional discrete distributionally robust optimization approaches, which often suffer from scalability issues, limited generalization, and costly worst-case inference, our framework exploits the Brenier theorem to characterize the least favorable (worst-case) distribution as the pushforward of a transport map from a continuous reference measure, enabling a continuous and expressive notion of risk-induced generation beyond classical discrete DRO formulations. Based on the min-max formulation, we propose a Gradient Descent Ascent (GDA)-type scheme that updates the decision model and the transport map in a single loop, establishing global convergence guarantees under mild regularity assumptions and possibly without convexity-concavity. We also propose to parameterize the transport map using a neural network that can be trained simultaneously with the GDA iterations by matching the transported training samples, thereby achieving a simulation-free approach. The efficiency of the proposed method as a risk-induced worst-case generator is validated by numerical experiments on synthetic and image data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08243",
        "abs_url": "https://arxiv.org/abs/2512.08243",
        "pdf_url": "https://arxiv.org/pdf/2512.08243",
        "title": "Residual-SwinCA-Net: A Channel-Aware Integrated Residual CNN-Swin Transformer for Malignant Lesion Segmentation in BUSI",
        "authors": [
            "Saeeda Naz",
            "Saddam Hussain Khan"
        ],
        "comments": "26 Pages, 10 Figures, 4 Tables",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "A novel deep hybrid Residual-SwinCA-Net segmentation framework is proposed in the study for addressing such challenges by extracting locally correlated and robust features, incorporating residual CNN modules. Furthermore, for learning global dependencies, Swin Transformer blocks are customized using internal residual pathways, which reinforce gradient stability, refine local patterns, and facilitate global feature fusion. Formerly, for enhancing tissue continuity, ultrasound noise suppressions, and accentuating fine structural transitions Laplacian-of-Gaussian regional operator is applied, and for maintaining the morphological integrity of malignant lesion contours, a boundary-oriented operator has been incorporated. Subsequently, a contraction strategy was applied stage-wise by progressively reducing features-map progressively for capturing scale invariance and enhancing the robustness of structural variability. In addition, each decoder level prior augmentation integrates a new Multi-Scale Channel Attention and Squeezing (MSCAS) module. The MSCAS selectively emphasizes encoder salient maps, retains discriminative global context, and complementary local structures with minimal computational cost while suppressing redundant activations. Finally, the Pixel-Attention module encodes class-relevant spatial cues by adaptively weighing malignant lesion pixels while suppressing background interference. The Residual-SwinCA-Net and existing CNNs/ViTs techniques have been implemented on the publicly available BUSI dataset. The proposed Residual-SwinCA-Net framework outperformed and achieved 99.29% mean accuracy, 98.74% IoU, and 0.9041 Dice for breast lesion segmentation. The proposed Residual-SwinCA-Net framework improves the BUSI lesion diagnostic performance and strengthens timely clinical decision-making.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08277",
        "abs_url": "https://arxiv.org/abs/2512.08277",
        "pdf_url": "https://arxiv.org/pdf/2512.08277",
        "title": "FedLAD: A Modular and Adaptive Testbed for Federated Log Anomaly Detection",
        "authors": [
            "Yihan Liao",
            "Jacky Keung",
            "Zhenyu Mao",
            "Jingyu Zhang",
            "Jialong Li"
        ],
        "comments": "Accepted Artifact at ACSOS 2025",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Log-based anomaly detection (LAD) is critical for ensuring the reliability of large-scale distributed systems. However, most existing LAD approaches assume centralized training, which is often impractical due to privacy constraints and the decentralized nature of system logs. While federated learning (FL) offers a promising alternative, there is a lack of dedicated testbeds tailored to the needs of LAD in federated settings. To address this, we present FedLAD, a unified platform for training and evaluating LAD models under FL constraints. FedLAD supports plug-and-play integration of diverse LAD models, benchmark datasets, and aggregation strategies, while offering runtime support for validation logging (self-monitoring), parameter tuning (self-configuration), and adaptive strategy control (self-adaptation). By enabling reproducible and scalable experimentation, FedLAD bridges the gap between FL frameworks and LAD requirements, providing a solid foundation for future research. Project code is publicly available at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08281",
        "abs_url": "https://arxiv.org/abs/2512.08281",
        "pdf_url": "https://arxiv.org/pdf/2512.08281",
        "title": "Probabilistic Multi-Agent Aircraft Landing Time Prediction",
        "authors": [
            "Kyungmin Kim",
            "Seokbin Yoon",
            "Keumjin Lee"
        ],
        "comments": "13 pages, 8 figures, accepted at AIAA SciTech 2026",
        "subjects": "Multiagent Systems (cs.MA); Machine Learning (cs.LG)",
        "abstract": "Accurate and reliable aircraft landing time prediction is essential for effective resource allocation in air traffic management. However, the inherent uncertainty of aircraft trajectories and traffic flows poses significant challenges to both prediction accuracy and trustworthiness. Therefore, prediction models should not only provide point estimates of aircraft landing times but also the uncertainties associated with these predictions. Furthermore, aircraft trajectories are frequently influenced by the presence of nearby aircraft through air traffic control interventions such as radar vectoring. Consequently, landing time prediction models must account for multi-agent interactions in the airspace. In this work, we propose a probabilistic multi-agent aircraft landing time prediction framework that provides the landing times of multiple aircraft as distributions. We evaluate the proposed framework using an air traffic surveillance dataset collected from the terminal airspace of the Incheon International Airport in South Korea. The results demonstrate that the proposed model achieves higher prediction accuracy than the baselines and quantifies the associated uncertainties of its outcomes. In addition, the model uncovered underlying patterns in air traffic control through its attention scores, thereby enhancing explainability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08305",
        "abs_url": "https://arxiv.org/abs/2512.08305",
        "pdf_url": "https://arxiv.org/pdf/2512.08305",
        "title": "Magnetic activity of ultracool dwarfs in the LAMOST DR11",
        "authors": [
            "Yue Xiang",
            "Shenghong Gu",
            "Dongtao Cao"
        ],
        "comments": "13 pages, 10 figures, accepted for publication in ApJ",
        "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)",
        "abstract": "Ultracool dwarfs consist of lowest-mass stars and brown dwarfs. Their interior is fully convective, different from that of the partly-convective Sun-like stars. Magnetic field generation process beneath the surface of ultracool dwarfs is still poorly understood and controversial. To increase samples of active ultracool dwarfs significantly, we have identified 962 ultracool dwarfs in the latest LAMOST data release, DR11. We also simulate the Chinese Space Station Survey Telescope (CSST) low-resolution slitless spectra by degrading the LAMOST spectra. A semi-supervised machine learning approach with an autoencoder model is built to identify ultracool dwarfs with the simulated CSST spectra, which demonstrates the capability of the CSST all-sky slitless spectroscopic survey on the detection of ultracool dwarfs. Magnetic activity of the ultracool dwarfs is investigated by using the H$\\alpha$ line emission as a proxy. The rotational periods of 82 ultracool dwarfs are derived based on the Kepler/K2 light curves. We also derive the activity-rotation relation of the ultracool dwarfs, which is saturated around a Rossby number of 0.12.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08327",
        "abs_url": "https://arxiv.org/abs/2512.08327",
        "pdf_url": "https://arxiv.org/pdf/2512.08327",
        "title": "Low Rank Support Quaternion Matrix Machine",
        "authors": [
            "Wang Chen",
            "Ziyan Luo",
            "Shuangyue Wang"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "Input features are conventionally represented as vectors, matrices, or third order tensors in the real field, for color image classification. Inspired by the success of quaternion data modeling for color images in image recovery and denoising tasks, we propose a novel classification method for color image classification, named as the Low-rank Support Quaternion Matrix Machine (LSQMM), in which the RGB channels are treated as pure quaternions to effectively preserve the intrinsic coupling relationships among channels via the quaternion algebra. For the purpose of promoting low-rank structures resulting from strongly correlated color channels, a quaternion nuclear norm regularization term, serving as a natural extension of the conventional matrix nuclear norm to the quaternion domain, is added to the hinge loss in our LSQMM model. An Alternating Direction Method of Multipliers (ADMM)-based iterative algorithm is designed to effectively resolve the proposed quaternion optimization model. Experimental results on multiple color image classification datasets demonstrate that our proposed classification approach exhibits advantages in classification accuracy, robustness and computational efficiency, compared to several state-of-the-art methods using support vector machines, support matrix machines, and support tensor machines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08340",
        "abs_url": "https://arxiv.org/abs/2512.08340",
        "pdf_url": "https://arxiv.org/pdf/2512.08340",
        "title": "Predicting California Bearing Ratio with Ensemble and Neural Network Models: A Case Study from Türkiye",
        "authors": [
            "Abdullah Hulusi Kökçam",
            "Uğur Dağdeviren",
            "Talas Fikret Kurnaz",
            "Alparslan Serhat Demir",
            "Caner Erden"
        ],
        "comments": "Presented at the 13th International Symposium on Intelligent Manufacturing and Service Systems, Duzce, Turkey, Sep 25-27, 2025. Also available on Zenodo: DOI https://doi.org/10.5281/zenodo.17530868",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "The California Bearing Ratio (CBR) is a key geotechnical indicator used to assess the load-bearing capacity of subgrade soils, especially in transportation infrastructure and foundation design. Traditional CBR determination relies on laboratory penetration tests. Despite their accuracy, these tests are often time-consuming, costly, and can be impractical, particularly for large-scale or diverse soil profiles. Recent progress in artificial intelligence, especially machine learning (ML), has enabled data-driven approaches for modeling complex soil behavior with greater speed and precision. This study introduces a comprehensive ML framework for CBR prediction using a dataset of 382 soil samples collected from various geoclimatic regions in Türkiye. The dataset includes physicochemical soil properties relevant to bearing capacity, allowing multidimensional feature representation in a supervised learning context. Twelve ML algorithms were tested, including decision tree, random forest, extra trees, gradient boosting, xgboost, k-nearest neighbors, support vector regression, multi-layer perceptron, adaboost, bagging, voting, and stacking regressors. Each model was trained, validated, and evaluated to assess its generalization and robustness. Among them, the random forest regressor performed the best, achieving strong R2 scores of 0.95 (training), 0.76 (validation), and 0.83 (test). These outcomes highlight the model's powerful nonlinear mapping ability, making it a promising tool for predictive geotechnical tasks. The study supports the integration of intelligent, data-centric models in geotechnical engineering, offering an effective alternative to traditional methods and promoting digital transformation in infrastructure analysis and design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08341",
        "abs_url": "https://arxiv.org/abs/2512.08341",
        "pdf_url": "https://arxiv.org/pdf/2512.08341",
        "title": "Multi-Agent Deep Reinforcement Learning for Collaborative UAV Relay Networks under Jamming Atatcks",
        "authors": [
            "Thai Duong Nguyen",
            "Ngoc-Tan Nguyen",
            "Thanh-Dao Nguyen",
            "Nguyen Van Huynh",
            "Dinh-Hieu Tran",
            "Symeon Chatzinotas"
        ],
        "comments": "IEEE ICC 2026",
        "subjects": "Networking and Internet Architecture (cs.NI); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "The deployment of Unmanned Aerial Vehicle (UAV) swarms as dynamic communication relays is critical for next-generation tactical networks. However, operating in contested environments requires solving a complex trade-off, including maximizing system throughput while ensuring collision avoidance and resilience against adversarial jamming. Existing heuristic-based approaches often struggle to find effective solutions due to the dynamic and multi-objective nature of this problem. This paper formulates this challenge as a cooperative Multi-Agent Reinforcement Learning (MARL) problem, solved using the Centralized Training with Decentralized Execution (CTDE) framework. Our approach employs a centralized critic that uses global state information to guide decentralized actors which operate using only local observations. Simulation results show that our proposed framework significantly outperforms heuristic baselines, increasing the total system throughput by approximately 50% while simultaneously achieving a near-zero collision rate. A key finding is that the agents develop an emergent anti-jamming strategy without explicit programming. They learn to intelligently position themselves to balance the trade-off between mitigating interference from jammers and maintaining effective communication links with ground users.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08360",
        "abs_url": "https://arxiv.org/abs/2512.08360",
        "pdf_url": "https://arxiv.org/pdf/2512.08360",
        "title": "Conditional Morphogenesis: Emergent Generation of Structural Digits via Neural Cellular Automata",
        "authors": [
            "Ali Sakour"
        ],
        "comments": "13 pages, 5 figures. Code available at: this https URL",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Biological systems exhibit remarkable morphogenetic plasticity, where a single genome can encode various specialized cellular structures triggered by local chemical signals. In the domain of Deep Learning, Differentiable Neural Cellular Automata (NCA) have emerged as a paradigm to mimic this self-organization. However, existing NCA research has predominantly focused on continuous texture synthesis or single-target object recovery, leaving the challenge of class-conditional structural generation largely unexplored. In this work, we propose a novel Conditional Neural Cellular Automata (c-NCA) architecture capable of growing distinct topological structures - specifically MNIST digits - from a single generic seed, guided solely by a spatially broadcasted class vector. Unlike traditional generative models (e.g., GANs, VAEs) that rely on global reception fields, our model enforces strict locality and translation equivariance. We demonstrate that by injecting a one-hot condition into the cellular perception field, a single set of local rules can learn to break symmetry and self-assemble into ten distinct geometric attractors. Experimental results show that our c-NCA achieves stable convergence, correctly forming digit topologies from a single pixel, and exhibits robustness characteristic of biological systems. This work bridges the gap between texture-based NCAs and structural pattern formation, offering a lightweight, biologically plausible alternative for conditional generation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08365",
        "abs_url": "https://arxiv.org/abs/2512.08365",
        "pdf_url": "https://arxiv.org/pdf/2512.08365",
        "title": "Magneton: Optimizing Energy Efficiency of ML Systems via Differential Energy Debugging",
        "authors": [
            "Yi Pan",
            "Wenbo Qian",
            "Dedong Xie",
            "Ruiyan Hu",
            "Yigong Hu",
            "Baris Kasikci"
        ],
        "comments": "12 pages, 10 fi",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "The training and deployment of machine learning (ML) models have become extremely energy-intensive. While existing optimization efforts focus primarily on hardware energy efficiency, a significant but overlooked source of inefficiency is software energy waste caused by poor software design. This often includes redundant or poorly designed operations that consume more energy without improving performance. These inefficiencies arise in widely used ML frameworks and applications, yet developers often lack the visibility and tools to detect and diagnose them. We propose differential energy debugging, a novel approach that leverages the observation that competing ML systems often implement similar functionality with vastly different energy consumption. Building on this insight, we design and implement Magneton, an energy profiler that compares energy consumption between similar ML systems at the operator level and automatically pinpoints code regions and configuration choices responsible for excessive energy use. Applied to 9 popular ML systems spanning LLM inference, general ML frameworks, and image generation, Magneton detects and diagnoses 16 known cases of software energy inefficiency and further discovers 8 previously unknown cases, 7 of which have been confirmed by developers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08436",
        "abs_url": "https://arxiv.org/abs/2512.08436",
        "pdf_url": "https://arxiv.org/pdf/2512.08436",
        "title": "Beyond Wave Variables: A Data-Driven Ensemble Approach for Enhanced Teleoperation Transparency and Stability",
        "authors": [
            "Nour Mitiche",
            "Farid Ferguene",
            "Mourad Oussalah"
        ],
        "comments": "14 pages, 8 figures, 5 tables",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "Time delays in communication channels present significant challenges for bilateral teleoperation systems, affecting both transparency and stability. Although traditional wave variable-based methods for a four-channel architecture ensure stability via passivity, they remain vulnerable to wave reflections and disturbances like variable delays and environmental noise. This article presents a data-driven hybrid framework that replaces the conventional wave-variable transform with an ensemble of three advanced sequence models, each optimized separately via the state-of-the-art Optuna optimizer, and combined through a stacking meta-learner. The base predictors include an LSTM augmented with Prophet for trend correction, an LSTM-based feature extractor paired with clustering and a random forest for improved regression, and a CNN-LSTM model for localized and long-term dynamics. Experimental validation was performed in Python using data generated from the baseline system implemented in MATLAB/Simulink. The results show that our optimized ensemble achieves a transparency comparable to the baseline wave-variable system under varying delays and noise, while ensuring stability through passivity constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08444",
        "abs_url": "https://arxiv.org/abs/2512.08444",
        "pdf_url": "https://arxiv.org/pdf/2512.08444",
        "title": "Learned iterative networks: An operator learning perspective",
        "authors": [
            "Andreas Hauptmann",
            "Ozan Öktem"
        ],
        "comments": "",
        "subjects": "Image and Video Processing (eess.IV); Machine Learning (cs.LG); Functional Analysis (math.FA); Numerical Analysis (math.NA); Optimization and Control (math.OC)",
        "abstract": "Learned image reconstruction has become a pillar in computational imaging and inverse problems. Among the most successful approaches are learned iterative networks, which are formulated by unrolling classical iterative optimisation algorithms for solving variational problems. While the underlying algorithm is usually formulated in the functional analytic setting, learned approaches are often viewed as purely discrete. In this chapter we present a unified operator view for learned iterative networks. Specifically, we formulate a learned reconstruction operator, defining how to compute, and separately the learning problem, which defines what to compute. In this setting we present common approaches and show that many approaches are closely related in their core. We review linear as well as nonlinear inverse problems in this framework and present a short numerical study to conclude.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08463",
        "abs_url": "https://arxiv.org/abs/2512.08463",
        "pdf_url": "https://arxiv.org/pdf/2512.08463",
        "title": "Using reinforcement learning to probe the role of feedback in skill acquisition",
        "authors": [
            "Antonio Terpin",
            "Raffaello D'Andrea"
        ],
        "comments": "Website: this https URL",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Robotics (cs.RO); Systems and Control (eess.SY)",
        "abstract": "Many high-performance human activities are executed with little or no external feedback: think of a figure skater landing a triple jump, a pitcher throwing a curveball for a strike, or a barista pouring latte art. To study the process of skill acquisition under fully controlled conditions, we bypass human subjects. Instead, we directly interface a generalist reinforcement learning agent with a spinning cylinder in a tabletop circulating water channel to maximize or minimize drag. This setup has several desirable properties. First, it is a physical system, with the rich interactions and complex dynamics that only the physical world has: the flow is highly chaotic and extremely difficult, if not impossible, to model or simulate accurately. Second, the objective -- drag minimization or maximization -- is easy to state and can be captured directly in the reward, yet good strategies are not obvious beforehand. Third, decades-old experimental studies provide recipes for simple, high-performance open-loop policies. Finally, the setup is inexpensive and far easier to reproduce than human studies. In our experiments we find that high-dimensional flow feedback lets the agent discover high-performance drag-control strategies with only minutes of real-world interaction. When we later replay the same action sequences without any feedback, we obtain almost identical performance. This shows that feedback, and in particular flow feedback, is not needed to execute the learned policy. Surprisingly, without flow feedback during training the agent fails to discover any well-performing policy in drag maximization, but still succeeds in drag minimization, albeit more slowly and less reliably. Our studies show that learning a high-performance skill can require richer information than executing it, and learning conditions can be kind or wicked depending solely on the goal, not on dynamics or policy complexity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08508",
        "abs_url": "https://arxiv.org/abs/2512.08508",
        "pdf_url": "https://arxiv.org/pdf/2512.08508",
        "title": "Fused Gromov-Wasserstein Contrastive Learning for Effective Enzyme-Reaction Screening",
        "authors": [
            "Gengmo Zhou",
            "Feng Yu",
            "Wenda Wang",
            "Zhifeng Gao",
            "Guolin Ke",
            "Zhewei Wei",
            "Zhen Wang"
        ],
        "comments": "",
        "subjects": "Biomolecules (q-bio.BM); Machine Learning (cs.LG)",
        "abstract": "Enzymes are crucial catalysts that enable a wide range of biochemical reactions. Efficiently identifying specific enzymes from vast protein libraries is essential for advancing biocatalysis. Traditional computational methods for enzyme screening and retrieval are time-consuming and resource-intensive. Recently, deep learning approaches have shown promise. However, these methods focus solely on the interaction between enzymes and reactions, overlooking the inherent hierarchical relationships within each domain. To address these limitations, we introduce FGW-CLIP, a novel contrastive learning framework based on optimizing the fused Gromov-Wasserstein distance. FGW-CLIP incorporates multiple alignments, including inter-domain alignment between reactions and enzymes and intra-domain alignment within enzymes and reactions. By introducing a tailored regularization term, our method minimizes the Gromov-Wasserstein distance between enzyme and reaction spaces, which enhances information integration across these domains. Extensive evaluations demonstrate the superiority of FGW-CLIP in challenging enzyme-reaction tasks. On the widely-used EnzymeMap benchmark, FGW-CLIP achieves state-of-the-art performance in enzyme virtual screening, as measured by BEDROC and EF metrics. Moreover, FGW-CLIP consistently outperforms across all three splits of ReactZyme, the largest enzyme-reaction benchmark, demonstrating robust generalization to novel enzymes and reactions. These results position FGW-CLIP as a promising framework for enzyme discovery in complex biochemical settings, with strong adaptability across diverse screening scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08510",
        "abs_url": "https://arxiv.org/abs/2512.08510",
        "pdf_url": "https://arxiv.org/pdf/2512.08510",
        "title": "Data-Efficient Learning of Anomalous Diffusion with Wavelet Representations: Enabling Direct Learning from Experimental Trajectories",
        "authors": [
            "Gongyi Wang",
            "Yu Zhang",
            "Zihan Huang"
        ],
        "comments": "23 pages, 16 figures",
        "subjects": "Biological Physics (physics.bio-ph); Soft Condensed Matter (cond-mat.soft); Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "Machine learning (ML) has become a versatile tool for analyzing anomalous diffusion trajectories, yet most existing pipelines are trained on large collections of simulated data. In contrast, experimental trajectories, such as those from single-particle tracking (SPT), are typically scarce and may differ substantially from the idealized models used for simulation, leading to degradation or even breakdown of performance when ML methods are applied to real data. To address this mismatch, we introduce a wavelet-based representation of anomalous diffusion that enables data-efficient learning directly from experimental recordings. This representation is constructed by applying six complementary wavelet families to each trajectory and combining the resulting wavelet modulus scalograms. We first evaluate the wavelet representation on simulated trajectories from the andi-datasets benchmark, where it clearly outperforms both feature-based and trajectory-based methods with as few as 1000 training trajectories and still retains an advantage on large training sets. We then use this representation to learn directly from experimental SPT trajectories of fluorescent beads diffusing in F-actin networks, where the wavelet representation remains superior to existing alternatives for both diffusion-exponent regression and mesh-size classification. In particular, when predicting the diffusion exponents of experimental trajectories, a model trained on 1200 experimental tracks using the wavelet representation achieves significantly lower errors than state-of-the-art deep learning models trained purely on $10^6$ simulated trajectories. We associate this data efficiency with the emergence of distinct scale fingerprints disentangling underlying diffusion mechanisms in the wavelet spectra.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08513",
        "abs_url": "https://arxiv.org/abs/2512.08513",
        "pdf_url": "https://arxiv.org/pdf/2512.08513",
        "title": "Minimax and Bayes Optimal Adaptive Experimental Design for Treatment Choice",
        "authors": [
            "Masahiro Kato"
        ],
        "comments": "",
        "subjects": "Econometrics (econ.EM); Machine Learning (cs.LG); Statistics Theory (math.ST); Methodology (stat.ME); Machine Learning (stat.ML)",
        "abstract": "We consider an adaptive experiment for treatment choice and design a minimax and Bayes optimal adaptive experiment with respect to regret. Given binary treatments, the experimenter's goal is to choose the treatment with the highest expected outcome through an adaptive experiment, in order to maximize welfare. We consider adaptive experiments that consist of two phases, the treatment allocation phase and the treatment choice phase. The experiment starts with the treatment allocation phase, where the experimenter allocates treatments to experimental subjects to gather observations. During this phase, the experimenter can adaptively update the allocation probabilities using the observations obtained in the experiment. After the allocation phase, the experimenter proceeds to the treatment choice phase, where one of the treatments is selected as the best. For this adaptive experimental procedure, we propose an adaptive experiment that splits the treatment allocation phase into two stages, where we first estimate the standard deviations and then allocate each treatment proportionally to its standard deviation. We show that this experiment, often referred to as Neyman allocation, is minimax and Bayes optimal in the sense that its regret upper bounds exactly match the lower bounds that we derive. To show this optimality, we derive minimax and Bayes lower bounds for the regret using change-of-measure arguments. Then, we evaluate the corresponding upper bounds using the central limit theorem and large deviation bounds.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08601",
        "abs_url": "https://arxiv.org/abs/2512.08601",
        "pdf_url": "https://arxiv.org/pdf/2512.08601",
        "title": "Heuristics for Combinatorial Optimization via Value-based Reinforcement Learning: A Unified Framework and Analysis",
        "authors": [
            "Orit Davidovich",
            "Shimrit Shtern",
            "Segev Wasserkrug",
            "Nimrod Megiddo"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Since the 1990s, considerable empirical work has been carried out to train statistical models, such as neural networks (NNs), as learned heuristics for combinatorial optimization (CO) problems. When successful, such an approach eliminates the need for experts to design heuristics per problem type. Due to their structure, many hard CO problems are amenable to treatment through reinforcement learning (RL). Indeed, we find a wealth of literature training NNs using value-based, policy gradient, or actor-critic approaches, with promising results, both in terms of empirical optimality gaps and inference runtimes. Nevertheless, there has been a paucity of theoretical work undergirding the use of RL for CO problems. To this end, we introduce a unified framework to model CO problems through Markov decision processes (MDPs) and solve them using RL techniques. We provide easy-to-test assumptions under which CO problems can be formulated as equivalent undiscounted MDPs that provide optimal solutions to the original CO problems. Moreover, we establish conditions under which value-based RL techniques converge to approximate solutions of the CO problem with a guarantee on the associated optimality gap. Our convergence analysis provides: (1) a sufficient rate of increase in batch size and projected gradient descent steps at each RL iteration; (2) the resulting optimality gap in terms of problem parameters and targeted RL accuracy; and (3) the importance of a choice of state-space embedding. Together, our analysis illuminates the success (and limitations) of the celebrated deep Q-learning algorithm in this problem context.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08659",
        "abs_url": "https://arxiv.org/abs/2512.08659",
        "pdf_url": "https://arxiv.org/pdf/2512.08659",
        "title": "An Agentic AI System for Multi-Framework Communication Coding",
        "authors": [
            "Bohao Yang",
            "Rui Yang",
            "Joshua M. Biro",
            "Haoyuan Wang",
            "Jessica L. Handley",
            "Brianna Richardson",
            "Sophia Bessias",
            "Nicoleta Economou-Zavlanos",
            "Armando D. Bedoya",
            "Monica Agrawal",
            "Michael M. Zavlanos",
            "Anand Chowdhury",
            "Raj M. Ratwani",
            "Kai Sun",
            "Kathryn I. Pollak",
            "Michael J. Pencina",
            "Chuan Hong"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Clinical communication is central to patient outcomes, yet large-scale human annotation of patient-provider conversation remains labor-intensive, inconsistent, and difficult to scale. Existing approaches based on large language models typically rely on single-task models that lack adaptability, interpretability, and reliability, especially when applied across various communication frameworks and clinical domains. In this study, we developed a Multi-framework Structured Agentic AI system for Clinical Communication (MOSAIC), built on a LangGraph-based architecture that orchestrates four core agents, including a Plan Agent for codebook selection and workflow planning, an Update Agent for maintaining up-to-date retrieval databases, a set of Annotation Agents that applies codebook-guided retrieval-augmented generation (RAG) with dynamic few-shot prompting, and a Verification Agent that provides consistency checks and feedback. To evaluate performance, we compared MOSAIC outputs against gold-standard annotations created by trained human coders. We developed and evaluated MOSAIC using 26 gold standard annotated transcripts for training and 50 transcripts for testing, spanning rheumatology and OB/GYN domains. On the test set, MOSAIC achieved an overall F1 score of 0.928. Performance was highest in the Rheumatology subset (F1 = 0.962) and strongest for Patient Behavior (e.g., patients asking questions, expressing preferences, or showing assertiveness). Ablations revealed that MOSAIC outperforms baseline benchmarking.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08667",
        "abs_url": "https://arxiv.org/abs/2512.08667",
        "pdf_url": "https://arxiv.org/pdf/2512.08667",
        "title": "Direct transfer of optimized controllers to similar systems using dimensionless MPC",
        "authors": [
            "Josip Kir Hromatko",
            "Shambhuraj Sawant",
            "Šandor Ileš",
            "Sébastien Gros"
        ],
        "comments": "7 pages, 4 figures",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "Scaled model experiments are commonly used in various engineering fields to reduce experimentation costs and overcome constraints associated with full-scale systems. The relevance of such experiments relies on dimensional analysis and the principle of dynamic similarity. However, transferring controllers to full-scale systems often requires additional tuning. In this paper, we propose a method to enable a direct controller transfer using dimensionless model predictive control, tuned automatically for closed-loop performance. With this reformulation, the closed-loop behavior of an optimized controller transfers directly to a new, dynamically similar system. Additionally, the dimensionless formulation allows for the use of data from systems of different scales during parameter optimization. We demonstrate the method on a cartpole swing-up and a car racing problem, applying either reinforcement learning or Bayesian optimization for tuning the controller parameters. Software used to obtain the results in this paper is publicly available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08705",
        "abs_url": "https://arxiv.org/abs/2512.08705",
        "pdf_url": "https://arxiv.org/pdf/2512.08705",
        "title": "Gradient-Informed Monte Carlo Fine-Tuning of Diffusion Models for Low-Thrust Trajectory Design",
        "authors": [
            "Jannik Graebner",
            "Ryne Beeson"
        ],
        "comments": "",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Preliminary mission design of low-thrust spacecraft trajectories in the Circular Restricted Three-Body Problem is a global search characterized by a complex objective landscape and numerous local minima. Formulating the problem as sampling from an unnormalized distribution supported on neighborhoods of locally optimal solutions, provides the opportunity to deploy Markov chain Monte Carlo methods and generative machine learning. In this work, we extend our previous self-supervised diffusion model fine-tuning framework to employ gradient-informed Markov chain Monte Carlo. We compare two algorithms - the Metropolis-Adjusted Langevin Algorithm and Hamiltonian Monte Carlo - both initialized from a distribution learned by a diffusion model. Derivatives of an objective function that balances fuel consumption, time of flight and constraint violations are computed analytically using state transition matrices. We show that incorporating the gradient drift term accelerates mixing and improves convergence of the Markov chain for a multi-revolution transfer in the Saturn-Titan system. Among the evaluated methods, MALA provides the best trade-off between performance and computational cost. Starting from samples generated by a baseline diffusion model trained on a related transfer, MALA explicitly targets Pareto-optimal solutions. Compared to a random walk Metropolis algorithm, it increases the feasibility rate from 17.34% to 63.01% and produces a denser, more diverse coverage of the Pareto front. By fine-tuning a diffusion model on the generated samples and associated reward values with reward-weighted likelihood maximization, we learn the global solution structure of the problem and eliminate the need for a tedious separate data generation phase.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08733",
        "abs_url": "https://arxiv.org/abs/2512.08733",
        "pdf_url": "https://arxiv.org/pdf/2512.08733",
        "title": "Mitigating Individual Skin Tone Bias in Skin Lesion Classification through Distribution-Aware Reweighting",
        "authors": [
            "Kuniko Paxton",
            "Zeinab Dehghani",
            "Koorosh Aslansefat",
            "Dhavalkumar Thakker",
            "Yiannis Papadopoulos"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Skin color has historically been a focal point of discrimination, yet fairness research in machine learning for medical imaging often relies on coarse subgroup categories, overlooking individual-level variations. Such group-based approaches risk obscuring biases faced by outliers within subgroups. This study introduces a distribution-based framework for evaluating and mitigating individual fairness in skin lesion classification. We treat skin tone as a continuous attribute rather than a categorical label, and employ kernel density estimation (KDE) to model its distribution. We further compare twelve statistical distance metrics to quantify disparities between skin tone distributions and propose a distance-based reweighting (DRW) loss function to correct underrepresentation in minority tones. Experiments across CNN and Transformer models demonstrate: (i) the limitations of categorical reweighting in capturing individual-level disparities, and (ii) the superior performance of distribution-based reweighting, particularly with Fidelity Similarity (FS), Wasserstein Distance (WD), Hellinger Metric (HM), and Harmonic Mean Similarity (HS). These findings establish a robust methodology for advancing fairness at individual level in dermatological AI systems, and highlight broader implications for sensitive continuous attributes in medical image analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08810",
        "abs_url": "https://arxiv.org/abs/2512.08810",
        "pdf_url": "https://arxiv.org/pdf/2512.08810",
        "title": "Multicalibration for LLM-based Code Generation",
        "authors": [
            "Viola Campos",
            "Robin Kuschnereit",
            "Adrian Ulges"
        ],
        "comments": "Accepted at AI-SQE 2026 (The 1st International Workshop on AI for Software Quality Evaluation: Judgment, Metrics, Benchmarks, and Beyond)",
        "subjects": "Software Engineering (cs.SE); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "As AI-based code generation becomes widespread, researchers are investigating the calibration of code LLMs - ensuring their confidence scores faithfully represent the true likelihood of code correctness. To do so, we investigate multicalibration, which can capture additional factors about a coding problem, such as complexity, code length, or programming language used. We study four multicalibration approaches on three function synthesis benchmarks, using latest-generation code LLMs (Qwen3 Coder, GPT-OSS, DeepSeek-R1-Distill). Our results demonstrate that multicalibration can yield distinct improvements over both uncalibrated token likelihoods (+1.03 in skill score) and baseline calibrations (+0.37 in skill score). We study the influence of the aforementioned factors in ablations, and make our dataset (consisting of code generations, likelihoods, and correctness labels) available for future research on code LLM calibration.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08854",
        "abs_url": "https://arxiv.org/abs/2512.08854",
        "pdf_url": "https://arxiv.org/pdf/2512.08854",
        "title": "Generation is Required for Data-Efficient Perception",
        "authors": [
            "Jack Brady",
            "Bernhard Schölkopf",
            "Thomas Kipf",
            "Simon Buchholz",
            "Wieland Brendel"
        ],
        "comments": "Preprint",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "It has been hypothesized that human-level visual perception requires a generative approach in which internal representations result from inverting a decoder. Yet today's most successful vision models are non-generative, relying on an encoder that maps images to representations without decoder inversion. This raises the question of whether generation is, in fact, necessary for machines to achieve human-level visual perception. To address this, we study whether generative and non-generative methods can achieve compositional generalization, a hallmark of human perception. Under a compositional data generating process, we formalize the inductive biases required to guarantee compositional generalization in decoder-based (generative) and encoder-based (non-generative) methods. We then show theoretically that enforcing these inductive biases on encoders is generally infeasible using regularization or architectural constraints. In contrast, for generative methods, the inductive biases can be enforced straightforwardly, thereby enabling compositional generalization by constraining a decoder and inverting it. We highlight how this inversion can be performed efficiently, either online through gradient-based search or offline through generative replay. We examine the empirical implications of our theory by training a range of generative and non-generative methods on photorealistic image datasets. We find that, without the necessary inductive biases, non-generative methods often fail to generalize compositionally and require large-scale pretraining or added supervision to improve generalization. By comparison, generative methods yield significant improvements in compositional generalization, without requiring additional data, by leveraging suitable inductive biases on a decoder along with search and replay.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08862",
        "abs_url": "https://arxiv.org/abs/2512.08862",
        "pdf_url": "https://arxiv.org/pdf/2512.08862",
        "title": "Secure and Privacy-Preserving Federated Learning for Next-Generation Underground Mine Safety",
        "authors": [
            "Mohamed Elmahallawy",
            "Sanjay Madria",
            "Samuel Frimpong"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Underground mining operations depend on sensor networks to monitor critical parameters such as temperature, gas concentration, and miner movement, enabling timely hazard detection and safety decisions. However, transmitting raw sensor data to a centralized server for machine learning (ML) model training raises serious privacy and security concerns. Federated Learning (FL) offers a promising alternative by enabling decentralized model training without exposing sensitive local data. Yet, applying FL in underground mining presents unique challenges: (i) Adversaries may eavesdrop on shared model updates to launch model inversion or membership inference attacks, compromising data privacy and operational safety; (ii) Non-IID data distributions across mines and sensor noise can hinder model convergence. To address these issues, we propose FedMining--a privacy-preserving FL framework tailored for underground mining. FedMining introduces two core innovations: (1) a Decentralized Functional Encryption (DFE) scheme that keeps local models encrypted, thwarting unauthorized access and inference attacks; and (2) a balancing aggregation mechanism to mitigate data heterogeneity and enhance convergence. Evaluations on real-world mining datasets demonstrate FedMining's ability to safeguard privacy while maintaining high model accuracy and achieving rapid convergence with reduced communication and computation overhead. These advantages make FedMining both secure and practical for real-time underground safety monitoring.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08882",
        "abs_url": "https://arxiv.org/abs/2512.08882",
        "pdf_url": "https://arxiv.org/pdf/2512.08882",
        "title": "Decentralized Trust for Space AI: Blockchain-Based Federated Learning Across Multi-Vendor LEO Satellite Networks",
        "authors": [
            "Mohamed Elmahallawy",
            "Asma Jodeiri Akbarfam"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "The rise of space AI is reshaping government and industry through applications such as disaster detection, border surveillance, and climate monitoring, powered by massive data from commercial and governmental low Earth orbit (LEO) satellites. Federated satellite learning (FSL) enables joint model training without sharing raw data, but suffers from slow convergence due to intermittent connectivity and introduces critical trust challenges--where biased or falsified updates can arise across satellite constellations, including those injected through cyberattacks on inter-satellite or satellite-ground communication links. We propose OrbitChain, a blockchain-backed framework that empowers trustworthy multi-vendor collaboration in LEO networks. OrbitChain (i) offloads consensus to high-altitude platforms (HAPs) with greater computational capacity, (ii) ensures transparent, auditable provenance of model updates from different orbits owned by different vendors, and (iii) prevents manipulated or incomplete contributions from affecting global FSL model aggregation. Extensive simulations show that OrbitChain reduces computational and communication overhead while improving privacy, security, and global model accuracy. Its permissioned proof-of-authority ledger finalizes over 1000 blocks with sub-second latency (0.16,s, 0.26,s, 0.35,s for 1-of-5, 3-of-5, and 5-of-5 quorums). Moreover, OrbitChain reduces convergence time by up to 30 hours on real satellite datasets compared to single-vendor, demonstrating its effectiveness for real-time, multi-vendor learning. Our code is available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2025-12-10",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-10?abs=True",
        "arxiv_id": "2512.08920",
        "abs_url": "https://arxiv.org/abs/2512.08920",
        "pdf_url": "https://arxiv.org/pdf/2512.08920",
        "title": "OSMO: Open-Source Tactile Glove for Human-to-Robot Skill Transfer",
        "authors": [
            "Jessica Yin",
            "Haozhi Qi",
            "Youngsun Wi",
            "Sayantan Kundu",
            "Mike Lambeta",
            "William Yang",
            "Changhao Wang",
            "Tingfan Wu",
            "Jitendra Malik",
            "Tess Hellebrekers"
        ],
        "comments": "Project website: this https URL",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Human video demonstrations provide abundant training data for learning robot policies, but video alone cannot capture the rich contact signals critical for mastering manipulation. We introduce OSMO, an open-source wearable tactile glove designed for human-to-robot skill transfer. The glove features 12 three-axis tactile sensors across the fingertips and palm and is designed to be compatible with state-of-the-art hand-tracking methods for in-the-wild data collection. We demonstrate that a robot policy trained exclusively on human demonstrations collected with OSMO, without any real robot data, is capable of executing a challenging contact-rich manipulation task. By equipping both the human and the robot with the same glove, OSMO minimizes the visual and tactile embodiment gap, enabling the transfer of continuous shear and normal force feedback while avoiding the need for image inpainting or other vision-based force inference. On a real-world wiping task requiring sustained contact pressure, our tactile-aware policy achieves a 72% success rate, outperforming vision-only baselines by eliminating contact-related failure modes. We release complete hardware designs, firmware, and assembly instructions to support community adoption.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]