[
    {
        "order": 1,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20629",
        "abs_url": "https://arxiv.org/abs/2512.20629",
        "pdf_url": "https://arxiv.org/pdf/2512.20629",
        "title": "Learning Evolving Latent Strategies for Multi-Agent Language Systems without Model Fine-Tuning",
        "authors": [
            "Wenlong Tang"
        ],
        "comments": "17 pages, 5 figures. Code available at this https URL",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "This study proposes a multi-agent language framework that enables continual strategy evolution without fine-tuning the language model's parameters. The core idea is to liberate the latent vectors of abstract concepts from traditional static semantic representations, allowing them to be continuously updated through environmental interaction and reinforcement feedback. We construct a dual-loop architecture: the behavior loop adjusts action preferences based on environmental rewards, while the language loop updates the external latent vectors by reflecting on the semantic embeddings of generated text. Together, these mechanisms allow agents to develop stable and disentangled strategic styles over long-horizon multi-round interactions. Experiments show that agents' latent spaces exhibit clear convergence trajectories under reflection-driven updates, along with structured shifts at critical moments. Moreover, the system demonstrates an emergent ability to implicitly infer and continually adapt to emotional agents, even without shared rewards. These results indicate that, without modifying model parameters, an external latent space can provide language agents with a low-cost, scalable, and interpretable form of abstract strategic representation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20633",
        "abs_url": "https://arxiv.org/abs/2512.20633",
        "pdf_url": "https://arxiv.org/pdf/2512.20633",
        "title": "Enhancing Lung Cancer Treatment Outcome Prediction through Semantic Feature Engineering Using Large Language Models",
        "authors": [
            "MunHwan Lee",
            "Shaika Chowdhury",
            "Xiaodi Li",
            "Sivaraman Rajaganapathy",
            "Eric W Klee",
            "Ping Yang",
            "Terence Sio",
            "Liewei Wang",
            "James Cerhan",
            "Nansu NA Zong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Accurate prediction of treatment outcomes in lung cancer remains challenging due to the sparsity, heterogeneity, and contextual overload of real-world electronic health data. Traditional models often fail to capture semantic information across multimodal streams, while large-scale fine-tuning approaches are impractical in clinical workflows. We introduce a framework that uses Large Language Models (LLMs) as Goal-oriented Knowledge Curators (GKC) to convert laboratory, genomic, and medication data into high-fidelity, task-aligned features. Unlike generic embeddings, GKC produces representations tailored to the prediction objective and operates as an offline preprocessing step that integrates naturally into hospital informatics pipelines. Using a lung cancer cohort (N=184), we benchmarked GKC against expert-engineered features, direct text embeddings, and an end-to-end transformer. Our approach achieved a mean AUROC of 0.803 (95% CI: 0.799-0.807) and outperformed all baselines. An ablation study further confirmed the complementary value of combining all three modalities. These results show that the quality of semantic representation is a key determinant of predictive accuracy in sparse clinical data settings. By reframing LLMs as knowledge curation engines rather than black-box predictors, this work demonstrates a scalable, interpretable, and workflow-compatible pathway for advancing AI-driven decision support in oncology.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20635",
        "abs_url": "https://arxiv.org/abs/2512.20635",
        "pdf_url": "https://arxiv.org/pdf/2512.20635",
        "title": "SHRP: Specialized Head Routing and Pruning for Efficient Encoder Compression",
        "authors": [
            "Zeli Su",
            "Ziyin Zhang",
            "Wenzheng Zhang",
            "Zhou Liu",
            "Guixian Xu",
            "Wentao Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Transformer encoders are widely deployed in large-scale web services for natural language understanding tasks such as text classification, semantic retrieval, and content ranking. However, their high inference latency and memory consumption pose significant challenges for real-time serving and scalability. These limitations stem largely from architectural redundancy, particularly in the attention module. The inherent parameter redundancy of the attention mechanism, coupled with the fact that its attention heads operate with a degree of independence, makes it particularly amenable to structured model compression. In this paper, we propose SHRP (Specialized Head Routing and Pruning), a novel structured pruning framework that automatically identifies and removes redundant attention heads while preserving most of the model's accuracy and compatibility. SHRP introduces Expert Attention, a modular design that treats each attention head as an independent expert, followed by a lightweight shared expander feed-forward network that refines their outputs. The framework employs a unified Top-1 usage-driven mechanism to jointly perform dynamic routing during training and deterministic pruning at deployment. Experimental results on the GLUE benchmark using a BERT-base encoder show that SHRP achieves 93% of the original model accuracy while reducing parameters by 48 percent. Under an extreme compression scenario where 11/12 of the layers are pruned, the model still maintains 84% accuracy and delivers a 4.2x throughput gain while reducing computation to as low as 11.5 percent of the original FLOPs, demonstrating its practical utility for large-scale and latency-sensitive web deployments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20643",
        "abs_url": "https://arxiv.org/abs/2512.20643",
        "pdf_url": "https://arxiv.org/pdf/2512.20643",
        "title": "Forecasting N-Body Dynamics: A Comparative Study of Neural Ordinary Differential Equations and Universal Differential Equations",
        "authors": [
            "Suriya R S",
            "Prathamesh Dinesh Joshi",
            "Rajat Dandekar",
            "Raj Dandekar",
            "Sreedath Panat"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computational Physics (physics.comp-ph)",
        "abstract": "The n body problem, fundamental to astrophysics, simulates the motion of n bodies acting under the effect of their own mutual gravitational interactions. Traditional machine learning models that are used for predicting and forecasting trajectories are often data intensive black box models, which ignore the physical laws, thereby lacking interpretability. Whereas Scientific Machine Learning ( Scientific ML ) directly embeds the known physical laws into the machine learning framework. Through robust modelling in the Julia programming language, our method uses the Scientific ML frameworks: Neural ordinary differential equations (NODEs) and Universal differential equations (UDEs) to predict and forecast the system dynamics. In addition, an essential component of our analysis involves determining the forecasting breakdown point, which is the smallest possible amount of training data our models need to predict future, unseen data accurately. We employ synthetically created noisy data to simulate real-world observational limitations. Our findings indicate that the UDE model is much more data efficient, needing only 20% of data for a correct forecast, whereas the Neural ODE requires 90%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20654",
        "abs_url": "https://arxiv.org/abs/2512.20654",
        "pdf_url": "https://arxiv.org/pdf/2512.20654",
        "title": "Q-RUN: Quantum-Inspired Data Re-uploading Networks",
        "authors": [
            "Wenbo Qiao",
            "Shuaixian Wang",
            "Peng Zhang",
            "Yan Ming",
            "Jiaming Zhao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Data re-uploading quantum circuits (DRQC) are a key approach to implementing quantum neural networks and have been shown to outperform classical neural networks in fitting high-frequency functions. However, their practical application is limited by the scalability of current quantum hardware. In this paper, we introduce the mathematical paradigm of DRQC into classical models by proposing a quantum-inspired data re-uploading network (Q-RUN), which retains the Fourier-expressive advantages of quantum models without any quantum hardware. Experimental results demonstrate that Q-RUN delivers superior performance across both data modeling and predictive modeling tasks. Compared to the fully connected layers and the state-of-the-art neural network layers, Q-RUN reduces model parameters while decreasing error by approximately one to three orders of magnitude on certain tasks. Notably, Q-RUN can serve as a drop-in replacement for standard fully connected layers, improving the performance of a wide range of neural architectures. This work illustrates how principles from quantum machine learning can guide the design of more expressive artificial intelligence.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20660",
        "abs_url": "https://arxiv.org/abs/2512.20660",
        "pdf_url": "https://arxiv.org/pdf/2512.20660",
        "title": "Managing the Stochastic: Foundations of Learning in Neuro-Symbolic Systems for Software Engineering",
        "authors": [
            "Matthew Thompson"
        ],
        "comments": "55 pages, 3 figures, 8 tables",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Software Engineering (cs.SE)",
        "abstract": "Current approaches to AI coding agents appear to blur the lines between the Large Language Model (LLM) and the agent itself, asking the LLM to make decisions best left to deterministic processes. This leads to systems prone to stochastic failures such as gaming unit tests or hallucinating syntax. Drawing on established software engineering practices that provide deterministic frameworks for managing unpredictable processes, this paper proposes setting the control boundary such that the LLM is treated as a component of the environment environment -- preserving its creative stochasticity -- rather than the decision-making agent. A \\textbf{Dual-State Architecture} is formalized, separating workflow state (deterministic control flow) from environment state (stochastic generation). \\textbf{Atomic Action Pairs} couple generation with verification as indivisible transactions, where \\textbf{Guard Functions} act as sensing actions that project probabilistic outputs onto observable workflow state. The framework is validated on three code generation tasks across 13 LLMs (1.3B--15B parameters). For qualified instruction-following models, task success rates improved by up to 66 percentage points at 1.2--2.1$\\times$ baseline computational cost. The results suggest that architectural constraints can substitute for parameter scale in achieving reliable code generation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20668",
        "abs_url": "https://arxiv.org/abs/2512.20668",
        "pdf_url": "https://arxiv.org/pdf/2512.20668",
        "title": "Forward Only Learning for Orthogonal Neural Networks of any Depth",
        "authors": [
            "Paul Caillon",
            "Alex Colagrande",
            "Erwan Fagnou",
            "Blaise Delattre",
            "Alexandre Allauzen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Backpropagation is still the de facto algorithm used today to train neural networks. With the exponential growth of recent architectures, the computational cost of this algorithm also becomes a burden. The recent PEPITA and forward-only frameworks have proposed promising alternatives, but they failed to scale up to a handful of hidden layers, yet limiting their use. In this paper, we first analyze theoretically the main limitations of these approaches. It allows us the design of a forward-only algorithm, which is equivalent to backpropagation under the linear and orthogonal assumptions. By relaxing the linear assumption, we then introduce FOTON (Forward-Only Training of Orthogonal Networks) that bridges the gap with the backpropagation algorithm. Experimental results show that it outperforms PEPITA, enabling us to train neural networks of any depth, without the need for a backward pass. Moreover its performance on convolutional networks clearly opens up avenues for its application to more advanced architectures. The code is open-sourced at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20670",
        "abs_url": "https://arxiv.org/abs/2512.20670",
        "pdf_url": "https://arxiv.org/pdf/2512.20670",
        "title": "Disentangling Fact from Sentiment: A Dynamic Conflict-Consensus Framework for Multimodal Fake News Detection",
        "authors": [
            "Weilin Zhou",
            "Zonghao Ying",
            "Junjie Mu",
            "Shengwei Tian",
            "Quanchen Zou",
            "Deyue Zhang",
            "Dongdong Yang",
            "Xiangzheng Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Prevalent multimodal fake news detection relies on consistency-based fusion, yet this paradigm fundamentally misinterprets critical cross-modal discrepancies as noise, leading to over-smoothing, which dilutes critical evidence of fabrication. Mainstream consistency-based fusion inherently minimizes feature discrepancies to align modalities, yet this approach fundamentally fails because it inadvertently smoothes out the subtle cross-modal contradictions that serve as the primary evidence of fabrication. To address this, we propose the Dynamic Conflict-Consensus Framework (DCCF), an inconsistency-seeking paradigm designed to amplify rather than suppress contradictions. First, DCCF decouples inputs into independent Fact and Sentiment spaces to distinguish objective mismatches from emotional dissonance. Second, we employ physics-inspired feature dynamics to iteratively polarize these representations, actively extracting maximally informative conflicts. Finally, a conflict-consensus mechanism standardizes these local discrepancies against the global context for robust deliberative this http URL experiments conducted on three real world datasets demonstrate that DCCF consistently outperforms state-of-the-art baselines, achieving an average accuracy improvement of 3.52\\%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20675",
        "abs_url": "https://arxiv.org/abs/2512.20675",
        "pdf_url": "https://arxiv.org/pdf/2512.20675",
        "title": "Revisiting the Learning Objectives of Vision-Language Reward Models",
        "authors": [
            "Simon Roy",
            "Samuel Barbeau",
            "Giovanni Beltrame",
            "Christian Desrosiers",
            "Nicolas Thome"
        ],
        "comments": "Published as an extended abstract at World Modeling Workshop 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Learning generalizable reward functions is a core challenge in embodied intelligence. Recent work leverages contrastive vision language models (VLMs) to obtain dense, domain-agnostic rewards without human supervision. These methods adapt VLMs into reward models through increasingly complex learning objectives, yet meaningful comparison remains difficult due to differences in training data, architectures, and evaluation settings. In this work, we isolate the impact of the learning objective by evaluating recent VLM-based reward models under a unified framework with identical backbones, finetuning data, and evaluation environments. Using Meta-World tasks, we assess modeling accuracy by measuring consistency with ground truth reward and correlation with expert progress. Remarkably, we show that a simple triplet loss outperforms state-of-the-art methods, suggesting that much of the improvements in recent approaches could be attributed to differences in data and architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20732",
        "abs_url": "https://arxiv.org/abs/2512.20732",
        "pdf_url": "https://arxiv.org/pdf/2512.20732",
        "title": "FEM-Bench: A Structured Scientific Reasoning Benchmark for Evaluating Code-Generating LLMs",
        "authors": [
            "Saeed Mohammadzadeh",
            "Erfan Hamdi",
            "Joel Shor",
            "Emma Lejeune"
        ],
        "comments": "40 pages, 5 figures, 6 tables, 7 listings",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Software Engineering (cs.SE)",
        "abstract": "As LLMs advance their reasoning capabilities about the physical world, the absence of rigorous benchmarks for evaluating their ability to generate scientifically valid physical models has become a critical gap. Computational mechanics, which develops and applies mathematical models and numerical methods to predict the behavior of physical systems under forces, deformation, and constraints, provides an ideal foundation for structured scientific reasoning evaluation. Problems follow clear mathematical structure, enforce strict physical and numerical constraints, and support objective verification. The discipline requires constructing explicit models of physical systems and reasoning about geometry, spatial relationships, and material behavior, connecting directly to emerging AI goals in physical reasoning and world modeling. We introduce FEM-Bench, a computational mechanics benchmark designed to evaluate the ability of LLMs to generate correct finite element method (FEM) and related code. FEM-Bench 2025 contains a suite of introductory but nontrivial tasks aligned with material from a first graduate course on computational mechanics. These tasks capture essential numerical and physical modeling challenges while representing only a small fraction of the complexity present in the discipline. Despite their simplicity, state-of-the-art LLMs do not reliably solve all of them. In a five attempt run, the best performing model at function writing, Gemini 3 Pro, completed 30/33 tasks at least once and 26/33 tasks all five times. The best performing model at unit test writing, GPT-5, had an Average Joint Success Rate of 73.8%. Other popular models showed broad performance variation. FEM-Bench establishes a structured foundation for evaluating AI-generated scientific code, and future iterations will incorporate increasingly sophisticated tasks to track progress as models evolve.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20755",
        "abs_url": "https://arxiv.org/abs/2512.20755",
        "pdf_url": "https://arxiv.org/pdf/2512.20755",
        "title": "Bridging Efficiency and Safety: Formal Verification of Neural Networks with Early Exits",
        "authors": [
            "Yizhak Yisrael Elboher",
            "Avraham Raviv",
            "Amihay Elboher",
            "Zhouxing Shi",
            "Omri Azencot",
            "Hillel Kugler",
            "Guy Katz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Ensuring the safety and efficiency of AI systems is a central goal of modern research. Formal verification provides guarantees of neural network robustness, while early exits improve inference efficiency by enabling intermediate predictions. Yet verifying networks with early exits introduces new challenges due to their conditional execution paths. In this work, we define a robustness property tailored to early exit architectures and show how off-the-shelf solvers can be used to assess it. We present a baseline algorithm, enhanced with an early stopping strategy and heuristic optimizations that maintain soundness and completeness. Experiments on multiple benchmarks validate our framework's effectiveness and demonstrate the performance gains of the improved algorithm. Alongside the natural inference acceleration provided by early exits, we show that they also enhance verifiability, enabling more queries to be solved in less time compared to standard networks. Together with a robustness analysis, we show how these metrics can help users navigate the inherent trade-off between accuracy and efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20761",
        "abs_url": "https://arxiv.org/abs/2512.20761",
        "pdf_url": "https://arxiv.org/pdf/2512.20761",
        "title": "TS-Arena Technical Report -- A Pre-registered Live Forecasting Platform",
        "authors": [
            "Marcel Meyer",
            "Sascha Kaltenpoth",
            "Kevin Zalipski",
            "Henrik Albers",
            "Oliver Müller"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "While Time Series Foundation Models (TSFMs) offer transformative capabilities for forecasting, they simultaneously risk triggering a fundamental evaluation crisis. This crisis is driven by information leakage due to overlapping training and test sets across different models, as well as the illegitimate transfer of global patterns to test data. While the ability to learn shared temporal dynamics represents a primary strength of these models, their evaluation on historical archives often permits the exploitation of observed global shocks, which violates the independence required for valid benchmarking. We introduce TS-Arena, a platform that restores the operational integrity of forecasting by treating the genuinely unknown future as the definitive test environment. By implementing a pre-registration mechanism on live data streams, the platform ensures that evaluation targets remain physically non-existent during inference, thereby enforcing a strict global temporal split. This methodology establishes a moving temporal frontier that prevents historical contamination and provides an authentic assessment of model generalization. Initially applied within the energy sector, TS-Arena provides a sustainable infrastructure for comparing foundation models under real-world constraints. A prototype of the platform is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20762",
        "abs_url": "https://arxiv.org/abs/2512.20762",
        "pdf_url": "https://arxiv.org/pdf/2512.20762",
        "title": "Subgroup Discovery with the Cox Model",
        "authors": [
            "Zachary Izzo",
            "Iain Melvin"
        ],
        "comments": "43 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG); Statistics Theory (math.ST); Machine Learning (stat.ML)",
        "abstract": "We study the problem of subgroup discovery for survival analysis, where the goal is to find an interpretable subset of the data on which a Cox model is highly accurate. Our work is the first to study this particular subgroup problem, for which we make several contributions. Subgroup discovery methods generally require a \"quality function\" in order to sift through and select the most advantageous subgroups. We first examine why existing natural choices for quality functions are insufficient to solve the subgroup discovery problem for the Cox model. To address the shortcomings of existing metrics, we introduce two technical innovations: the *expected prediction entropy (EPE)*, a novel metric for evaluating survival models which predict a hazard function; and the *conditional rank statistics (CRS)*, a statistical object which quantifies the deviation of an individual point to the distribution of survival times in an existing subgroup. We study the EPE and CRS theoretically and show that they can solve many of the problems with existing metrics. We introduce a total of eight algorithms for the Cox subgroup discovery problem. The main algorithm is able to take advantage of both the EPE and the CRS, allowing us to give theoretical correctness results for this algorithm in a well-specified setting. We evaluate all of the proposed methods empirically on both synthetic and real data. The experiments confirm our theory, showing that our contributions allow for the recovery of a ground-truth subgroup in well-specified cases, as well as leading to better model fit compared to naively fitting the Cox model to the whole dataset in practical settings. Lastly, we conduct a case study on jet engine simulation data from NASA. The discovered subgroups uncover known nonlinearities/homogeneity in the data, and which suggest design choices which have been mirrored in practice.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20777",
        "abs_url": "https://arxiv.org/abs/2512.20777",
        "pdf_url": "https://arxiv.org/pdf/2512.20777",
        "title": "Improving Matrix Exponential for Generative AI Flows: A Taylor-Based Approach Beyond Paterson--Stockmeyer",
        "authors": [
            "Jorge Sastre",
            "Daniel Faronbi",
            "José Miguel Alonso",
            "Peter Traver",
            "Javier Ibáñez",
            "Nuria Lloret"
        ],
        "comments": "41 pages, 35 figures",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "The matrix exponential is a fundamental operator in scientific computing and system simulation, with applications ranging from control theory and quantum mechanics to modern generative machine learning. While Padé approximants combined with scaling and squaring have long served as the standard, recent Taylor-based methods, which utilize polynomial evaluation schemes that surpass the classical Paterson--Stockmeyer technique, offer superior accuracy and reduced computational complexity. This paper presents an optimized Taylor-based algorithm for the matrix exponential, specifically designed for the high-throughput requirements of generative AI flows. We provide a rigorous error analysis and develop a dynamic selection strategy for the Taylor order and scaling factor to minimize computational effort under a prescribed error tolerance. Extensive numerical experiments demonstrate that our approach provides significant acceleration and maintains high numerical stability compared to existing state-of-the-art implementations. These results establish the proposed method as a highly efficient tool for large-scale generative modeling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20785",
        "abs_url": "https://arxiv.org/abs/2512.20785",
        "pdf_url": "https://arxiv.org/pdf/2512.20785",
        "title": "Symbolic regression for defect interactions in 2D materials",
        "authors": [
            "Mikhail Lazarev",
            "Andrey Ustyuzhanin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Machine learning models have become firmly established across all scientific fields. Extracting features from data and making inferences based on them with neural network models often yields high accuracy; however, this approach has several drawbacks. Symbolic regression is a powerful technique for discovering analytical equations that describe data, providing interpretable and generalizable models capable of predicting unseen data. Symbolic regression methods have gained new momentum with the advancement of neural network technologies and offer several advantages, the main one being the interpretability of results. In this work, we examined the application of the deep symbolic regression algorithm SEGVAE to determine the properties of two-dimensional materials with defects. Comparing the results with state-of-the-art graph neural network-based methods shows comparable or, in some cases, even identical outcomes. We also discuss the applicability of this class of methods in natural sciences.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20813",
        "abs_url": "https://arxiv.org/abs/2512.20813",
        "pdf_url": "https://arxiv.org/pdf/2512.20813",
        "title": "GraphFire-X: Physics-Informed Graph Attention Networks and Structural Gradient Boosting for Building-Scale Wildfire Preparedness at the Wildland-Urban Interface",
        "authors": [
            "Miguel Esparza",
            "Vamshi Battal",
            "Ali Mostafavi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As wildfires increasingly evolve into urban conflagrations, traditional risk models that treat structures as isolated assets fail to capture the non-linear contagion dynamics characteristic of the wildland urban interface (WUI). This research bridges the gap between mechanistic physics and data driven learning by establishing a novel dual specialist ensemble framework that disentangles vulnerability into two distinct vectors, environmental contagion and structural fragility. The architecture integrates two specialized predictive streams, an environmental specialist, implemented as a graph neural network (GNN) that operationalizes the community as a directed contagion graph weighted by physics informed convection, radiation, and ember probabilities, and enriched with high dimensional Google AlphaEarth Foundation embeddings, and a Structural Specialist, implemented via XGBoost to isolate granular asset level resilience. Applied to the 2025 Eaton Fire, the framework reveals a critical dichotomy in risk drivers. The GNN demonstrates that neighborhood scale environmental pressure overwhelmingly dominates intrinsic structural features in defining propagation pathways, while the XGBoost model identifies eaves as the primary micro scale ingress vector. By synthesizing these divergent signals through logistic stacking, the ensemble achieves robust classification and generates a diagnostic risk topology. This capability empowers decision makers to move beyond binary loss prediction and precisely target mitigation prioritizing vegetation management for high connectivity clusters and structural hardening for architecturally vulnerable nodes thereby operationalizing a proactive, data driven approach to community resilience.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20814",
        "abs_url": "https://arxiv.org/abs/2512.20814",
        "pdf_url": "https://arxiv.org/pdf/2512.20814",
        "title": "FedMPDD: Communication-Efficient Federated Learning with Privacy Preservation Attributes via Projected Directional Derivative",
        "authors": [
            "Mohammadreza Rostami",
            "Solmaz S. Kia"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper introduces \\texttt{FedMPDD} (\\textbf{Fed}erated Learning via \\textbf{M}ulti-\\textbf{P}rojected \\textbf{D}irectional \\textbf{D}erivatives), a novel algorithm that simultaneously optimizes bandwidth utilization and enhances privacy in Federated Learning. The core idea of \\texttt{FedMPDD} is to encode each client's high-dimensional gradient by computing its directional derivatives along multiple random vectors. This compresses the gradient into a much smaller message, significantly reducing uplink communication costs from $\\mathcal{O}(d)$ to $\\mathcal{O}(m)$, where $m \\ll d$. The server then decodes the aggregated information by projecting it back onto the same random vectors. Our key insight is that averaging multiple projections overcomes the dimension-dependent convergence limitations of a single projection. We provide a rigorous theoretical analysis, establishing that \\texttt{FedMPDD} converges at a rate of $\\mathcal{O}(1/\\sqrt{K})$, matching the performance of FedSGD. Furthermore, we demonstrate that our method provides some inherent privacy against gradient inversion attacks due to the geometric properties of low-rank projections, offering a tunable privacy-utility trade-off controlled by the number of projections. Extensive experiments on benchmark datasets validate our theory and demonstrates our results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20821",
        "abs_url": "https://arxiv.org/abs/2512.20821",
        "pdf_url": "https://arxiv.org/pdf/2512.20821",
        "title": "Defending against adversarial attacks using mixture of experts",
        "authors": [
            "Mohammad Meymani",
            "Roozbeh Razavi-Far"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine learning is a powerful tool enabling full automation of a huge number of tasks without explicit programming. Despite recent progress of machine learning in different domains, these models have shown vulnerabilities when they are exposed to adversarial threats. Adversarial threats aim to hinder the machine learning models from satisfying their objectives. They can create adversarial perturbations, which are imperceptible to humans' eyes but have the ability to cause misclassification during inference. Moreover, they can poison the training data to harm the model's performance or they can query the model to steal its sensitive information. In this paper, we propose a defense system, which devises an adversarial training module within mixture-of-experts architecture to enhance its robustness against adversarial threats. In our proposed defense system, we use nine pre-trained experts with ResNet-18 as their backbone. During end-to-end training, the parameters of expert models and gating mechanism are jointly updated allowing further optimization of the experts. Our proposed defense system outperforms state-of-the-art defense systems and plain classifiers, which use a more complex architecture than our model's backbone.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20865",
        "abs_url": "https://arxiv.org/abs/2512.20865",
        "pdf_url": "https://arxiv.org/pdf/2512.20865",
        "title": "Robustness Certificates for Neural Networks against Adversarial Attacks",
        "authors": [
            "Sara Taheri",
            "Mahalakshmi Sabanayagam",
            "Debarghya Ghoshdastidar",
            "Majid Zamani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "The increasing use of machine learning in safety-critical domains amplifies the risk of adversarial threats, especially data poisoning attacks that corrupt training data to degrade performance or induce unsafe behavior. Most existing defenses lack formal guarantees or rely on restrictive assumptions about the model class, attack type, extent of poisoning, or point-wise certification, limiting their practical reliability. This paper introduces a principled formal robustness certification framework that models gradient-based training as a discrete-time dynamical system (dt-DS) and formulates poisoning robustness as a formal safety verification problem. By adapting the concept of barrier certificates (BCs) from control theory, we introduce sufficient conditions to certify a robust radius ensuring that the terminal model remains safe under worst-case ${\\ell}_p$-norm based poisoning. To make this practical, we parameterize BCs as neural networks trained on finite sets of poisoned trajectories. We further derive probably approximately correct (PAC) bounds by solving a scenario convex program (SCP), which yields a confidence lower bound on the certified robustness radius generalizing beyond the training set. Importantly, our framework also extends to certification against test-time attacks, making it the first unified framework to provide formal guarantees in both training and test-time attack settings. Experiments on MNIST, SVHN, and CIFAR-10 show that our approach certifies non-trivial perturbation budgets while being model-agnostic and requiring no prior knowledge of the attack or contamination level.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20885",
        "abs_url": "https://arxiv.org/abs/2512.20885",
        "pdf_url": "https://arxiv.org/pdf/2512.20885",
        "title": "From GNNs to Symbolic Surrogates via Kolmogorov-Arnold Networks for Delay Prediction",
        "authors": [
            "Sami Marouani",
            "Kamal Singh",
            "Baptiste Jeudy",
            "Amaury Habrard"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "Accurate prediction of flow delay is essential for optimizing and managing modern communication networks. We investigate three levels of modeling for this task. First, we implement a heterogeneous GNN with attention-based message passing, establishing a strong neural baseline. Second, we propose FlowKANet in which Kolmogorov-Arnold Networks replace standard MLP layers, reducing trainable parameters while maintaining competitive predictive performance. FlowKANet integrates KAMP-Attn (Kolmogorov-Arnold Message Passing with Attention), embedding KAN operators directly into message-passing and attention computation. Finally, we distill the model into symbolic surrogate models using block-wise regression, producing closed-form equations that eliminate trainable weights while preserving graph-structured dependencies. The results show that KAN layers provide a favorable trade-off between efficiency and accuracy and that symbolic surrogates emphasize the potential for lightweight deployment and enhanced transparency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20893",
        "abs_url": "https://arxiv.org/abs/2512.20893",
        "pdf_url": "https://arxiv.org/pdf/2512.20893",
        "title": "Time-Efficient Evaluation and Enhancement of Adversarial Robustness in Deep Neural Networks",
        "authors": [
            "Runqi Lin"
        ],
        "comments": "Ph.D. Thesis, The University of Sydney",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "With deep neural networks (DNNs) increasingly embedded in modern society, ensuring their safety has become a critical and urgent issue. In response, substantial efforts have been dedicated to the red-blue adversarial framework, where the red team focuses on identifying vulnerabilities in DNNs and the blue team on mitigating them. However, existing approaches from both teams remain computationally intensive, constraining their applicability to large-scale models. To overcome this limitation, this thesis endeavours to provide time-efficient methods for the evaluation and enhancement of adversarial robustness in DNNs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20915",
        "abs_url": "https://arxiv.org/abs/2512.20915",
        "pdf_url": "https://arxiv.org/pdf/2512.20915",
        "title": "Towards a General Framework for Predicting and Explaining the Hardness of Graph-based Combinatorial Optimization Problems using Machine Learning and Association Rule Mining",
        "authors": [
            "Bharat Sharman",
            "Elkafi Hassini"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Combinatorics (math.CO)",
        "abstract": "This study introduces GCO-HPIF, a general machine-learning-based framework to predict and explain the computational hardness of combinatorial optimization problems that can be represented on graphs. The framework consists of two stages. In the first stage, a dataset is created comprising problem-agnostic graph features and hardness classifications of problem instances. Machine-learning-based classification algorithms are trained to map graph features to hardness categories. In the second stage, the framework explains the predictions using an association rule mining algorithm. Additionally, machine-learning-based regression models are trained to predict algorithmic computation times. The GCO-HPIF framework was applied to a dataset of 3287 maximum clique problem instances compiled from the COLLAB, IMDB, and TWITTER graph datasets using five state-of-the-art algorithms, namely three exact branch-and-bound-based algorithms (Gurobi, CliSAT, and MOMC) and two graph-neural-network-based algorithms (EGN and HGS). The framework demonstrated excellent performance in predicting instance hardness, achieving a weighted F1 score of 0.9921, a minority-class F1 score of 0.878, and an ROC-AUC score of 0.9083 using only three graph features. The best association rule found by the FP-Growth algorithm for explaining the hardness predictions had a support of 0.8829 for hard instances and an overall accuracy of 87.64 percent, underscoring the framework's usefulness for both prediction and explanation. Furthermore, the best-performing regression model for predicting computation times achieved a percentage RMSE of 5.12 and an R2 value of 0.991.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20932",
        "abs_url": "https://arxiv.org/abs/2512.20932",
        "pdf_url": "https://arxiv.org/pdf/2512.20932",
        "title": "Guardrailed Elasticity Pricing: A Churn-Aware Forecasting Playbook for Subscription Strategy",
        "authors": [
            "Deepit Sapru"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "This paper presents a marketing analytics framework that operationalizes subscription pricing as a dynamic, guardrailed decision system, uniting multivariate demand forecasting, segment-level price elasticity, and churn propensity to optimize revenue, margin, and retention. The approach blends seasonal time-series models with tree-based learners, runs Monte Carlo scenario tests to map risk envelopes, and solves a constrained optimization that enforces business guardrails on customer experience, margin floors, and allowable churn. Validated across heterogeneous SaaS portfolios, the method consistently outperforms static tiers and uniform uplifts by reallocating price moves toward segments with higher willingness-to-pay while protecting price-sensitive cohorts. The system is designed for real-time recalibration via modular APIs and includes model explainability for governance and compliance. Managerially, the framework functions as a strategy playbook that clarifies when to shift from flat to dynamic pricing, how to align pricing with CLV and MRR targets, and how to embed ethical guardrails, enabling durable growth without eroding customer trust.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20941",
        "abs_url": "https://arxiv.org/abs/2512.20941",
        "pdf_url": "https://arxiv.org/pdf/2512.20941",
        "title": "A Multi-fidelity Double-Delta Wing Dataset and Empirical Scaling Laws for GNN-based Aerodynamic Field Surrogate",
        "authors": [
            "Yiren Shen",
            "Juan J. Alonso"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Fluid Dynamics (physics.flu-dyn)",
        "abstract": "Data-driven surrogate models are increasingly adopted to accelerate vehicle design. However, open-source multi-fidelity datasets and empirical guidelines linking dataset size to model performance remain limited. This study investigates the relationship between training data size and prediction accuracy for a graph neural network (GNN) based surrogate model for aerodynamic field prediction. We release an open-source, multi-fidelity aerodynamic dataset for double-delta wings, comprising 2448 flow snapshots across 272 geometries evaluated at angles of attack from 11 (degree) to 19 (degree) at Ma=0.3 using both Vortex Lattice Method (VLM) and Reynolds-Averaged Navier-Stokes (RANS) solvers. The geometries are generated using a nested Saltelli sampling scheme to support future dataset expansion and variance-based sensitivity analysis. Using this dataset, we conduct a preliminary empirical scaling study of the MF-VortexNet surrogate by constructing six training datasets with sizes ranging from 40 to 1280 snapshots and training models with 0.1 to 2.4 million parameters under a fixed training budget. We find that the test error decreases with data size with a power-law exponent of -0.6122, indicating efficient data utilization. Based on this scaling law, we estimate that the optimal sampling density is approximately eight samples per dimension in a d-dimensional design space. The results also suggest improved data utilization efficiency for larger surrogate models, implying a potential trade-off between dataset generation cost and model training budget.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20956",
        "abs_url": "https://arxiv.org/abs/2512.20956",
        "pdf_url": "https://arxiv.org/pdf/2512.20956",
        "title": "Solving Functional PDEs with Gaussian Processes and Applications to Functional Renormalization Group Equations",
        "authors": [
            "Xianjin Yang",
            "Matthieu Darcy",
            "Matthew Hudes",
            "Francis J. Alexander",
            "Gregory Eyink",
            "Houman Owhadi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present an operator learning framework for solving non-perturbative functional renormalization group equations, which are integro-differential equations defined on functionals. Our proposed approach uses Gaussian process operator learning to construct a flexible functional representation formulated directly on function space, making it independent of a particular equation or discretization. Our method is flexible, and can apply to a broad range of functional differential equations while still allowing for the incorporation of physical priors in either the prior mean or the kernel design. We demonstrate the performance of our method on several relevant equations, such as the Wetterich and Wilson--Polchinski equations, showing that it achieves equal or better performance than existing approximations such as the local-potential approximation, while being significantly more flexible. In particular, our method can handle non-constant fields, making it promising for the study of more complex field configurations, such as instantons.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20959",
        "abs_url": "https://arxiv.org/abs/2512.20959",
        "pdf_url": "https://arxiv.org/pdf/2512.20959",
        "title": "Can Agentic AI Match the Performance of Human Data Scientists?",
        "authors": [
            "An Luo",
            "Jin Du",
            "Fangqiao Tian",
            "Xun Xian",
            "Robert Specht",
            "Ganghua Wang",
            "Xuan Bi",
            "Charles Fleming",
            "Jayanth Srinivasa",
            "Ashish Kundu",
            "Mingyi Hong",
            "Jie Ding"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Methodology (stat.ME)",
        "abstract": "Data science plays a critical role in transforming complex data into actionable insights across numerous domains. Recent developments in large language models (LLMs) have significantly automated data science workflows, but a fundamental question persists: Can these agentic AI systems truly match the performance of human data scientists who routinely leverage domain-specific knowledge? We explore this question by designing a prediction task where a crucial latent variable is hidden in relevant image data instead of tabular features. As a result, agentic AI that generates generic codes for modeling tabular data cannot perform well, while human experts could identify the important hidden variable using domain knowledge. We demonstrate this idea with a synthetic dataset for property insurance. Our experiments show that agentic AI that relies on generic analytics workflow falls short of methods that use domain-specific insights. This highlights a key limitation of the current agentic AI for data science and underscores the need for future research to develop agentic AI systems that can better recognize and incorporate domain knowledge.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20974",
        "abs_url": "https://arxiv.org/abs/2512.20974",
        "pdf_url": "https://arxiv.org/pdf/2512.20974",
        "title": "Generalised Linear Models in Deep Bayesian RL with Learnable Basis Functions",
        "authors": [
            "Jingyang You",
            "Hanna Kurniawati"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Robotics (cs.RO)",
        "abstract": "Bayesian Reinforcement Learning (BRL) provides a framework for generalisation of Reinforcement Learning (RL) problems from its use of Bayesian task parameters in the transition and reward models. However, classical BRL methods assume known forms of transition and reward models, reducing their applicability in real-world problems. As a result, recent deep BRL methods have started to incorporate model learning, though the use of neural networks directly on the joint data and task parameters requires optimising the Evidence Lower Bound (ELBO). ELBOs are difficult to optimise and may result in indistinctive task parameters, hence compromised BRL policies. To this end, we introduce a novel deep BRL method, Generalised Linear Models in Deep Bayesian RL with Learnable Basis Functions (GLiBRL), that enables efficient and accurate learning of transition and reward models, with fully tractable marginal likelihood and Bayesian inference on task parameters and model noises. On challenging MetaWorld ML10/45 benchmarks, GLiBRL improves the success rate of one of the state-of-the-art deep BRL methods, VariBAD, by up to 2.7x. Comparing against representative or recent deep BRL / Meta-RL methods, such as MAML, RL2, SDVT, TrMRL and ECET, GLiBRL also demonstrates its low-variance and decent performance consistently.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21000",
        "abs_url": "https://arxiv.org/abs/2512.21000",
        "pdf_url": "https://arxiv.org/pdf/2512.21000",
        "title": "CoSeNet: A Novel Approach for Optimal Segmentation of Correlation Matrices",
        "authors": [
            "Alberto. Palomo-Alonso",
            "David Casillas-Perez",
            "Silvia Jimenez-Fernandez",
            "Antonio Portilla-Figueras",
            "Sancho Salcedo-Sanz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In this paper, we propose a novel approach for the optimal identification of correlated segments in noisy correlation matrices. The proposed model is known as CoSeNet (Correlation Seg-mentation Network) and is based on a four-layer algorithmic architecture that includes several processing layers: input, formatting, re-scaling, and segmentation layer. The proposed model can effectively identify correlated segments in such matrices, better than previous approaches for similar problems. Internally, the proposed model utilizes an overlapping technique and uses pre-trained Machine Learning (ML) algorithms, which makes it robust and generalizable. CoSeNet approach also includes a method that optimizes the parameters of the re-scaling layer using a heuristic algorithm and fitness based on a Window Difference-based metric. The output of the model is a binary noise-free matrix representing optimal segmentation as well as its seg-mentation points and can be used in a variety of applications, obtaining compromise solutions between efficiency, memory, and speed of the proposed deployment model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21075",
        "abs_url": "https://arxiv.org/abs/2512.21075",
        "pdf_url": "https://arxiv.org/pdf/2512.21075",
        "title": "Understanding Scaling Laws in Deep Neural Networks via Feature Learning Dynamics",
        "authors": [
            "Zihan Yao",
            "Ruoyu Wu",
            "Tianxiang Gao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Probability (math.PR); Machine Learning (stat.ML)",
        "abstract": "The empirical success of deep learning is often attributed to scaling laws that predict consistent gains as model, data, and compute grow; however, large models can exhibit training instability and diminishing returns, suggesting that scaling laws describe what success looks like but not when and why scaling succeeds or fails. A central obstacle is the lack of a rigorous understanding of feature learning at large depth. While muP characterizes feature-learning dynamics in the infinite-width limit and enables hyperparameter transfer across width, its depth extension (depth-muP) breaks down for residual blocks with more than one internal layer. We derive Neural Feature Dynamics (NFD) for ResNets with single-layer residual blocks, characterizing feature learning via a coupled forward-backward stochastic system in the joint infinite-width and infinite-depth limit. In this regime, NFD identifies when scaling-law trends persist and explains diminishing returns. It also reveals a vanishing mechanism induced by the 1/sqrt(depth) residual scaling under which the gradient-independence assumption (GIA), known to fail during training at finite depth, becomes provably valid again at infinite depth, yielding an analytically tractable regime for end-to-end feature learning. Motivated by this insight, we study two-layer residual blocks and show that the same mechanism causes feature-learning collapse in the first internal layer at large depth, providing a structural explanation for the empirical failure of depth-muP. Based on this diagnosis, we propose a depth-aware learning-rate correction that counteracts the collapse and empirically restores depth-wise hyperparameter transfer, yielding stronger performance in deeper ResNets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21102",
        "abs_url": "https://arxiv.org/abs/2512.21102",
        "pdf_url": "https://arxiv.org/pdf/2512.21102",
        "title": "Shared Representation Learning for High-Dimensional Multi-Task Forecasting under Resource Contention in Cloud-Native Backends",
        "authors": [
            "Zixiao Huang",
            "Jixiao Yang",
            "Sijia Li",
            "Chi Zhang",
            "Jinyu Chen",
            "Chengda Xu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This study proposes a unified forecasting framework for high-dimensional multi-task time series to meet the prediction demands of cloud native backend systems operating under highly dynamic loads, coupled metrics, and parallel tasks. The method builds a shared encoding structure to represent diverse monitoring indicators in a unified manner and employs a state fusion mechanism to capture trend changes and local disturbances across different time scales. A cross-task structural propagation module is introduced to model potential dependencies among nodes, enabling the model to understand complex structural patterns formed by resource contention, link interactions, and changes in service topology. To enhance adaptability to non-stationary behaviors, the framework incorporates a dynamic adjustment mechanism that automatically regulates internal feature flows according to system state changes, ensuring stable predictions in the presence of sudden load shifts, topology drift, and resource jitter. The experimental evaluation compares multiple models across various metrics and verifies the effectiveness of the framework through analyses of hyperparameter sensitivity, environmental sensitivity, and data sensitivity. The results show that the proposed method achieves superior performance on several error metrics and provides more accurate representations of future states under different operating conditions. Overall, the unified forecasting framework offers reliable predictive capability for high-dimensional, multi-task, and strongly dynamic environments in cloud native systems and provides essential technical support for intelligent backend management.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21113",
        "abs_url": "https://arxiv.org/abs/2512.21113",
        "pdf_url": "https://arxiv.org/pdf/2512.21113",
        "title": "A Mechanistic Analysis of Transformers for Dynamical Systems",
        "authors": [
            "Gregory Duthé",
            "Nikolaos Evangelou",
            "Wei Liu",
            "Ioannis G. Kevrekidis",
            "Eleni Chatzi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computational Engineering, Finance, and Science (cs.CE)",
        "abstract": "Transformers are increasingly adopted for modeling and forecasting time-series, yet their internal mechanisms remain poorly understood from a dynamical systems perspective. In contrast to classical autoregressive and state-space models, which benefit from well-established theoretical foundations, Transformer architectures are typically treated as black boxes. This gap becomes particularly relevant as attention-based models are considered for general-purpose or zero-shot forecasting across diverse dynamical regimes. In this work, we do not propose a new forecasting model, but instead investigate the representational capabilities and limitations of single-layer Transformers when applied to dynamical data. Building on a dynamical systems perspective we interpret causal self-attention as a linear, history-dependent recurrence and analyze how it processes temporal information. Through a series of linear and nonlinear case studies, we identify distinct operational regimes. For linear systems, we show that the convexity constraint imposed by softmax attention fundamentally restricts the class of dynamics that can be represented, leading to oversmoothing in oscillatory settings. For nonlinear systems under partial observability, attention instead acts as an adaptive delay-embedding mechanism, enabling effective state reconstruction when sufficient temporal context and latent dimensionality are available. These results help bridge empirical observations with classical dynamical systems theory, providing insight into when and why Transformers succeed or fail as models of dynamical systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21152",
        "abs_url": "https://arxiv.org/abs/2512.21152",
        "pdf_url": "https://arxiv.org/pdf/2512.21152",
        "title": "MODE: Multi-Objective Adaptive Coreset Selection",
        "authors": [
            "Tanmoy Mukherjee",
            "Pierre Marquis",
            "Zied Bouraoui"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We present Mode(Multi-Objective adaptive Data Efficiency), a framework that dynamically combines coreset selection strategies based on their evolving contribution to model performance. Unlike static methods, \\mode adapts selection criteria to training phases: emphasizing class balance early, diversity during representation learning, and uncertainty at convergence. We show that MODE achieves (1-1/e)-approximation with O(n \\log n) complexity and demonstrates competitive accuracy while providing interpretable insights into data utility evolution. Experiments show \\mode reduces memory requirements",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21170",
        "abs_url": "https://arxiv.org/abs/2512.21170",
        "pdf_url": "https://arxiv.org/pdf/2512.21170",
        "title": "A Unified Framework for EEG Seizure Detection Using Universum-Integrated Generalized Eigenvalues Proximal Support Vector Machine",
        "authors": [
            "Yogesh Kumar",
            "Vrushank Ahire",
            "M. A. Ganaie"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The paper presents novel Universum-enhanced classifiers: the Universum Generalized Eigenvalue Proximal Support Vector Machine (U-GEPSVM) and the Improved U-GEPSVM (IU-GEPSVM) for EEG signal classification. Using the computational efficiency of generalized eigenvalue decomposition and the generalization benefits of Universum learning, the proposed models address critical challenges in EEG analysis: non-stationarity, low signal-to-noise ratio, and limited labeled data. U-GEPSVM extends the GEPSVM framework by incorporating Universum constraints through a ratio-based objective function, while IU-GEPSVM enhances stability through a weighted difference-based formulation that provides independent control over class separation and Universum alignment. The models are evaluated on the Bonn University EEG dataset across two binary classification tasks: (O vs S)-healthy (eyes closed) vs seizure, and (Z vs S)-healthy (eyes open) vs seizure. IU-GEPSVM achieves peak accuracies of 85% (O vs S) and 80% (Z vs S), with mean accuracies of 81.29% and 77.57% respectively, outperforming baseline methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21208",
        "abs_url": "https://arxiv.org/abs/2512.21208",
        "pdf_url": "https://arxiv.org/pdf/2512.21208",
        "title": "Analytic and Variational Stability of Deep Learning Systems",
        "authors": [
            "Ronald Katende"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Dynamical Systems (math.DS); Optimization and Control (math.OC)",
        "abstract": "We propose a unified analytic and variational framework for studying stability in deep learning systems viewed as coupled representation-parameter dynamics. The central object is the Learning Stability Profile, which tracks the infinitesimal response of representations, parameters, and update mechanisms to perturbations along the learning trajectory. We prove a Fundamental Analytic Stability Theorem showing that uniform boundedness of these stability signatures is equivalent, up to norm equivalence, to the existence of a Lyapunov-type energy that dissipates along the learning flow. In smooth regimes, the framework yields explicit stability exponents linking spectral norms, activation regularity, step sizes, and learning rates to contractivity of the learning dynamics. Classical spectral stability results for feedforward networks, a discrete CFL-type condition for residual architectures, and parametric and temporal stability laws for stochastic gradient methods arise as direct consequences. The theory extends to non-smooth learning systems, including ReLU networks, proximal and projected updates, and stochastic subgradient flows, by replacing classical derivatives with Clarke generalized derivatives and smooth energies with variational Lyapunov functionals. The resulting framework provides a unified dynamical description of stability across architectures and optimization methods, clarifying how architectural and algorithmic choices jointly govern robustness and sensitivity to perturbations. It also provides a foundation for further extensions to continuous-time limits and geometric formulations of learning dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21231",
        "abs_url": "https://arxiv.org/abs/2512.21231",
        "pdf_url": "https://arxiv.org/pdf/2512.21231",
        "title": "MiST: Understanding the Role of Mid-Stage Scientific Training in Developing Chemical Reasoning Models",
        "authors": [
            "Andres M Bran",
            "Tong Xie",
            "Shai Pranesh",
            "Jeffrey Meng",
            "Xuan Vu Nguyen",
            "Jeremy Goumaz",
            "David Ming Segura",
            "Ruizhi Xu",
            "Dongzhan Zhou",
            "Wenjie Zhang",
            "Bram Hoex",
            "Philippe Schwaller"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Large Language Models can develop reasoning capabilities through online fine-tuning with rule-based rewards. However, recent studies reveal a critical constraint: reinforcement learning succeeds only when the base model already assigns non-negligible probability to correct answers -- a property we term 'latent solvability'. This work investigates the emergence of chemical reasoning capabilities and what these prerequisites mean for chemistry. We identify two necessary conditions for RL-based chemical reasoning: 1) Symbolic competence, and 2) Latent chemical knowledge. We propose mid-stage scientific training (MiST): a set of mid-stage training techniques to satisfy these, including data-mixing with SMILES/CIF-aware pre-processing, continued pre-training on 2.9B tokens, and supervised fine-tuning on 1B tokens. These steps raise the latent-solvability score on 3B and 7B models by up to 1.8x, and enable RL to lift top-1 accuracy from 10.9 to 63.9% on organic reaction naming, and from 40.6 to 67.4% on inorganic material generation. Similar results are observed for other challenging chemical tasks, while producing interpretable reasoning traces. Our results define clear prerequisites for chemical reasoning training and highlight the broader role of mid-stage training in unlocking reasoning capabilities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21288",
        "abs_url": "https://arxiv.org/abs/2512.21288",
        "pdf_url": "https://arxiv.org/pdf/2512.21288",
        "title": "Model Merging via Multi-Teacher Knowledge Distillation",
        "authors": [
            "Seyed Arshan Dalili",
            "Mehrdad Mahdavi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Model merging has emerged as a lightweight alternative to joint multi-task learning (MTL), yet the generalization properties of merged models remain largely unexplored. Establishing such theoretical guarantees is non-trivial, as the merging process typically forbids access to the original training data and involves combining fine-tuned models trained on fundamentally heterogeneous data distributions. Without a principled understanding of these dynamics, current methods often rely on heuristics to approximate the optimal combination of parameters. This dependence is most critical in coefficient scaling, the weighting factors that modulate the magnitude of each fine-tuned model's contribution to the shared parameter. However, without a principled objective to guide their selection, these methods lead to brittle performance and are highly sensitive to scaling initialization. We address this gap by (i) establishing a novel flatness-aware PAC-Bayes generalization bound specifically for the model merging setting. This analysis introduces a \"cross-task heterogeneity\" term that formally captures the mismatch between diverse fine-tuned model priors and the target multi-task distributions. Guided by this theoretical insight, (ii) we frame model merging as multi-teacher knowledge distillation on scarce, unlabeled data. We formally demonstrate that minimizing the student-teacher Kullback-Leibler divergence directly tightens the upper bound on the merged model's excess risk. Guided by the flatness-aware bound derived, (iii) we operationalize this objective via SAMerging, a method that employs Sharpness-Aware Minimization (SAM) to find flat minima. Empirically, SAMerging establishes a new state of the art across vision and NLP benchmarks, achieving remarkable performance. The code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21301",
        "abs_url": "https://arxiv.org/abs/2512.21301",
        "pdf_url": "https://arxiv.org/pdf/2512.21301",
        "title": "Transcriptome-Conditioned Personalized De Novo Drug Generation for AML Using Metaheuristic Assembly and Target-Driven Filtering",
        "authors": [
            "Abdullah G. Elafifi",
            "Basma Mamdouh",
            "Mariam Hanafy",
            "Muhammed Alaa Eldin",
            "Yosef Khaled",
            "Nesma Mohamed El-Gelany",
            "Tarek H.M. Abou-El-Enien"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Acute Myeloid Leukemia (AML) remains a clinical challenge due to its extreme molecular heterogeneity and high relapse rates. While precision medicine has introduced mutation-specific therapies, many patients still lack effective, personalized options. This paper presents a novel, end-to-end computational framework that bridges the gap between patient-specific transcriptomics and de novo drug discovery. By analyzing bulk RNA sequencing data from the TCGA-LAML cohort, the study utilized Weighted Gene Co-expression Network Analysis (WGCNA) to prioritize 20 high-value biomarkers, including metabolic transporters like HK3 and immune-modulatory receptors such as SIGLEC9. The physical structures of these targets were modeled using AlphaFold3, and druggable hotspots were quantitatively mapped via the DOGSiteScorer engine. Then developed a novel, reaction-first evolutionary metaheuristic algorithm as well as multi-objective optimization programming that assembles novel ligands from fragment libraries, guided by spatial alignment to these identified hotspots. The generative model produced structurally unique chemical entities with a strong bias toward drug-like space, as evidenced by QED scores peaking between 0.5 and 0.7. Validation through ADMET profiling and SwissDock molecular docking identified high-confidence candidates, such as Ligand L1, which achieved a binding free energy of -6.571 kcal/mol against the A08A96 biomarker. These results demonstrate that integrating systems biology with metaheuristic molecular assembly can produce pharmacologically viable, patient tailored leads, offering a scalable blueprint for precision oncology in AML and beyond",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21311",
        "abs_url": "https://arxiv.org/abs/2512.21311",
        "pdf_url": "https://arxiv.org/pdf/2512.21311",
        "title": "Learning to Solve PDEs on Neural Shape Representations",
        "authors": [
            "Lilian Welschinger",
            "Yilin Liu",
            "Zican Wang",
            "Niloy Mitra"
        ],
        "comments": "Article webpage link: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Solving partial differential equations (PDEs) on shapes underpins many shape analysis and engineering tasks; yet, prevailing PDE solvers operate on polygonal/triangle meshes while modern 3D assets increasingly live as neural representations. This mismatch leaves no suitable method to solve surface PDEs directly within the neural domain, forcing explicit mesh extraction or per-instance residual training, preventing end-to-end workflows. We present a novel, mesh-free formulation that learns a local update operator conditioned on neural (local) shape attributes, enabling surface PDEs to be solved directly where the (neural) data lives. The operator integrates naturally with prevalent neural surface representations, is trained once on a single representative shape, and generalizes across shape and topology variations, enabling accurate, fast inference without explicit meshing or per-instance optimization while preserving differentiability. Across analytic benchmarks (heat equation and Poisson solve on sphere) and real neural assets across different representations, our method slightly outperforms CPM while remaining reasonably close to FEM, and, to our knowledge, delivers the first end-to-end pipeline that solves surface PDEs on both neural and classical surface representations. Code will be released on acceptance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21326",
        "abs_url": "https://arxiv.org/abs/2512.21326",
        "pdf_url": "https://arxiv.org/pdf/2512.21326",
        "title": "Measuring all the noises of LLM Evals",
        "authors": [
            "Sida Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (stat.ML)",
        "abstract": "Separating signal from noise is central to experimental science. Applying well-established statistical method effectively to LLM evals requires consideration of their unique noise characteristics. We clearly define and measure three types of noise: prediction noise from generating different answers on a given question, data noise from sampling questions, and their combined total noise following the law of total variance. To emphasize relative comparisons and gain statistical power, we propose the all-pairs paired method, which applies the paired analysis to all pairs of LLMs and measures all the noise components based on millions of question-level predictions across many evals and settings. These measurements revealed clear patterns. First, each eval exhibits a characteristic and highly predictable total noise level across all model pairs. Second, paired prediction noise typically exceeds paired data noise, which means reducing prediction noise by averaging can significantly increase statistical power. These findings enable practitioners to assess significance without custom testing and to detect much smaller effects in controlled experiments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2509.18121",
        "abs_url": "https://arxiv.org/abs/2509.18121",
        "pdf_url": "https://arxiv.org/pdf/2509.18121",
        "title": "Energy-convergence trade off for the training of neural networks on bio-inspired hardware",
        "authors": [
            "Nikhil Garg",
            "Paul Uriarte Vicandi",
            "Yanming Zhang",
            "Alexandre Baigol",
            "Donato Francesco Falcone",
            "Saketh Ram Mamidala",
            "Bert Jan Offrein",
            "Laura Bégon-Lours"
        ],
        "comments": "",
        "subjects": "Emerging Technologies (cs.ET); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "The increasing deployment of wearable sensors and implantable devices is shifting AI processing demands to the extreme edge, necessitating ultra-low power for continuous operation. Inspired by the brain, emerging memristive devices promise to accelerate neural network training by eliminating costly data transfers between compute and memory. Though, balancing performance and energy efficiency remains a challenge. We investigate ferroelectric synaptic devices based on HfO2/ZrO2 superlattices and feed their experimentally measured weight updates into hardware-aware neural network simulations. Across pulse widths from 20 ns to 0.2 ms, shorter pulses lower per-update energy but require more training epochs while still reducing total energy without sacrificing accuracy. Classification accuracy using plain stochastic gradient descent (SGD) is diminished compared to mixed-precision SGD. We analyze the causes and propose a ``symmetry point shifting'' technique, addressing asymmetric updates and restoring accuracy. These results highlight a trade-off among accuracy, convergence speed, and energy use, showing that short-pulse programming with tailored training significantly enhances on-chip learning efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.12101",
        "abs_url": "https://arxiv.org/abs/2512.12101",
        "pdf_url": "https://arxiv.org/pdf/2512.12101",
        "title": "AI-Augmented Pollen Recognition in Optical and Holographic Microscopy for Veterinary Imaging",
        "authors": [
            "Swarn S. Warshaneyan",
            "Maksims Ivanovs",
            "Blaž Cugmas",
            "Inese Bērziņa",
            "Laura Goldberga",
            "Mindaugas Tamosiunas",
            "Roberts Kadiķis"
        ],
        "comments": "10 pages, 10 figures, 2 tables, 22 references. Journal submission undergoing peer review",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Quantitative Methods (q-bio.QM); Machine Learning (stat.ML)",
        "abstract": "We present a comprehensive study on fully automated pollen recognition across both conventional optical and digital in-line holographic microscopy (DIHM) images of sample slides. Visually recognizing pollen in unreconstructed holographic images remains challenging due to speckle noise, twin-image artifacts and substantial divergence from bright-field appearances. We establish the performance baseline by training YOLOv8s for object detection and MobileNetV3L for classification on a dual-modality dataset of automatically annotated optical and affinely aligned DIHM images. On optical data, detection mAP50 reaches 91.3% and classification accuracy reaches 97%, whereas on DIHM data, we achieve only 8.15% for detection mAP50 and 50% for classification accuracy. Expanding the bounding boxes of pollens in DIHM images over those acquired in aligned optical images achieves 13.3% for detection mAP50 and 54% for classification accuracy. To improve object detection in DIHM images, we employ a Wasserstein GAN with spectral normalization (WGAN-SN) to create synthetic DIHM images, yielding an FID score of 58.246. Mixing real-world and synthetic data at the 1.0 : 1.5 ratio for DIHM images improves object detection up to 15.4%. These results demonstrate that GAN-based augmentation can reduce the performance divide, bringing fully automated DIHM workflows for veterinary imaging a small but important step closer to practice.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20620",
        "abs_url": "https://arxiv.org/abs/2512.20620",
        "pdf_url": "https://arxiv.org/pdf/2512.20620",
        "title": "Uncovering Patterns of Brain Activity from EEG Data Consistently Associated with Cybersickness Using Neural Network Interpretability Maps",
        "authors": [
            "Jacqueline Yau",
            "Katherine J. Mimnaugh",
            "Evan G. Center",
            "Timo Ojala",
            "Steven M. LaValle",
            "Wenzhen Yuan",
            "Nancy Amato",
            "Minje Kim",
            "Kara Federmeier"
        ],
        "comments": "",
        "subjects": "Human-Computer Interaction (cs.HC); Machine Learning (cs.LG)",
        "abstract": "Cybersickness poses a serious challenge for users of virtual reality (VR) technology. Consequently, there has been significant effort to track its occurrence during VR use with brain activity through electroencephalography (EEG). However, a significant confound in current methods for detecting sickness from EEG is they do not account for the simultaneous processing of the sickening visual stimulus that is present in the brain data from VR. Using event-related potentials (ERPs) from an auditory stimulus shown to reflect cybersickness impacts, we can more precisely target EEG cybersickness features and use those to achieve better performance in online cybersickness classification. In this article, we introduce a method utilizing trained convolutional neural networks and transformer models and plot interpretability maps from integrated gradients and class activation to give a visual representation of what the model determined was most useful in sickness classification from an EEG dataset consisting of ERPs recorded during the elicitation of cybersickness. Across 12 runs of our method with three different neural networks, the models consistently pointed to a surprising finding: that amplitudes recorded at an electrode placed on the scalp near the left prefrontal cortex were important in the classification of cybersickness. These results help clarify a hidden pattern in other related research and point to exciting opportunities for future investigation: that this scalp location could be used as a tagged feature for better real-time cybersickness classification with EEG. We provide our code at: [anonymized].",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20657",
        "abs_url": "https://arxiv.org/abs/2512.20657",
        "pdf_url": "https://arxiv.org/pdf/2512.20657",
        "title": "Graph Neural Networks for Source Detection: A Review and Benchmark Study",
        "authors": [
            "Martin Sterchi",
            "Nathan Brack",
            "Lorenz Hilfiker"
        ],
        "comments": "",
        "subjects": "Social and Information Networks (cs.SI); Machine Learning (cs.LG)",
        "abstract": "The source detection problem arises when an epidemic process unfolds over a contact network, and the objective is to identify its point of origin, i.e., the source node. Research on this problem began with the seminal work of Shah and Zaman in 2010, who formally defined it and introduced the notion of rumor centrality. With the emergence of Graph Neural Networks (GNNs), several studies have proposed GNN-based approaches to source detection. However, some of these works lack methodological clarity and/or are hard to reproduce. As a result, it remains unclear (to us, at least) whether GNNs truly outperform more traditional source detection methods across comparable settings. In this paper, we first review existing GNN-based methods for source detection, clearly outlining the specific settings each addresses and the models they employ. Building on this research, we propose a principled GNN architecture tailored to the source detection task. We also systematically investigate key questions surrounding this problem. Most importantly, we aim to provide a definitive assessment of how GNNs perform relative to other source detection methods. Our experiments show that GNNs substantially outperform all other methods we test across a variety of network types. Although we initially set out to challenge the notion of GNNs as a solution to source detection, our results instead demonstrate their remarkable effectiveness for this task. We discuss possible reasons for this strong performance. To ensure full reproducibility, we release all code and data on GitHub. Finally, we argue that epidemic source detection should serve as a benchmark task for evaluating GNN architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20682",
        "abs_url": "https://arxiv.org/abs/2512.20682",
        "pdf_url": "https://arxiv.org/pdf/2512.20682",
        "title": "Fast and Exact Least Absolute Deviations Line Fitting via Piecewise Affine Lower-Bounding",
        "authors": [
            "Stefan Volz",
            "Martin Storath",
            "Andreas Weinmann"
        ],
        "comments": "Submitted to IEEE Transactions on Signal Processing",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Least-absolute-deviations (LAD) line fitting is robust to outliers but computationally more involved than least squares regression. Although the literature includes linear and near-linear time algorithms for the LAD line fitting problem, these methods are difficult to implement and, to our knowledge, lack maintained public implementations. As a result, practitioners often resort to linear programming (LP) based methods such as the simplex-based Barrodale-Roberts method and interior-point methods, or on iteratively reweighted least squares (IRLS) approximation which does not guarantee exact solutions. To close this gap, we propose the Piecewise Affine Lower-Bounding (PALB) method, an exact algorithm for LAD line fitting. PALB uses supporting lines derived from subgradients to build piecewise-affine lower bounds, and employs a subdivision scheme involving minima of these lower bounds. We prove correctness and provide bounds on the number of iterations. On synthetic datasets with varied signal types and noise including heavy-tailed outliers as well as a real dataset from the NOAA's Integrated Surface Database, PALB exhibits empirical log-linear scaling. It is consistently faster than publicly available implementations of LP based and IRLS based solvers. We provide a reference implementation written in Rust with a Python API.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20685",
        "abs_url": "https://arxiv.org/abs/2512.20685",
        "pdf_url": "https://arxiv.org/pdf/2512.20685",
        "title": "Diffusion Models in Simulation-Based Inference: A Tutorial Review",
        "authors": [
            "Jonas Arruda",
            "Niels Bracher",
            "Ullrich Köthe",
            "Jan Hasenauer",
            "Stefan T. Radev"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "Diffusion models have recently emerged as powerful learners for simulation-based inference (SBI), enabling fast and accurate estimation of latent parameters from simulated and real data. Their score-based formulation offers a flexible way to learn conditional or joint distributions over parameters and observations, thereby providing a versatile solution to various modeling problems. In this tutorial review, we synthesize recent developments on diffusion models for SBI, covering design choices for training, inference, and evaluation. We highlight opportunities created by various concepts such as guidance, score composition, flow matching, consistency models, and joint modeling. Furthermore, we discuss how efficiency and statistical accuracy are affected by noise schedules, parameterizations, and samplers. Finally, we illustrate these concepts with case studies across parameter dimensionalities, simulation budgets, and model types, and outline open questions for future research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20712",
        "abs_url": "https://arxiv.org/abs/2512.20712",
        "pdf_url": "https://arxiv.org/pdf/2512.20712",
        "title": "Real-World Adversarial Attacks on RF-Based Drone Detectors",
        "authors": [
            "Omer Gazit",
            "Yael Itzhakev",
            "Yuval Elovici",
            "Asaf Shabtai"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Radio frequency (RF) based systems are increasingly used to detect drones by analyzing their RF signal patterns, converting them into spectrogram images which are processed by object detection models. Existing RF attacks against image based models alter digital features, making over-the-air (OTA) implementation difficult due to the challenge of converting digital perturbations to transmittable waveforms that may introduce synchronization errors and interference, and encounter hardware limitations. We present the first physical attack on RF image based drone detectors, optimizing class-specific universal complex baseband (I/Q) perturbation waveforms that are transmitted alongside legitimate communications. We evaluated the attack using RF recordings and OTA experiments with four types of drones. Our results show that modest, structured I/Q perturbations are compatible with standard RF chains and reliably reduce target drone detection while preserving detection of legitimate drones.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20745",
        "abs_url": "https://arxiv.org/abs/2512.20745",
        "pdf_url": "https://arxiv.org/pdf/2512.20745",
        "title": "AgentMath: Empowering Mathematical Reasoning for Large Language Models via Tool-Augmented Agent",
        "authors": [
            "Haipeng Luo",
            "Huawen Feng",
            "Qingfeng Sun",
            "Can Xu",
            "Kai Zheng",
            "Yufei Wang",
            "Tao Yang",
            "Han Hu",
            "Yansong Tang",
            "Di Wang"
        ],
        "comments": "LLM, Mathematical Reasoning",
        "subjects": "Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Large Reasoning Models (LRMs) like o3 and DeepSeek-R1 have achieved remarkable progress in natural language reasoning with long chain-of-thought. However, they remain computationally inefficient and struggle with accuracy when solving problems requiring complex mathematical operations. In this work, we present AgentMath, an agent framework that seamlessly integrates language models' reasoning capabilities with code interpreters' computational precision to efficiently tackle complex mathematical problems. Our approach introduces three key innovations: (1) An automated method that converts natural language chain-of-thought into structured tool-augmented trajectories, generating high-quality supervised fine-tuning (SFT) data to alleviate data scarcity; (2) A novel agentic reinforcement learning (RL) paradigm that dynamically interleaves natural language generation with real-time code execution. This enables models to autonomously learn optimal tool-use strategies through multi-round interactive feedback, while fostering emergent capabilities in code refinement and error correction; (3) An efficient training system incorporating innovative techniques, including request-level asynchronous rollout scheduling, agentic partial rollout, and prefix-aware weighted load balancing, achieving 4-5x speedup and making efficient RL training feasible on ultra-long sequences with scenarios with massive tool this http URL evaluations show that AgentMath achieves state-of-the-art performance on challenging mathematical competition benchmarks including AIME24, AIME25, and HMMT25. Specifically, AgentMath-30B-A3B attains 90.6%, 86.4%, and 73.8% accuracy respectively, achieving advanced this http URL results validate the effectiveness of our approach and pave the way for building more sophisticated and scalable mathematical reasoning agents.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20747",
        "abs_url": "https://arxiv.org/abs/2512.20747",
        "pdf_url": "https://arxiv.org/pdf/2512.20747",
        "title": "A Physics Informed Neural Network For Deriving MHD State Vectors From Global Active Regions Observations",
        "authors": [
            "Subhamoy Chatterjee",
            "Mausumi Dikpati"
        ],
        "comments": "25 pages, 12 figures, accepted for publication in The Astrophysical Journal",
        "subjects": "Solar and Stellar Astrophysics (astro-ph.SR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Solar active regions (ARs) do not appear randomly but cluster along longitudinally warped toroidal bands ('toroids') that encode information about magnetic structures in the tachocline, where global-scale organization likely originates. Global MagnetoHydroDynamic Shallow-Water Tachocline (MHD-SWT) models have shown potential to simulate such toroids, matching observations qualitatively. For week-scale early prediction of flare-producing AR emergence, forward-integration of these toroids is necessary. This requires model initialization with a dynamically self-consistent MHD state-vector that includes magnetic, flow fields, and shell-thickness variations. However, synoptic magnetograms provide only geometric shape of toroids, not the state-vector needed to initialize MHD-SWT models. To address this challenging task, we develop PINNBARDS, a novel Physics-Informed Neural Network (PINN)-Based AR Distribution Simulator, that uses observational toroids and MHD-SWT equations to derive initial state-vector. Using Feb-14-2024 SDO/HMI synoptic map, we show that PINN converges to physically consistent, predominantly antisymmetric toroids, matching observed ones. Although surface data provides north and south toroids' central latitudes, and their latitudinal widths, they cannot determine tachocline field strengths, connected to AR emergence. We explore here solutions across a broad parameter range, finding hydrodynamically-dominated structures for weak fields (~2 kG) and overly rigid behavior for strong fields (~100 kG). We obtain best agreement with observations for 20-30 kG toroidal fields, and ~10 degree bandwidth, consistent with low-order longitudinal mode excitation. To our knowledge, PINNBARDS serves as the first method for reconstructing state-vectors for hidden tachocline magnetic structures from surface patterns; potentially leading to weeks ahead prediction of flare-producing AR-emergence.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20757",
        "abs_url": "https://arxiv.org/abs/2512.20757",
        "pdf_url": "https://arxiv.org/pdf/2512.20757",
        "title": "TokSuite: Measuring the Impact of Tokenizer Choice on Language Model Behavior",
        "authors": [
            "Gül Sena Altıntaş",
            "Malikeh Ehghaghi",
            "Brian Lester",
            "Fengyuan Liu",
            "Wanru Zhao",
            "Marco Ciccone",
            "Colin Raffel"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Tokenizers provide the fundamental basis through which text is represented and processed by language models (LMs). Despite the importance of tokenization, its role in LM performance and behavior is poorly understood due to the challenge of measuring the impact of tokenization in isolation. To address this need, we present TokSuite, a collection of models and a benchmark that supports research into tokenization's influence on LMs. Specifically, we train fourteen models that use different tokenizers but are otherwise identical using the same architecture, dataset, training budget, and initialization. Additionally, we curate and release a new benchmark that specifically measures model performance subject to real-world perturbations that are likely to influence tokenization. Together, TokSuite allows robust decoupling of the influence of a model's tokenizer, supporting a series of novel findings that elucidate the respective benefits and shortcomings of a wide range of popular tokenizers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20811",
        "abs_url": "https://arxiv.org/abs/2512.20811",
        "pdf_url": "https://arxiv.org/pdf/2512.20811",
        "title": "Weighted MCC: A Robust Measure of Multiclass Classifier Performance for Observations with Individual Weights",
        "authors": [
            "Rommel Cortez",
            "Bala Krishnamoorthy"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Several performance measures are used to evaluate binary and multiclass classification tasks. But individual observations may often have distinct weights, and none of these measures are sensitive to such varying weights. We propose a new weighted Pearson-Matthews Correlation Coefficient (MCC) for binary classification as well as weighted versions of related multiclass measures. The weighted MCC varies between $-1$ and $1$. But crucially, the weighted MCC values are higher for classifiers that perform better on highly weighted observations, and hence is able to distinguish them from classifiers that have a similar overall performance and ones that perform better on the lowly weighted observations. Furthermore, we prove that the weighted measures are robust with respect to the choice of weights in a precise manner: if the weights are changed by at most $\\epsilon$, the value of the weighted measure changes at most by a factor of $\\epsilon$ in the binary case and by a factor of $\\epsilon^2$ in the multiclass case. Our computations demonstrate that the weighted measures clearly identify classifiers that perform better on higher weighted observations, while the unweighted measures remain completely indifferent to the choices of weights.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20833",
        "abs_url": "https://arxiv.org/abs/2512.20833",
        "pdf_url": "https://arxiv.org/pdf/2512.20833",
        "title": "CHAMMI-75: pre-training multi-channel models with heterogeneous microscopy images",
        "authors": [
            "Vidit Agrawal",
            "John Peters",
            "Tyler N. Thompson",
            "Mohammad Vali Sanian",
            "Chau Pham",
            "Nikita Moshkov",
            "Arshad Kazi",
            "Aditya Pillai",
            "Jack Freeman",
            "Byunguk Kang",
            "Samouil L. Farhi",
            "Ernest Fraenkel",
            "Ron Stewart",
            "Lassi Paavolainen",
            "Bryan A. Plummer",
            "Juan C. Caicedo"
        ],
        "comments": "47 Pages, 23 Figures, 26 Tables",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Quantifying cell morphology using images and machine learning has proven to be a powerful tool to study the response of cells to treatments. However, models used to quantify cellular morphology are typically trained with a single microscopy imaging type. This results in specialized models that cannot be reused across biological studies because the technical specifications do not match (e.g., different number of channels), or because the target experimental conditions are out of distribution. Here, we present CHAMMI-75, an open access dataset of heterogeneous, multi-channel microscopy images from 75 diverse biological studies. We curated this resource from publicly available sources to investigate cellular morphology models that are channel-adaptive and can process any microscopy image type. Our experiments show that training with CHAMMI-75 can improve performance in multi-channel bioimaging tasks primarily because of its high diversity in microscopy modalities. This work paves the way to create the next generation of cellular morphology models for biological studies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20856",
        "abs_url": "https://arxiv.org/abs/2512.20856",
        "pdf_url": "https://arxiv.org/pdf/2512.20856",
        "title": "NVIDIA Nemotron 3: Efficient and Open Intelligence",
        "authors": [
            "NVIDIA",
            "Aaron Blakeman",
            "Aaron Grattafiori",
            "Aarti Basant",
            "Abhibha Gupta",
            "Abhinav Khattar",
            "Adi Renduchintala",
            "Aditya Vavre",
            "Akanksha Shukla",
            "Akhiad Bercovich",
            "Aleksander Ficek",
            "Aleksandr Shaposhnikov",
            "Alex Kondratenko",
            "Alexander Bukharin",
            "Alexandre Milesi",
            "Ali Taghibakhshi",
            "Alisa Liu",
            "Amelia Barton",
            "Ameya Sunil Mahabaleshwarkar",
            "Amir Klein",
            "Amit Zuker",
            "Amnon Geifman",
            "Amy Shen",
            "Anahita Bhiwandiwalla",
            "Andrew Tao",
            "Anjulie Agrusa",
            "Ankur Verma",
            "Ann Guan",
            "Anubhav Mandarwal",
            "Arham Mehta",
            "Ashwath Aithal",
            "Ashwin Poojary",
            "Asif Ahamed",
            "Asit Mishra",
            "Asma Kuriparambil Thekkumpate",
            "Ayush Dattagupta",
            "Banghua Zhu",
            "Bardiya Sadeghi",
            "Barnaby Simkin",
            "Ben Lanir",
            "Benedikt Schifferer",
            "Besmira Nushi",
            "Bilal Kartal",
            "Bita Darvish Rouhani",
            "Boris Ginsburg",
            "Brandon Norick",
            "Brandon Soubasis",
            "Branislav Kisacanin",
            "Brian Yu",
            "Bryan Catanzaro",
            "Carlo del Mundo",
            "Chantal Hwang",
            "Charles Wang",
            "Cheng-Ping Hsieh",
            "Chenghao Zhang",
            "Chenhan Yu",
            "Chetan Mungekar",
            "Chintan Patel",
            "Chris Alexiuk",
            "Christopher Parisien",
            "Collin Neale",
            "Cyril Meurillon",
            "Damon Mosk-Aoyama",
            "Dan Su",
            "Dane Corneil",
            "Daniel Afrimi",
            "Daniel Lo",
            "Daniel Rohrer",
            "Daniel Serebrenik",
            "Daria Gitman",
            "Daria Levy",
            "Darko Stosic",
            "David Mosallanezhad",
            "Deepak Narayanan",
            "Dhruv Nathawani",
            "Dima Rekesh",
            "Dina Yared",
            "Divyanshu Kakwani",
            "Dong Ahn",
            "Duncan Riach",
            "Dusan Stosic",
            "Edgar Minasyan",
            "Edward Lin",
            "Eileen Long",
            "Eileen Peters Long",
            "Elad Segal",
            "Elena Lantz",
            "Ellie Evans",
            "Elliott Ning",
            "Eric Chung",
            "Eric Harper",
            "Eric Tramel",
            "Erick Galinkin",
            "Erik Pounds",
            "Evan Briones",
            "Evelina Bakhturina",
            "Evgeny Tsykunov",
            "Faisal Ladhak",
            "Fay Wang",
            "Fei Jia"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "We introduce the Nemotron 3 family of models - Nano, Super, and Ultra. These models deliver strong agentic, reasoning, and conversational capabilities. The Nemotron 3 family uses a Mixture-of-Experts hybrid Mamba-Transformer architecture to provide best-in-class throughput and context lengths of up to 1M tokens. Super and Ultra models are trained with NVFP4 and incorporate LatentMoE, a novel approach that improves model quality. The two larger models also include MTP layers for faster text generation. All Nemotron 3 models are post-trained using multi-environment reinforcement learning enabling reasoning, multi-step tool use, and support granular reasoning budget control. Nano, the smallest model, outperforms comparable models in accuracy while remaining extremely cost-efficient for inference. Super is optimized for collaborative agents and high-volume workloads such as IT ticket automation. Ultra, the largest model, provides state-of-the-art accuracy and reasoning performance. Nano is released together with its technical report and this white paper, while Super and Ultra will follow in the coming months. We will openly release the model weights, pre- and post-training software, recipes, and all data for which we hold redistribution rights.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20872",
        "abs_url": "https://arxiv.org/abs/2512.20872",
        "pdf_url": "https://arxiv.org/pdf/2512.20872",
        "title": "Better Call Graphs: A New Dataset of Function Call Graphs for Malware Classification",
        "authors": [
            "Jakir Hossain",
            "Gurvinder Singh",
            "Lukasz Ziarek",
            "Ahmet Erdem Sarıyüce"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Function call graphs (FCGs) have emerged as a powerful abstraction for malware detection, capturing the behavioral structure of applications beyond surface-level signatures. Their utility in traditional program analysis has been well established, enabling effective classification and analysis of malicious software. In the mobile domain, especially in the Android ecosystem, FCG-based malware classification is particularly critical due to the platform's widespread adoption and the complex, component-based structure of Android apps. However, progress in this direction is hindered by the lack of large-scale, high-quality Android-specific FCG datasets. Existing datasets are often outdated, dominated by small or redundant graphs resulting from app repackaging, and fail to reflect the diversity of real-world malware. These limitations lead to overfitting and unreliable evaluation of graph-based classification methods. To address this gap, we introduce Better Call Graphs (BCG), a comprehensive dataset of large and unique FCGs extracted from recent Android application packages (APKs). BCG includes both benign and malicious samples spanning various families and types, along with graph-level features for each APK. Through extensive experiments using baseline classifiers, we demonstrate the necessity and value of BCG compared to existing datasets. BCG is publicly available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20877",
        "abs_url": "https://arxiv.org/abs/2512.20877",
        "pdf_url": "https://arxiv.org/pdf/2512.20877",
        "title": "Architectural Trade-offs in Small Language Models Under Compute Constraints",
        "authors": [
            "Shivraj Singh Bhatti"
        ],
        "comments": "15 pages, 11 images",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "We present a systematic empirical study of small language models under strict compute constraints, analyzing how architectural choices and training budget interact to determine performance. Starting from a linear next-token predictor, we progressively introduce nonlinearities, self-attention, and multi-layer transformer architectures, evaluating each on character-level modeling of Tiny Shakespeare and word-level modeling of Penn Treebank (PTB) and WikiText-2. We compare models using test negative log-likelihood (NLL), parameter count, and approximate training FLOPs to characterize accuracy-efficiency trade-offs. Our results show that attention-based models dominate MLPs in per-FLOP efficiency even at small scale, while increasing depth or context without sufficient optimization can degrade performance. We further examine rotary positional embeddings (RoPE), finding that architectural techniques successful in large language models do not necessarily transfer to small-model regimes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20924",
        "abs_url": "https://arxiv.org/abs/2512.20924",
        "pdf_url": "https://arxiv.org/pdf/2512.20924",
        "title": "Clever Hans in Chemistry: Chemist Style Signals Confound Activity Prediction on Public Benchmarks",
        "authors": [
            "Andrew D. Blevins",
            "Ian K. Quigley"
        ],
        "comments": "",
        "subjects": "Biomolecules (q-bio.BM); Machine Learning (cs.LG); Chemical Physics (physics.chem-ph)",
        "abstract": "Can machine learning models identify which chemist made a molecule from structure alone? If so, models trained on literature data may exploit chemist intent rather than learning causal structure-activity relationships. We test this by linking CHEMBL assays to publication authors and training a 1,815-class classifier to predict authors from molecular fingerprints, achieving 60% top-5 accuracy under scaffold-based splitting. We then train an activity model that receives only a protein identifier and an author-probability vector derived from structure, with no direct access to molecular descriptors. This author-only model achieves predictive power comparable to a simple baseline that has access to structure. This reveals a \"Clever Hans\" failure mode: models can predict bioactivity largely by inferring chemist goals and favorite targets without requiring a lab-independent understanding of chemistry. We analyze the sources of this leakage, propose author-disjoint splits, and recommend dataset practices to decouple chemist intent from biological outcomes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20943",
        "abs_url": "https://arxiv.org/abs/2512.20943",
        "pdf_url": "https://arxiv.org/pdf/2512.20943",
        "title": "AirGS: Real-Time 4D Gaussian Streaming for Free-Viewpoint Video Experiences",
        "authors": [
            "Zhe Wang",
            "Jinghang Li",
            "Yifei Zhu"
        ],
        "comments": "This paper is accepted by IEEE International Conference on Computer Communications (INFOCOM), 2026",
        "subjects": "Graphics (cs.GR); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG); Multimedia (cs.MM); Networking and Internet Architecture (cs.NI); Image and Video Processing (eess.IV)",
        "abstract": "Free-viewpoint video (FVV) enables immersive viewing experiences by allowing users to view scenes from arbitrary perspectives. As a prominent reconstruction technique for FVV generation, 4D Gaussian Splatting (4DGS) models dynamic scenes with time-varying 3D Gaussian ellipsoids and achieves high-quality rendering via fast rasterization. However, existing 4DGS approaches suffer from quality degradation over long sequences and impose substantial bandwidth and storage overhead, limiting their applicability in real-time and wide-scale deployments. Therefore, we present AirGS, a streaming-optimized 4DGS framework that rearchitects the training and delivery pipeline to enable high-quality, low-latency FVV experiences. AirGS converts Gaussian video streams into multi-channel 2D formats and intelligently identifies keyframes to enhance frame reconstruction quality. It further combines temporal coherence with inflation loss to reduce training time and representation size. To support communication-efficient transmission, AirGS models 4DGS delivery as an integer linear programming problem and design a lightweight pruning level selection algorithm to adaptively prune the Gaussian updates to be transmitted, balancing reconstruction quality and bandwidth consumption. Extensive experiments demonstrate that AirGS reduces quality deviation in PSNR by more than 20% when scene changes, maintains frame-level PSNR consistently above 30, accelerates training by 6 times, reduces per-frame transmission size by nearly 50% compared to the SOTA 4DGS approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20967",
        "abs_url": "https://arxiv.org/abs/2512.20967",
        "pdf_url": "https://arxiv.org/pdf/2512.20967",
        "title": "Deadline-Aware Online Scheduling for LLM Fine-Tuning with Spot Market Predictions",
        "authors": [
            "Linggao Kong",
            "Yuedong Xu",
            "Lei Jiao",
            "Chuan Xu"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "As foundation models grow in size, fine-tuning them becomes increasingly expensive. While GPU spot instances offer a low-cost alternative to on-demand resources, their volatile prices and availability make deadline-aware scheduling particularly challenging. We tackle this difficulty by using a mix of spot and on-demand instances. Distinctively, we show the predictability of prices and availability in a spot instance market, the power of prediction in enabling cost-efficient scheduling and its sensitivity to estimation errors. An integer programming problem is formulated to capture the use of mixed instances under both the price and availability dynamics. We propose an online allocation algorithm with prediction based on the committed horizon control approach that leverages a \\emph{commitment level} to enforce the partial sequence of decisions. When this prediction becomes inaccurate, we further present a complementary online algorithm without predictions. An online policy selection algorithm is developed that learns the best policy from a pool constructed by varying the parameters of both algorithms. We prove that the prediction-based algorithm achieves tighter performance bounds as prediction error decreases, while the policy selection algorithm possesses a regret bound of $\\mathcal{O}(\\sqrt{T})$. Experimental results demonstrate that our online framework can adaptively select the best policy under varying spot market dynamics and prediction quality, consistently outperforming baselines and improving utility by up to 54.8\\%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.20983",
        "abs_url": "https://arxiv.org/abs/2512.20983",
        "pdf_url": "https://arxiv.org/pdf/2512.20983",
        "title": "Automatic Replication of LLM Mistakes in Medical Conversations",
        "authors": [
            "Oleksii Proniakin",
            "Diego Fajardo",
            "Ruslan Nazarenko",
            "Razvan Marinescu"
        ],
        "comments": "48 pages, 3 figures, 4 tables",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) are increasingly evaluated in clinical settings using multi-dimensional rubrics which quantify reasoning quality, safety, and patient-centeredness. Yet, replicating specific mistakes in other LLM models is not straightforward and often requires manual effort. We introduce MedMistake, an automatic pipeline that extracts mistakes LLMs make in patient-doctor conversations and converts them into a benchmark of single-shot QA pairs. Our pipeline (1) creates complex, conversational data between an LLM patient and LLM doctor, (2) runs an evaluation with a committee of 2 LLM judges across a variety of dimensions and (3) creates simplified single-shot QA scenarios from those mistakes. We release MedMistake-All, a dataset of 3,390 single-shot QA pairs where GPT-5 and Gemini 2.5 Pro are currently failing to answer correctly, as judged by two LLM judges. We used medical experts to validate a subset of 211/3390 questions (MedMistake-Bench), which we used to run a final evaluation of 12 frontier LLMs: Claude Opus 4.5, Claude Sonnet 4.5, DeepSeek-Chat, Gemini 2.5 Pro, Gemini 3 Pro, GPT-4o, GPT-5, GPT-5.1, GPT-5.2, Grok 4, Grok 4.1, Mistral Large. We found that GPT models, Claude and Grok obtained the best performance on MedMistake-Bench. We release both the doctor-validated benchmark (MedMistake-Bench), as well as the full dataset (MedMistake-All) at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21005",
        "abs_url": "https://arxiv.org/abs/2512.21005",
        "pdf_url": "https://arxiv.org/pdf/2512.21005",
        "title": "Learning from Neighbors with PHIBP: Predicting Infectious Disease Dynamics in Data-Sparse Environments",
        "authors": [
            "Edwin Fong",
            "Lancelot F. James",
            "Juho Lee"
        ],
        "comments": "Draft Book chapter on AMMI methods -- Application of PHIBP arXiv:2502.01919 to Infectious Disease Detection with suggested extensions using the developments in arXiv:2508.18668",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Probability (math.PR)",
        "abstract": "Modeling sparse count data, which arise across numerous scientific fields, presents significant statistical challenges. This chapter addresses these challenges in the context of infectious disease prediction, with a focus on predicting outbreaks in geographic regions that have historically reported zero cases. To this end, we present the detailed computational framework and experimental application of the Poisson Hierarchical Indian Buffet Process (PHIBP), with demonstrated success in handling sparse count data in microbiome and ecological studies. The PHIBP's architecture, grounded in the concept of absolute abundance, systematically borrows statistical strength from related regions and circumvents the known sensitivities of relative-rate methods to zero counts. Through a series of experiments on infectious disease data, we show that this principled approach provides a robust foundation for generating coherent predictive distributions and for the effective use of comparative measures such as alpha and beta diversity. The chapter's emphasis on algorithmic implementation and experimental results confirms that this unified framework delivers both accurate outbreak predictions and meaningful epidemiological insights in data-sparse settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21020",
        "abs_url": "https://arxiv.org/abs/2512.21020",
        "pdf_url": "https://arxiv.org/pdf/2512.21020",
        "title": "Enhancing diffusion models with Gaussianization preprocessing",
        "authors": [
            "Li Cunzhi",
            "Louis Kang",
            "Hideaki Shimazaki"
        ],
        "comments": "17 pages, 9 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Diffusion models are a class of generative models that have demonstrated remarkable success in tasks such as image generation. However, one of the bottlenecks of these models is slow sampling due to the delay before the onset of trajectory bifurcation, at which point substantial reconstruction begins. This issue degrades generation quality, especially in the early stages. Our primary objective is to mitigate bifurcation-related issues by preprocessing the training data to enhance reconstruction quality, particularly for small-scale network architectures. Specifically, we propose applying Gaussianization preprocessing to the training data to make the target distribution more closely resemble an independent Gaussian distribution, which serves as the initial density of the reconstruction process. This preprocessing step simplifies the model's task of learning the target distribution, thereby improving generation quality even in the early stages of reconstruction with small networks. The proposed method is, in principle, applicable to a broad range of generative tasks, enabling more stable and efficient sampling processes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21021",
        "abs_url": "https://arxiv.org/abs/2512.21021",
        "pdf_url": "https://arxiv.org/pdf/2512.21021",
        "title": "Towards Better Search with Domain-Aware Text Embeddings for C2C Marketplaces",
        "authors": [
            "Andre Rusli",
            "Miao Cao",
            "Shoma Ishimoto",
            "Sho Akiyama",
            "Max Frenzel"
        ],
        "comments": "5 pages, AAAI 2026 Workshop on New Frontiers in Information Retrieval",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Consumer-to-consumer (C2C) marketplaces pose distinct retrieval challenges: short, ambiguous queries; noisy, user-generated listings; and strict production constraints. This paper reports our experiment to build a domain-aware Japanese text-embedding approach to improve the quality of search at Mercari, Japan's largest C2C marketplace. We experimented with fine-tuning on purchase-driven query-title pairs, using role-specific prefixes to model query-item asymmetry. To meet production constraints, we apply Matryoshka Representation Learning to obtain compact, truncation-robust embeddings. Offline evaluation on historical search logs shows consistent gains over a strong generic encoder, with particularly large improvements when replacing PCA compression with Matryoshka truncation. A manual assessment further highlights better handling of proper nouns, marketplace-specific semantics, and term-importance alignment. Additionally, an initial online A/B test demonstrates statistically significant improvements in revenue per user and search-flow efficiency, with transaction frequency maintained. Results show that domain-aware embeddings improve relevance and efficiency at scale and form a practical foundation for richer LLM-era search experiences.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21029",
        "abs_url": "https://arxiv.org/abs/2512.21029",
        "pdf_url": "https://arxiv.org/pdf/2512.21029",
        "title": "Critical Points of Degenerate Metrics on Algebraic Varieties: A Tale of Overparametrization",
        "authors": [
            "Giovanni Luca Marchetti",
            "Erin Connelly",
            "Paul Breiding",
            "Kathlén Kohn"
        ],
        "comments": "",
        "subjects": "Algebraic Geometry (math.AG); Machine Learning (cs.LG)",
        "abstract": "We study the critical points over an algebraic variety of an optimization problem defined by a quadratic objective that is degenerate. This scenario arises in machine learning when the dataset size is small with respect to the model, and is typically referred to as overparametrization. Our main result relates the degenerate optimization problem to a nondegenerate one via a projection. In the highly-degenerate regime, we find that a central role is played by the ramification locus of the projection. Additionally, we provide tools for counting the number of critical points over projective varieties, and discuss specific cases arising from deep learning. Our work bridges tools from algebraic geometry with ideas from machine learning, and it extends the line of literature around the Euclidean distance degree to the degenerate setting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21039",
        "abs_url": "https://arxiv.org/abs/2512.21039",
        "pdf_url": "https://arxiv.org/pdf/2512.21039",
        "title": "Agentic Multi-Persona Framework for Evidence-Aware Fake News Detection",
        "authors": [
            "Roopa Bukke",
            "Soumya Pandey",
            "Suraj Kumar",
            "Soumi Chattopadhyay",
            "Chandranath Adak"
        ],
        "comments": "12 pages, 8 tables, 2 figures",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "The rapid proliferation of online misinformation poses significant risks to public trust, policy, and safety, necessitating reliable automated fake news detection. Existing methods often struggle with multimodal content, domain generalization, and explainability. We propose AMPEND-LS, an agentic multi-persona evidence-grounded framework with LLM-SLM synergy for multimodal fake news detection. AMPEND-LS integrates textual, visual, and contextual signals through a structured reasoning pipeline powered by LLMs, augmented with reverse image search, knowledge graph paths, and persuasion strategy analysis. To improve reliability, we introduce a credibility fusion mechanism combining semantic similarity, domain trustworthiness, and temporal context, and a complementary SLM classifier to mitigate LLM uncertainty and hallucinations. Extensive experiments across three benchmark datasets demonstrate that AMPEND-LS consistently outperformed state-of-the-art baselines in accuracy, F1 score, and robustness. Qualitative case studies further highlight its transparent reasoning and resilience against evolving misinformation. This work advances the development of adaptive, explainable, and evidence-aware systems for safeguarding online information integrity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21048",
        "abs_url": "https://arxiv.org/abs/2512.21048",
        "pdf_url": "https://arxiv.org/pdf/2512.21048",
        "title": "zkFL-Health: Blockchain-Enabled Zero-Knowledge Federated Learning for Medical AI Privacy",
        "authors": [
            "Savvy Sharma",
            "George Petrovic",
            "Sarthak Kaushik"
        ],
        "comments": "10 pages, 1 figure, 5 tables",
        "subjects": "Cryptography and Security (cs.CR); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "Healthcare AI needs large, diverse datasets, yet strict privacy and governance constraints prevent raw data sharing across institutions. Federated learning (FL) mitigates this by training where data reside and exchanging only model updates, but practical deployments still face two core risks: (1) privacy leakage via gradients or updates (membership inference, gradient inversion) and (2) trust in the aggregator, a single point of failure that can drop, alter, or inject contributions undetected. We present zkFL-Health, an architecture that combines FL with zero-knowledge proofs (ZKPs) and Trusted Execution Environments (TEEs) to deliver privacy-preserving, verifiably correct collaborative training for medical AI. Clients locally train and commit their updates; the aggregator operates within a TEE to compute the global update and produces a succinct ZK proof (via Halo2/Nova) that it used exactly the committed inputs and the correct aggregation rule, without revealing any client update to the host. Verifier nodes validate the proof and record cryptographic commitments on-chain, providing an immutable audit trail and removing the need to trust any single party. We outline system and threat models tailored to healthcare, the zkFL-Health protocol, security/privacy guarantees, and a performance evaluation plan spanning accuracy, privacy risk, latency, and cost. This framework enables multi-institutional medical AI with strong confidentiality, integrity, and auditability, key properties for clinical adoption and regulatory compliance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21076",
        "abs_url": "https://arxiv.org/abs/2512.21076",
        "pdf_url": "https://arxiv.org/pdf/2512.21076",
        "title": "Blurb-Refined Inference from Crowdsourced Book Reviews using Hierarchical Genre Mining with Dual-Path Graph Convolutions",
        "authors": [
            "Suraj Kumar",
            "Utsav Kumar Nareti",
            "Soumi Chattopadhyay",
            "Chandranath Adak",
            "Prolay Mallick"
        ],
        "comments": "10 pages, 4 figures, 3 tables",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG); Multimedia (cs.MM)",
        "abstract": "Accurate book genre classification is fundamental to digital library organization, content discovery, and personalized recommendation. Existing approaches typically model genre prediction as a flat, single-label task, ignoring hierarchical genre structure and relying heavily on noisy, subjective user reviews, which often degrade classification reliability. We propose HiGeMine, a two-phase hierarchical genre mining framework that robustly integrates user reviews with authoritative book blurbs. In the first phase, HiGeMine employs a zero-shot semantic alignment strategy to filter reviews, retaining only those semantically consistent with the corresponding blurb, thereby mitigating noise, bias, and irrelevance. In the second phase, we introduce a dual-path, two-level graph-based classification architecture: a coarse-grained Level-1 binary classifier distinguishes fiction from non-fiction, followed by Level-2 multi-label classifiers for fine-grained genre prediction. Inter-genre dependencies are explicitly modeled using a label co-occurrence graph, while contextual representations are derived from pretrained language models applied to the filtered textual content. To facilitate systematic evaluation, we curate a new hierarchical book genre dataset. Extensive experiments demonstrate that HiGeMine consistently outperformed strong baselines across hierarchical genre classification tasks. The proposed framework offers a principled and effective solution for leveraging both structured and unstructured textual data in hierarchical book genre analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21081",
        "abs_url": "https://arxiv.org/abs/2512.21081",
        "pdf_url": "https://arxiv.org/pdf/2512.21081",
        "title": "Dyna-Style Reinforcement Learning Modeling and Control of Non-linear Dynamics",
        "authors": [
            "Karim Abdelsalam",
            "Zeyad Gamal",
            "Ayman El-Badawy"
        ],
        "comments": "",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "Controlling systems with complex, nonlinear dynamics poses a significant challenge, particularly in achieving efficient and robust control. In this paper, we propose a Dyna-Style Reinforcement Learning control framework that integrates Sparse Identification of Nonlinear Dynamics (SINDy) with Twin Delayed Deep Deterministic Policy Gradient (TD3) reinforcement learning. SINDy is used to identify a data-driven model of the system, capturing its key dynamics without requiring an explicit physical model. This identified model is used to generate synthetic rollouts that are periodically injected into the reinforcement learning replay buffer during training on the real environment, enabling efficient policy learning with limited data available. By leveraging this hybrid approach, we mitigate the sample inefficiency of traditional model-free reinforcement learning methods while ensuring accurate control of nonlinear systems. To demonstrate the effectiveness of this framework, we apply it to a bi-rotor system as a case study, evaluating its performance in stabilization and trajectory tracking. The results show that our SINDy-TD3 approach achieves superior accuracy and robustness compared to direct reinforcement learning techniques, highlighting the potential of combining data-driven modeling with reinforcement learning for complex dynamical systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21106",
        "abs_url": "https://arxiv.org/abs/2512.21106",
        "pdf_url": "https://arxiv.org/pdf/2512.21106",
        "title": "Semantic Refinement with LLMs for Graph Representations",
        "authors": [
            "Safal Thapaliya",
            "Zehong Wang",
            "Jiazheng Li",
            "Ziming Li",
            "Yanfang Ye",
            "Chuxu Zhang"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Graph-structured data exhibit substantial heterogeneity in where their predictive signals originate: in some domains, node-level semantics dominate, while in others, structural patterns play a central role. This structure-semantics heterogeneity implies that no graph learning model with a fixed inductive bias can generalize optimally across diverse graph domains. However, most existing methods address this challenge from the model side by incrementally injecting new inductive biases, which remains fundamentally limited given the open-ended diversity of real-world graphs. In this work, we take a data-centric perspective and treat node semantics as a task-adaptive variable. We propose a Data-Adaptive Semantic Refinement framework DAS for graph representation learning, which couples a fixed graph neural network (GNN) and a large language model (LLM) in a closed feedback loop. The GNN provides implicit supervisory signals to guide the semantic refinement of LLM, and the refined semantics are fed back to update the same graph learner. We evaluate our approach on both text-rich and text-free graphs. Results show consistent improvements on structure-dominated graphs while remaining competitive on semantics-rich graphs, demonstrating the effectiveness of data-centric semantic adaptation under structure-semantics heterogeneity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21132",
        "abs_url": "https://arxiv.org/abs/2512.21132",
        "pdf_url": "https://arxiv.org/pdf/2512.21132",
        "title": "AutoBaxBuilder: Bootstrapping Code Security Benchmarking",
        "authors": [
            "Tobias von Arx",
            "Niels Mündler",
            "Mark Vero",
            "Maximilian Baader",
            "Martin Vechev"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Programming Languages (cs.PL)",
        "abstract": "As LLMs see wide adoption in software engineering, the reliable assessment of the correctness and security of LLM-generated code is crucial. Notably, prior work has demonstrated that security is often overlooked, exposing that LLMs are prone to generating code with security vulnerabilities. These insights were enabled by specialized benchmarks, crafted through significant manual effort by security experts. However, relying on manually-crafted benchmarks is insufficient in the long term, because benchmarks (i) naturally end up contaminating training data, (ii) must extend to new tasks to provide a more complete picture, and (iii) must increase in difficulty to challenge more capable LLMs. In this work, we address these challenges and present AutoBaxBuilder, a framework that generates tasks and tests for code security benchmarking from scratch. We introduce a robust pipeline with fine-grained plausibility checks, leveraging the code understanding capabilities of LLMs to construct functionality tests and end-to-end security-probing exploits. To confirm the quality of the generated benchmark, we conduct both a qualitative analysis and perform quantitative experiments, comparing it against tasks constructed by human experts. We use AutoBaxBuilder to construct entirely new tasks and release them to the public as AutoBaxBench, together with a thorough evaluation of the security capabilities of LLMs on these tasks. We find that a new task can be generated in under 2 hours, costing less than USD 10.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21153",
        "abs_url": "https://arxiv.org/abs/2512.21153",
        "pdf_url": "https://arxiv.org/pdf/2512.21153",
        "title": "ElfCore: A 28nm Neural Processor Enabling Dynamic Structured Sparse Training and Online Self-Supervised Learning with Activity-Dependent Weight Update",
        "authors": [
            "Zhe Su",
            "Giacomo Indiveri"
        ],
        "comments": "This paper has been published in the proceedings of the 2025 IEEE European Solid-State Electronics Research Conference (ESSERC)",
        "subjects": "Hardware Architecture (cs.AR); Machine Learning (cs.LG)",
        "abstract": "In this paper, we present ElfCore, a 28nm digital spiking neural network processor tailored for event-driven sensory signal processing. ElfCore is the first to efficiently integrate: (1) a local online self-supervised learning engine that enables multi-layer temporal learning without labeled inputs; (2) a dynamic structured sparse training engine that supports high-accuracy sparse-to-sparse learning; and (3) an activity-dependent sparse weight update mechanism that selectively updates weights based solely on input activity and network dynamics. Demonstrated on tasks including gesture recognition, speech, and biomedical signal processing, ElfCore outperforms state-of-the-art solutions with up to 16X lower power consumption, 3.8X reduced on-chip memory requirements, and 5.9X greater network capacity efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21166",
        "abs_url": "https://arxiv.org/abs/2512.21166",
        "pdf_url": "https://arxiv.org/pdf/2512.21166",
        "title": "A Community-Enhanced Graph Representation Model for Link Prediction",
        "authors": [
            "Lei Wang",
            "Darong Lai"
        ],
        "comments": "",
        "subjects": "Social and Information Networks (cs.SI); Machine Learning (cs.LG)",
        "abstract": "Although Graph Neural Networks (GNNs) have become the dominant approach for graph representation learning, their performance on link prediction tasks does not always surpass that of traditional heuristic methods such as Common Neighbors and Jaccard Coefficient. This is mainly because existing GNNs tend to focus on learning local node representations, making it difficult to effectively capture structural relationships between node pairs. Furthermore, excessive reliance on local neighborhood information can lead to over-smoothing. Prior studies have shown that introducing global structural encoding can partially alleviate this issue. To address these limitations, we propose a Community-Enhanced Link Prediction (CELP) framework that incorporates community structure to jointly model local and global graph topology. Specifically, CELP enhances the graph via community-aware, confidence-guided edge completion and pruning, while integrating multi-scale structural features to achieve more accurate link prediction. Experimental results across multiple benchmark datasets demonstrate that CELP achieves superior performance, validating the crucial role of community structure in improving link prediction accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21211",
        "abs_url": "https://arxiv.org/abs/2512.21211",
        "pdf_url": "https://arxiv.org/pdf/2512.21211",
        "title": "Causal-driven attribution (CDA): Estimating channel influence without user-level data",
        "authors": [
            "Georgios Filippou",
            "Boi Mai Quach",
            "Diana Lenghel",
            "Arthur White",
            "Ashish Kumar Jha"
        ],
        "comments": "42 pages, 8 figures, submitted initially to the journal of the academy of marketing science on 24th Dec 2025",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Attribution modelling lies at the heart of marketing effectiveness, yet most existing approaches depend on user-level path data, which are increasingly inaccessible due to privacy regulations and platform restrictions. This paper introduces a Causal-Driven Attribution (CDA) framework that infers channel influence using only aggregated impression-level data, avoiding any reliance on user identifiers or click-path tracking. CDA integrates temporal causal discovery (using PCMCI) with causal effect estimation via a Structural Causal Model to recover directional channel relationships and quantify their contributions to conversions. Using large-scale synthetic data designed to replicate real marketing dynamics, we show that CDA achieves an average relative RMSE of 9.50% when given the true causal graph, and 24.23% when using the predicted graph, demonstrating strong accuracy under correct structure and meaningful signal recovery even under structural uncertainty. CDA captures cross-channel interdependencies while providing interpretable, privacy-preserving attribution insights, offering a scalable and future-proof alternative to traditional path-based models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21238",
        "abs_url": "https://arxiv.org/abs/2512.21238",
        "pdf_url": "https://arxiv.org/pdf/2512.21238",
        "title": "Assessing the Software Security Comprehension of Large Language Models",
        "authors": [
            "Mohammed Latif Siddiq",
            "Natalie Sekerak",
            "Antonio Karam",
            "Maria Leal",
            "Arvin Islam-Gomes",
            "Joanna C. S. Santos"
        ],
        "comments": "Submitted to Empirical Software Engineering (EMSE) journal",
        "subjects": "Software Engineering (cs.SE); Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) are increasingly used in software development, but their level of software security expertise remains unclear. This work systematically evaluates the security comprehension of five leading LLMs: GPT-4o-Mini, GPT-5-Mini, Gemini-2.5-Flash, Llama-3.1, and Qwen-2.5, using Blooms Taxonomy as a framework. We assess six cognitive dimensions: remembering, understanding, applying, analyzing, evaluating, and creating. Our methodology integrates diverse datasets, including curated multiple-choice questions, vulnerable code snippets (SALLM), course assessments from an Introduction to Software Security course, real-world case studies (XBOW), and project-based creation tasks from a Secure Software Engineering course. Results show that while LLMs perform well on lower-level cognitive tasks such as recalling facts and identifying known vulnerabilities, their performance degrades significantly on higher-order tasks that require reasoning, architectural evaluation, and secure system creation. Beyond reporting aggregate accuracy, we introduce a software security knowledge boundary that identifies the highest cognitive level at which a model consistently maintains reliable performance. In addition, we identify 51 recurring misconception patterns exhibited by LLMs across Blooms levels.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21243",
        "abs_url": "https://arxiv.org/abs/2512.21243",
        "pdf_url": "https://arxiv.org/pdf/2512.21243",
        "title": "LookPlanGraph: Embodied Instruction Following Method with VLM Graph Augmentation",
        "authors": [
            "Anatoly O. Onishchenko",
            "Alexey K. Kovalev",
            "Aleksandr I. Panov"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Methods that use Large Language Models (LLM) as planners for embodied instruction following tasks have become widespread. To successfully complete tasks, the LLM must be grounded in the environment in which the robot operates. One solution is to use a scene graph that contains all the necessary information. Modern methods rely on prebuilt scene graphs and assume that all task-relevant information is available at the start of planning. However, these approaches do not account for changes in the environment that may occur between the graph construction and the task execution. We propose LookPlanGraph - a method that leverages a scene graph composed of static assets and object priors. During plan execution, LookPlanGraph continuously updates the graph with relevant objects, either by verifying existing priors or discovering new entities. This is achieved by processing the agents egocentric camera view using a Vision Language Model. We conducted experiments with changed object positions VirtualHome and OmniGibson simulated environments, demonstrating that LookPlanGraph outperforms methods based on predefined static scene graphs. To demonstrate the practical applicability of our approach, we also conducted experiments in a real-world setting. Additionally, we introduce the GraSIF (Graph Scenes for Instruction Following) dataset with automated validation framework, comprising 514 tasks drawn from SayPlan Office, BEHAVIOR-1K, and VirtualHome RobotHow. Project page available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21319",
        "abs_url": "https://arxiv.org/abs/2512.21319",
        "pdf_url": "https://arxiv.org/pdf/2512.21319",
        "title": "Variationally correct operator learning: Reduced basis neural operator with a posteriori error estimation",
        "authors": [
            "Yuan Qiu",
            "Wolfgang Dahmen",
            "Peng Chen"
        ],
        "comments": "",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "Minimizing PDE-residual losses is a common strategy to promote physical consistency in neural operators. However, standard formulations often lack variational correctness, meaning that small residuals do not guarantee small solution errors due to the use of non-compliant norms or ad hoc penalty terms for boundary conditions. This work develops a variationally correct operator learning framework by constructing first-order system least-squares (FOSLS) objectives whose values are provably equivalent to the solution error in PDE-induced norms. We demonstrate this framework on stationary diffusion and linear elasticity, incorporating mixed Dirichlet-Neumann boundary conditions via variational lifts to preserve norm equivalence without inconsistent penalties. To ensure the function space conformity required by the FOSLS loss, we propose a Reduced Basis Neural Operator (RBNO). The RBNO predicts coefficients for a pre-computed, conforming reduced basis, thereby ensuring variational stability by design while enabling efficient training. We provide a rigorous convergence analysis that bounds the total error by the sum of finite element discretization bias, reduced basis truncation error, neural network approximation error, and statistical estimation errors arising from finite sampling and optimization. Numerical benchmarks validate these theoretical bounds and demonstrate that the proposed approach achieves superior accuracy in PDE-compliant norms compared to standard baselines, while the residual loss serves as a reliable, computable a posteriori error estimator.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21323",
        "abs_url": "https://arxiv.org/abs/2512.21323",
        "pdf_url": "https://arxiv.org/pdf/2512.21323",
        "title": "Parallel Token Prediction for Language Models",
        "authors": [
            "Felix Draxler",
            "Justus Will",
            "Farrin Marouf Sofian",
            "Theofanis Karaletsos",
            "Sameer Singh",
            "Stephan Mandt"
        ],
        "comments": "Preprint. Under review",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "We propose Parallel Token Prediction (PTP), a universal framework for parallel sequence generation in language models. PTP jointly predicts multiple dependent tokens in a single transformer call by incorporating the sampling procedure into the model. This reduces the latency bottleneck of autoregressive decoding, and avoids the restrictive independence assumptions common in existing multi-token prediction methods. We prove that PTP can represent arbitrary autoregressive sequence distributions. PTP is trained either by distilling an existing model or through inverse autoregressive training without a teacher. Experimentally, we achieve state-of-the-art speculative decoding performance on Vicuna-7B by accepting over four tokens per step on Spec-Bench. The universality of our framework indicates that parallel generation of long sequences is feasible without loss of modeling power.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-12-25",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-25?abs=True",
        "arxiv_id": "2512.21335",
        "abs_url": "https://arxiv.org/abs/2512.21335",
        "pdf_url": "https://arxiv.org/pdf/2512.21335",
        "title": "Autonomous Uncertainty Quantification for Computational Point-of-care Sensors",
        "authors": [
            "Artem Goncharov",
            "Rajesh Ghosh",
            "Hyou-Arm Joung",
            "Dino Di Carlo",
            "Aydogan Ozcan"
        ],
        "comments": "18 Pages, 5 Figures",
        "subjects": "Medical Physics (physics.med-ph); Machine Learning (cs.LG); Applied Physics (physics.app-ph); Biological Physics (physics.bio-ph)",
        "abstract": "Computational point-of-care (POC) sensors enable rapid, low-cost, and accessible diagnostics in emergency, remote and resource-limited areas that lack access to centralized medical facilities. These systems can utilize neural network-based algorithms to accurately infer a diagnosis from the signals generated by rapid diagnostic tests or sensors. However, neural network-based diagnostic models are subject to hallucinations and can produce erroneous predictions, posing a risk of misdiagnosis and inaccurate clinical decisions. To address this challenge, here we present an autonomous uncertainty quantification technique developed for POC diagnostics. As our testbed, we used a paper-based, computational vertical flow assay (xVFA) platform developed for rapid POC diagnosis of Lyme disease, the most prevalent tick-borne disease globally. The xVFA platform integrates a disposable paper-based assay, a handheld optical reader and a neural network-based inference algorithm, providing rapid and cost-effective Lyme disease diagnostics in under 20 min using only 20 uL of patient serum. By incorporating a Monte Carlo dropout (MCDO)-based uncertainty quantification approach into the diagnostics pipeline, we identified and excluded erroneous predictions with high uncertainty, significantly improving the sensitivity and reliability of the xVFA in an autonomous manner, without access to the ground truth diagnostic information of patients. Blinded testing using new patient samples demonstrated an increase in diagnostic sensitivity from 88.2% to 95.7%, indicating the effectiveness of MCDO-based uncertainty quantification in enhancing the robustness of neural network-driven computational POC sensing systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]