[
    {
        "order": 1,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05216",
        "abs_url": "https://arxiv.org/abs/2512.05216",
        "pdf_url": "https://arxiv.org/pdf/2512.05216",
        "title": "Coefficient of Variation Masking: A Volatility-Aware Strategy for EHR Foundation Models",
        "authors": [
            "Rajna Fani",
            "Rafi Al Attrach",
            "David Restrepo",
            "Yugang Jia",
            "Leo Anthony Celi",
            "Peter Schüffler"
        ],
        "comments": "16 pages, 9 figures, 1 table, 1 algorithm. Accepted at Machine Learning for Health (ML4H) 2025, Proceedings of the Machine Learning Research (PMLR)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Masked autoencoders (MAEs) are increasingly applied to electronic health records (EHR) for learning general-purpose representations that support diverse clinical tasks. However, existing approaches typically rely on uniform random masking, implicitly assuming all features are equally predictable. In reality, laboratory tests exhibit substantial heterogeneity in volatility: some biomarkers (e.g., sodium) remain stable, while others (e.g., lactate) fluctuate considerably and are more difficult to model. Clinically, volatile biomarkers often signal acute pathophysiology and require more sophisticated modeling to capture their complex temporal patterns. We propose a volatility-aware pretraining strategy, Coefficient of Variation Masking (CV-Masking), that adaptively adjusts masking probabilities according to the intrinsic variability of each feature. Combined with a value-only masking objective aligned with clinical workflows, CV-Masking yields systematic improvements over random and variance-based strategies. Experiments on a large panel of laboratory tests show that CV-Masking enhances reconstruction, improves downstream predictive performance, and accelerates convergence, producing more robust and clinically meaningful EHR representations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05217",
        "abs_url": "https://arxiv.org/abs/2512.05217",
        "pdf_url": "https://arxiv.org/pdf/2512.05217",
        "title": "Rethinking Tokenization for Clinical Time Series: When Less is More",
        "authors": [
            "Rafi Al Attrach",
            "Rajna Fani",
            "David Restrepo",
            "Yugang Jia",
            "Peter Schüffler"
        ],
        "comments": "9 pages, 2 figures, 4 tables. Machine Learning for Health (ML4H) 2025, Findings track",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Tokenization strategies shape how models process electronic health records, yet fair comparisons of their effectiveness remain limited. We present a systematic evaluation of tokenization approaches for clinical time series modeling using transformer-based architectures, revealing task-dependent and sometimes counterintuitive findings about temporal and value feature importance. Through controlled ablations across four clinical prediction tasks on MIMIC-IV, we demonstrate that explicit time encodings provide no consistent statistically significant benefit for the evaluated downstream tasks. Value features show task-dependent importance, affecting mortality prediction but not readmission, suggesting code sequences alone can carry sufficient predictive signal. We further show that frozen pretrained code encoders dramatically outperform their trainable counterparts while requiring dramatically fewer parameters. Larger clinical encoders provide consistent improvements across tasks, benefiting from frozen embeddings that eliminate computational overhead. Our controlled evaluation enables fairer tokenization comparisons and demonstrates that simpler, parameter-efficient approaches can, in many cases, achieve strong performance, though the optimal tokenization strategy remains task-dependent.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05222",
        "abs_url": "https://arxiv.org/abs/2512.05222",
        "pdf_url": "https://arxiv.org/pdf/2512.05222",
        "title": "Mitigating the Antigenic Data Bottleneck: Semi-supervised Learning with Protein Language Models for Influenza A Surveillance",
        "authors": [
            "Yanhua Xu"
        ],
        "comments": "V0: initial draft uploaded",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Influenza A viruses (IAVs) evolve antigenically at a pace that requires frequent vaccine updates, yet the haemagglutination inhibition (HI) assays used to quantify antigenicity are labor-intensive and unscalable. As a result, genomic data vastly outpace available phenotypic labels, limiting the effectiveness of traditional supervised models. We hypothesize that combining pre-trained Protein Language Models (PLMs) with Semi-Supervised Learning (SSL) can retain high predictive accuracy even when labeled data are scarce. We evaluated two SSL strategies, Self-training and Label Spreading, against fully supervised baselines using four PLM-derived embeddings (ESM-2, ProtVec, ProtT5, ProtBert) applied to haemagglutinin (HA) sequences. A nested cross-validation framework simulated low-label regimes (25%, 50%, 75%, and 100% label availability) across four IAV subtypes (H1N1, H3N2, H5N1, H9N2). SSL consistently improved performance under label scarcity. Self-training with ProtVec produced the largest relative gains, showing that SSL can compensate for lower-resolution representations. ESM-2 remained highly robust, achieving F1 scores above 0.82 with only 25% labeled data, indicating that its embeddings capture key antigenic determinants. While H1N1 and H9N2 were predicted with high accuracy, the hypervariable H3N2 subtype remained challenging, although SSL mitigated the performance decline. These findings demonstrate that integrating PLMs with SSL can address the antigenicity labeling bottleneck and enable more effective use of unlabeled surveillance sequences, supporting rapid variant prioritization and timely vaccine strain selection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05226",
        "abs_url": "https://arxiv.org/abs/2512.05226",
        "pdf_url": "https://arxiv.org/pdf/2512.05226",
        "title": "Variance Matters: Improving Domain Adaptation via Stratified Sampling",
        "authors": [
            "Andrea Napoli",
            "Paul White"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Domain shift remains a key challenge in deploying machine learning models to the real world. Unsupervised domain adaptation (UDA) aims to address this by minimising domain discrepancy during training, but the discrepancy estimates suffer from high variance in stochastic settings, which can stifle the theoretical benefits of the method. This paper proposes Variance-Reduced Domain Adaptation via Stratified Sampling (VaRDASS), the first specialised stochastic variance reduction technique for UDA. We consider two specific discrepancy measures -- correlation alignment and the maximum mean discrepancy (MMD) -- and derive ad hoc stratification objectives for these terms. We then present expected and worst-case error bounds, and prove that our proposed objective for the MMD is theoretically optimal (i.e., minimises the variance) under certain assumptions. Finally, a practical k-means style optimisation algorithm is introduced and analysed. Experiments on three domain shift datasets demonstrate improved discrepancy estimation accuracy and target domain performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05238",
        "abs_url": "https://arxiv.org/abs/2512.05238",
        "pdf_url": "https://arxiv.org/pdf/2512.05238",
        "title": "Edged Weisfeiler-Lehman Algorithm",
        "authors": [
            "Xiao Yue",
            "Bo Liu",
            "Feng Zhang",
            "Guangzhi Qu"
        ],
        "comments": "Author's Accepted Manuscript (AAM) of ICANN 2024 paper published in LNCS (Springer). Final version available at: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As a classical approach on graph learning, the propagation-aggregation methodology is widely exploited by many of Graph Neural Networks (GNNs), wherein the representation of a node is updated by aggregating representations from itself and neighbor nodes recursively. Similar to the propagation-aggregation methodology, the Weisfeiler-Lehman (1-WL) algorithm tests isomorphism through color refinement according to color representations of a node and its neighbor nodes. However, 1-WL does not leverage any edge features (labels), presenting a potential improvement on exploiting edge features in some fields. To address this limitation, we proposed a novel Edged-WL algorithm (E-WL) which extends the original 1-WL algorithm to incorporate edge features. Building upon the E-WL algorithm, we also introduce an Edged Graph Isomorphism Network (EGIN) model for further exploiting edge features, which addresses one key drawback in many GNNs that do not utilize any edge features of graph data. We evaluated the performance of proposed models using 12 edge-featured benchmark graph datasets and compared them with some state-of-the-art baseline models. Experimental results indicate that our proposed EGIN models, in general, demonstrate superior performance in graph learning on graph classification tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05241",
        "abs_url": "https://arxiv.org/abs/2512.05241",
        "pdf_url": "https://arxiv.org/pdf/2512.05241",
        "title": "Bridging quantum and classical computing for partial differential equations through multifidelity machine learning",
        "authors": [
            "Bruno Jacob",
            "Amanda A. Howard",
            "Panos Stinis"
        ],
        "comments": "19 pages, 12 figures",
        "subjects": "Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Quantum algorithms for partial differential equations (PDEs) face severe practical constraints on near-term hardware: limited qubit counts restrict spatial resolution to coarse grids, while circuit depth limitations prevent accurate long-time integration. These hardware bottlenecks confine quantum PDE solvers to low-fidelity regimes despite their theoretical potential for computational speedup. We introduce a multifidelity learning framework that corrects coarse quantum solutions to high-fidelity accuracy using sparse classical training data, facilitating the path toward practical quantum utility for scientific computing. The approach trains a low-fidelity surrogate on abundant quantum solver outputs, then learns correction mappings through a multifidelity neural architecture that balances linear and nonlinear transformations. Demonstrated on benchmark nonlinear PDEs including viscous Burgers equation and incompressible Navier-Stokes flows via quantum lattice Boltzmann methods, the framework successfully corrects coarse quantum predictions and achieves temporal extrapolation well beyond the classical training window. This strategy illustrates how one can reduce expensive high-fidelity simulation requirements while producing predictions that are competitive with classical accuracy. By bridging the gap between hardware-limited quantum simulations and application requirements, this work establishes a pathway for extracting computational value from current quantum devices in real-world scientific applications, advancing both algorithm development and practical deployment of near-term quantum computing for computational physics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05254",
        "abs_url": "https://arxiv.org/abs/2512.05254",
        "pdf_url": "https://arxiv.org/pdf/2512.05254",
        "title": "When unlearning is free: leveraging low influence points to reduce computational costs",
        "authors": [
            "Anat Kleiman",
            "Robert Fisher",
            "Ben Deaner",
            "Udi Wieder"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As concerns around data privacy in machine learning grow, the ability to unlearn, or remove, specific data points from trained models becomes increasingly important. While state of the art unlearning methods have emerged in response, they typically treat all points in the forget set equally. In this work, we challenge this approach by asking whether points that have a negligible impact on the model's learning need to be removed. Through a comparative analysis of influence functions across language and vision tasks, we identify subsets of training data with negligible impact on model outputs. Leveraging this insight, we propose an efficient unlearning framework that reduces the size of datasets before unlearning leading to significant computational savings (up to approximately 50 percent) on real world empirical examples.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05287",
        "abs_url": "https://arxiv.org/abs/2512.05287",
        "pdf_url": "https://arxiv.org/pdf/2512.05287",
        "title": "DMAGT: Unveiling miRNA-Drug Associations by Integrating SMILES and RNA Sequence Structures through Graph Transformer Models",
        "authors": [
            "Ziqi Zhang"
        ],
        "comments": "9 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "MiRNAs, due to their role in gene regulation, have paved a new pathway for pharmacology, focusing on drug development that targets miRNAs. However, traditional wet lab experiments are limited by efficiency and cost constraints, making it difficult to extensively explore potential associations between developed drugs and target miRNAs. Therefore, we have designed a novel machine learning model based on a multi-layer transformer-based graph neural network, DMAGT, specifically for predicting associations between drugs and miRNAs. This model transforms drug-miRNA associations into graphs, employs Word2Vec for embedding features of drug molecular structures and miRNA base structures, and leverages a graph transformer model to learn from embedded features and relational structures, ultimately predicting associations between drugs and miRNAs. To evaluate DMAGT, we tested its performance on three datasets composed of drug-miRNA associations: ncDR, RNAInter, and SM2miR, achieving up to AUC of $95.24\\pm0.05$. DMAGT demonstrated superior performance in comparative experiments tackling similar challenges. To validate its practical efficacy, we specifically focused on two drugs, namely 5-Fluorouracil and Oxaliplatin. Of the 20 potential drug-miRNA associations identified as the most likely, 14 were successfully validated. The above experiments demonstrate that DMAGT has an excellent performance and stability in predicting drug-miRNA associations, providing a new shortcut for miRNA drug development.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05291",
        "abs_url": "https://arxiv.org/abs/2512.05291",
        "pdf_url": "https://arxiv.org/pdf/2512.05291",
        "title": "Bridging Interpretability and Optimization: Provably Attribution-Weighted Actor-Critic in Reproducing Kernel Hilbert Spaces",
        "authors": [
            "Na Li",
            "Hangguan Shan",
            "Wei Ni",
            "Wenjie Zhang",
            "Xinyu Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Actor-critic (AC) methods are a cornerstone of reinforcement learning (RL) but offer limited interpretability. Current explainable RL methods seldom use state attributions to assist training. Rather, they treat all state features equally, thereby neglecting the heterogeneous impacts of individual state dimensions on the reward. We propose RKHS--SHAP-based Advanced Actor--Critic (RSA2C), an attribution-aware, kernelized, two-timescale AC algorithm, including Actor, Value Critic, and Advantage Critic. The Actor is instantiated in a vector-valued reproducing kernel Hilbert space (RKHS) with a Mahalanobis-weighted operator-valued kernel, while the Value Critic and Advantage Critic reside in scalar RKHSs. These RKHS-enhanced components use sparsified dictionaries: the Value Critic maintains its own dictionary, while the Actor and Advantage Critic share one. State attributions, computed from the Value Critic via RKHS--SHAP (kernel mean embedding for on-manifold expectations and conditional mean embedding for off-manifold expectations), are converted into Mahalanobis-gated weights that modulate Actor gradients and Advantage Critic targets. Theoretically, we derive a global, non-asymptotic convergence bound under state perturbations, showing stability through the perturbation-error term and efficiency through the convergence-error term. Empirical results on three standard continuous-control environments show that our algorithm achieves efficiency, stability, and interpretability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05306",
        "abs_url": "https://arxiv.org/abs/2512.05306",
        "pdf_url": "https://arxiv.org/pdf/2512.05306",
        "title": "Uncertainty Quantification for Scientific Machine Learning using Sparse Variational Gaussian Process Kolmogorov-Arnold Networks (SVGP KAN)",
        "authors": [
            "Y. Sungtaek Ju"
        ],
        "comments": "20 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Kolmogorov-Arnold Networks have emerged as interpretable alternatives to traditional multi-layer perceptrons. However, standard implementations lack principled uncertainty quantification capabilities essential for many scientific applications. We present a framework integrating sparse variational Gaussian process inference with the Kolmogorov-Arnold topology, enabling scalable Bayesian inference with computational complexity quasi-linear in sample size. Through analytic moment matching, we propagate uncertainty through deep additive structures while maintaining interpretability. We use three example studies to demonstrate the framework's ability to distinguish aleatoric from epistemic uncertainty: calibration of heteroscedastic measurement noise in fluid flow reconstruction, quantification of prediction confidence degradation in multi-step forecasting of advection-diffusion dynamics, and out-of-distribution detection in convolutional autoencoders. These results suggest Sparse Variational Gaussian Process Kolmogorov-Arnold Networks (SVGP KANs) is a promising architecture for uncertainty-aware learning in scientific machine learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05320",
        "abs_url": "https://arxiv.org/abs/2512.05320",
        "pdf_url": "https://arxiv.org/pdf/2512.05320",
        "title": "Enhancing Deep Deterministic Policy Gradients on Continuous Control Tasks with Decoupled Prioritized Experience Replay",
        "authors": [
            "Mehmet Efe Lorasdagi",
            "Dogan Can Cicek",
            "Furkan Burak Mutlu",
            "Suleyman Serdar Kozat"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Background: Deep Deterministic Policy Gradient-based reinforcement learning algorithms utilize Actor-Critic architectures, where both networks are typically trained using identical batches of replayed transitions. However, the learning objectives and update dynamics of the Actor and Critic differ, raising concerns about whether uniform transition usage is optimal. Objectives: We aim to improve the performance of deep deterministic policy gradient algorithms by decoupling the transition batches used to train the Actor and the Critic. Our goal is to design an experience replay mechanism that provides appropriate learning signals to each component by using separate, tailored batches. Methods: We introduce Decoupled Prioritized Experience Replay (DPER), a novel approach that allows independent sampling of transition batches for the Actor and the Critic. DPER can be integrated into any off-policy deep reinforcement learning algorithm that operates in continuous control domains. We combine DPER with the state-of-the-art Twin Delayed DDPG algorithm and evaluate its performance across standard continuous control benchmarks. Results: DPER outperforms conventional experience replay strategies such as vanilla experience replay and prioritized experience replay in multiple MuJoCo tasks from the OpenAI Gym suite. Conclusions: Our findings show that decoupling experience replay for Actor and Critic networks can enhance training dynamics and final policy quality. DPER offers a generalizable mechanism that enhances performance for a wide class of actor-critic off-policy reinforcement learning algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05327",
        "abs_url": "https://arxiv.org/abs/2512.05327",
        "pdf_url": "https://arxiv.org/pdf/2512.05327",
        "title": "Non-Convex Federated Optimization under Cost-Aware Client Selection",
        "authors": [
            "Xiaowen Jiang",
            "Anton Rodomanov",
            "Sebastian U. Stich"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Different federated optimization algorithms typically employ distinct client-selection strategies: some methods communicate only with a randomly sampled subset of clients at each round, while others need to periodically communicate with all clients or use a hybrid scheme that combines both strategies. However, existing metrics for comparing optimization methods typically do not distinguish between these strategies, which often incur different communication costs in practice. To address this disparity, we introduce a simple and natural model of federated optimization that quantifies communication and local computation complexities. This new model allows for several commonly used client-selection strategies and explicitly associates each with a distinct cost. Within this setting, we propose a new algorithm that achieves the best-known communication and local complexities among existing federated optimization methods for non-convex optimization. This algorithm is based on the inexact composite gradient method with a carefully constructed gradient estimator and a special procedure for solving the auxiliary subproblem at each iteration. The gradient estimator is based on SAGA, a popular variance-reduced gradient estimator. We first derive a new variance bound for it, showing that SAGA can exploit functional similarity. We then introduce the Recursive-Gradient technique as a general way to potentially improve the error bound of a given conditionally unbiased gradient estimator, including both SAGA and SVRG. By applying this technique to SAGA, we obtain a new estimator, RG-SAGA, which has an improved error bound compared to the original one.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05336",
        "abs_url": "https://arxiv.org/abs/2512.05336",
        "pdf_url": "https://arxiv.org/pdf/2512.05336",
        "title": "PathFinder: MCTS and LLM Feedback-based Path Selection for Multi-Hop Question Answering",
        "authors": [
            "Durga Prasad Maram",
            "Kalpa Gunaratna",
            "Vijay Srinivasan",
            "Haris Jeelani",
            "Srinivas Chappidi"
        ],
        "comments": "5 PAGES, 3 IMAGES",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multi-hop question answering is a challenging task in which language models must reason over multiple steps to reach the correct answer. With the help of Large Language Models and their reasoning capabilities, existing systems are able to think and decompose an input question over multiple steps to analyze, retrieve, and reason. However, training-based approaches for this problem still suffer from LLM hallucinations and incorrect reasoning paths that hinder performance. Hence, we propose PATHFINDER, an approach that: (i) uses Monte Carlo Tree Search to generate training path traces, (ii) improves training data quality by filtering erroneous and lengthy traces using sub-answer recall and LLM-as-a-judge verification, and (iii) reformulates sub-queries to handle failed retrieval cases. By following these steps, we demonstrate that PATHFINDER improves the performance of multi-hop QA over public benchmark datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05339",
        "abs_url": "https://arxiv.org/abs/2512.05339",
        "pdf_url": "https://arxiv.org/pdf/2512.05339",
        "title": "Taxonomy-Adaptive Moderation Model with Robust Guardrails for Large Language Models",
        "authors": [
            "Mahesh Kumar Nandwana",
            "Youngwan Lim",
            "Joseph Liu",
            "Alex Yang",
            "Varun Notibala",
            "Nishchaie Khanna"
        ],
        "comments": "To be presented at AAAI-26 PerFM Workshop",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) are typically aligned for safety during the post-training phase; however, they may still generate inappropriate outputs that could potentially pose risks to users. This challenge underscores the need for robust safeguards that operate across both model inputs and outputs. In this work, we introduce Roblox Guard 1.0, a state-of-the-art instruction fine-tuned LLM designed to enhance the safety of LLM systems through comprehensive input-output moderation, using a pipeline of LLMs to enhance moderation capability. Built on the Llama-3.1-8B-Instruct backbone, our model is instruction fine-tuned to generalize across previously unseen safety taxonomies and demonstrates strong performance on out-of-domain safety benchmarks. The instruction fine-tuning process uses a mix of synthetic and open-source safety datasets, augmented with chain-of-thought (CoT) rationales and input inversion to enhance contextual understanding and decision making. To support systematic evaluation, we also release RobloxGuard-Eval, a new benchmark featuring an extensible safety taxonomy to assess the effectiveness of LLM guardrails and moderation frameworks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05341",
        "abs_url": "https://arxiv.org/abs/2512.05341",
        "pdf_url": "https://arxiv.org/pdf/2512.05341",
        "title": "When Forgetting Builds Reliability: LLM Unlearning for Reliable Hardware Code Generation",
        "authors": [
            "Yiwen Liang",
            "Qiufeng Li",
            "Shikai Wang",
            "Weidong Cao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Hardware Architecture (cs.AR)",
        "abstract": "Large Language Models (LLMs) have shown strong potential in accelerating digital hardware design through automated code generation. Yet, ensuring their reliability remains a critical challenge, as existing LLMs trained on massive heterogeneous datasets often exhibit problematic memorization of proprietary intellectual property (IP), contaminated benchmarks, and unsafe coding patterns. To mitigate these risks, we propose a novel unlearning framework tailored for LLM-based hardware code generation. Our method combines (i) a syntax-preserving unlearning strategy that safeguards the structural integrity of hardware code during forgetting, and (ii) a fine-grained floor-aware selective loss that enables precise and efficient removal of problematic knowledge. This integration achieves effective unlearning without degrading LLM code generation capabilities. Extensive experiments show that our framework supports forget sets up to 3x larger, typically requiring only a single training epoch, while preserving both syntactic correctness and functional integrity of register-transfer level (RTL) codes. Our work paves an avenue towards reliable LLM-assisted hardware design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05367",
        "abs_url": "https://arxiv.org/abs/2512.05367",
        "pdf_url": "https://arxiv.org/pdf/2512.05367",
        "title": "Enhancing Dimensionality Prediction in Hybrid Metal Halides via Feature Engineering and Class-Imbalance Mitigation",
        "authors": [
            "Mariia Karabin",
            "Isaac Armstrong",
            "Leo Beck",
            "Paulina Apanel",
            "Markus Eisenbach",
            "David B. Mitzi",
            "Hanna Terletska",
            "Hendrik Heinz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present a machine learning framework for predicting the structural dimensionality of hybrid metal halides (HMHs), including organic-inorganic perovskites, using a combination of chemically-informed feature engineering and advanced class-imbalance handling techniques. The dataset, consisting of 494 HMH structures, is highly imbalanced across dimensionality classes (0D, 1D, 2D, 3D), posing significant challenges to predictive modeling. This dataset was later augmented to 1336 via the Synthetic Minority Oversampling Technique (SMOTE) to mitigate the effects of the class imbalance. We developed interaction-based descriptors and integrated them into a multi-stage workflow that combines feature selection, model stacking, and performance optimization to improve dimensionality prediction accuracy. Our approach significantly improves F1-scores for underrepresented classes, achieving robust cross-validation performance across all dimensionalities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05377",
        "abs_url": "https://arxiv.org/abs/2512.05377",
        "pdf_url": "https://arxiv.org/pdf/2512.05377",
        "title": "China Regional 3km Downscaling Based on Residual Corrective Diffusion Model",
        "authors": [
            "Honglu Sun",
            "Hao Jing",
            "Zhixiang Dai",
            "Sa Xiao",
            "Wei Xue",
            "Jian Sun",
            "Qifeng Lu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Atmospheric and Oceanic Physics (physics.ao-ph)",
        "abstract": "A fundamental challenge in numerical weather prediction is to efficiently produce high-resolution forecasts. A common solution is applying downscaling methods, which include dynamical downscaling and statistical downscaling, to the outputs of global models. This work focuses on statistical downscaling, which establishes statistical relationships between low-resolution and high-resolution historical data using statistical models. Deep learning has emerged as a powerful tool for this task, giving rise to various high-performance super-resolution models, which can be directly applied for downscaling, such as diffusion models and Generative Adversarial Networks. This work relies on a diffusion-based downscaling framework named CorrDiff. In contrast to the original work of CorrDiff, the region considered in this work is nearly 20 times larger, and we not only consider surface variables as in the original work, but also encounter high-level variables (six pressure levels) as target downscaling variables. In addition, a global residual connection is added to improve accuracy. In order to generate the 3km forecasts for the China region, we apply our trained models to the 25km global grid forecasts of CMA-GFS, an operational global model of the China Meteorological Administration (CMA), and SFF, a data-driven deep learning-based weather model developed from Spherical Fourier Neural Operators (SFNO). CMA-MESO, a high-resolution regional model, is chosen as the baseline model. The experimental results demonstrate that the forecasts downscaled by our method generally outperform the direct forecasts of CMA-MESO in terms of MAE for the target variables. Our forecasts of radar composite reflectivity show that CorrDiff, as a generative model, can generate fine-scale details that lead to more realistic predictions compared to the corresponding deterministic regression models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05402",
        "abs_url": "https://arxiv.org/abs/2512.05402",
        "pdf_url": "https://arxiv.org/pdf/2512.05402",
        "title": "Smart Timing for Mining: A Deep Learning Framework for Bitcoin Hardware ROI Prediction",
        "authors": [
            "Sithumi Wickramasinghe",
            "Bikramjit Das",
            "Dorien Herremans"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Bitcoin mining hardware acquisition requires strategic timing due to volatile markets, rapid technological obsolescence, and protocol-driven revenue cycles. Despite mining's evolution into a capital-intensive industry, there is little guidance on when to purchase new Application-Specific Integrated Circuit (ASIC) hardware, and no prior computational frameworks address this decision problem. We address this gap by formulating hardware acquisition as a time series classification task, predicting whether purchasing ASIC machines yields profitable (Return on Investment (ROI) >= 1), marginal (0 < ROI < 1), or unprofitable (ROI <= 0) returns within one year. We propose MineROI-Net, an open source Transformer-based architecture designed to capture multi-scale temporal patterns in mining profitability. Evaluated on data from 20 ASIC miners released between 2015 and 2024 across diverse market regimes, MineROI-Net outperforms LSTM-based and TSLANet baselines, achieving 83.7% accuracy and 83.1% macro F1-score. The model demonstrates strong economic relevance, achieving 93.6% precision in detecting unprofitable periods and 98.5% precision for profitable ones, while avoiding misclassification of profitable scenarios as unprofitable and vice versa. These results indicate that MineROI-Net offers a practical, data-driven tool for timing mining hardware acquisitions, potentially reducing financial risk in capital-intensive mining operations. The model is available through: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05403",
        "abs_url": "https://arxiv.org/abs/2512.05403",
        "pdf_url": "https://arxiv.org/pdf/2512.05403",
        "title": "RevoNAD: Reflective Evolutionary Exploration for Neural Architecture Design",
        "authors": [
            "Gyusam Chang",
            "Jeongyoon Yoon",
            "Shin han yi",
            "JaeHyeok Lee",
            "Sujin Jang",
            "Sangpil Kim"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent progress in leveraging large language models (LLMs) has enabled Neural Architecture Design (NAD) systems to generate new architecture not limited from manually predefined search space. Nevertheless, LLM-driven generation remains challenging: the token-level design loop is discrete and non-differentiable, preventing feedback from smoothly guiding architectural improvement. These methods, in turn, commonly suffer from mode collapse into redundant structures or drift toward infeasible designs when constructive reasoning is not well grounded. We introduce RevoNAD, a reflective evolutionary orchestrator that effectively bridges LLM-based reasoning with feedback-aligned architectural search. First, RevoNAD presents a Multi-round Multi-expert Consensus to transfer isolated design rules into meaningful architectural clues. Then, Adaptive Reflective Exploration adjusts the degree of exploration leveraging reward variance; it explores when feedback is uncertain and refines when stability is reached. Finally, Pareto-guided Evolutionary Selection effectively promotes architectures that jointly optimize accuracy, efficiency, latency, confidence, and structural diversity. Across CIFAR10, CIFAR100, ImageNet16-120, COCO-5K, and Cityscape, RevoNAD achieves state-of-the-art performance. Ablation and transfer studies further validate the effectiveness of RevoNAD in allowing practically reliable, and deployable neural architecture design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05416",
        "abs_url": "https://arxiv.org/abs/2512.05416",
        "pdf_url": "https://arxiv.org/pdf/2512.05416",
        "title": "Sepsis Prediction Using Graph Convolutional Networks over Patient-Feature-Value Triplets",
        "authors": [
            "Bozhi Dan",
            "Di Wu",
            "Ji Xu",
            "Xiang Liu",
            "Yiziting Zhu",
            "Xin Shu",
            "Yujie Li",
            "Bin Yi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In the intensive care setting, sepsis continues to be a major contributor to patient illness and death; however, its timely detection is hindered by the complex, sparse, and heterogeneous nature of electronic health record (EHR) data. We propose Triplet-GCN, a single-branch graph convolutional model that represents each encounter as patient--feature--value triplets, constructs a bipartite EHR graph, and learns patient embeddings via a Graph Convolutional Network (GCN) followed by a lightweight multilayer perceptron (MLP). The pipeline applies type-specific preprocessing -- median imputation and standardization for numeric variables, effect coding for binary features, and mode imputation with low-dimensional embeddings for rare categorical attributes -- and initializes patient nodes with summary statistics, while retaining measurement values on edges to preserve \"who measured what and by how much\". In a retrospective, multi-center Chinese cohort (N = 648; 70/30 train--test split) drawn from three tertiary hospitals, Triplet-GCN consistently outperforms strong tabular baselines (KNN, SVM, XGBoost, Random Forest) across discrimination and balanced error metrics, yielding a more favorable sensitivity--specificity trade-off and improved overall utility for early warning. These findings indicate that encoding EHR as triplets and propagating information over a patient--feature graph produce more informative patient representations than feature-independent models, offering a simple, end-to-end blueprint for deployable sepsis risk stratification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05419",
        "abs_url": "https://arxiv.org/abs/2512.05419",
        "pdf_url": "https://arxiv.org/pdf/2512.05419",
        "title": "TS-HINT: Enhancing Semiconductor Time Series Regression Using Attention Hints From Large Language Model Reasoning",
        "authors": [
            "Jonathan Adam Rico",
            "Nagarajan Raghavan",
            "Senthilnath Jayavelu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Existing data-driven methods rely on the extraction of static features from time series to approximate the material removal rate (MRR) of semiconductor manufacturing processes such as chemical mechanical polishing (CMP). However, this leads to a loss of temporal dynamics. Moreover, these methods require a large amount of data for effective training. In this paper, we propose TS-Hint, a Time Series Foundation Model (TSFM) framework, integrated with chain-of-thought reasoning which provides attention hints during training based on attention mechanism data and saliency data. Experimental results demonstrate the effectiveness of our model in limited data settings via few-shot learning and can learn directly from multivariate time series features.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05469",
        "abs_url": "https://arxiv.org/abs/2512.05469",
        "pdf_url": "https://arxiv.org/pdf/2512.05469",
        "title": "How Ensemble Learning Balances Accuracy and Overfitting: A Bias-Variance Perspective on Tabular Data",
        "authors": [
            "Zubair Ahmed Mohammad"
        ],
        "comments": "11 pages, 9 figures, 3 tables. Code and reproducible experiments are available at: this https URL",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Ensemble models often achieve higher accuracy than single learners, but their ability to maintain small generalization gaps is not always well understood. This study examines how ensembles balance accuracy and overfitting across four tabular classification tasks: Breast Cancer, Heart Disease, Pima Diabetes, and Credit Card Fraud. Using repeated stratified cross validation with statistical significance testing, we compare linear models, a single decision tree, and nine ensemble methods. The results show that ensembles can reach high accuracy without large gaps by reducing variance through averaging or controlled boosting. On nearly linear and clean data, linear models already generalize well and ensembles offer little additional benefit. On datasets with meaningful nonlinear structure, tree based ensembles increase test accuracy by 5 to 7 points while keeping gaps below 3 percent. On noisy or highly imbalanced datasets, ensembles remain competitive but require regularization to avoid fitting noise or majority class patterns. We also compute simple dataset complexity indicators, such as linearity score, Fisher ratio, and noise estimate, which explain when ensembles are likely to control variance effectively. Overall, the study provides a clear view of how and when ensembles maintain high accuracy while keeping overfitting low, offering practical guidance for model selection in real world tabular applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05483",
        "abs_url": "https://arxiv.org/abs/2512.05483",
        "pdf_url": "https://arxiv.org/pdf/2512.05483",
        "title": "Turbulence Regression",
        "authors": [
            "Yingang Fan",
            "Binjie Ding",
            "Baiyi Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Air turbulence refers to the disordered and irregular motion state generated by drastic changes in velocity, pressure, or direction during airflow. Various complex factors lead to intricate low-altitude turbulence outcomes. Under current observational conditions, especially when using only wind profile radar data, traditional methods struggle to accurately predict turbulence states. Therefore, this paper introduces a NeuTucker decomposition model utilizing discretized data. Designed for continuous yet sparse three-dimensional wind field data, it constructs a low-rank Tucker decomposition model based on a Tucker neural network to capture the latent interactions within the three-dimensional wind field data. Therefore, two core ideas are proposed here: 1) Discretizing continuous input data to adapt to models like NeuTucF that require discrete data inputs. 2) Constructing a four-dimensional Tucker interaction tensor to represent all possible spatio-temporal interactions among different elevations and three-dimensional wind speeds. In estimating missing observations in real datasets, this discretized NeuTucF model demonstrates superior performance compared to various common regression models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05502",
        "abs_url": "https://arxiv.org/abs/2512.05502",
        "pdf_url": "https://arxiv.org/pdf/2512.05502",
        "title": "GRASP: Graph Reasoning Agents for Systems Pharmacology with Human-in-the-Loop",
        "authors": [
            "Omid Bazgir",
            "Vineeth Manthapuri",
            "Ilia Rattsev",
            "Mohammad Jafarnejad"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Quantitative Systems Pharmacology (QSP) modeling is essential for drug development but it requires significant time investment that limits the throughput of domain experts. We present \\textbf{GRASP} -- a multi-agent, graph-reasoning framework with a human-in-the-loop conversational interface -- that encodes QSP models as typed biological knowledge graphs and compiles them to executable MATLAB/SimBiology code while preserving units, mass balance, and physiological constraints. A two-phase workflow -- \\textsc{Understanding} (graph reconstruction of legacy code) and \\textsc{Action} (constraint-checked, language-driven modification) -- is orchestrated by a state machine with iterative validation. GRASP performs breadth-first parameter-alignment around new entities to surface dependent quantities and propose biologically plausible defaults, and it runs automatic execution/diagnostics until convergence. In head-to-head evaluations using LLM-as-judge, GRASP outperforms SME-guided CoT and ToT baselines across biological plausibility, mathematical correctness, structural fidelity, and code quality (\\(\\approx\\)9--10/10 vs.\\ 5--7/10). BFS alignment achieves F1 = 0.95 for dependency discovery, units, and range. These results demonstrate that graph-structured, agentic workflows can make QSP model development both accessible and rigorous, enabling domain experts to specify mechanisms in natural language without sacrificing biomedical fidelity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05526",
        "abs_url": "https://arxiv.org/abs/2512.05526",
        "pdf_url": "https://arxiv.org/pdf/2512.05526",
        "title": "Credal and Interval Deep Evidential Classifications",
        "authors": [
            "Michele Caprio",
            "Shireen K. Manchingal",
            "Fabio Cuzzolin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Statistics Theory (math.ST); Methodology (stat.ME)",
        "abstract": "Uncertainty Quantification (UQ) presents a pivotal challenge in the field of Artificial Intelligence (AI), profoundly impacting decision-making, risk assessment and model reliability. In this paper, we introduce Credal and Interval Deep Evidential Classifications (CDEC and IDEC, respectively) as novel approaches to address UQ in classification tasks. CDEC and IDEC leverage a credal set (closed and convex set of probabilities) and an interval of evidential predictive distributions, respectively, allowing us to avoid overfitting to the training data and to systematically assess both epistemic (reducible) and aleatoric (irreducible) uncertainties. When those surpass acceptable thresholds, CDEC and IDEC have the capability to abstain from classification and flag an excess of epistemic or aleatoric uncertainty, as relevant. Conversely, within acceptable uncertainty bounds, CDEC and IDEC provide a collection of labels with robust probabilistic guarantees. CDEC and IDEC are trained using standard backpropagation and a loss function that draws from the theory of evidence. They overcome the shortcomings of previous efforts, and extend the current evidential deep learning literature. Through extensive experiments on MNIST, CIFAR-10 and CIFAR-100, together with their natural OoD shifts (F-MNIST/K-MNIST, SVHN/Intel, TinyImageNet), we show that CDEC and IDEC achieve competitive predictive accuracy, state-of-the-art OoD detection under epistemic and total uncertainty, and tight, well-calibrated prediction regions that expand reliably under distribution shift. An ablation over ensemble size further demonstrates that CDEC attains stable uncertainty estimates with only a small ensemble.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05531",
        "abs_url": "https://arxiv.org/abs/2512.05531",
        "pdf_url": "https://arxiv.org/pdf/2512.05531",
        "title": "IDK-S: Incremental Distributional Kernel for Streaming Anomaly Detection",
        "authors": [
            "Yang Xu",
            "Yixiao Ma",
            "Kaifeng Zhang",
            "Zuliang Yang",
            "Kai Ming Ting"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Anomaly detection on data streams presents significant challenges, requiring methods to maintain high detection accuracy among evolving distributions while ensuring real-time efficiency. Here we introduce $\\mathcal{IDK}$-$\\mathcal{S}$, a novel $\\mathbf{I}$ncremental $\\mathbf{D}$istributional $\\mathbf{K}$ernel for $\\mathbf{S}$treaming anomaly detection that effectively addresses these challenges by creating a new dynamic representation in the kernel mean embedding framework. The superiority of $\\mathcal{IDK}$-$\\mathcal{S}$ is attributed to two key innovations. First, it inherits the strengths of the Isolation Distributional Kernel, an offline detector that has demonstrated significant performance advantages over foundational methods like Isolation Forest and Local Outlier Factor due to the use of a data-dependent kernel. Second, it adopts a lightweight incremental update mechanism that significantly reduces computational overhead compared to the naive baseline strategy of performing a full model retraining. This is achieved without compromising detection accuracy, a claim supported by its statistical equivalence to the full retrained model. Our extensive experiments on thirteen benchmarks demonstrate that $\\mathcal{IDK}$-$\\mathcal{S}$ achieves superior detection accuracy while operating substantially faster, in many cases by an order of magnitude, than existing state-of-the-art methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05534",
        "abs_url": "https://arxiv.org/abs/2512.05534",
        "pdf_url": "https://arxiv.org/pdf/2512.05534",
        "title": "On the Theoretical Foundation of Sparse Dictionary Learning in Mechanistic Interpretability",
        "authors": [
            "Yiming Tang",
            "Harshvardhan Saini",
            "Yizhen Liao",
            "Dianbo Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "As AI models achieve remarkable capabilities across diverse domains, understanding what representations they learn and how they process information has become increasingly important for both scientific progress and trustworthy deployment. Recent works in mechanistic interpretability have shown that neural networks represent meaningful concepts as directions in their representation spaces and often encode many concepts in superposition. Various sparse dictionary learning (SDL) methods, including sparse autoencoders, transcoders, and crosscoders, address this by training auxiliary models with sparsity constraints to disentangle these superposed concepts into interpretable features. These methods have demonstrated remarkable empirical success but have limited theoretical understanding. Existing theoretical work is limited to sparse autoencoders with tied-weight constraints, leaving the broader family of SDL methods without formal grounding. In this work, we develop the first unified theoretical framework considering SDL as one unified optimization problem. We demonstrate how diverse methods instantiate the theoretical framwork and provide rigorous analysis on the optimization landscape. We provide the first theoretical explanations for some empirically observed phenomena, including feature absorption, dead neurons, and the neuron resampling technique. We further design controlled experiments to validate our theoretical results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05540",
        "abs_url": "https://arxiv.org/abs/2512.05540",
        "pdf_url": "https://arxiv.org/pdf/2512.05540",
        "title": "SCoNE: Spherical Consistent Neighborhoods Ensemble for Effective and Efficient Multi-View Anomaly Detection",
        "authors": [
            "Yang Xu",
            "Hang Zhang",
            "Yixiao Ma",
            "Ye Zhu",
            "Kai Ming Ting"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The core problem in multi-view anomaly detection is to represent local neighborhoods of normal instances consistently across all views. Recent approaches consider a representation of local neighborhood in each view independently, and then capture the consistent neighbors across all views via a learning process. They suffer from two key issues. First, there is no guarantee that they can capture consistent neighbors well, especially when the same neighbors are in regions of varied densities in different views, resulting in inferior detection accuracy. Second, the learning process has a high computational cost of $\\mathcal{O}(N^2)$, rendering them inapplicable for large datasets. To address these issues, we propose a novel method termed \\textbf{S}pherical \\textbf{C}onsistent \\textbf{N}eighborhoods \\textbf{E}nsemble (SCoNE). It has two unique features: (a) the consistent neighborhoods are represented with multi-view instances directly, requiring no intermediate representations as used in existing approaches; and (b) the neighborhoods have data-dependent properties, which lead to large neighborhoods in sparse regions and small neighborhoods in dense regions. The data-dependent properties enable local neighborhoods in different views to be represented well as consistent neighborhoods, without learning. This leads to $\\mathcal{O}(N)$ time complexity. Empirical evaluations show that SCoNE has superior detection accuracy and runs orders-of-magnitude faster in large datasets than existing approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05556",
        "abs_url": "https://arxiv.org/abs/2512.05556",
        "pdf_url": "https://arxiv.org/pdf/2512.05556",
        "title": "Improving Local Fidelity Through Sampling and Modeling Nonlinearity",
        "authors": [
            "Sanjeev Shrestha",
            "Rahul Dubey",
            "Hui Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "With the increasing complexity of black-box machine learning models and their adoption in high-stakes areas, it is critical to provide explanations for their predictions. Local Interpretable Model-agnostic Explanation (LIME) is a widely used technique that explains the prediction of any classifier by learning an interpretable model locally around the predicted instance. However, it assumes that the local decision boundary is linear and fails to capture the non-linear relationships, leading to incorrect explanations. In this paper, we propose a novel method that can generate high-fidelity explanations. Multivariate adaptive regression splines (MARS) is used to model non-linear local boundaries that effectively captures the underlying behavior of the reference model, thereby enhancing the local fidelity of the explanation. Additionally, we utilize the N-ball sampling technique, which samples directly from the desired distribution instead of reweighting samples as done in LIME, further improving the faithfulness score. We evaluate our method on three UCI datasets across different classifiers and varying kernel widths. Experimental results show that our method yields more faithful explanations compared to baselines, achieving an average reduction of 37% in root mean square error, significantly improving local fidelity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05567",
        "abs_url": "https://arxiv.org/abs/2512.05567",
        "pdf_url": "https://arxiv.org/pdf/2512.05567",
        "title": "Wasserstein distance based semi-supervised manifold learning and application to GNSS multi-path detection",
        "authors": [
            "Antoine Blais",
            "Nicolas Couëllan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP); Machine Learning (stat.ML)",
        "abstract": "The main objective of this study is to propose an optimal transport based semi-supervised approach to learn from scarce labelled image data using deep convolutional networks. The principle lies in implicit graph-based transductive semi-supervised learning where the similarity metric between image samples is the Wasserstein distance. This metric is used in the label propagation mechanism during learning. We apply and demonstrate the effectiveness of the method on a GNSS real life application. More specifically, we address the problem of multi-path interference detection. Experiments are conducted under various signal conditions. The results show that for specific choices of hyperparameters controlling the amount of semi-supervision and the level of sensitivity to the metric, the classification accuracy can be significantly improved over the fully supervised training method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05591",
        "abs_url": "https://arxiv.org/abs/2512.05591",
        "pdf_url": "https://arxiv.org/pdf/2512.05591",
        "title": "Entropy Ratio Clipping as a Soft Global Constraint for Stable Reinforcement Learning",
        "authors": [
            "Zhenpeng Su",
            "Leiyu Pan",
            "Minxuan Lv",
            "Tiehua Mei",
            "Zijia Lin",
            "Yuntao Li",
            "Wenping Hu",
            "Ruiming Tang",
            "Kun Gai",
            "Guorui Zhou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Large language model post-training relies on reinforcement learning to improve model capability and alignment quality. However, the off-policy training paradigm introduces distribution shift, which often pushes the policy beyond the trust region, leading to training instabilities manifested as fluctuations in policy entropy and unstable gradients. Although PPO-Clip mitigates this issue through importance clipping, it still overlooks the global distributional shift of actions. To address these challenges, we propose using the entropy ratio between the current and previous policies as a new global metric that effectively quantifies the relative change in policy exploration throughout updates. Building on this metric, we introduce an \\textbf{Entropy Ratio Clipping} (ERC) mechanism that imposes bidirectional constraints on the entropy ratio. This stabilizes policy updates at the global distribution level and compensates for the inability of PPO-clip to regulate probability shifts of un-sampled actions. We integrate ERC into both DAPO and GPPO reinforcement learning algorithms. Experiments across multiple benchmarks show that ERC consistently improves performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05620",
        "abs_url": "https://arxiv.org/abs/2512.05620",
        "pdf_url": "https://arxiv.org/pdf/2512.05620",
        "title": "Hyperparameter Transfer Enables Consistent Gains of Matrix-Preconditioned Optimizers Across Scales",
        "authors": [
            "Shikai Qiu",
            "Zixi Chen",
            "Hoang Phan",
            "Qi Lei",
            "Andrew Gordon Wilson"
        ],
        "comments": "NeurIPS 2025. Code available at: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Several recently introduced deep learning optimizers utilizing matrix-level preconditioning have shown promising speedups relative to the current dominant optimizer AdamW, particularly in relatively small-scale experiments. However, efforts to validate and replicate their successes have reported mixed results. To better understand the effectiveness of these optimizers at scale, in this work we investigate how to scale preconditioned optimizers via hyperparameter transfer, building on prior works such as $\\mu$P. We study how the optimal learning rate and weight decay should scale with model width and depth for a wide range of optimizers, including Shampoo, SOAP, and Muon, accounting for the impact of commonly used techniques such as blocking and grafting. We find that scaling the learning rate according to $\\mu$P improves transfer, but can still suffer from significant finite-width deviations that cause drifting optimal learning rates, which we show can be mitigated by blocking and explicit spectral normalization. For compute-optimal scaling, we find scaling independent weight decay as $1/\\mathrm{width}$ is nearly optimal across optimizers. Applying these scaling rules, we show Muon and Shampoo consistently achieve $1.4\\times$ and $1.3\\times$ speedup over AdamW for training Llama-architecture language models of sizes ranging from $190$M to $1.4$B, whereas the speedup vanishes rapidly with scale under incorrect scaling. Based on these results and further ablations, we argue that studying optimal hyperparameter transfer is essential for reliably comparing optimizers at scale given a realistic tuning budget.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05623",
        "abs_url": "https://arxiv.org/abs/2512.05623",
        "pdf_url": "https://arxiv.org/pdf/2512.05623",
        "title": "Bounded Graph Clustering with Graph Neural Networks",
        "authors": [
            "Kibidi Neocosmos",
            "Diego Baptista",
            "Nicole Ludwig"
        ],
        "comments": "17 pages, 8 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In community detection, many methods require the user to specify the number of clusters in advance since an exhaustive search over all possible values is computationally infeasible. While some classical algorithms can infer this number directly from the data, this is typically not the case for graph neural networks (GNNs): even when a desired number of clusters is specified, standard GNN-based methods often fail to return the exact number due to the way they are designed. In this work, we address this limitation by introducing a flexible and principled way to control the number of communities discovered by GNNs. Rather than assuming the true number of clusters is known, we propose a framework that allows the user to specify a plausible range and enforce these bounds during training. However, if the user wants an exact number of clusters, it may also be specified and reliably returned.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05648",
        "abs_url": "https://arxiv.org/abs/2512.05648",
        "pdf_url": "https://arxiv.org/pdf/2512.05648",
        "title": "Beyond Data Filtering: Knowledge Localization for Capability Removal in LLMs",
        "authors": [
            "Igor Shilov",
            "Alex Cloud",
            "Aryo Pradipta Gema",
            "Jacob Goldman-Wetzler",
            "Nina Panickssery",
            "Henry Sleight",
            "Erik Jones",
            "Cem Anil"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large Language Models increasingly possess capabilities that carry dual-use risks. While data filtering has emerged as a pretraining-time mitigation, it faces significant challenges: labeling whether data is harmful is expensive at scale, and given improving sample efficiency with larger models, even small amounts of mislabeled content could give rise to dangerous capabilities. To address risks associated with mislabeled harmful content, prior work proposed Gradient Routing (Cloud et al., 2024) -- a technique that localizes target knowledge into a dedicated subset of model parameters so they can later be removed. We explore an improved variant of Gradient Routing, which we call Selective GradienT Masking (SGTM), with particular focus on evaluating its robustness to label noise. SGTM zero-masks selected gradients such that target domain examples only update their dedicated parameters. We test SGTM's effectiveness in two applications: removing knowledge of one language from a model trained on a bilingual synthetic dataset, and removing biology knowledge from a model trained on English Wikipedia. In both cases SGTM provides better retain/forget trade-off in the presence of labeling errors compared to both data filtering and a previously proposed instantiation of Gradient Routing. Unlike shallow unlearning approaches that can be quickly undone through fine-tuning, SGTM exhibits strong robustness to adversarial fine-tuning, requiring seven times more fine-tuning steps to reach baseline performance on the forget set compared to a finetuning-based unlearning method (RMU). Our results suggest SGTM provides a promising pretraining-time complement to existing safety mitigations, particularly in settings where label noise is unavoidable.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05680",
        "abs_url": "https://arxiv.org/abs/2512.05680",
        "pdf_url": "https://arxiv.org/pdf/2512.05680",
        "title": "Meta-Learning Multi-armed Bandits for Beam Tracking in 5G and 6G Networks",
        "authors": [
            "Alexander Mattick",
            "George Yammine",
            "Georgios Kontes",
            "Setareh Maghsudi",
            "Christopher Mutschler"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Beamforming-capable antenna arrays with many elements enable higher data rates in next generation 5G and 6G networks. In current practice, analog beamforming uses a codebook of pre-configured beams with each of them radiating towards a specific direction, and a beam management function continuously selects \\textit{optimal} beams for moving user equipments (UEs). However, large codebooks and effects caused by reflections or blockages of beams make an optimal beam selection challenging. In contrast to previous work and standardization efforts that opt for supervised learning to train classifiers to predict the next best beam based on previously selected beams we formulate the problem as a partially observable Markov decision process (POMDP) and model the environment as the codebook itself. At each time step, we select a candidate beam conditioned on the belief state of the unobservable optimal beam and previously probed beams. This frames the beam selection problem as an online search procedure that locates the moving optimal beam. In contrast to previous work, our method handles new or unforeseen trajectories and changes in the physical environment, and outperforms previous work by orders of magnitude.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05721",
        "abs_url": "https://arxiv.org/abs/2512.05721",
        "pdf_url": "https://arxiv.org/pdf/2512.05721",
        "title": "BERTO: an Adaptive BERT-based Network Time Series Predictor with Operator Preferences in Natural Language",
        "authors": [
            "Nitin Priyadarshini Shankar",
            "Vaibhav Singh",
            "Sheetal Kalyani",
            "Christian Maciocco"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce BERTO, a BERT-based framework for traffic prediction and energy optimization in cellular networks. Built on transformer architectures, BERTO delivers high prediction accuracy, while its Balancing Loss Function and prompt-based customization allow operators to adjust the trade-off between power savings and performance. Natural language prompts guide the model to manage underprediction and overprediction in accordance with the operator's intent. Experiments on real-world datasets show that BERTO improves upon existing models with a $4.13$\\% reduction in MSE while introducing the feature of balancing competing objectives of power saving and performance through simple natural language inputs, operating over a flexible range of $1.4$ kW in power and up to $9\\times$ variation in service quality, making it well suited for intelligent RAN deployments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05722",
        "abs_url": "https://arxiv.org/abs/2512.05722",
        "pdf_url": "https://arxiv.org/pdf/2512.05722",
        "title": "Teaching Language Models Mechanistic Explainability Through Arrow-Pushing",
        "authors": [
            "Théo A. Neukomm",
            "Zlatko Jončev",
            "Philippe Schwaller"
        ],
        "comments": "ELLIS 2025 ML4Molecules Workshop",
        "subjects": "Machine Learning (cs.LG); Chemical Physics (physics.chem-ph)",
        "abstract": "Chemical reaction mechanisms provide crucial insight into synthesizability, yet current Computer-Assisted Synthesis Planning (CASP) systems lack mechanistic grounding. We introduce a computational framework for teaching language models to predict chemical reaction mechanisms through arrow pushing formalism, a century-old notation that tracks electron flow while respecting conservation laws. We developed MechSMILES, a compact textual format encoding molecular structure and electron flow, and trained language models on four mechanism prediction tasks of increasing complexity using mechanistic reaction datasets, such as mech-USPTO-31k and FlowER. Our models achieve more than 95\\% top-3 accuracy on elementary step prediction and scores that surpass 73\\% on mech-USPTO-31k, and 93\\% on FlowER dataset for the retrieval of complete reaction mechanisms on our hardest task. This mechanistic understanding enables three key applications. First, our models serve as post-hoc validators for CASP systems, filtering chemically implausible transformations. Second, they enable holistic atom-to-atom mapping that tracks all atoms, including hydrogens. Third, they extract catalyst-aware reaction templates that distinguish recycled catalysts from spectator species. By grounding predictions in physically meaningful electron moves that ensure conservation of mass and charge, this work provides a pathway toward more explainable and chemically valid computational synthesis planning, while providing an architecture-agnostic framework for the benchmarking of mechanism prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05764",
        "abs_url": "https://arxiv.org/abs/2512.05764",
        "pdf_url": "https://arxiv.org/pdf/2512.05764",
        "title": "Towards agent-based-model informed neural networks",
        "authors": [
            "Nino Antulov-Fantulin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Social and Information Networks (cs.SI); Adaptation and Self-Organizing Systems (nlin.AO); Physics and Society (physics.soc-ph)",
        "abstract": "In this article, we present a framework for designing neural networks that remain consistent with the underlying principles of agent-based models. We begin by highlighting the limitations of standard neural differential equations in modeling complex systems, where physical invariants (like energy) are often absent but other constraints (like mass conservation, network locality, bounded rationality) must be enforced. To address this, we introduce Agent-Based-Model informed Neural Networks(ABM-NNs), which leverage restricted graph neural networks and hierarchical decomposition to learn interpretable, structure-preserving dynamics. We validate the framework across three case studies of increasing complexity: (i) a generalized Generalized Lotka--Volterra system, where we recover ground-truth parameters from short trajectories in presence of interventions; (ii) a graph-based SIR contagion model, where our method outperforms state-of-the-art graph learning baselines (GCN, GraphSAGE, Graph Transformer) in out-of-sample forecasting and noise robustness; and (iii) a real-world macroeconomic model of the ten largest economies, where we learn coupled GDP dynamics from empirical data and demonstrate gradient-based counterfactual analysis for policy interventions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05790",
        "abs_url": "https://arxiv.org/abs/2512.05790",
        "pdf_url": "https://arxiv.org/pdf/2512.05790",
        "title": "Learnability Window in Gated Recurrent Neural Networks",
        "authors": [
            "Lorenzo Livi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "We develop a theoretical framework that explains how gating mechanisms determine the learnability window $\\mathcal{H}_N$ of recurrent neural networks, defined as the largest temporal horizon over which gradient information remains statistically recoverable. While classical analyses emphasize numerical stability of Jacobian products, we show that stability alone is insufficient: learnability is governed instead by the \\emph{effective learning rates} $\\mu_{t,\\ell}$, per-lag and per-neuron quantities obtained from first-order expansions of gate-induced Jacobian products in Backpropagation Through Time. These effective learning rates act as multiplicative filters that control both the magnitude and anisotropy of gradient transport. Under heavy-tailed ($\\alpha$-stable) gradient noise, we prove that the minimal sample size required to detect a dependency at lag~$\\ell$ satisfies $N(\\ell)\\propto f(\\ell)^{-\\alpha}$, where $f(\\ell)=\\|\\mu_{t,\\ell}\\|_1$ is the effective learning rate envelope. This leads to an explicit formula for $\\mathcal{H}_N$ and closed-form scaling laws for logarithmic, polynomial, and exponential decay of $f(\\ell)$. The theory predicts that broader or more heterogeneous gate spectra produce slower decay of $f(\\ell)$ and hence larger learnability windows, whereas heavier-tailed noise compresses $\\mathcal{H}_N$ by slowing statistical concentration. By linking gate-induced time-scale structure, gradient noise, and sample complexity, the framework identifies the effective learning rates as the fundamental quantities that govern when -- and for how long -- gated recurrent networks can learn long-range temporal dependencies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05794",
        "abs_url": "https://arxiv.org/abs/2512.05794",
        "pdf_url": "https://arxiv.org/pdf/2512.05794",
        "title": "Mechanistic Interpretability of Antibody Language Models Using SAEs",
        "authors": [
            "Rebonto Haque",
            "Oliver M. Turnbull",
            "Anisha Parsan",
            "Nithin Parsan",
            "John J. Yang",
            "Charlotte M. Deane"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Quantitative Methods (q-bio.QM)",
        "abstract": "Sparse autoencoders (SAEs) are a mechanistic interpretability technique that have been used to provide insight into learned concepts within large protein language models. Here, we employ TopK and Ordered SAEs to investigate an autoregressive antibody language model, p-IgGen, and steer its generation. We show that TopK SAEs can reveal biologically meaningful latent features, but high feature concept correlation does not guarantee causal control over generation. In contrast, Ordered SAEs impose an hierarchical structure that reliably identifies steerable features, but at the expense of more complex and less interpretable activation patterns. These findings advance the mechanistic interpretability of domain-specific protein language models and suggest that, while TopK SAEs are sufficient for mapping latent features to concepts, Ordered SAEs are preferable when precise generative steering is required.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05817",
        "abs_url": "https://arxiv.org/abs/2512.05817",
        "pdf_url": "https://arxiv.org/pdf/2512.05817",
        "title": "Utility Boundary of Dataset Distillation: Scaling and Configuration-Coverage Laws",
        "authors": [
            "Zhengquan Luo",
            "Zhiqiang Xu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Dataset distillation (DD) aims to construct compact synthetic datasets that allow models to achieve comparable performance to full-data training while substantially reducing storage and computation. Despite rapid empirical progress, its theoretical foundations remain limited: existing methods (gradient, distribution, trajectory matching) are built on heterogeneous surrogate objectives and optimization assumptions, which makes it difficult to analyze their common principles or provide general guarantees. Moreover, it is still unclear under what conditions distilled data can retain the effectiveness of full datasets when the training configuration, such as optimizer, architecture, or augmentation, changes. To answer these questions, we propose a unified theoretical framework, termed configuration--dynamics--error analysis, which reformulates major DD approaches under a common generalization-error perspective and provides two main results: (i) a scaling law that provides a single-configuration upper bound, characterizing how the error decreases as the distilled sample size increases and explaining the commonly observed performance saturation effect; and (ii) a coverage law showing that the required distilled sample size scales linearly with configuration diversity, with provably matching upper and lower bounds. In addition, our unified analysis reveals that various matching methods are interchangeable surrogates, reducing the same generalization error, clarifying why they can all achieve dataset distillation and providing guidance on how surrogate choices affect sample efficiency and robustness. Experiments across diverse methods and configurations empirically confirm the derived laws, advancing a theoretical foundation for DD and enabling theory-driven design of compact, configuration-robust dataset distillation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05825",
        "abs_url": "https://arxiv.org/abs/2512.05825",
        "pdf_url": "https://arxiv.org/pdf/2512.05825",
        "title": "Approximation of Box Decomposition Algorithm for Fast Hypervolume-Based Multi-Objective Optimization",
        "authors": [
            "Shuhei Watanabe"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Hypervolume (HV)-based Bayesian optimization (BO) is one of the standard approaches for multi-objective decision-making. However, the computational cost of optimizing the acquisition function remains a significant bottleneck, primarily due to the expense of HV improvement calculations. While HV box-decomposition offers an efficient way to cope with the frequent exact improvement calculations, it suffers from super-polynomial memory complexity $O(MN^{\\lfloor \\frac{M + 1}{2} \\rfloor})$ in the worst case as proposed by Lacour et al. (2017). To tackle this problem, Couckuyt et al. (2012) employed an approximation algorithm. However, a rigorous algorithmic description is currently absent from the literature. This paper bridges this gap by providing comprehensive mathematical and algorithmic details of this approximation algorithm.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05844",
        "abs_url": "https://arxiv.org/abs/2512.05844",
        "pdf_url": "https://arxiv.org/pdf/2512.05844",
        "title": "NEAT: Neighborhood-Guided, Efficient, Autoregressive Set Transformer for 3D Molecular Generation",
        "authors": [
            "Daniel Rose",
            "Roxane Axel Jacob",
            "Johannes Kirchmair",
            "Thierry Langer"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Autoregressive models are a promising alternative to diffusion-based models for 3D molecular structure generation. However, a key limitation is the assumption of a token order: while text has a natural sequential order, the next token prediction given a molecular graph prefix should be invariant to atom permutations. Previous works sidestepped this mismatch by using canonical orders or focus atoms. We argue that this is unnecessary. We introduce NEAT, a Neighborhood-guided, Efficient, Autoregressive, Set Transformer that treats molecular graphs as sets of atoms and learns the order-agnostic distribution over admissible tokens at the graph boundary with an autoregressive flow model. NEAT approaches state-of-the-art performance in 3D molecular generation with high computational efficiency and atom-level permutation invariance, establishing a practical foundation for scalable molecular design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05868",
        "abs_url": "https://arxiv.org/abs/2512.05868",
        "pdf_url": "https://arxiv.org/pdf/2512.05868",
        "title": "Predicting Price Movements in High-Frequency Financial Data with Spiking Neural Networks",
        "authors": [
            "Brian Ezinwoke",
            "Oliver Rhodes"
        ],
        "comments": "9 pages, 5 figures, 8 tables",
        "subjects": "Machine Learning (cs.LG); Computational Finance (q-fin.CP)",
        "abstract": "Modern high-frequency trading (HFT) environments are characterized by sudden price spikes that present both risk and opportunity, but conventional financial models often fail to capture the required fine temporal structure. Spiking Neural Networks (SNNs) offer a biologically inspired framework well-suited to these challenges due to their natural ability to process discrete events and preserve millisecond-scale timing. This work investigates the application of SNNs to high-frequency price-spike forecasting, enhancing performance via robust hyperparameter tuning with Bayesian Optimization (BO). This work converts high-frequency stock data into spike trains and evaluates three architectures: an established unsupervised STDP-trained SNN, a novel SNN with explicit inhibitory competition, and a supervised backpropagation network. BO was driven by a novel objective, Penalized Spike Accuracy (PSA), designed to ensure a network's predicted price spike rate aligns with the empirical rate of price events. Simulated trading demonstrated that models optimized with PSA consistently outperformed their Spike Accuracy (SA)-tuned counterparts and baselines. Specifically, the extended SNN model with PSA achieved the highest cumulative return (76.8%) in simple backtesting, significantly surpassing the supervised alternative (42.54% return). These results validate the potential of spiking networks, when robustly tuned with task-specific objectives, for effective price spike forecasting in HFT.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05870",
        "abs_url": "https://arxiv.org/abs/2512.05870",
        "pdf_url": "https://arxiv.org/pdf/2512.05870",
        "title": "Computational Design of Low-Volatility Lubricants for Space Using Interpretable Machine Learning",
        "authors": [
            "Daniel Miliate",
            "Ashlie Martini"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The function and lifetime of moving mechanical assemblies (MMAs) in space depend on the properties of lubricants. MMAs that experience high speeds or high cycles require liquid based lubricants due to their ability to reflow to the point of contact. However, only a few liquid-based lubricants have vapor pressures low enough for the vacuum conditions of space, each of which has limitations that add constraints to MMA designs. This work introduces a data-driven machine learning (ML) approach to predicting vapor pressure, enabling virtual screening and discovery of new space-suitable liquid lubricants. The ML models are trained with data from both high-throughput molecular dynamics simulations and experimental databases. The models are designed to prioritize interpretability, enabling the relationships between chemical structure and vapor pressure to be identified. Based on these insights, several candidate molecules are proposed that may have promise for future space lubricant applications in MMAs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05881",
        "abs_url": "https://arxiv.org/abs/2512.05881",
        "pdf_url": "https://arxiv.org/pdf/2512.05881",
        "title": "DAE-HardNet: A Physics Constrained Neural Network Enforcing Differential-Algebraic Hard Constraints",
        "authors": [
            "Rahul Golder",
            "Bimol Nath Roy",
            "M. M. Faruque Hasan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Traditional physics-informed neural networks (PINNs) do not always satisfy physics based constraints, especially when the constraints include differential operators. Rather, they minimize the constraint violations in a soft way. Strict satisfaction of differential-algebraic equations (DAEs) to embed domain knowledge and first-principles in data-driven models is generally challenging. This is because data-driven models consider the original functions to be black-box whose derivatives can only be obtained after evaluating the functions. We introduce DAE-HardNet, a physics-constrained (rather than simply physics-informed) neural network that learns both the functions and their derivatives simultaneously, while enforcing algebraic as well as differential constraints. This is done by projecting model predictions onto the constraint manifold using a differentiable projection layer. We apply DAE-HardNet to several systems and test problems governed by DAEs, including the dynamic Lotka-Volterra predator-prey system and transient heat conduction. We also show the ability of DAE-HardNet to estimate unknown parameters through a parameter estimation problem. Compared to multilayer perceptrons (MLPs) and PINNs, DAE-HardNet achieves orders of magnitude reduction in the physics loss while maintaining the prediction accuracy. It has the added benefits of learning the derivatives which improves the constrained learning of the backbone neural network prior to the projection layer. For specific problems, this suggests that the projection layer can be bypassed for faster inference. The current implementation and codes are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05893",
        "abs_url": "https://arxiv.org/abs/2512.05893",
        "pdf_url": "https://arxiv.org/pdf/2512.05893",
        "title": "NeuroMemFPP: A recurrent neural approach for memory-aware parameter estimation in fractional Poisson process",
        "authors": [
            "Neha Gupta",
            "Aditya Maheshwari"
        ],
        "comments": "12 pages",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "In this paper, we propose a recurrent neural network (RNN)-based framework for estimating the parameters of the fractional Poisson process (FPP), which models event arrivals with memory and long-range dependence. The Long Short-Term Memory (LSTM) network estimates the key parameters $\\mu >0$ and $\\beta \\in(0,1)$ from sequences of inter-arrival times, effectively modeling their temporal dependencies. Our experiments on synthetic data show that the proposed approach reduces the mean squared error (MSE) by about 55.3\\% compared to the traditional method of moments (MOM) and performs reliably across different training conditions. We tested the method on two real-world high-frequency datasets: emergency call records from Montgomery County, PA, and AAPL stock trading data. The results show that the LSTM can effectively track daily patterns and parameter changes, indicating its effectiveness on real-world data with complex time dependencies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05915",
        "abs_url": "https://arxiv.org/abs/2512.05915",
        "pdf_url": "https://arxiv.org/pdf/2512.05915",
        "title": "LDLT $\\mathcal{L}$-Lipschitz Network: Generalized Deep End-To-End Lipschitz Network Construction",
        "authors": [
            "Marius F.R. Juston",
            "Ramavarapu S. Sreenivas",
            "Dustin Nottage",
            "Ahmet Soylemezoglu"
        ],
        "comments": "39 pages, 3 figures, 12 tables",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Deep residual networks (ResNets) have demonstrated outstanding success in computer vision tasks, attributed to their ability to maintain gradient flow through deep architectures. Simultaneously, controlling the Lipschitz constant in neural networks has emerged as an essential area of research to enhance adversarial robustness and network certifiability. This paper presents a rigorous approach to the general design of $\\mathcal{L}$-Lipschitz deep residual networks using a Linear Matrix Inequality (LMI) framework. Initially, the ResNet architecture was reformulated as a cyclic tridiagonal LMI, and closed-form constraints on network parameters were derived to ensure $\\mathcal{L}$-Lipschitz continuity; however, using a new $LDL^\\top$ decomposition approach for certifying LMI feasibility, we extend the construction of $\\mathcal{L}$-Lipchitz networks to any other nonlinear architecture. Our contributions include a provable parameterization methodology for constructing Lipschitz-constrained residual networks and other hierarchical architectures. Cholesky decomposition is also used for efficient parameterization. These findings enable robust network designs applicable to adversarial robustness, certified training, and control systems. The $LDL^\\top$ formulation is shown to be a tight relaxation of the SDP-based network, maintaining full expressiveness and achieving 3\\%-13\\% accuracy gains over SLL Layers on 121 UCI data sets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05916",
        "abs_url": "https://arxiv.org/abs/2512.05916",
        "pdf_url": "https://arxiv.org/pdf/2512.05916",
        "title": "KQ-SVD: Compressing the KV Cache with Provable Guarantees on Attention Fidelity",
        "authors": [
            "Damien Lesens",
            "Beheshteh T. Rakhshan",
            "Guillaume Rabusseau"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The Key-Value (KV) cache is central to the efficiency of transformer-based large language models (LLMs), storing previously computed vectors to accelerate inference. Yet, as sequence length and batch size grow, the cache becomes a major memory bottleneck. Prior compression methods typically apply low-rank decomposition to keys alone or attempt to jointly embed queries and keys, but both approaches neglect that attention fundamentally depends on their inner products. In this work, we prove that such strategies are suboptimal for approximating the attention matrix. We introduce KQ-SVD, a simple and computationally efficient method that directly performs an optimal low-rank decomposition of the attention matrix via a closed-form solution. By targeting the true source of redundancy, KQ-SVD preserves attention outputs with higher fidelity under compression. Extensive evaluations on LLaMA and Mistral models demonstrate that our approach consistently delivers superior projection quality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05931",
        "abs_url": "https://arxiv.org/abs/2512.05931",
        "pdf_url": "https://arxiv.org/pdf/2512.05931",
        "title": "On the Bayes Inconsistency of Disagreement Discrepancy Surrogates",
        "authors": [
            "Neil G. Marchant",
            "Andrew C. Cullen",
            "Feng Liu",
            "Sarah M. Erfani"
        ],
        "comments": "37 pages, 7 figures",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Deep neural networks often fail when deployed in real-world contexts due to distribution shift, a critical barrier to building safe and reliable systems. An emerging approach to address this problem relies on \\emph{disagreement discrepancy} -- a measure of how the disagreement between two models changes under a shifting distribution. The process of maximizing this measure has seen applications in bounding error under shifts, testing for harmful shifts, and training more robust models. However, this optimization involves the non-differentiable zero-one loss, necessitating the use of practical surrogate losses. We prove that existing surrogates for disagreement discrepancy are not Bayes consistent, revealing a fundamental flaw: maximizing these surrogates can fail to maximize the true disagreement discrepancy. To address this, we introduce new theoretical results providing both upper and lower bounds on the optimality gap for such surrogates. Guided by this theory, we propose a novel disagreement loss that, when paired with cross-entropy, yields a provably consistent surrogate for disagreement discrepancy. Empirical evaluations across diverse benchmarks demonstrate that our method provides more accurate and robust estimates of disagreement discrepancy than existing approaches, particularly under challenging adversarial conditions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05948",
        "abs_url": "https://arxiv.org/abs/2512.05948",
        "pdf_url": "https://arxiv.org/pdf/2512.05948",
        "title": "Developing synthetic microdata through machine learning for firm-level business surveys",
        "authors": [
            "Jorge Cisneros Paz",
            "Timothy Wojan",
            "Matthew Williams",
            "Jennifer Ozawa",
            "Robert Chew",
            "Kimberly Janda",
            "Timothy Navarro",
            "Michael Floyd",
            "Christine Task",
            "Damon Streat"
        ],
        "comments": "17 pages, 4 figures, 6 tables",
        "subjects": "Machine Learning (cs.LG); General Economics (econ.GN); Applications (stat.AP); Methodology (stat.ME)",
        "abstract": "Public-use microdata samples (PUMS) from the United States (US) Census Bureau on individuals have been available for decades. However, large increases in computing power and the greater availability of Big Data have dramatically increased the probability of re-identifying anonymized data, potentially violating the pledge of confidentiality given to survey respondents. Data science tools can be used to produce synthetic data that preserve critical moments of the empirical data but do not contain the records of any existing individual respondent or business. Developing public-use firm data from surveys presents unique challenges different from demographic data, because there is a lack of anonymity and certain industries can be easily identified in each geographic area. This paper briefly describes a machine learning model used to construct a synthetic PUMS based on the Annual Business Survey (ABS) and discusses various quality metrics. Although the ABS PUMS is currently being refined and results are confidential, we present two synthetic PUMS developed for the 2007 Survey of Business Owners, similar to the ABS business data. Econometric replication of a high impact analysis published in Small Business Economics demonstrates the verisimilitude of the synthetic data to the true data and motivates discussion of possible ABS use cases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05950",
        "abs_url": "https://arxiv.org/abs/2512.05950",
        "pdf_url": "https://arxiv.org/pdf/2512.05950",
        "title": "Impugan: Learning Conditional Generative Models for Robust Data Imputation",
        "authors": [
            "Zalish Mahmud",
            "Anantaa Kotal",
            "Aritran Piplai"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Incomplete data are common in real-world applications. Sensors fail, records are inconsistent, and datasets collected from different sources often differ in scale, sampling rate, and quality. These differences create missing values that make it difficult to combine data and build reliable models. Standard imputation methods such as regression models, expectation-maximization, and multiple imputation rely on strong assumptions about linearity and independence. These assumptions rarely hold for complex or heterogeneous data, which can lead to biased or over-smoothed estimates. We propose Impugan, a conditional Generative Adversarial Network (cGAN) for imputing missing values and integrating heterogeneous datasets. The model is trained on complete samples to learn how missing variables depend on observed ones. During inference, the generator reconstructs missing entries from available features, and the discriminator enforces realism by distinguishing true from imputed data. This adversarial process allows Impugan to capture nonlinear and multimodal relationships that conventional methods cannot represent. In experiments on benchmark datasets and a multi-source integration task, Impugan achieves up to 82\\% lower Earth Mover's Distance (EMD) and 70\\% lower mutual-information deviation (MI) compared to leading baselines. These results show that adversarially trained generative models provide a scalable and principled approach for imputing and merging incomplete, heterogeneous data. Our model is available at: this http URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05962",
        "abs_url": "https://arxiv.org/abs/2512.05962",
        "pdf_url": "https://arxiv.org/pdf/2512.05962",
        "title": "Whatever Remains Must Be True: Filtering Drives Reasoning in LLMs, Shaping Diversity",
        "authors": [
            "Germán Kruszewski",
            "Pierre Erbacher",
            "Jos Rozen",
            "Marc Dymetman"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Reinforcement Learning (RL) has become the de facto standard for tuning LLMs to solve tasks involving reasoning. However, growing evidence shows that models trained in such way often suffer from a significant loss in diversity. We argue that this arises because RL implicitly optimizes the \"mode-seeking\" or \"zero-forcing\" Reverse KL to a target distribution causing the model to concentrate mass on certain high-probability regions of the target while neglecting others. In this work, we instead begin from an explicit target distribution, obtained by filtering out incorrect answers while preserving the relative probabilities of correct ones. Starting from a pre-trained LLM, we approximate this target distribution using the $\\alpha$-divergence family, which unifies prior approaches and enables direct control of the precision-diversity trade-off by interpolating between mode-seeking and mass-covering divergences. On a Lean theorem-proving benchmark, our method achieves state-of-the-art performance along the coverage-precision Pareto frontier, outperforming all prior methods on the coverage axis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05127",
        "abs_url": "https://arxiv.org/abs/2512.05127",
        "pdf_url": "https://arxiv.org/pdf/2512.05127",
        "title": "Bayesian Optimization and Convolutional Neural Networks for Zernike-Based Wavefront Correction in High Harmonic Generation",
        "authors": [
            "Guilherme Grancho D. Fernandes",
            "Duarte Alexandrino",
            "Eduardo Silva",
            "João Matias",
            "Joaquim Pereira"
        ],
        "comments": "",
        "subjects": "Optics (physics.optics); Machine Learning (cs.LG)",
        "abstract": "High harmonic generation (HHG) is a nonlinear process that enables table-top generation of tunable, high-energy, coherent, ultrashort radiation pulses in the extreme ultraviolet (EUV) to soft X-ray range. These pulses find applications in photoemission spectroscopy in condensed matter physics, pump-probe spectroscopy for high-energy-density plasmas, and attosecond science. However, optical aberrations in the high-power laser systems required for HHG degrade beam quality and reduce efficiency. We present a machine learning approach to optimize aberration correction using a spatial light modulator. We implemented and compared Bayesian optimization and convolutional neural network (CNN) methods to predict optimal Zernike polynomial coefficients for wavefront correction. Our CNN achieved promising results with 80.39% accuracy on test data, demonstrating the potential for automated aberration correction in HHG systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05139",
        "abs_url": "https://arxiv.org/abs/2512.05139",
        "pdf_url": "https://arxiv.org/pdf/2512.05139",
        "title": "Spatiotemporal Satellite Image Downscaling with Transfer Encoders and Autoregressive Generative Models",
        "authors": [
            "Yang Xiang",
            "Jingwen Zhong",
            "Yige Yan",
            "Petros Koutrakis",
            "Eric Garshick",
            "Meredith Franklin"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We present a transfer-learning generative downscaling framework to reconstruct fine resolution satellite images from coarse scale inputs. Our approach combines a lightweight U-Net transfer encoder with a diffusion-based generative model. The simpler U-Net is first pretrained on a long time series of coarse resolution data to learn spatiotemporal representations; its encoder is then frozen and transferred to a larger downscaling model as physically meaningful latent features. Our application uses NASA's MERRA-2 reanalysis as the low resolution source domain (50 km) and the GEOS-5 Nature Run (G5NR) as the high resolution target (7 km). Our study area included a large area in Asia, which was made computationally tractable by splitting into two subregions and four seasons. We conducted domain similarity analysis using Wasserstein distances confirmed minimal distributional shift between MERRA-2 and G5NR, validating the safety of parameter frozen transfer. Across seasonal regional splits, our model achieved excellent performance (R2 = 0.65 to 0.94), outperforming comparison models including deterministic U-Nets, variational autoencoders, and prior transfer learning baselines. Out of data evaluations using semivariograms, ACF/PACF, and lag-based RMSE/R2 demonstrated that the predicted downscaled images preserved physically consistent spatial variability and temporal autocorrelation, enabling stable autoregressive reconstruction beyond the G5NR record. These results show that transfer enhanced diffusion models provide a robust and physically coherent solution for downscaling a long time series of coarse resolution images with limited training periods. This advancement has significant implications for improving environmental exposure assessment and long term environmental monitoring.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05158",
        "abs_url": "https://arxiv.org/abs/2512.05158",
        "pdf_url": "https://arxiv.org/pdf/2512.05158",
        "title": "Continuous-Time Homeostatic Dynamics for Reentrant Inference Models",
        "authors": [
            "Byung Gyu Chae"
        ],
        "comments": "13 pages, 4 figures",
        "subjects": "Dynamical Systems (math.DS); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We formulate the Fast-Weights Homeostatic Reentry Network (FHRN) as a continuous-time neural-ODE system, revealing its role as a norm-regulated reentrant dynamical process. Starting from the discrete reentry rule $x_t = x_t^{(\\mathrm{ex})} + \\gamma\\, W_r\\, g(\\|y_{t-1}\\|)\\, y_{t-1}$, we derive the coupled system $\\dot{y}=-y+f(W_ry;\\,x,\\,A)+g_{\\mathrm{h}}(y)$ showing that the network couples fast associative memory with global radial homeostasis. The dynamics admit bounded attractors governed by an energy functional, yielding a ring-like manifold. A Jacobian spectral analysis identifies a \\emph{reflective regime} in which reentry induces stable oscillatory trajectories rather than divergence or collapse. Unlike continuous-time recurrent neural networks or liquid neural networks, FHRN achieves stability through population-level gain modulation rather than fixed recurrence or neuron-local time adaptation. These results establish the reentry network as a distinct class of self-referential neural dynamics supporting recursive yet bounded computation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05162",
        "abs_url": "https://arxiv.org/abs/2512.05162",
        "pdf_url": "https://arxiv.org/pdf/2512.05162",
        "title": "How to Tame Your LLM: Semantic Collapse in Continuous Systems",
        "authors": [
            "C. M. Wyss"
        ],
        "comments": "35 pages, 1 figure. Exolytica AI Technical Report XTR-2025-01",
        "subjects": "Machine Learning (stat.ML); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Dynamical Systems (math.DS); Probability (math.PR)",
        "abstract": "We develop a general theory of semantic dynamics for large language models by formalizing them as Continuous State Machines (CSMs): smooth dynamical systems whose latent manifolds evolve under probabilistic transition operators. The associated transfer operator $P: L^2(M,\\mu) \\to L^2(M,\\mu)$ encodes the propagation of semantic mass. Under mild regularity assumptions (compactness, ergodicity, bounded Jacobian), $P$ is compact with discrete spectrum. Within this setting, we prove the Semantic Characterization Theorem (SCT): the leading eigenfunctions of $P$ induce finitely many spectral basins of invariant meaning, each definable in an o-minimal structure over $\\mathbb{R}$. Thus spectral lumpability and logical tameness coincide. This explains how discrete symbolic semantics can emerge from continuous computation: the continuous activation manifold collapses into a finite, logically interpretable ontology. We further extend the SCT to stochastic and adiabatic (time-inhomogeneous) settings, showing that slowly drifting kernels preserve compactness, spectral coherence, and basin structure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05207",
        "abs_url": "https://arxiv.org/abs/2512.05207",
        "pdf_url": "https://arxiv.org/pdf/2512.05207",
        "title": "Hierarchical Reinforcement Learning for the Dynamic VNE with Alternatives Problem",
        "authors": [
            "Ali Al Housseini",
            "Cristina Rottondi",
            "Omran Ayoub"
        ],
        "comments": "Submitted to IEEE International Conference on Machine Learning for Communication and Networking (ICMLCN) 2026",
        "subjects": "Networking and Internet Architecture (cs.NI); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Virtual Network Embedding (VNE) is a key enabler of network slicing, yet most formulations assume that each Virtual Network Request (VNR) has a fixed topology. Recently, VNE with Alternative topologies (VNEAP) was introduced to capture malleable VNRs, where each request can be instantiated using one of several functionally equivalent topologies that trade resources differently. While this flexibility enlarges the feasible space, it also introduces an additional decision layer, making dynamic embedding more challenging. This paper proposes HRL-VNEAP, a hierarchical reinforcement learning approach for VNEAP under dynamic arrivals. A high-level policy selects the most suitable alternative topology (or rejects the request), and a low-level policy embeds the chosen topology onto the substrate network. Experiments on realistic substrate topologies under multiple traffic loads show that naive exploitation strategies provide only modest gains, whereas HRL-VNEAP consistently achieves the best performance across all metrics. Compared to the strongest tested baselines, HRL-VNEAP improves acceptance ratio by up to \\textbf{20.7\\%}, total revenue by up to \\textbf{36.2\\%}, and revenue-over-cost by up to \\textbf{22.1\\%}. Finally, we benchmark against an MILP formulation on tractable instances to quantify the remaining gap to optimality and motivate future work on learning- and optimization-based VNEAP solutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05245",
        "abs_url": "https://arxiv.org/abs/2512.05245",
        "pdf_url": "https://arxiv.org/pdf/2512.05245",
        "title": "STAR-GO: Improving Protein Function Prediction by Learning to Hierarchically Integrate Ontology-Informed Semantic Embeddings",
        "authors": [
            "Mehmet Efe Akça",
            "Gökçe Uludoğan",
            "Arzucan Özgür",
            "İnci M. Baytaş"
        ],
        "comments": "14 pages, 2 figures, 6 tables",
        "subjects": "Biomolecules (q-bio.BM); Machine Learning (cs.LG)",
        "abstract": "Accurate prediction of protein function is essential for elucidating molecular mechanisms and advancing biological and therapeutic discovery. Yet experimental annotation lags far behind the rapid growth of protein sequence data. Computational approaches address this gap by associating proteins with Gene Ontology (GO) terms, which encode functional knowledge through hierarchical relations and textual definitions. However, existing models often emphasize one modality over the other, limiting their ability to generalize, particularly to unseen or newly introduced GO terms that frequently arise as the ontology evolves, and making the previously trained models outdated. We present STAR-GO, a Transformer-based framework that jointly models the semantic and structural characteristics of GO terms to enhance zero-shot protein function prediction. STAR-GO integrates textual definitions with ontology graph structure to learn unified GO representations, which are processed in hierarchical order to propagate information from general to specific terms. These representations are then aligned with protein sequence embeddings to capture sequence-function relationships. STAR-GO achieves state-of-the-art performance and superior zero-shot generalization, demonstrating the utility of integrating semantics and structure for robust and adaptable protein function prediction. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05251",
        "abs_url": "https://arxiv.org/abs/2512.05251",
        "pdf_url": "https://arxiv.org/pdf/2512.05251",
        "title": "One-Step Diffusion Samplers via Self-Distillation and Deterministic Flow",
        "authors": [
            "Pascal Jutras-Dube",
            "Jiaru Zhang",
            "Ziran Wang",
            "Ruqi Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Sampling from unnormalized target distributions is a fundamental yet challenging task in machine learning and statistics. Existing sampling algorithms typically require many iterative steps to produce high-quality samples, leading to high computational costs. We introduce one-step diffusion samplers which learn a step-conditioned ODE so that one large step reproduces the trajectory of many small ones via a state-space consistency loss. We further show that standard ELBO estimates in diffusion samplers degrade in the few-step regime because common discrete integrators yield mismatched forward/backward transition kernels. Motivated by this analysis, we derive a deterministic-flow (DF) importance weight for ELBO estimation without a backward kernel. To calibrate DF, we introduce a volume-consistency regularization that aligns the accumulated volume change along the flow across step resolutions. Our proposed sampler therefore achieves both sampling and stable evidence estimate in only one or few steps. Across challenging synthetic and Bayesian benchmarks, it achieves competitive sample quality with orders-of-magnitude fewer network evaluations while maintaining robust ELBO estimates.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05271",
        "abs_url": "https://arxiv.org/abs/2512.05271",
        "pdf_url": "https://arxiv.org/pdf/2512.05271",
        "title": "Robust forecast aggregation via additional queries",
        "authors": [
            "Rafael Frongillo",
            "Mary Monroe",
            "Eric Neyman",
            "Bo Waggoner"
        ],
        "comments": "",
        "subjects": "Computer Science and Game Theory (cs.GT); Machine Learning (cs.LG)",
        "abstract": "We study the problem of robust forecast aggregation: combining expert forecasts with provable accuracy guarantees compared to the best possible aggregation of the underlying information. Prior work shows strong impossibility results, e.g. that even under natural assumptions, no aggregation of the experts' individual forecasts can outperform simply following a random expert (Neyman and Roughgarden, 2022). In this paper, we introduce a more general framework that allows the principal to elicit richer information from experts through structured queries. Our framework ensures that experts will truthfully report their underlying beliefs, and also enables us to define notions of complexity over the difficulty of asking these queries. Under a general model of independent but overlapping expert signals, we show that optimal aggregation is achievable in the worst case with each complexity measure bounded above by the number of agents $n$. We further establish tight tradeoffs between accuracy and query complexity: aggregation error decreases linearly with the number of queries, and vanishes when the \"order of reasoning\" and number of agents relevant to a query is $\\omega(\\sqrt{n})$. These results demonstrate that modest extensions to the space of expert queries dramatically strengthen the power of robust forecast aggregation. We therefore expect that our new query framework will open up a fruitful line of research in this area.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05288",
        "abs_url": "https://arxiv.org/abs/2512.05288",
        "pdf_url": "https://arxiv.org/pdf/2512.05288",
        "title": "Beyond Detection: A Comprehensive Benchmark and Study on Representation Learning for Fine-Grained Webshell Family Classification",
        "authors": [
            "Feijiang Han"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Malicious WebShells pose a significant and evolving threat by compromising critical digital infrastructures and endangering public services in sectors such as healthcare and finance. While the research community has made significant progress in WebShell detection (i.e., distinguishing malicious samples from benign ones), we argue that it is time to transition from passive detection to in-depth analysis and proactive defense. One promising direction is the automation of WebShell family classification, which involves identifying the specific malware lineage in order to understand an adversary's tactics and enable a precise, rapid response. This crucial task, however, remains a largely unexplored area that currently relies on slow, manual expert analysis. To address this gap, we present the first systematic study to automate WebShell family classification. Our method begins with extracting dynamic function call traces to capture inherent behaviors that are resistant to common encryption and obfuscation. To enhance the scale and diversity of our dataset for a more stable evaluation, we augment these real-world traces with new variants synthesized by Large Language Models. These augmented traces are then abstracted into sequences, graphs, and trees, providing a foundation to benchmark a comprehensive suite of representation methods. Our evaluation spans classic sequence-based embeddings (CBOW, GloVe), transformers (BERT, SimCSE), and a range of structure-aware algorithms, including Graph Kernels, Graph Edit Distance, Graph2Vec, and various Graph Neural Networks. Through extensive experiments on four real-world, family-annotated datasets under both supervised and unsupervised settings, we establish a robust baseline and provide practical insights into the most effective combinations of data abstractions, representation models, and learning paradigms for this challenge.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05325",
        "abs_url": "https://arxiv.org/abs/2512.05325",
        "pdf_url": "https://arxiv.org/pdf/2512.05325",
        "title": "LYNX: Learning Dynamic Exits for Confidence-Controlled Reasoning",
        "authors": [
            "Ömer Faruk Akgül",
            "Yusuf Hakan Kalaycı",
            "Rajgopal Kannan",
            "Willie Neiswanger",
            "Viktor Prasanna"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large reasoning models achieve strong performance on complex tasks by generating extended chains of thought, but they often \"overthink\": continuing to reason long after they have enough information to answer correctly. This wastes inference-time compute and can hurt accuracy. Existing attempts to stop early either manipulate decoding with extra sampling and heuristics, rely on auxiliary verifier models, or operate only as post-hoc analysis pipelines without formal guarantees. We introduce LYNX, an online early-exit mechanism that turns a model's own hidden-state awareness into confidence-controlled stopping decisions. LYNX attaches exit decisions to naturally occurring reasoning cues (e.g., \"hmm\", \"wait\") during generation, trains a lightweight probe on hidden states at those cue tokens using supervision from forced exits, and wraps the resulting scores in split conformal prediction to obtain distribution-free control over premature exits. Crucially, we train and calibrate this probe once on a generic mathematical corpus and reuse it unchanged across benchmarks, decoding temperatures, and even non-mathematical tasks. Across three model families spanning 1.5B to 32B parameters, a single mathematically trained probe per base model yields strong accuracy--efficiency tradeoffs. On GSM8K, LYNX matches or improves baseline accuracy while reducing tokens by 40--65\\%; on MATH-500 it improves accuracy by up to 12 points with roughly 35--60\\% fewer tokens; on AIME 2024 it recovers baseline accuracy with more than 50\\% token savings; and on CommonsenseQA, a non-math benchmark, it transfers zero-shot with modest accuracy gains and up to 70\\% fewer tokens. Compared to state-of-the-art early-exit methods, LYNX offers competitive or superior Pareto frontiers while remaining fully online, requiring no proxy models at inference, and providing explicit, user-tunable confidence guarantees.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05331",
        "abs_url": "https://arxiv.org/abs/2512.05331",
        "pdf_url": "https://arxiv.org/pdf/2512.05331",
        "title": "Exposing Pink Slime Journalism: Linguistic Signatures and Robust Detection Against LLM-Generated Threats",
        "authors": [
            "Sadat Shahriar",
            "Navid Ayoobi",
            "Arjun Mukherjee",
            "Mostafa Musharrat",
            "Sai Vishnu Vamsi"
        ],
        "comments": "Published in RANLP 2025",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "The local news landscape, a vital source of reliable information for 28 million Americans, faces a growing threat from Pink Slime Journalism, a low-quality, auto-generated articles that mimic legitimate local reporting. Detecting these deceptive articles requires a fine-grained analysis of their linguistic, stylistic, and lexical characteristics. In this work, we conduct a comprehensive study to uncover the distinguishing patterns of Pink Slime content and propose detection strategies based on these insights. Beyond traditional generation methods, we highlight a new adversarial vector: modifications through large language models (LLMs). Our findings reveal that even consumer-accessible LLMs can significantly undermine existing detection systems, reducing their performance by up to 40% in F1-score. To counter this threat, we introduce a robust learning framework specifically designed to resist LLM-based adversarial attacks and adapt to the evolving landscape of automated pink slime journalism, and showed and improvement by up to 27%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05337",
        "abs_url": "https://arxiv.org/abs/2512.05337",
        "pdf_url": "https://arxiv.org/pdf/2512.05337",
        "title": "Symmetric Linear Dynamical Systems are Learnable from Few Observations",
        "authors": [
            "Minh Vu",
            "Andrey Y. Lokhov",
            "Marc Vuffray"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Systems and Control (eess.SY); Optimization and Control (math.OC)",
        "abstract": "We consider the problem of learning the parameters of a $N$-dimensional stochastic linear dynamics under both full and partial observations from a single trajectory of time $T$. We introduce and analyze a new estimator that achieves a small maximum element-wise error on the recovery of symmetric dynamic matrices using only $T=\\mathcal{O}(\\log N)$ observations, irrespective of whether the matrix is sparse or dense. This estimator is based on the method of moments and does not rely on problem-specific regularization. This is especially important for applications such as structure discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05361",
        "abs_url": "https://arxiv.org/abs/2512.05361",
        "pdf_url": "https://arxiv.org/pdf/2512.05361",
        "title": "FieldSeer I: Physics-Guided World Models for Long-Horizon Electromagnetic Dynamics under Partial Observability",
        "authors": [
            "Ziheng Guo",
            "Fang Wu",
            "Maoxiong Zhao",
            "Chaoqun Fang",
            "Yang Bu"
        ],
        "comments": "",
        "subjects": "Optics (physics.optics); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "We introduce FieldSeer I, a geometry-aware world model that forecasts electromagnetic field dynamics from partial observations in 2-D TE waveguides. The model assimilates a short prefix of observed fields, conditions on a scalar source action and structure/material map, and generates closed-loop rollouts in the physical domain. Training in a symmetric-log domain ensures numerical stability. Evaluated on a reproducible FDTD benchmark (200 unique simulations, structure-wise split), FieldSeer I achieves higher suffix fidelity than GRU and deterministic baselines across three practical settings: (i) software-in-the-loop filtering (64x64, P=80->Q=80), (ii) offline single-file rollouts (80x140, P=240->Q=40), and (iii) offline multi-structure rollouts (80x140, P=180->Q=100). Crucially, it enables edit-after-prefix geometry modifications without re-assimilation. Results demonstrate that geometry-conditioned world models provide a practical path toward interactive digital twins for photonic design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05415",
        "abs_url": "https://arxiv.org/abs/2512.05415",
        "pdf_url": "https://arxiv.org/pdf/2512.05415",
        "title": "Moving object detection from multi-depth images with an attention-enhanced CNN",
        "authors": [
            "Masato Shibukawa",
            "Fumi Yoshida",
            "Toshifumi Yanagisawa",
            "Takashi Ito",
            "Hirohisa Kurosaki",
            "Makoto Yoshikawa",
            "Kohki Kamiya",
            "Ji-an Jiang",
            "Wesley Fraser",
            "JJ Kavelaars",
            "Susan Benecchi",
            "Anne Verbiscer",
            "Akira Hatakeyama",
            "Hosei O",
            "Naoya Ozaki"
        ],
        "comments": "14 pages, 22 figures, submitted to PASJ",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "One of the greatest challenges for detecting moving objects in the solar system from wide-field survey data is determining whether a signal indicates a true object or is due to some other source, like noise. Object verification has relied heavily on human eyes, which usually results in significant labor costs. In order to address this limitation and reduce the reliance on manual intervention, we propose a multi-input convolutional neural network integrated with a convolutional block attention module. This method is specifically tailored to enhance the moving object detection system that we have developed and used previously. The current method introduces two innovations. This first one is a multi-input architecture that processes multiple stacked images simultaneously. The second is the incorporation of the convolutional block attention module which enables the model to focus on essential features in both spatial and channel dimensions. These advancements facilitate efficient learning from multiple inputs, leading to more robust detection of moving objects. The performance of the model is evaluated on a dataset consisting of approximately 2,000 observational images. We achieved an accuracy of nearly 99% with AUC (an Area Under the Curve) of >0.99. These metrics indicate that the proposed model achieves excellent classification performance. By adjusting the threshold for object detection, the new model reduces the human workload by more than 99% compared to manual verification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05430",
        "abs_url": "https://arxiv.org/abs/2512.05430",
        "pdf_url": "https://arxiv.org/pdf/2512.05430",
        "title": "ArtistMus: A Globally Diverse, Artist-Centric Benchmark for Retrieval-Augmented Music Question Answering",
        "authors": [
            "Daeyong Kwon",
            "SeungHeon Doh",
            "Juhan Nam"
        ],
        "comments": "Submitted to LREC 2026. This work is an evolution of our earlier preprint arXiv:2507.23334",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Recent advances in large language models (LLMs) have transformed open-domain question answering, yet their effectiveness in music-related reasoning remains limited due to sparse music knowledge in pretraining data. While music information retrieval and computational musicology have explored structured and multimodal understanding, few resources support factual and contextual music question answering (MQA) grounded in artist metadata or historical context. We introduce MusWikiDB, a vector database of 3.2M passages from 144K music-related Wikipedia pages, and ArtistMus, a benchmark of 1,000 questions on 500 diverse artists with metadata such as genre, debut year, and topic. These resources enable systematic evaluation of retrieval-augmented generation (RAG) for MQA. Experiments show that RAG markedly improves factual accuracy; open-source models gain up to +56.8 percentage points (for example, Qwen3 8B improves from 35.0 to 91.8), approaching proprietary model performance. RAG-style fine-tuning further boosts both factual recall and contextual reasoning, improving results on both in-domain and out-of-domain benchmarks. MusWikiDB also yields approximately 6 percentage points higher accuracy and 40% faster retrieval than a general-purpose Wikipedia corpus. We release MusWikiDB and ArtistMus to advance research in music information retrieval and domain-specific question answering, establishing a foundation for retrieval-augmented reasoning in culturally rich domains such as music.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05456",
        "abs_url": "https://arxiv.org/abs/2512.05456",
        "pdf_url": "https://arxiv.org/pdf/2512.05456",
        "title": "Do We Really Even Need Data? A Modern Look at Drawing Inference with Predicted Data",
        "authors": [
            "Stephen Salerno",
            "Kentaro Hoffman",
            "Awan Afiaz",
            "Anna Neufeld",
            "Tyler H. McCormick",
            "Jeffrey T. Leek"
        ],
        "comments": "32 pages, 9 figures, 3 tables",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "As artificial intelligence and machine learning tools become more accessible, and scientists face new obstacles to data collection (e.g., rising costs, declining survey response rates), researchers increasingly use predictions from pre-trained algorithms as substitutes for missing or unobserved data. Though appealing for financial and logistical reasons, using standard tools for inference can misrepresent the association between independent variables and the outcome of interest when the true, unobserved outcome is replaced by a predicted value. In this paper, we characterize the statistical challenges inherent to drawing inference with predicted data (IPD) and show that high predictive accuracy does not guarantee valid downstream inference. We show that all such failures reduce to statistical notions of (i) bias, when predictions systematically shift the estimand or distort relationships among variables, and (ii) variance, when uncertainty from the prediction model and the intrinsic variability of the true data are ignored. We then review recent methods for conducting IPD and discuss how this framework is deeply rooted in classical statistical theory. We then comment on some open questions and interesting avenues for future work in this area, and end with some comments on how to use predicted data in scientific studies that is both transparent and statistically principled.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05462",
        "abs_url": "https://arxiv.org/abs/2512.05462",
        "pdf_url": "https://arxiv.org/pdf/2512.05462",
        "title": "Model Gateway: Model Management Platform for Model-Driven Drug Discovery",
        "authors": [
            "Yan-Shiun Wu",
            "Nathan A. Morin"
        ],
        "comments": "7 pages, 7 figures",
        "subjects": "Software Engineering (cs.SE); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "This paper presents the Model Gateway, a management platform for managing machine learning (ML) and scientific computational models in the drug discovery pipeline. The platform supports Large Language Model (LLM) Agents and Generative AI-based tools to perform ML model management tasks in our Machine Learning operations (MLOps) pipelines, such as the dynamic consensus model, a model that aggregates several scientific computational models, registration and management, retrieving model information, asynchronous submission/execution of models, and receiving results once the model complete executions. The platform includes a Model Owner Control Panel, Platform Admin Tools, and Model Gateway API service for interacting with the platform and tracking model execution. The platform achieves a 0% failure rate when testing scaling beyond 10k simultaneous application clients consume models. The Model Gateway is a fundamental part of our model-driven drug discovery pipeline. It has the potential to significantly accelerate the development of new drugs with the maturity of our MLOps infrastructure and the integration of LLM Agents and Generative AI tools.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05500",
        "abs_url": "https://arxiv.org/abs/2512.05500",
        "pdf_url": "https://arxiv.org/pdf/2512.05500",
        "title": "SSDLabeler: Realistic semi-synthetic data generation for multi-label artifact classification in EEG",
        "authors": [
            "Taketo Akama",
            "Akima Connelly",
            "Shun Minamikawa",
            "Natalia Polouliakh"
        ],
        "comments": "",
        "subjects": "Neurons and Cognition (q-bio.NC); Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "EEG recordings are inherently contaminated by artifacts such as ocular, muscular, and environmental noise, which obscure neural activity and complicate preprocessing. Artifact classification offers advantages in stability and transparency, providing a viable alternative to ICA-based methods that enable flexible use alongside human inspections and across various applications. However, artifact classification is limited by its training data as it requires extensive manual labeling, which cannot fully cover the diversity of real-world EEG. Semi-synthetic data (SSD) methods have been proposed to address this limitation, but prior approaches typically injected single artifact types using ICA components or required separately recorded artifact signals, reducing both the realism of the generated data and the applicability of the method. To overcome these issues, we introduce SSDLabeler, a framework that generates realistic, annotated SSDs by decomposing real EEG with ICA, epoch-level artifact verification using RMS and PSD criteria, and reinjecting multiple artifact types into clean data. When applied to train a multi-label artifact classifier, it improved accuracy on raw EEG across diverse conditions compared to prior SSD and raw EEG training, establishing a scalable foundation for artifact handling that captures the co-occurrence and complexity of real EEG.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05508",
        "abs_url": "https://arxiv.org/abs/2512.05508",
        "pdf_url": "https://arxiv.org/pdf/2512.05508",
        "title": "Lyrics Matter: Exploiting the Power of Learnt Representations for Music Popularity Prediction",
        "authors": [
            "Yash Choudhary",
            "Preeti Rao",
            "Pushpak Bhattacharyya"
        ],
        "comments": "8 pages",
        "subjects": "Sound (cs.SD); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Accurately predicting music popularity is a critical challenge in the music industry, offering benefits to artists, producers, and streaming platforms. Prior research has largely focused on audio features, social metadata, or model architectures. This work addresses the under-explored role of lyrics in predicting popularity. We present an automated pipeline that uses LLM to extract high-dimensional lyric embeddings, capturing semantic, syntactic, and sequential information. These features are integrated into HitMusicLyricNet, a multimodal architecture that combines audio, lyrics, and social metadata for popularity score prediction in the range 0-100. Our method outperforms existing baselines on the SpotGenTrack dataset, which contains over 100,000 tracks, achieving 9% and 20% improvements in MAE and MSE, respectively. Ablation confirms that gains arise from our LLM-driven lyrics feature pipeline (LyricsAENet), underscoring the value of dense lyric representations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05525",
        "abs_url": "https://arxiv.org/abs/2512.05525",
        "pdf_url": "https://arxiv.org/pdf/2512.05525",
        "title": "Poodle: Seamlessly Scaling Down Large Language Models with Just-in-Time Model Replacement",
        "authors": [
            "Nils Strassenburg",
            "Boris Glavic",
            "Tilmann Rabl"
        ],
        "comments": "",
        "subjects": "Databases (cs.DB); Machine Learning (cs.LG)",
        "abstract": "Businesses increasingly rely on large language models (LLMs) to automate simple repetitive tasks instead of developing custom machine learning models. LLMs require few, if any, training examples and can be utilized by users without expertise in model development. However, this comes at the cost of substantially higher resource and energy consumption compared to smaller models, which often achieve similar predictive performance for simple tasks. In this paper, we present our vision for just-in-time model replacement (JITR), where, upon identifying a recurring task in calls to an LLM, the model is replaced transparently with a cheaper alternative that performs well for this specific task. JITR retains the ease of use and low development effort of LLMs, while saving significant cost and energy. We discuss the main challenges in realizing our vision regarding the identification of recurring tasks and the creation of a custom model. Specifically, we argue that model search and transfer learning will play a crucial role in JITR to efficiently identify and fine-tune models for a recurring task. Using our JITR prototype Poodle, we achieve significant savings for exemplary tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05528",
        "abs_url": "https://arxiv.org/abs/2512.05528",
        "pdf_url": "https://arxiv.org/pdf/2512.05528",
        "title": "Decoding Selective Auditory Attention to Musical Elements in Ecologically Valid Music Listening",
        "authors": [
            "Taketo Akama",
            "Zhuohao Zhang",
            "Tsukasa Nagashima",
            "Takagi Yutaka",
            "Shun Minamikawa",
            "Natalia Polouliakh"
        ],
        "comments": "",
        "subjects": "Neurons and Cognition (q-bio.NC); Machine Learning (cs.LG); Sound (cs.SD); Audio and Speech Processing (eess.AS); Signal Processing (eess.SP)",
        "abstract": "Art has long played a profound role in shaping human emotion, cognition, and behavior. While visual arts such as painting and architecture have been studied through eye tracking, revealing distinct gaze patterns between experts and novices, analogous methods for auditory art forms remain underdeveloped. Music, despite being a pervasive component of modern life and culture, still lacks objective tools to quantify listeners' attention and perceptual focus during natural listening experiences. To our knowledge, this is the first attempt to decode selective attention to musical elements using naturalistic, studio-produced songs and a lightweight consumer-grade EEG device with only four electrodes. By analyzing neural responses during real world like music listening, we test whether decoding is feasible under conditions that minimize participant burden and preserve the authenticity of the musical experience. Our contributions are fourfold: (i) decoding music attention in real studio-produced songs, (ii) demonstrating feasibility with a four-channel consumer EEG, (iii) providing insights for music attention decoding, and (iv) demonstrating improved model ability over prior work. Our findings suggest that musical attention can be decoded not only for novel songs but also across new subjects, showing performance improvements compared to existing approaches under our tested conditions. These findings show that consumer-grade devices can reliably capture signals, and that neural decoding in music could be feasible in real-world settings. This paves the way for applications in education, personalized music technologies, and therapeutic interventions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05611",
        "abs_url": "https://arxiv.org/abs/2512.05611",
        "pdf_url": "https://arxiv.org/pdf/2512.05611",
        "title": "Design-marginal calibration of Gaussian process predictive distributions: Bayesian and conformal approaches",
        "authors": [
            "Aurélien Pion",
            "Emmanuel Vazquez"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "We study the calibration of Gaussian process (GP) predictive distributions in the interpolation setting from a design-marginal perspective. Conditioning on the data and averaging over a design measure \\mu, we formalize \\mu-coverage for central intervals and \\mu-probabilistic calibration through randomized probability integral transforms. We introduce two methods. cps-gp adapts conformal predictive systems to GP interpolation using standardized leave-one-out residuals, yielding stepwise predictive distributions with finite-sample marginal calibration. bcr-gp retains the GP posterior mean and replaces the Gaussian residual by a generalized normal model fitted to cross-validated standardized residuals. A Bayesian selection rule-based either on a posterior upper quantile of the variance for conservative prediction or on a cross-posterior Kolmogorov-Smirnov criterion for probabilistic calibration-controls dispersion and tail behavior while producing smooth predictive distributions suitable for sequential design. Numerical experiments on benchmark functions compare cps-gp, bcr-gp, Jackknife+ for GPs, and the full conformal Gaussian process, using calibration metrics (coverage, Kolmogorov-Smirnov, integral absolute error) and accuracy or sharpness through the scaled continuous ranked probability score.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05657",
        "abs_url": "https://arxiv.org/abs/2512.05657",
        "pdf_url": "https://arxiv.org/pdf/2512.05657",
        "title": "Over-the-Air Semantic Alignment with Stacked Intelligent Metasurfaces",
        "authors": [
            "Mario Edoardo Pandolfo",
            "Kyriakos Stylianopoulos",
            "George C. Alexandropoulos",
            "Paolo Di Lorenzo"
        ],
        "comments": "",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Semantic communication systems aim to transmit task-relevant information between devices capable of artificial intelligence, but their performance can degrade when heterogeneous transmitter-receiver models produce misaligned latent representations. Existing semantic alignment methods typically rely on additional digital processing at the transmitter or receiver, increasing overall device complexity. In this work, we introduce the first over-the-air semantic alignment framework based on stacked intelligent metasurfaces (SIM), which enables latent-space alignment directly in the wave domain, reducing substantially the computational burden at the device level. We model SIMs as trainable linear operators capable of emulating both supervised linear aligners and zero-shot Parseval-frame-based equalizers. To realize these operators physically, we develop a gradient-based optimization procedure that tailors the metasurface transfer function to a desired semantic mapping. Experiments with heterogeneous vision transformer (ViT) encoders show that SIMs can accurately reproduce both supervised and zero-shot semantic equalizers, achieving up to 90% task accuracy in regimes with high signal-to-noise ratio (SNR), while maintaining strong robustness even at low SNR values.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05717",
        "abs_url": "https://arxiv.org/abs/2512.05717",
        "pdf_url": "https://arxiv.org/pdf/2512.05717",
        "title": "Comparing the latent features of universal machine-learning interatomic potentials",
        "authors": [
            "Sofiia Chorna",
            "Davide Tisi",
            "Cesare Malosso",
            "Wei Bin How",
            "Michele Ceriotti",
            "Sanggyu Chong"
        ],
        "comments": "",
        "subjects": "Chemical Physics (physics.chem-ph); Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG)",
        "abstract": "The past few years have seen the development of ``universal'' machine-learning interatomic potentials (uMLIPs) capable of approximating the ground-state potential energy surface across a wide range of chemical structures and compositions with reasonable accuracy. While these models differ in the architecture and the dataset used, they share the ability to compress a staggering amount of chemical information into descriptive latent features. Herein, we systematically analyze what the different uMLIPs have learned by quantitatively assessing the relative information content of their latent features with feature reconstruction errors as metrics, and observing how the trends are affected by the choice of training set and training protocol. We find that the uMLIPs encode chemical space in significantly distinct ways, with substantial cross-model feature reconstruction errors. When variants of the same model architecture are considered, trends become dependent on the dataset, target, and training protocol of choice. We also observe that fine-tuning of a uMLIP retains a strong pre-training bias in the latent features. Finally, we discuss how atom-level features, which are directly output by MLIPs, can be compressed into global structure-level features via concatenation of progressive cumulants, each adding significantly new information about the variability across the atomic environments within a given system.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05753",
        "abs_url": "https://arxiv.org/abs/2512.05753",
        "pdf_url": "https://arxiv.org/pdf/2512.05753",
        "title": "A Fast Anti-Jamming Cognitive Radar Deployment Algorithm Based on Reinforcement Learning",
        "authors": [
            "Wencheng Cai",
            "Xuchao Gao",
            "Congying Han",
            "Mingqiang Li",
            "Tiande Guo"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "The fast deployment of cognitive radar to counter jamming remains a critical challenge in modern warfare, where more efficient deployment leads to quicker detection of targets. Existing methods are primarily based on evolutionary algorithms, which are time-consuming and prone to falling into local optima. We tackle these drawbacks via the efficient inference of neural networks and propose a brand new framework: Fast Anti-Jamming Radar Deployment Algorithm (FARDA). We first model the radar deployment problem as an end-to-end task and design deep reinforcement learning algorithms to solve it, where we develop integrated neural modules to perceive heatmap information and a brand new reward format. Empirical results demonstrate that our method achieves coverage comparable to evolutionary algorithms while deploying radars approximately 7,000 times faster. Further ablation experiments confirm the necessity of each component of FARDA.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05783",
        "abs_url": "https://arxiv.org/abs/2512.05783",
        "pdf_url": "https://arxiv.org/pdf/2512.05783",
        "title": "Curvature-Regularized Variational Autoencoder for 3D Scene Reconstruction from Sparse Depth",
        "authors": [
            "Maryam Yousefi",
            "Soodeh Bakhshandeh"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "When depth sensors provide only 5% of needed measurements, reconstructing complete 3D scenes becomes difficult. Autonomous vehicles and robots cannot tolerate the geometric errors that sparse reconstruction introduces. We propose curvature regularization through a discrete Laplacian operator, achieving 18.1% better reconstruction accuracy than standard variational autoencoders. Our contribution challenges an implicit assumption in geometric deep learning: that combining multiple geometric constraints improves performance. A single well-designed regularization term not only matches but exceeds the effectiveness of complex multi-term formulations. The discrete Laplacian offers stable gradients and noise suppression with just 15% training overhead and zero inference cost. Code and models are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05818",
        "abs_url": "https://arxiv.org/abs/2512.05818",
        "pdf_url": "https://arxiv.org/pdf/2512.05818",
        "title": "Machine-learning-enabled interpretation of tribological deformation patterns in large-scale MD data",
        "authors": [
            "Hendrik J. Ehrich",
            "Marvin C. May",
            "Stefan J. Eder"
        ],
        "comments": "19 pages, 11 figures",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG)",
        "abstract": "Molecular dynamics (MD) simulations have become indispensable for exploring tribological deformation patterns at the atomic scale. However, transforming the resulting high-dimensional data into interpretable deformation pattern maps remains a resource-intensive and largely manual process. In this work, we introduce a data-driven workflow that automates this interpretation step using unsupervised and supervised learning. Grain-orientation-colored computational tomograph pictures obtained from CuNi alloy simulations were first compressed through an autoencoder to a 32-dimensional global feature vector. Despite this strong compression, the reconstructed images retained the essential microstructural motifs: grain boundaries, stacking faults, twins, and partial lattice rotations, while omitting only the finest defects. The learned representations were then combined with simulation metadata (composition, load, time, temperature, and spatial position) to train a CNN-MLP model to predict the dominant deformation pattern. The resulting model achieves a prediction accuracy of approximately 96% on validation data. A refined evaluation strategy, in which an entire spatial region containing distinct grains was excluded from training, provides a more robust measure of generalization. The approach demonstrates that essential tribological deformation signatures can be automatically identified and classified from structural images using Machine Learning. This proof of concept constitutes a first step towards fully automated, data-driven construction of tribological mechanism maps and, ultimately, toward predictive modeling frameworks that may reduce the need for large-scale MD simulation campaigns.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05887",
        "abs_url": "https://arxiv.org/abs/2512.05887",
        "pdf_url": "https://arxiv.org/pdf/2512.05887",
        "title": "Bootstrapping Fuzzers for Compilers of Low-Resource Language Dialects Using Language Models",
        "authors": [
            "Sairam Vaidya",
            "Marcel Böhme",
            "Loris D'Antoni"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG); Programming Languages (cs.PL)",
        "abstract": "Modern extensible compiler frameworks-such as MLIR-enable rapid creation of domain-specific language dialects. This flexibility, however, makes correctness harder to ensure as the same extensibility that accelerates development also complicates maintaining the testing infrastructure. Extensible languages require automated test generation that is both dialect-agnostic (works across dialects without manual adaptation) and dialect-effective (targets dialect-specific features to find bugs). Existing approaches typically sacrifice one of these goals by either requiring manually constructed seed corpora for each dialect, or by failing to be effective. We present a dialect-agnostic and dialect-effective grammar-based and coverage-guided fuzzing approach for extensible compilers that combines two key insights from existing work: (i) the grammars of dialects, which already encode the structural and type constraints, can often be extracted automatically from the dialect specification; and (ii) these grammars can be used in combination with pre-trained large language models to automatically generate representative and diverse seed inputs from the full dialect space without requiring any manual input or training data. These seeds can then be used to bootstrap coverage-guided fuzzers. We built this approach into a tool, Germinator. When evaluated on six MLIR projects spanning 91 dialects, Germinator generated seeds improve line coverage by 10-120% over grammar-based baselines. We compare against grammar-based baselines because they are the only class of existing automatic seed generators that can be applied uniformly across MLIR's heterogeneous dialect ecosystem. Germinator discovers 88 previously unknown bugs (40 confirmed), including 23 in dialects with no prior automated test generators, demonstrating effective and controllable testing of low-resource dialects at scale.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05926",
        "abs_url": "https://arxiv.org/abs/2512.05926",
        "pdf_url": "https://arxiv.org/pdf/2512.05926",
        "title": "BalLOT: Balanced $k$-means clustering with optimal transport",
        "authors": [
            "Wenyan Luo",
            "Dustin G. Mixon"
        ],
        "comments": "20 pages, 9 figures",
        "subjects": "Machine Learning (stat.ML); Data Structures and Algorithms (cs.DS); Information Theory (cs.IT); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "We consider the fundamental problem of balanced $k$-means clustering. In particular, we introduce an optimal transport approach to alternating minimization called BalLOT, and we show that it delivers a fast and effective solution to this problem. We establish this with a variety of numerical experiments before proving several theoretical guarantees. First, we prove that for generic data, BalLOT produces integral couplings at each step. Next, we perform a landscape analysis to provide theoretical guarantees for both exact and partial recoveries of planted clusters under the stochastic ball model. Finally, we propose initialization schemes that achieve one-step recovery of planted clusters.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05940",
        "abs_url": "https://arxiv.org/abs/2512.05940",
        "pdf_url": "https://arxiv.org/pdf/2512.05940",
        "title": "Designing an Optimal Sensor Network via Minimizing Information Loss",
        "authors": [
            "Daniel Waxman",
            "Fernando Llorente",
            "Katia Lamer",
            "Petar M. Djurić"
        ],
        "comments": "37 pages, 15 figures. Accepted to Bayesian Analysis",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG); Computation (stat.CO); Machine Learning (stat.ML)",
        "abstract": "Optimal experimental design is a classic topic in statistics, with many well-studied problems, applications, and solutions. The design problem we study is the placement of sensors to monitor spatiotemporal processes, explicitly accounting for the temporal dimension in our modeling and optimization. We observe that recent advancements in computational sciences often yield large datasets based on physics-based simulations, which are rarely leveraged in experimental design. We introduce a novel model-based sensor placement criterion, along with a highly-efficient optimization algorithm, which integrates physics-based simulations and Bayesian experimental design principles to identify sensor networks that \"minimize information loss\" from simulated data. Our technique relies on sparse variational inference and (separable) Gauss-Markov priors, and thus may adapt many techniques from Bayesian experimental design. We validate our method through a case study monitoring air temperature in Phoenix, Arizona, using state-of-the-art physics-based simulations. Our results show our framework to be superior to random or quasi-random sampling, particularly with a limited number of sensors. We conclude by discussing practical considerations and implications of our framework, including more complex modeling tools and real-world deployments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2025-12-08",
        "date_url": "https://arxiv.org/catchup/cs.LG/2025-12-08?abs=True",
        "arxiv_id": "2512.05957",
        "abs_url": "https://arxiv.org/abs/2512.05957",
        "pdf_url": "https://arxiv.org/pdf/2512.05957",
        "title": "Consequences of Kernel Regularity for Bandit Optimization",
        "authors": [
            "Madison Lee",
            "Tara Javidi"
        ],
        "comments": "Feedback welcome!",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "In this work we investigate the relationship between kernel regularity and algorithmic performance in the bandit optimization of RKHS functions. While reproducing kernel Hilbert space (RKHS) methods traditionally rely on global kernel regressors, it is also common to use a smoothness-based approach that exploits local approximations. We show that these perspectives are deeply connected through the spectral properties of isotropic kernels. In particular, we characterize the Fourier spectra of the Matérn, square-exponential, rational-quadratic, $\\gamma$-exponential, piecewise-polynomial, and Dirichlet kernels, and show that the decay rate determines asymptotic regret from both viewpoints. For kernelized bandit algorithms, spectral decay yields upper bounds on the maximum information gain, governing worst-case regret, while for smoothness-based methods, the same decay rates establish Hölder space embeddings and Besov space norm-equivalences, enabling local continuity analysis. These connections show that kernel-based and locally adaptive algorithms can be analyzed within a unified framework. This allows us to derive explicit regret bounds for each kernel family, obtaining novel results in several cases and providing improved analysis for others. Furthermore, we analyze LP-GP-UCB, an algorithm that combines both approaches, augmenting global Gaussian process surrogates with local polynomial estimators. While the hybrid approach does not uniformly dominate specialized methods, it achieves order-optimality across multiple kernel families.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]