[
    {
        "order": 1,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09066",
        "abs_url": "https://arxiv.org/abs/2602.09066",
        "pdf_url": "https://arxiv.org/pdf/2602.09066",
        "title": "Spectral Disentanglement and Enhancement: A Dual-domain Contrastive Framework for Representation Learning",
        "authors": [
            "Jinjin Guo",
            "Yexin Li",
            "Zhichao Huang",
            "Jun Fang",
            "Zhiyuan Liu",
            "Chao Liu",
            "Pengzhang Liu",
            "Qixia Jiang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Large-scale multimodal contrastive learning has recently achieved impressive success in learning rich and transferable representations, yet it remains fundamentally limited by the uniform treatment of feature dimensions and the neglect of the intrinsic spectral structure of the learned features. Empirical evidence indicates that high-dimensional embeddings tend to collapse into narrow cones, concentrating task-relevant semantics in a small subspace, while the majority of dimensions remain occupied by noise and spurious correlations. Such spectral imbalance and entanglement undermine model generalization. We propose Spectral Disentanglement and Enhancement (SDE), a novel framework that bridges the gap between the geometry of the embedded spaces and their spectral properties. Our approach leverages singular value decomposition to adaptively partition feature dimensions into strong signals that capture task-critical semantics, weak signals that reflect ancillary correlations, and noise representing irrelevant perturbations. A curriculum-based spectral enhancement strategy is then applied, selectively amplifying informative components with theoretical guarantees on training stability. Building upon the enhanced features, we further introduce a dual-domain contrastive loss that jointly optimizes alignment in both the feature and spectral spaces, effectively integrating spectral regularization into the training process and encouraging richer, more robust representations. Extensive experiments on large-scale multimodal benchmarks demonstrate that SDE consistently improves representation robustness and generalization, outperforming state-of-the-art methods. SDE integrates seamlessly with existing contrastive pipelines, offering an effective solution for multimodal representation learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09079",
        "abs_url": "https://arxiv.org/abs/2602.09079",
        "pdf_url": "https://arxiv.org/pdf/2602.09079",
        "title": "Patient foundation model for risk stratification in low-risk overweight patients",
        "authors": [
            "Zachary N. Flamholz",
            "Dillon Tracy",
            "Ripple Khera",
            "Jordan Wolinsky",
            "Nicholas Lee",
            "Nathaniel Tann",
            "Xiao Yin Zhu",
            "Harry Phillips",
            "Jeffrey Sherman"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate risk stratification in patients with overweight or obesity is critical for guiding preventive care and allocating high-cost therapies such as GLP-1 receptor agonists. We present PatientTPP, a neural temporal point process (TPP) model trained on over 500,000 real-world clinical trajectories to learn patient representations from sequences of diagnoses, labs, and medications. We extend existing TPP modeling approaches to include static and numeric features and incorporate clinical knowledge for event encoding. PatientTPP representations support downstream prediction tasks, including classification of obesity-associated outcomes in low-risk individuals, even for events not explicitly modeled during training. In health economic evaluation, PatientTPP outperformed body mass index in stratifying patients by future cardiovascular-related healthcare costs, identifying higher-risk patients more efficiently. By modeling both the type and timing of clinical events, PatientTPP offers an interpretable, general-purpose foundation for patient risk modeling with direct applications to obesity-related care and cost targeting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09081",
        "abs_url": "https://arxiv.org/abs/2602.09081",
        "pdf_url": "https://arxiv.org/pdf/2602.09081",
        "title": "DMamba: Decomposition-enhanced Mamba for Time Series Forecasting",
        "authors": [
            "Ruxuan Chen",
            "Fang Sun"
        ],
        "comments": "9 pages, 3 figures, 4 tables",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "State Space Models (SSMs), particularly Mamba, have shown potential in long-term time series forecasting. However, existing Mamba-based architectures often struggle with datasets characterized by non-stationary patterns. A key observation from time series theory is that the statistical nature of inter-variable relationships differs fundamentally between the trend and seasonal components of a decomposed series. Trend relationships are often driven by a few common stochastic factors or long-run equilibria, suggesting that they reside on a lower-dimensional manifold. In contrast, seasonal relationships involve dynamic, high-dimensional interactions like phase shifts and amplitude co-movements, requiring more expressive modeling. In this paper, we propose DMamba, a novel forecasting model that explicitly aligns architectural complexity with this component-specific characteristic. DMamba employs seasonal-trend decomposition and processes the components with specialized, differentially complex modules: a variable-direction Mamba encoder captures the rich, cross-variable dynamics within the seasonal component, while a simple Multi-Layer Perceptron (MLP) suffices to learn from the lower-dimensional inter-variable relationships in the trend component. Extensive experiments on diverse datasets demonstrate that DMamba sets a new state-of-the-art (SOTA), consistently outperforming both recent Mamba-based architectures and leading decomposition-based models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09101",
        "abs_url": "https://arxiv.org/abs/2602.09101",
        "pdf_url": "https://arxiv.org/pdf/2602.09101",
        "title": "From Adam to Adam-Like Lagrangians: Second-Order Nonlocal Dynamics",
        "authors": [
            "Carlos Heredia"
        ],
        "comments": "42 pages, 10 figures",
        "subjects": "Machine Learning (cs.LG); Dynamical Systems (math.DS); Numerical Analysis (math.NA); Optimization and Control (math.OC)",
        "abstract": "In this paper, we derive an accelerated continuous-time formulation of Adam by modeling it as a second-order integro-differential dynamical system. We relate this inertial nonlocal model to an existing first-order nonlocal Adam flow through an $\\alpha$-refinement limit, and we provide Lyapunov-based stability and convergence analyses. We also introduce an Adam-inspired nonlocal Lagrangian formulation, offering a variational viewpoint. Numerical simulations on Rosenbrock-type examples show agreement between the proposed dynamics and discrete Adam.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09113",
        "abs_url": "https://arxiv.org/abs/2602.09113",
        "pdf_url": "https://arxiv.org/pdf/2602.09113",
        "title": "Benchmarking the Energy Savings with Speculative Decoding Strategies",
        "authors": [
            "Rohit Dutta",
            "Paramita Koley",
            "Soham Poddar",
            "Janardan Misra",
            "Sanjay Podder",
            "Naveen Balani",
            "Saptarshi Ghosh",
            "Niloy Ganguly"
        ],
        "comments": "Accepted at EACL Findings 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Speculative decoding has emerged as an effective method to reduce latency and inference cost of LLM inferences. However, there has been inadequate attention towards the energy requirements of these models. To address this gap, this paper presents a comprehensive survey of energy requirements of speculative decoding strategies, with detailed analysis on how various factors -- model size and family, speculative decoding strategies, and dataset characteristics -- influence the energy optimizations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09116",
        "abs_url": "https://arxiv.org/abs/2602.09116",
        "pdf_url": "https://arxiv.org/pdf/2602.09116",
        "title": "Importance inversion transfer identifies shared principles for cross-domain learning",
        "authors": [
            "Daniele Caligiore"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Physics and Society (physics.soc-ph); Quantitative Methods (q-bio.QM)",
        "abstract": "The capacity to transfer knowledge across scientific domains relies on shared organizational principles. However, existing transfer-learning methodologies often fail to bridge radically heterogeneous systems, particularly under severe data scarcity or stochastic noise. This study formalizes Explainable Cross-Domain Transfer Learning (X-CDTL), a framework unifying network science and explainable artificial intelligence to identify structural invariants that generalize across biological, linguistic, molecular, and social networks. By introducing the Importance Inversion Transfer (IIT) mechanism, the framework prioritizes domain-invariant structural anchors over idiosyncratic, highly discriminative features. In anomaly detection tasks, models guided by these principles achieve significant performance gains - exhibiting a 56\\% relative improvement in decision stability under extreme noise - over traditional baselines. These results provide evidence for a shared organizational signature across heterogeneous domains, establishing a principled paradigm for cross-disciplinary knowledge propagation. By shifting from opaque latent representations to explicit structural laws, this work advances machine learning as a robust engine for scientific discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09120",
        "abs_url": "https://arxiv.org/abs/2602.09120",
        "pdf_url": "https://arxiv.org/pdf/2602.09120",
        "title": "SpinCastML an Open Decision-Making Application for Inverse Design of Electrospinning Manufacturing: A Machine Learning, Optimal Sampling and Inverse Monte Carlo Approach",
        "authors": [
            "Elisa Roldan",
            "Tasneem Sabir"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Electrospinning is a powerful technique for producing micro to nanoscale fibers with application specific architectures. Small variations in solution or operating conditions can shift the jet regime, generating non Gaussian fiber diameter distributions. Despite substantial progress, no existing framework enables inverse design toward desired fiber outcomes while integrating polymer solvent chemical constraints or predicting full distributions. SpinCastML is an open source, distribution aware, chemically informed machine learning and Inverse Monte Carlo (IMC) software for inverse electrospinning design. Built on a rigorously curated dataset of 68,480 fiber diameters from 1,778 datasets across 16 polymers, SpinCastML integrates three structured sampling methods, a suite of 11 high-performance learners, and chemistry aware constraints to predict not only mean diameter but the entire distribution. Cubist model with a polymer balanced Sobol D optimal sampling provides the highest global performance (R2 > 0.92). IMC accurately captures the fiber distributions, achieving R2 > 0.90 and <1% error between predicted and experimental success rates. The IMC engine supports both retrospective analysis and forward-looking inverse design, generating physically and chemically feasible polymer solvent parameter combinations with quantified success probabilities for user-defined targets. SpinCastML reframes electrospinning from trial and error to a reproducible, data driven design process. As an open source executable, it enables laboratories to analyze their own datasets and co create an expanding community software. SpinCastML reduces experimental waste, accelerates discovery, and democratizes access to advanced modeling, establishing distribution aware inverse design as a new standard for sustainable nanofiber manufacturing across biomedical, filtration, and energy applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09127",
        "abs_url": "https://arxiv.org/abs/2602.09127",
        "pdf_url": "https://arxiv.org/pdf/2602.09127",
        "title": "Epistemic Throughput: Fundamental Limits of Attention-Constrained Inference",
        "authors": [
            "Lei You"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Information Theory (cs.IT)",
        "abstract": "Recent generative and tool-using AI systems can surface a large volume of candidates at low marginal cost, yet only a small fraction can be checked carefully. This creates a decoder-side bottleneck: downstream decision-makers must form reliable posteriors from many public records under scarce attention. We formalize this regime via Attention-Constrained Inference (ACI), in which a cheap screening stage processes $K$ records and an expensive verification stage can follow up on at most $B$ of them. Under Bayes log-loss, we study the maximum achievable reduction in posterior uncertainty per window, which we call \\emph{epistemic throughput}. Our main result is a ``JaKoB'' scaling law showing that epistemic throughput has a baseline term that grows linearly with verification and prevalence, and an additional \\emph{information-leverage} term that scales as $\\sqrt{JKB}$, where $J$ summarizes screening quality. Thus, expanding cheap screening can nonlinearly amplify scarce verification, even when informative records are rare. We further show that this scaling is tight in a weak-screening limit, and that in the sparse-verification regime ($B \\ll K$), substantial leverage requires heavy-tailed score distributions; for light-tailed scores the amplification is only logarithmic.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09128",
        "abs_url": "https://arxiv.org/abs/2602.09128",
        "pdf_url": "https://arxiv.org/pdf/2602.09128",
        "title": "Counterfactual Maps: What They Are and How to Find Them",
        "authors": [
            "Awa Khouna",
            "Julien Ferry",
            "Thibaut Vidal"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Counterfactual explanations are a central tool in interpretable machine learning, yet computing them exactly for complex models remains challenging. For tree ensembles, predictions are piecewise constant over a large collection of axis-aligned hyperrectangles, implying that an optimal counterfactual for a point corresponds to its projection onto the nearest rectangle with an alternative label under a chosen metric. Existing methods largely overlook this geometric structure, relying either on heuristics with no optimality guarantees or on mixed-integer programming formulations that do not scale to interactive use. In this work, we revisit counterfactual generation through the lens of nearest-region search and introduce counterfactual maps, a global representation of recourse for tree ensembles. Leveraging the fact that any tree ensemble can be compressed into an equivalent partition of labeled hyperrectangles, we cast counterfactual search as the problem of identifying the generalized Voronoi cell associated with the nearest rectangle of an alternative label. This leads to an exact, amortized algorithm based on volumetric k-dimensional (KD) trees, which performs branch-and-bound nearest-region queries with explicit optimality certificates and sublinear average query time after a one-time preprocessing phase. Our experimental analyses on several real datasets drawn from high-stakes application domains show that this approach delivers globally optimal counterfactual explanations with millisecond-level latency, achieving query times that are orders of magnitude faster than existing exact, cold-start optimization methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09130",
        "abs_url": "https://arxiv.org/abs/2602.09130",
        "pdf_url": "https://arxiv.org/pdf/2602.09130",
        "title": "UniComp: A Unified Evaluation of Large Language Model Compression via Pruning, Quantization and Distillation",
        "authors": [
            "Jonathan von Rad",
            "Yong Cao",
            "Andreas Geiger"
        ],
        "comments": "18 pages, 6 figures. Submitted to ACL 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Model compression is increasingly essential for deploying large language models (LLMs), yet existing evaluations are limited in method coverage and focus primarily on knowledge-centric benchmarks. Thus, we introduce UniComp, a unified evaluation framework for comparing pruning, quantization, and knowledge distillation. UniComp evaluates compressed models along three dimensions: performance, reliability, and efficiency, using a diverse set of capability- and safety-oriented benchmarks together with a hardware-aware efficiency analysis. Through extensive evaluation of six compression techniques on modern LLMs across more than 40 datasets, we find that (i) compression exhibits a consistent knowledge bias, where knowledge-intensive tasks are relatively preserved while reasoning, multilingual, and instruction-following capabilities degrade substantially; (ii) quantization provides the best overall trade-off between retained performance and efficiency, whereas distillation yields strong runtime acceleration gains at high computational cost; and (iii) task-specific calibration can significantly improve the reasoning ability of pruned models by up to 50%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09158",
        "abs_url": "https://arxiv.org/abs/2602.09158",
        "pdf_url": "https://arxiv.org/pdf/2602.09158",
        "title": "What do Geometric Hallucination Detection Metrics Actually Measure?",
        "authors": [
            "Eric Yeats",
            "John Buckheit",
            "Sarah Scullen",
            "Brendan Kennedy",
            "Loc Truong",
            "Davis Brown",
            "Bill Kay",
            "Cliff Joslyn",
            "Tegan Emerson",
            "Michael J. Henry",
            "John Emanuello",
            "Henry Kvinge"
        ],
        "comments": "Published at the 2025 ICML Workshop on Reliable and Responsible Foundation Models",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Hallucination remains a barrier to deploying generative models in high-consequence applications. This is especially true in cases where external ground truth is not readily available to validate model outputs. This situation has motivated the study of geometric signals in the internal state of an LLM that are predictive of hallucination and require limited external knowledge. Given that there are a range of factors that can lead model output to be called a hallucination (e.g., irrelevance vs incoherence), in this paper we ask what specific properties of a hallucination these geometric statistics actually capture. To assess this, we generate a synthetic dataset which varies distinct properties of output associated with hallucination. This includes output correctness, confidence, relevance, coherence, and completeness. We find that different geometric statistics capture different types of hallucinations. Along the way we show that many existing geometric detection methods have substantial sensitivity to shifts in task domain (e.g., math questions vs. history questions). Motivated by this, we introduce a simple normalization method to mitigate the effect of domain shift on geometric statistics, leading to AUROC gains of +34 points in multi-domain settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09162",
        "abs_url": "https://arxiv.org/abs/2602.09162",
        "pdf_url": "https://arxiv.org/pdf/2602.09162",
        "title": "Boltzmann Reinforcement Learning for Noise resilience in Analog Ising Machines",
        "authors": [
            "Aditya Choudhary",
            "Saaketh Desai",
            "Prasad Iyer"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Analog Ising machines (AIMs) have emerged as a promising paradigm for combinatorial optimization, utilizing physical dynamics to solve Ising problems with high energy efficiency. However, the performance of traditional optimization and sampling algorithms on these platforms is often limited by inherent measurement noise. We introduce BRAIN (Boltzmann Reinforcement for Analog Ising Networks), a distribution learning framework that utilizes variational reinforcement learning to approximate the Boltzmann distribution. By shifting from state-by-state sampling to aggregating information across multiple noisy measurements, BRAIN is resilient to Gaussian noise characteristic of AIMs. We evaluate BRAIN across diverse combinatorial topologies, including the Curie-Weiss and 2D nearest-neighbor Ising systems. We find that under realistic 3\\% Gaussian measurement noise, BRAIN maintains 98\\% ground state fidelity, whereas Markov Chain Monte Carlo (MCMC) methods degrade to 51\\% fidelity. Furthermore, BRAIN reaches the MCMC-equivalent solution up to 192x faster under these conditions. BRAIN exhibits $\\mathcal{O}(N^{1.55})$ scaling up to 65,536 spins and maintains robustness against severe measurement uncertainty up to 40\\%. Beyond ground state optimization, BRAIN accurately captures thermodynamic phase transitions and metastable states, providing a scalable and noise-resilient method for utilizing analog computing architectures in complex optimizations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09164",
        "abs_url": "https://arxiv.org/abs/2602.09164",
        "pdf_url": "https://arxiv.org/pdf/2602.09164",
        "title": "Faster Rates For Federated Variational Inequalities",
        "authors": [
            "Guanghui Wang",
            "Satyen Kale"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In this paper, we study federated optimization for solving stochastic variational inequalities (VIs), a problem that has attracted growing attention in recent years. Despite substantial progress, a significant gap remains between existing convergence rates and the state-of-the-art bounds known for federated convex optimization. In this work, we address this limitation by establishing a series of improved convergence rates. First, we show that, for general smooth and monotone variational inequalities, the classical Local Extra SGD algorithm admits tighter guarantees under a refined analysis. Next, we identify an inherent limitation of Local Extra SGD, which can lead to excessive client drift. Motivated by this observation, we propose a new algorithm, the Local Inexact Proximal Point Algorithm with Extra Step (LIPPAX), and show that it mitigates client drift and achieves improved guarantees in several regimes, including bounded Hessian, bounded operator, and low-variance settings. Finally, we extend our results to federated composite variational inequalities and establish improved convergence guarantees.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09169",
        "abs_url": "https://arxiv.org/abs/2602.09169",
        "pdf_url": "https://arxiv.org/pdf/2602.09169",
        "title": "Train Less, Infer Faster: Efficient Model Finetuning and Compression via Structured Sparsity",
        "authors": [
            "Jonathan Svirsky",
            "Yehonathan Refael",
            "Ofir Lindenbaum"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Fully finetuning foundation language models (LMs) with billions of parameters is often impractical due to high computational costs, memory requirements, and the risk of overfitting. Although methods like low-rank adapters help address these challenges by adding small trainable modules to the frozen LM, they also increase memory usage and do not reduce inference latency. We uncover an intriguing phenomenon: sparsifying specific model rows and columns enables efficient task adaptation without requiring weight tuning. We propose a scheme for effective finetuning via sparsification using training stochastic gates, which requires minimal trainable parameters, reduces inference time, and removes 20--40\\% of model parameters without significant accuracy loss. Empirical results show it outperforms recent finetuning baselines in efficiency and performance. Additionally, we provide theoretical guarantees for the convergence of this stochastic gating process, and show that our method admits a simpler and better-conditioned optimization landscape compared to LoRA. Our results highlight sparsity as a compelling mechanism for task-specific adaptation in LMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09181",
        "abs_url": "https://arxiv.org/abs/2602.09181",
        "pdf_url": "https://arxiv.org/pdf/2602.09181",
        "title": "Weighted Wasserstein Barycenter of Gaussian Processes for exotic Bayesian Optimization tasks",
        "authors": [
            "Antonio Candelieri",
            "Francesco Archetti"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Exploiting the analogy between Gaussian Distributions and Gaussian Processes' posterior, we present how the weighted Wasserstein Barycenter of Gaussian Processes (W2BGP) can be used to unify, under a common framework, different exotic Bayesian Optimization (BO) tasks. Specifically, collaborative/federated BO, (synchronous) batch BO, and multi-fidelity BO are considered in this paper. Our empirical analysis proves that each one of these tasks requires just an appropriate weighting schema for the W2BGP, while the entire framework remains untouched. Moreover, we demonstrate that the most well-known BO acquisition functions can be easily re-interpreted under the proposed framework and also enable a more computationally efficient way to deal with the computation of the Wasserstein Barycenter, compared with state-of-the-art methods from the Machine Learning literature. Finally, research perspectives branching from the proposed approach are presented.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09194",
        "abs_url": "https://arxiv.org/abs/2602.09194",
        "pdf_url": "https://arxiv.org/pdf/2602.09194",
        "title": "ML-DCN: Masked Low-Rank Deep Crossing Network Towards Scalable Ads Click-through Rate Prediction at Pinterest",
        "authors": [
            "Jiacheng Li",
            "Yixiong Meng",
            "Yi wu",
            "Yun Zhao",
            "Sharare Zehtabian",
            "Jiayin Jin",
            "Degao Peng",
            "Jinfeng Zhuang",
            "Qifei Shen",
            "Kungang Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep learning recommendation systems rely on feature interaction modules to model complex user-item relationships across sparse categorical and dense features. In large-scale ad ranking, increasing model capacity is a promising path to improving both predictive performance and business outcomes, yet production serving budgets impose strict constraints on latency and FLOPs. This creates a central tension: we want interaction modules that both scale effectively with additional compute and remain compute-efficient at serving time. In this work, we study how to scale feature interaction modules under a fixed serving budget. We find that naively scaling DCNv2 and MaskNet, despite their widespread adoption in industry, yields rapidly diminishing offline gains in the Pinterest ads ranking system. To overcome aforementioned limitations, we propose ML-DCN, an interaction module that integrates an instance-conditioned mask into a low-rank crossing layer, enabling per-example selection and amplification of salient interaction directions while maintaining efficient computation. This novel architecture combines the strengths of DCNv2 and MaskNet, scales efficiently with increased compute, and achieves state-of-the-art performance. Experiments on a large internal Pinterest ads dataset show that ML-DCN achieves higher AUC than DCNv2, MaskNet, and recent scaling-oriented alternatives at matched FLOPs, and it scales more favorably overall as compute increases, exhibiting a stronger AUC-FLOPs trade-off. Finally, online A/B tests demonstrate statistically significant improvements in key ads metrics (including CTR and click-quality measures) and ML-DCN has been deployed in the production system with neutral serving cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09196",
        "abs_url": "https://arxiv.org/abs/2602.09196",
        "pdf_url": "https://arxiv.org/pdf/2602.09196",
        "title": "Fair Feature Importance Scores via Feature Occlusion and Permutation",
        "authors": [
            "Camille Little",
            "Madeline Navarro",
            "Santiago Segarra",
            "Genevera Allen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "As machine learning models increasingly impact society, their opaque nature poses challenges to trust and accountability, particularly in fairness contexts. Understanding how individual features influence model outcomes is crucial for building interpretable and equitable models. While feature importance metrics for accuracy are well-established, methods for assessing feature contributions to fairness remain underexplored. We propose two model-agnostic approaches to measure fair feature importance. First, we propose to compare model fairness before and after permuting feature values. This simple intervention-based approach decouples a feature and model predictions to measure its contribution to training. Second, we evaluate the fairness of models trained with and without a given feature. This occlusion-based score enjoys dramatic computational simplification via minipatch learning. Our empirical results reflect the simplicity and effectiveness of our proposed metrics for multiple predictive tasks. Both methods offer simple, scalable, and interpretable solutions to quantify the influence of features on fairness, providing new tools for responsible machine learning development.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09220",
        "abs_url": "https://arxiv.org/abs/2602.09220",
        "pdf_url": "https://arxiv.org/pdf/2602.09220",
        "title": "A Lightweight Multi-View Approach to Short-Term Load Forecasting",
        "authors": [
            "Julien GuitÃ©-Vinet",
            "Alexandre Blondin MassÃ©",
            "Ã‰ric Beaudry"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Time series forecasting is a critical task across domains such as energy, finance, and meteorology, where accurate predictions enable informed decision-making. While transformer-based and large-parameter models have recently achieved state-of-the-art results, their complexity can lead to overfitting and unstable forecasts, especially when older data points become less relevant. In this paper, we propose a lightweight multi-view approach to short-term load forecasting that leverages single-value embeddings and a scaled time-range input to capture temporally relevant features efficiently. We introduce an embedding dropout mechanism to prevent over-reliance on specific features and enhance interpretability. Our method achieves competitive performance with significantly fewer parameters, demonstrating robustness across multiple datasets, including scenarios with noisy or sparse data, and provides insights into the contributions of individual features to the forecast.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09225",
        "abs_url": "https://arxiv.org/abs/2602.09225",
        "pdf_url": "https://arxiv.org/pdf/2602.09225",
        "title": "Barycentric alignment for instance-level comparison of neural representations",
        "authors": [
            "Shreya Saha",
            "Zoe Wanying He",
            "Meenakshi Khosla"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Comparing representations across neural networks is challenging because representations admit symmetries, such as arbitrary reordering of units or rotations of activation space, that obscure underlying equivalence between models. We introduce a barycentric alignment framework that quotients out these nuisance symmetries to construct a universal embedding space across many models. Unlike existing similarity measures, which summarize relationships over entire stimulus sets, this framework enables similarity to be defined at the level of individual stimuli, revealing inputs that elicit convergent versus divergent representations across models. Using this instance-level notion of similarity, we identify systematic input properties that predict representational convergence versus divergence across vision and language model families. We also construct universal embedding spaces for brain representations across individuals and cortical regions, enabling instance-level comparison of representational agreement across stages of the human visual hierarchy. Finally, we apply the same barycentric alignment framework to purely unimodal vision and language models and find that post-hoc alignment into a shared space yields image text similarity scores that closely track human cross-modal judgments and approach the performance of contrastively trained vision-language models. This strikingly suggests that independently learned representations already share sufficient geometric structure for human-aligned cross-modal comparison. Together, these results show that resolving representational similarity at the level of individual stimuli reveals phenomena that cannot be detected by set-level comparison metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09229",
        "abs_url": "https://arxiv.org/abs/2602.09229",
        "pdf_url": "https://arxiv.org/pdf/2602.09229",
        "title": "Beyond the Unit Hypersphere: Embedding Magnitude in Contrastive Learning",
        "authors": [
            "Xincan Feng",
            "Taro Watanabe"
        ],
        "comments": "Preliminary work. Under review",
        "subjects": "Machine Learning (cs.LG); Information Retrieval (cs.IR)",
        "abstract": "Cosine similarity is prevalent in contrastive learning, yet it makes an implicit assumption: embedding magnitude is noise. Prior work occasionally found dot product and cosine similarity comparable, but left unanswered WHAT information magnitude carries, WHEN it helps, and HOW to leverage it. We conduct a systematic study through a $2 \\times 2$ ablation that independently controls input-side and output-side normalization across text and vision models. Our findings reveal three key insights. First, in text retrieval, output (document) magnitude strongly correlates with relevance (Cohen's $d$ up to 1.80), yielding the largest gains on reasoning-intensive tasks. Second, input and output magnitudes serve asymmetric roles: output magnitude directly scales similarity scores while input magnitude modulates training dynamics. Third, magnitude learning benefits asymmetric tasks (text retrieval, RAG) but harms symmetric tasks (STS, text-image alignment). These findings establish a task symmetry principle: the choice between cosine and dot product depends on whether the task has distinct input roles, enabling cost-free improvements by simply removing an unnecessary constraint.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09235",
        "abs_url": "https://arxiv.org/abs/2602.09235",
        "pdf_url": "https://arxiv.org/pdf/2602.09235",
        "title": "RAPID: Risk of Attribute Prediction-Induced Disclosure in Synthetic Microdata",
        "authors": [
            "Matthias Templ",
            "Oscar Thees",
            "Roman MÃ¼ller"
        ],
        "comments": "29 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP); Methodology (stat.ME)",
        "abstract": "Statistical data anonymization increasingly relies on fully synthetic microdata, for which classical identity disclosure measures are less informative than an adversary's ability to infer sensitive attributes from released data. We introduce RAPID (Risk of Attribute Prediction--Induced Disclosure), a disclosure risk measure that directly quantifies inferential vulnerability under a realistic attack model. An adversary trains a predictive model solely on the released synthetic data and applies it to real individuals' quasi-identifiers. For continuous sensitive attributes, RAPID reports the proportion of records whose predicted values fall within a specified relative error tolerance. For categorical attributes, we propose a baseline-normalized confidence score that measures how much more confident the attacker is about the true class than would be expected from class prevalence alone, and we summarize risk as the fraction of records exceeding a policy-defined threshold. This construction yields an interpretable, bounded risk metric that is robust to class imbalance, independent of any specific synthesizer, and applicable with arbitrary learning algorithms. We illustrate threshold calibration, uncertainty quantification, and comparative evaluation of synthetic data generators using simulations and real data. Our results show that RAPID provides a practical, attacker-realistic upper bound on attribute-inference disclosure risk that complements existing utility diagnostics and disclosure control frameworks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09238",
        "abs_url": "https://arxiv.org/abs/2602.09238",
        "pdf_url": "https://arxiv.org/pdf/2602.09238",
        "title": "Feature salience -- not task-informativeness -- drives machine learning model explanations",
        "authors": [
            "Benedict Clark",
            "Marta Oliveira",
            "Rick Wilming",
            "Stefan Haufe"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Explainable AI (XAI) promises to provide insight into machine learning models' decision processes, where one goal is to identify failures such as shortcut learning. This promise relies on the field's assumption that input features marked as important by an XAI must contain information about the target variable. However, it is unclear whether informativeness is indeed the main driver of importance attribution in practice, or if other data properties such as statistical suppression, novelty at test-time, or high feature salience substantially contribute. To clarify this, we trained deep learning models on three variants of a binary image classification task, in which translucent watermarks are either absent, act as class-dependent confounds, or represent class-independent noise. Results for five popular attribution methods show substantially elevated relative importance in watermarked areas (RIW) for all models regardless of the training setting ($R^2 \\geq .45$). By contrast, whether the presence of watermarks is class-dependent or not only has a marginal effect on RIW ($R^2 \\leq .03$), despite a clear impact impact on model performance and generalisation ability. XAI methods show similar behaviour to model-agnostic edge detection filters and attribute substantially less importance to watermarks when bright image intensities are encoded by smaller instead of larger feature values. These results indicate that importance attribution is most strongly driven by the salience of image structures at test time rather than statistical associations learned by machine learning models. Previous studies demonstrating successful XAI application should be reevaluated with respect to a possibly spurious concurrency of feature salience and informativeness, and workflows using feature attribution methods as building blocks should be scrutinised.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09258",
        "abs_url": "https://arxiv.org/abs/2602.09258",
        "pdf_url": "https://arxiv.org/pdf/2602.09258",
        "title": "Generalizing GNNs with Tokenized Mixture of Experts",
        "authors": [
            "Xiaoguang Guo",
            "Zehong Wang",
            "Jiazheng Li",
            "Shawn Spitzel",
            "Qi Yang",
            "Kaize Ding",
            "Jundong Li",
            "Chuxu Zhang"
        ],
        "comments": "Graph Neural Networks, Generalization, Mixture of Experts",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deployed graph neural networks (GNNs) are frozen at deployment yet must fit clean data, generalize under distribution shifts, and remain stable to perturbations. We show that static inference induces a fundamental tradeoff: improving stability requires reducing reliance on shift-sensitive features, leaving an irreducible worst-case generalization floor. Instance-conditional routing can break this ceiling, but is fragile because shifts can mislead routing and perturbations can make routing fluctuate. We capture these effects via two decompositions separating coverage vs selection, and base sensitivity vs fluctuation amplification. Based on these insights, we propose STEM-GNN, a pretrain-then-finetune framework with a mixture-of-experts encoder for diverse computation paths, a vector-quantized token interface to stabilize encoder-to-head signals, and a Lipschitz-regularized head to bound output amplification. Across nine node, link, and graph benchmarks, STEM-GNN achieves a stronger three-way balance, improving robustness to degree/homophily shifts and to feature/edge corruptions while remaining competitive on clean graphs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09278",
        "abs_url": "https://arxiv.org/abs/2602.09278",
        "pdf_url": "https://arxiv.org/pdf/2602.09278",
        "title": "The effect of whitening on explanation performance",
        "authors": [
            "Benedict Clark",
            "Stoyan Karastoyanov",
            "Rick Wilming",
            "Stefan Haufe"
        ],
        "comments": "Presented at the NeurIPS 2024 workshop on Interpretable AI: Past, Present and Future",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Explainable Artificial Intelligence (XAI) aims to provide transparent insights into machine learning models, yet the reliability of many feature attribution methods remains a critical challenge. Prior research (Haufe et al., 2014; Wilming et al., 2022, 2023) has demonstrated that these methods often erroneously assign significant importance to non-informative variables, such as suppressor variables, leading to fundamental misinterpretations. Since statistical suppression is induced by feature dependencies, this study investigates whether data whitening, a common preprocessing technique for decorrelation, can mitigate such errors. Using the established XAI-TRIS benchmark (Clark et al., 2024b), which offers synthetic ground-truth data and quantitative measures of explanation correctness, we empirically evaluate 16 popular feature attribution methods applied in combination with 5 distinct whitening transforms. Additionally, we analyze a minimal linear two-dimensional classification problem (Wilming et al., 2023) to theoretically assess whether whitening can remove the impact of suppressor features from Bayes-optimal models. Our results indicate that, while specific whitening techniques can improve explanation performance, the degree of improvement varies substantially across XAI methods and model architectures. These findings highlight the complex relationship between data non-linearities, preprocessing quality, and attribution fidelity, underscoring the vital role of pre-processing techniques in enhancing model interpretability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09288",
        "abs_url": "https://arxiv.org/abs/2602.09288",
        "pdf_url": "https://arxiv.org/pdf/2602.09288",
        "title": "Measuring Privacy Risks and Tradeoffs in Financial Synthetic Data Generation",
        "authors": [
            "Michael Zuo",
            "Inwon Kang",
            "Stacy Patterson",
            "Oshani Seneviratne"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We explore the privacy-utility tradeoff of synthetic data generation schemes on tabular financial datasets, a domain characterized by high regulatory risk and severe class imbalance. We consider representative tabular data generators, including autoencoders, generative adversarial networks, diffusion, and copula synthesizers. To address the challenges of the financial domain, we provide novel privacy-preserving implementations of GAN and autoencoder synthesizers. We evaluate whether and how well the generators simultaneously achieve data quality, downstream utility, and privacy, with comparison across balanced and imbalanced input datasets. Our results offer insight into the distinct challenges of generating synthetic data from datasets that exhibit severe class imbalance and mixed-type attributes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09295",
        "abs_url": "https://arxiv.org/abs/2602.09295",
        "pdf_url": "https://arxiv.org/pdf/2602.09295",
        "title": "Positive-Unlabelled Active Learning to Curate a Dataset for Orca Resident Interpretation",
        "authors": [
            "Bret Nestor",
            "Bohan Yao",
            "Jasmine Moore",
            "Jasper Kanes"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Sound (cs.SD)",
        "abstract": "This work presents the largest curation of Southern Resident Killer Whale (SRKW) acoustic data to date, also containing other marine mammals in their environment. We systematically search all available public archival hydrophone data within the SRKW habitat (over 30 years of audio data). The search consists of a weakly-supervised, positive-unlabelled, active learning strategy to identify all instances of marine mammals. The resulting transformer-based detectors outperform state-of-the-art detectors on the DEEPAL, DCLDE-2026, and two newly introduced expert-annotated datasets in terms of accuracy, energy efficiency, and speed. The detection model has a specificity of 0-28.8% at 95% sensitivity. Our multiclass species classifier obtains a top-1 accuracy of 42.1% (11 train classes, 4 test classes) and our ecotype classifier obtains a top-1 accuracy of 43.0% (4 train classes, 5 test classes) on the DCLDE-2026 dataset. We yield 919 hours of SRKW data, 230 hours of Bigg's orca data, 1374 hours of orca data from unlabelled ecotypes, 1501 hours of humpback data, 88 hours of sea lion data, 246 hours of pacific white-sided dolphin data, and over 784 hours of unspecified marine mammal data. This SRKW dataset is larger than DCLDE-2026, Ocean Networks Canada, and OrcaSound combined. The curated species labels are available under CC-BY 4.0 license, and the corresponding audio data are available under the licenses of the original owners. The comprehensive nature of this dataset makes it suitable for unsupervised machine translation, habitat usage surveys, and conservation endeavours for this critically endangered ecotype.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09297",
        "abs_url": "https://arxiv.org/abs/2602.09297",
        "pdf_url": "https://arxiv.org/pdf/2602.09297",
        "title": "The Laplacian Mechanism Improves Transformers by Reshaping Token Geometry",
        "authors": [
            "Yuchong Zhang",
            "Vardan Papyan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Transformers leverage attention, the residual connection, and layer normalization to control the variance of token representations. We propose to modify attention into a Laplacian mechanism that gives the model more direct control over token variance. We conjecture that this helps transformers achieve the ideal token geometry. To investigate our conjecture, we first show that incorporating the Laplacian mechanism into transformers induces consistent improvements across benchmarks in computer vision and language. Next, we study how the Laplacian mechanism impacts the geometry of token representations using various tools: 1) principal component analysis, 2) cosine similarity metric, 3) analysis of variance, and 4) Neural Collapse metrics. Our investigation shows that the Laplacian mechanism reshapes token embeddings toward a geometry of maximal separability: tokens collapse according to their classes, and the class means exhibit Neural Collapse.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09300",
        "abs_url": "https://arxiv.org/abs/2602.09300",
        "pdf_url": "https://arxiv.org/pdf/2602.09300",
        "title": "Risk-sensitive reinforcement learning using expectiles, shortfall risk and optimized certainty equivalent risk",
        "authors": [
            "Sumedh Gupte",
            "Shrey Rakeshkumar Patel",
            "Soumen Pachal",
            "Prashanth L. A.",
            "Sanjay P. Bhat"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose risk-sensitive reinforcement learning algorithms catering to three families of risk measures, namely expectiles, utility-based shortfall risk and optimized certainty equivalent risk. For each risk measure, in the context of a finite horizon Markov decision process, we first derive a policy gradient theorem. Second, we propose estimators of the risk-sensitive policy gradient for each of the aforementioned risk measures, and establish $\\mathcal{O}\\left(1/m\\right)$ mean-squared error bounds for our estimators, where $m$ is the number of trajectories. Further, under standard assumptions for policy gradient-type algorithms, we establish smoothness of the risk-sensitive objective, in turn leading to stationary convergence rate bounds for the overall risk-sensitive policy gradient algorithm that we propose. Finally, we conduct numerical experiments to validate the theoretical findings on popular RL benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09303",
        "abs_url": "https://arxiv.org/abs/2602.09303",
        "pdf_url": "https://arxiv.org/pdf/2602.09303",
        "title": "Stabilizing Physics-Informed Consistency Models via Structure-Preserving Training",
        "authors": [
            "Che-Chia Chang",
            "Chen-Yang Dai",
            "Te-Sheng Lin",
            "Ming-Chih Lai",
            "Chieh-Hsin Lai"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "We propose a physics-informed consistency modeling framework for solving partial differential equations (PDEs) via fast, few-step generative inference. We identify a key stability challenge in physics-constrained consistency training, where PDE residuals can drive the model toward trivial or degenerate solutions, degrading the learned data distribution. To address this, we introduce a structure-preserving two-stage training strategy that decouples distribution learning from physics enforcement by freezing the coefficient decoder during physics-informed fine-tuning. We further propose a two-step residual objective that enforces physical consistency on refined, structurally valid generative trajectories rather than noisy single-step predictions. The resulting framework enables stable, high-fidelity inference for both unconditional generation and forward problems. We demonstrate that forward solutions can be obtained via a projection-based zero-shot inpainting procedure, achieving consistent accuracy of diffusion baselines with orders of magnitude reduction in computational cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09304",
        "abs_url": "https://arxiv.org/abs/2602.09304",
        "pdf_url": "https://arxiv.org/pdf/2602.09304",
        "title": "Statistical Roughness-Informed Machine Unlearning",
        "authors": [
            "Mohammad Partohaghighi",
            "Roummel Marcia",
            "Bruce J. West",
            "YangQuan Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine unlearning aims to remove the influence of a designated forget set from a trained model while preserving utility on the retained data. In modern deep networks, approximate unlearning frequently fails under large or adversarial deletions due to pronounced layer-wise heterogeneity: some layers exhibit stable, well-regularized representations while others are brittle, undertrained, or overfit, so naive update allocation can trigger catastrophic forgetting or unstable dynamics. We propose Statistical-Roughness Adaptive Gradient Unlearning (SRAGU), a mechanism-first unlearning algorithm that reallocates unlearning updates using layer-wise statistical roughness operationalized via heavy-tailed spectral diagnostics of layer weight matrices. Starting from an Adaptive Gradient Unlearning (AGU) sensitivity signal computed on the forget set, SRAGU estimates a WeightWatcher-style heavy-tailed exponent for each layer, maps it to a bounded spectral stability weight, and uses this stability signal to spectrally reweight the AGU sensitivities before applying the same minibatch update form. This concentrates unlearning motion in spectrally stable layers while damping updates in unstable or overfit layers, improving stability under hard deletions. We evaluate unlearning via behavioral alignment to a gold retrained reference model trained from scratch on the retained data, using empirical prediction-divergence and KL-to-gold proxies on a forget-focused query set; we additionally report membership inference auditing as a complementary leakage signal, treating forget-set points as should-be-forgotten members during evaluation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09305",
        "abs_url": "https://arxiv.org/abs/2602.09305",
        "pdf_url": "https://arxiv.org/pdf/2602.09305",
        "title": "Reward Modeling for Reinforcement Learning-Based LLM Reasoning: Design, Challenges, and Evaluation",
        "authors": [
            "Pei-Chi Pan",
            "Yingbin Liang",
            "Sen Lin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) demonstrate transformative potential, yet their reasoning remains inconsistent and unreliable. Reinforcement learning (RL)-based fine-tuning is a key mechanism for improvement, but its effectiveness is fundamentally governed by reward design. Despite its importance, the relationship between reward modeling and core LLM challenges--such as evaluation bias, hallucination, distribution shift, and efficient learning--remains poorly understood. This work argues that reward modeling is not merely an implementation detail but a central architect of reasoning alignment, shaping what models learn, how they generalize, and whether their outputs can be trusted. We introduce Reasoning-Aligned Reinforcement Learning (RARL), a unifying framework that systematizes diverse reward paradigms for multi-step reasoning. Within this framework, we present a taxonomy of reward mechanisms, analyze reward hacking as a pervasive failure mode, and examine how reward signals unify challenges ranging from inference-time scaling to hallucination mitigation. We further critically evaluate existing benchmarks, highlighting vulnerabilities such as data contamination and reward misalignment, and outline directions for more robust evaluation. By integrating fragmented research threads and clarifying the interplay between reward design and fundamental reasoning capabilities, this work provides a foundational roadmap for building reasoning models that are robust, verifiable, and trustworthy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09306",
        "abs_url": "https://arxiv.org/abs/2602.09306",
        "pdf_url": "https://arxiv.org/pdf/2602.09306",
        "title": "Empowering Contrastive Federated Sequential Recommendation with LLMs",
        "authors": [
            "Thi Minh Chau Nguyen",
            "Minh Hieu Nguyen",
            "Duc Anh Nguyen",
            "Xuan Huong Tran",
            "Thanh Trung Huynh",
            "Quoc Viet Hung Nguyen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Databases (cs.DB)",
        "abstract": "Federated sequential recommendation (FedSeqRec) aims to perform next-item prediction while keeping user data decentralised, yet model quality is frequently constrained by fragmented, noisy, and homogeneous interaction logs stored on individual devices. Many existing approaches attempt to compensate through manual data augmentation or additional server-side constraints, but these strategies either introduce limited semantic diversity or increase system overhead. To overcome these challenges, we propose \\textbf{LUMOS}, a parameter-isolated FedSeqRec architecture that integrates large language models (LLMs) as \\emph{local semantic generators}. Instead of sharing gradients or auxiliary parameters, LUMOS privately invokes an on-device LLM to construct three complementary sequence variants from each user history: (i) \\emph{future-oriented} trajectories that infer plausible behavioural continuations, (ii) \\emph{semantically equivalent rephrasings} that retain user intent while diversifying interaction patterns, and (iii) \\emph{preference-inconsistent counterfactuals} that serve as informative negatives. These synthesized sequences are jointly encoded within the federated backbone through a tri-view contrastive optimisation scheme, enabling richer representation learning without exposing sensitive information. Experimental results across three public benchmarks show that LUMOS achieves consistent gains over competitive centralised and federated baselines on HR@20 and NDCG@20. In addition, the use of semantically grounded positive signals and counterfactual negatives improves robustness under noisy and adversarial environments, even without dedicated server-side protection modules. Overall, this work demonstrates the potential of LLM-driven semantic generation as a new paradigm for advancing privacy-preserving federated recommendation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09316",
        "abs_url": "https://arxiv.org/abs/2602.09316",
        "pdf_url": "https://arxiv.org/pdf/2602.09316",
        "title": "Effective MoE-based LLM Compression by Exploiting Heterogeneous Inter-Group Experts Routing Frequency and Information Density",
        "authors": [
            "Zhendong Mi",
            "Yixiao Chen",
            "Pu Zhao",
            "Xiaodong Yu",
            "Hao Wang",
            "Yanzhi Wang",
            "Shaoyi Huang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Mixture-of-Experts (MoE) based Large Language Models (LLMs) have achieved superior performance, yet the massive memory overhead caused by storing multiple expert networks severely hinders their practical deployment. Singular Value Decomposition (SVD)-based compression has emerged as a promising post-training technique; however, most existing methods apply uniform rank allocation or rely solely on static weight properties. This overlooks the substantial heterogeneity in expert utilization observed in MoE models, where frequent routing patterns and intrinsic information density vary significantly across experts. In this work, we propose RFID-MoE, an effective framework for MoE compression by exploiting heterogeneous Routing Frequency and Information Density. We first introduce a fused metric that combines expert activation frequency with effective rank to measure expert importance, adaptively allocating higher ranks to critical expert groups under a fixed budget. Moreover, instead of discarding compression residuals, we reconstruct them via a parameter-efficient sparse projection mechanism to recover lost information with minimal parameter overhead. Extensive experiments on representative MoE LLMs (e.g., Qwen3, DeepSeekMoE) across multiple compression ratios demonstrate that RFID-MoE consistently outperforms state-of-the-art methods like MoBE and D2-MoE. Notably, RFID-MoE achieves a perplexity of 16.92 on PTB with the Qwen3-30B model at a 60% compression ratio, reducing perplexity by over 8.0 compared to baselines, and improves zero-shot accuracy on HellaSwag by approximately 8%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09317",
        "abs_url": "https://arxiv.org/abs/2602.09317",
        "pdf_url": "https://arxiv.org/pdf/2602.09317",
        "title": "SnareNet: Flexible Repair Layers for Neural Networks with Hard Constraints",
        "authors": [
            "Ya-Chi Chu",
            "Alkiviades Boukas",
            "Madeleine Udell"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Machine Learning (stat.ML)",
        "abstract": "Neural networks are increasingly used as surrogate solvers and control policies, but unconstrained predictions can violate physical, operational, or safety requirements. We propose SnareNet, a feasibility-controlled architecture for learning mappings whose outputs must satisfy input-dependent nonlinear constraints. SnareNet appends a differentiable repair layer that navigates in the constraint map's range space, steering iterates toward feasibility and producing a repaired output that satisfies constraints to a user-specified tolerance. To stabilize end-to-end training, we introduce adaptive relaxation, which designs a relaxed feasible set that snares the neural network at initialization and shrinks it into the feasible set, enabling early exploration and strict feasibility later in training. On optimization-learning and trajectory planning benchmarks, SnareNet consistently attains improved objective quality while satisfying constraints more reliably than prior work.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09326",
        "abs_url": "https://arxiv.org/abs/2602.09326",
        "pdf_url": "https://arxiv.org/pdf/2602.09326",
        "title": "Priority-Aware Shapley Value",
        "authors": [
            "Kiljae Lee",
            "Ziqi Liu",
            "Weijing Tang",
            "Yuan Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Shapley values are widely used for model-agnostic data valuation and feature attribution, yet they implicitly assume contributors are interchangeable. This can be problematic when contributors are dependent (e.g., reused/augmented data or causal feature orderings) or when contributions should be adjusted by factors such as trust or risk. We propose Priority-Aware Shapley Value (PASV), which incorporates both hard precedence constraints and soft, contributor-specific priority weights. PASV is applicable to general precedence structures, recovers precedence-only and weight-only Shapley variants as special cases, and is uniquely characterized by natural axioms. We develop an efficient adjacent-swap Metropolis-Hastings sampler for scalable Monte Carlo estimation and analyze limiting regimes induced by extreme priority weights. Experiments on data valuation (MNIST/CIFAR10) and feature attribution (Census Income) demonstrate more structure-faithful allocations and a practical sensitivity analysis via our proposed \"priority sweeping\".",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09328",
        "abs_url": "https://arxiv.org/abs/2602.09328",
        "pdf_url": "https://arxiv.org/pdf/2602.09328",
        "title": "In-Hospital Stroke Prediction from PPG-Derived Hemodynamic Features",
        "authors": [
            "Jiaming Liu",
            "Cheng Ding",
            "Daoqiang Zhang"
        ],
        "comments": "11 pages, 6 figures, 3 tables. To appear in Proceedings of the 32nd ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD '26)",
        "subjects": "Machine Learning (cs.LG); Image and Video Processing (eess.IV)",
        "abstract": "The absence of pre-hospital physiological data in standard clinical datasets fundamentally constrains the early prediction of stroke, as patients typically present only after stroke has occurred, leaving the predictive value of continuous monitoring signals such as photoplethysmography (PPG) unvalidated. In this work, we overcome this limitation by focusing on a rare but clinically critical cohort - patients who suffered stroke during hospitalization while already under continuous monitoring - thereby enabling the first large-scale analysis of pre-stroke PPG waveforms aligned to verified onset times. Using MIMIC-III and MC-MED, we develop an LLM-assisted data mining pipeline to extract precise in-hospital stroke onset timestamps from unstructured clinical notes, followed by physician validation, identifying 176 patients (MIMIC) and 158 patients (MC-MED) with high-quality synchronized pre-onset PPG data, respectively. We then extract hemodynamic features from PPG and employ a ResNet-1D model to predict impending stroke across multiple early-warning horizons. The model achieves F1-scores of 0.7956, 0.8759, and 0.9406 at 4, 5, and 6 hours prior to onset on MIMIC-III, and, without re-tuning, reaches 0.9256, 0.9595, and 0.9888 on MC-MED for the same horizons. These results provide the first empirical evidence from real-world clinical data that PPG contains predictive signatures of stroke several hours before onset, demonstrating that passively acquired physiological signals can support reliable early warning, supporting a shift from post-event stroke recognition to proactive, physiology-based surveillance that may materially improve patient outcomes in routine clinical care.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09329",
        "abs_url": "https://arxiv.org/abs/2602.09329",
        "pdf_url": "https://arxiv.org/pdf/2602.09329",
        "title": "MacrOData: New Benchmarks of Thousands of Datasets for Tabular Outlier Detection",
        "authors": [
            "Xueying Ding",
            "Simon KlÃ¼ttermann",
            "Haomin Wen",
            "Yilong Chen",
            "Leman Akoglu"
        ],
        "comments": "28 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Quality benchmarks are essential for fairly and accurately tracking scientific progress and enabling practitioners to make informed methodological choices. Outlier detection (OD) on tabular data underpins numerous real-world applications, yet existing OD benchmarks remain limited. The prominent OD benchmark AdBench is the de facto standard in the literature, yet comprises only 57 datasets. In addition to other shortcomings discussed in this work, its small scale severely restricts diversity and statistical power. We introduce MacrOData, a large-scale benchmark suite for tabular OD comprising three carefully curated components: OddBench, with 790 datasets containing real-world semantic anomalies; OvrBench, with 856 datasets featuring real-world statistical outliers; and SynBench, with 800 synthetically generated datasets spanning diverse data priors and outlier archetypes. Owing to its scale and diversity, MacrOData enables comprehensive and statistically robust evaluation of tabular OD methods. Our benchmarks further satisfy several key desiderata: We provide standardized train/test splits for all datasets, public/private benchmark partitions with held-out test labels for the latter reserved toward an online leaderboard, and annotate our datasets with semantic metadata. We conduct extensive experiments across all benchmarks, evaluating a broad range of OD methods comprising classical, deep, and foundation models, over diverse hyperparameter configurations. We report detailed empirical findings, practical guidelines, as well as individual performances as references for future research. All benchmarks containing 2,446 datasets combined are open-sourced, along with a publicly accessible leaderboard hosted at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09349",
        "abs_url": "https://arxiv.org/abs/2602.09349",
        "pdf_url": "https://arxiv.org/pdf/2602.09349",
        "title": "Large Language Models for Designing Participatory Budgeting Rules",
        "authors": [
            "Nguyen Thach",
            "Xingchen Sha",
            "Hau Chan"
        ],
        "comments": "Accepted as full paper to AAMAS 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Participatory budgeting (PB) is a democratic paradigm for deciding the funding of public projects given the residents' preferences, which has been adopted in numerous cities across the world. The main focus of PB is designing rules, functions that return feasible budget allocations for a set of projects subject to some budget constraint. Designing PB rules that optimize both utility and fairness objectives based on agent preferences had been challenging due to the extensive domain knowledge required and the proven trade-off between the two notions. Recently, large language models (LLMs) have been increasingly employed for automated algorithmic design. Given the resemblance of PB rules to algorithms for classical knapsack problems, in this paper, we introduce a novel framework, named LLMRule, that addresses the limitations of existing works by incorporating LLMs into an evolutionary search procedure for automating the design of PB rules. Our experimental results, evaluated on more than 600 real-world PB instances obtained from the U.S., Canada, Poland, and the Netherlands with different representations of agent preferences, demonstrate that the LLM-generated rules generally outperform existing handcrafted rules in terms of overall utility while still maintaining a similar degree of fairness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09375",
        "abs_url": "https://arxiv.org/abs/2602.09375",
        "pdf_url": "https://arxiv.org/pdf/2602.09375",
        "title": "Latent PoincarÃ© Shaping for Agentic Reinforcement Learning",
        "authors": [
            "Hanchen Xia",
            "Baoyou Chen",
            "Zelin Zang",
            "Yutang Ge",
            "Guojiang Zhao",
            "Siyu Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose LaPha, a method for training AlphaZero-like LLM agents in a PoincarÃ© latent space. Under LaPha, the search process can be visualized as a tree rooted at the prompt and growing outward from the origin toward the boundary of the PoincarÃ© ball, where negative curvature provides exponentially increasing capacity with radius. Using hyperbolic geodesic distance to rule-verified correctness, we define a node potential and assign dense process rewards by potential differences. We further attach a lightweight value head on the same shared latent space, enabling self-guided test-time scaling with almost no additional overhead. On MATH-500, LaPha improves Qwen2.5-Math-1.5B from 66.0% to 88.2%. With value-head-guided search, LaPha-1.5B reaches 56.7% accuracy on AIME'24, and LaPha-7B further achieves 60.0% on AIME'24 and 53.3% on AIME'25.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09395",
        "abs_url": "https://arxiv.org/abs/2602.09395",
        "pdf_url": "https://arxiv.org/pdf/2602.09395",
        "title": "Sparse Layer Sharpness-Aware Minimization for Efficient Fine-Tuning",
        "authors": [
            "Yifei Cheng",
            "Xianglin Yang",
            "Guoxia Wang",
            "Chao Huang",
            "Fei Ma",
            "Dianhai Yu",
            "Xiaochun Cao",
            "Li Shen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Sharpness-aware minimization (SAM) seeks the minima with a flat loss landscape to improve the generalization performance in machine learning tasks, including fine-tuning. However, its extra parameter perturbation step doubles the computation cost, which becomes the bottleneck of SAM in the practical implementation. In this work, we propose an approach SL-SAM to break this bottleneck by introducing the sparse technique to layers. Our key innovation is to frame the dynamic selection of layers for both the gradient ascent (perturbation) and descent (update) steps as a multi-armed bandit problem. At the beginning of each iteration, SL-SAM samples a part of the layers of the model according to the gradient norm to participate in the backpropagation of the following parameter perturbation and update steps, thereby reducing the computation complexity. We then provide the analysis to guarantee the convergence of SL-SAM. In the experiments of fine-tuning models in several tasks, SL-SAM achieves the performances comparable to the state-of-the-art baselines, including a \\#1 rank on LLM fine-tuning. Meanwhile, SL-SAM significantly reduces the ratio of active parameters in backpropagation compared to vanilla SAM (SL-SAM activates 47\\%, 22\\% and 21\\% parameters on the vision, moderate and large language model respectively while vanilla SAM always activates 100\\%), verifying the efficiency of our proposed algorithm.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09402",
        "abs_url": "https://arxiv.org/abs/2602.09402",
        "pdf_url": "https://arxiv.org/pdf/2602.09402",
        "title": "Learning with Multiple Correct Answers -- A Trichotomy of Regret Bounds under Different Feedback Models",
        "authors": [
            "Alireza F. Pour",
            "Farnam Mansouri",
            "Shai Ben-David"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study an online learning problem with multiple correct answers, where each instance admits a set of valid labels, and in each round the learner must output a valid label for the queried example. This setting is motivated by language generation tasks, in which a prompt may admit many acceptable completions, but not every completion is acceptable. We study this problem under three feedback models. For each model, we characterize the optimal mistake bound in the realizable setting using an appropriate combinatorial dimension. We then establish a trichotomy of regret bounds across the three models in the agnostic setting. Our results also imply sample complexity bounds for the batch setup that depend on the respective combinatorial dimensions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09424",
        "abs_url": "https://arxiv.org/abs/2602.09424",
        "pdf_url": "https://arxiv.org/pdf/2602.09424",
        "title": "Reward-Guided Discrete Diffusion via Clean-Sample Markov Chain for Molecule and Biological Sequence Design",
        "authors": [
            "Prin Phunyaphibarn",
            "Minhyuk Sung"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Discrete diffusion models have recently emerged as a powerful class of generative models for chemistry and biology data. In these fields, the goal is to generate various samples with high rewards (e.g., drug-likeness in molecules), making reward-based guidance crucial. Most existing methods are based on guiding the diffusion model using intermediate rewards but tend to underperform since intermediate rewards are noisy due to the non-smooth nature of reward functions used in scientific domains. To address this, we propose Clean-Sample Markov Chain (CSMC) Sampler, a method that performs effective test-time reward-guided sampling for discrete diffusion models, enabling local search without relying on intermediate rewards. CSMC constructs a Markov chain of clean samples using the Metropolis-Hastings algorithm such that its stationary distribution is the target distribution. We design a proposal distribution by sequentially applying the forward and backward diffusion processes, making the acceptance probability tractable. Experiments on molecule and biological sequence generation with various reward functions demonstrate that our method consistently outperforms prior approaches that rely on intermediate rewards.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09456",
        "abs_url": "https://arxiv.org/abs/2602.09456",
        "pdf_url": "https://arxiv.org/pdf/2602.09456",
        "title": "Taming the Monster Every Context: Complexity Measure and Unified Framework for Offline-Oracle Efficient Contextual Bandits",
        "authors": [
            "Hao Qin",
            "Chicheng Zhang"
        ],
        "comments": "40 pages (13 pages main body, 24 pages supplementary materials)",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We propose an algorithmic framework, Offline Estimation to Decisions (OE2D), that reduces contextual bandit learning with general reward function approximation to offline regression. The framework allows near-optimal regret for contextual bandits with large action spaces with $O(log(T))$ calls to an offline regression oracle over $T$ rounds, and makes $O(loglog(T))$ calls when $T$ is known. The design of OE2D algorithm generalizes Falcon~\\citep{simchi2022bypassing} and its linear reward version~\\citep[][Section 4]{xu2020upper} in that it chooses an action distribution that we term ``exploitative F-design'' that simultaneously guarantees low regret and good coverage that trades off exploration and exploitation. Central to our regret analysis is a new complexity measure, the Decision-Offline Estimation Coefficient (DOEC), which we show is bounded in bounded Eluder dimension per-context and smoothed regret settings. We also establish a relationship between DOEC and Decision Estimation Coefficient (DEC)~\\citep{foster2021statistical}, bridging the design principles of offline- and online-oracle efficient contextual bandit algorithms for the first time.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09461",
        "abs_url": "https://arxiv.org/abs/2602.09461",
        "pdf_url": "https://arxiv.org/pdf/2602.09461",
        "title": "Scalable and Reliable State-Aware Inference of High-Impact N-k Contingencies",
        "authors": [
            "Lihao Mai",
            "Chenhan Xiao",
            "Yang Weng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Increasing penetration of inverter-based resources, flexible loads, and rapidly changing operating conditions make higher-order $N\\!-\\!k$ contingency assessment increasingly important but computationally prohibitive. Exhaustive evaluation of all outage combinations using AC power-flow or ACOPF is infeasible in routine operation. This fact forces operators to rely on heuristic screening methods whose ability to consistently retain all critical contingencies is not formally established. This paper proposes a scalable, state-aware contingency inference framework designed to directly generate high-impact $N\\!-\\!k$ outage scenarios without enumerating the combinatorial contingency space. The framework employs a conditional diffusion model to produce candidate contingencies tailored to the current operating state, while a topology-aware graph neural network trained only on base and $N\\!-\\!1$ cases efficiently constructs high-risk training samples offline. Finally, the framework is developed to provide controllable coverage guarantees for severe contingencies, allowing operators to explicitly manage the risk of missing critical events under limited AC power-flow evaluation budgets. Experiments on IEEE benchmark systems show that, for a given evaluation budget, the proposed approach consistently evaluates higher-severity contingencies than uniform sampling. This allows critical outages to be identified more reliably with reduced computational effort.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09474",
        "abs_url": "https://arxiv.org/abs/2602.09474",
        "pdf_url": "https://arxiv.org/pdf/2602.09474",
        "title": "Online Learning in MDPs with Partially Adversarial Transitions and Losses",
        "authors": [
            "Ofir Schlisselberg",
            "Tal Lancewicki",
            "Yishay Mansour"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study reinforcement learning in MDPs whose transition function is stochastic at most steps but may behave adversarially at a fixed subset of $\\Lambda$ steps per episode. This model captures environments that are stable except at a few vulnerable points. We introduce \\emph{conditioned occupancy measures}, which remain stable across episodes even with adversarial transitions, and use them to design two algorithms. The first handles arbitrary adversarial steps and achieves regret $\\tilde{O}(H S^{\\Lambda}\\sqrt{K S A^{\\Lambda+1}})$, where $K$ is the number of episodes, $S$ is the number of state, $A$ is the number of actions and $H$ is the episode's horizon. The second, assuming the adversarial steps are consecutive, improves the dependence on $S$ to $\\tilde{O}(H\\sqrt{K S^{3} A^{\\Lambda+1}})$. We further give a $K^{2/3}$-regret reduction that removes the need to know which steps are the $\\Lambda$ adversarial steps. We also characterize the regret of adversarial MDPs in the \\emph{fully adversarial} setting ($\\Lambda=H-1$) both for full-information and bandit feedback, and provide almost matching upper and lower bounds (slightly strengthen existing lower bounds, and clarify how different feedback structures affect the hardness of learning).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09487",
        "abs_url": "https://arxiv.org/abs/2602.09487",
        "pdf_url": "https://arxiv.org/pdf/2602.09487",
        "title": "Adaptive recurrent flow map operator learning for reaction diffusion dynamics",
        "authors": [
            "Huseyin Tunc"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "Reaction-diffusion (RD) equations underpin pattern formation across chemistry, biology, and physics, yet learning stable operators that forecast their long-term dynamics from data remains challenging. Neural-operator surrogates provide resolution-robust prediction, but autoregressive rollouts can drift due to the accumulation of error, and out-of-distribution (OOD) initial conditions often degrade accuracy. Physics-based numerical residual objectives can regularize operator learning, although they introduce additional assumptions, sensitivity to discretization and loss design, and higher training cost. Here we develop a purely data-driven operator learner with adaptive recurrent training (DDOL-ART) using a robust recurrent strategy with lightweight validation milestones that early-exit unproductive rollout segments and redirect optimization. Trained only on a single in-distribution toroidal Gaussian family over short horizons, DDOL-ART learns one-step operators that remain stable under long rollouts and generalize zero-shot to strong morphology shifts across FitzHugh-Nagumo (FN), Gray-Scott (GS), and Lambda-Omega (LO) systems. Across these benchmarks, DDOL-ART delivers a strong accuracy and cost trade-off. It is several-fold faster than a physics-based numerical-loss operator learner (NLOL) under matched settings, and it remains competitive on both in-distribution stability and OOD robustness. Training-dynamics diagnostics show that adaptivity strengthens the correlation between validation error and OOD test error performance, acting as a feedback controller that limits optimization drift. Our results indicate that feedback-controlled recurrent training of DDOL-ART generates robust flow-map surrogates without PDE residuals, while simultaneously maintaining competitiveness with NLOL at significantly reduced training costs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09499",
        "abs_url": "https://arxiv.org/abs/2602.09499",
        "pdf_url": "https://arxiv.org/pdf/2602.09499",
        "title": "Computationally Efficient Replicable Learning of Parities",
        "authors": [
            "Moshe Noivirt",
            "Jessica Sorrell",
            "Eliad Tsfadia"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "We study the computational relationship between replicability (Impagliazzo et al. [STOC `22], Ghazi et al. [NeurIPS `21]) and other stability notions. Specifically, we focus on replicable PAC learning and its connections to differential privacy (Dwork et al. [TCC 2006]) and to the statistical query (SQ) model (Kearns [JACM `98]). Statistically, it was known that differentially private learning and replicable learning are equivalent and strictly more powerful than SQ-learning. Yet, computationally, all previously known efficient (i.e., polynomial-time) replicable learning algorithms were confined to SQ-learnable tasks or restricted distributions, in contrast to differentially private learning. Our main contribution is the first computationally efficient replicable algorithm for realizable learning of parities over arbitrary distributions, a task that is known to be hard in the SQ-model, but possible under differential privacy. This result provides the first evidence that efficient replicable learning over general distributions strictly extends efficient SQ-learning, and is closer in power to efficient differentially private learning, despite computational separations between replicability and privacy. Our main building block is a new, efficient, and replicable algorithm that, given a set of vectors, outputs a subspace of their linear span that covers most of them.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09502",
        "abs_url": "https://arxiv.org/abs/2602.09502",
        "pdf_url": "https://arxiv.org/pdf/2602.09502",
        "title": "Improved Approximate Regret for Decentralized Online Continuous Submodular Maximization via Reductions",
        "authors": [
            "Yuanyu Wan",
            "Yu Shen",
            "Dingzhi Yu",
            "Bo Xue",
            "Mingli Song"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "To expand the applicability of decentralized online learning, previous studies have proposed several algorithms for decentralized online continuous submodular maximization (D-OCSM) -- a non-convex/non-concave setting with continuous DR-submodular reward functions. However, there exist large gaps between their approximate regret bounds and the regret bounds achieved in the convex setting. Moreover, if focusing on projection-free algorithms, which can efficiently handle complex decision sets, they cannot even recover the approximate regret bounds achieved in the centralized setting. In this paper, we first demonstrate that for D-OCSM over general convex decision sets, these two issues can be addressed simultaneously. Furthermore, for D-OCSM over downward-closed decision sets, we show that the second issue can be addressed while significantly alleviating the first issue. Our key techniques are two reductions from D-OCSM to decentralized online convex optimization (D-OCO), which can exploit D-OCO algorithms to improve the approximate regret of D-OCSM in these two cases, respectively.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09507",
        "abs_url": "https://arxiv.org/abs/2602.09507",
        "pdf_url": "https://arxiv.org/pdf/2602.09507",
        "title": "Towards Uniformity and Alignment for Multimodal Representation Learning",
        "authors": [
            "Wenzhe Yin",
            "Pan Zhou",
            "Zehao Xiao",
            "Jie Liu",
            "Shujian Yu",
            "Jan-Jakob Sonke",
            "Efstratios Gavves"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multimodal representation learning aims to construct a shared embedding space in which heterogeneous modalities are semantically aligned. Despite strong empirical results, InfoNCE-based objectives introduce inherent conflicts that yield distribution gaps across modalities. In this work, we identify two conflicts in the multimodal regime, both exacerbated as the number of modalities increases: (i) an alignment-uniformity conflict, whereby the repulsion of uniformity undermines pairwise alignment, and (ii) an intra-alignment conflict, where aligning multiple modalities induces competing alignment directions. To address these issues, we propose a principled decoupling of alignment and uniformity for multimodal representations, providing a conflict-free recipe for multimodal learning that simultaneously supports discriminative and generative use cases without task-specific modules. We then provide a theoretical guarantee that our method acts as an efficient proxy for a global HÃ¶lder divergence over multiple modality distributions, and thus reduces the distribution gap among modalities. Extensive experiments on retrieval and UnCLIP-style generation demonstrate consistent gains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09509",
        "abs_url": "https://arxiv.org/abs/2602.09509",
        "pdf_url": "https://arxiv.org/pdf/2602.09509",
        "title": "Beyond Student: An Asymmetric Network for Neural Network Inheritance",
        "authors": [
            "Yiyun Zhou",
            "Jingwei Shi",
            "Mingjing Xu",
            "Zhonghua Jiang",
            "Jingyuan Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Knowledge Distillation (KD) has emerged as a powerful technique for model compression, enabling lightweight student networks to benefit from the performance of redundant teacher networks. However, the inherent capacity gap often limits the performance of student networks. Inspired by the expressiveness of pretrained teacher networks, a compelling research question arises: is there a type of network that can not only inherit the teacher's structure but also maximize the inheritance of its knowledge? Furthermore, how does the performance of such an inheriting network compare to that of student networks, all benefiting from the same teacher network? To further explore this question, we propose InherNet, a neural network inheritance method that performs asymmetric low-rank decomposition on the teacher's weights and reconstructs a lightweight yet expressive network without significant architectural disruption. By leveraging Singular Value Decomposition (SVD) for initialization to ensure the inheritance of principal knowledge, InherNet effectively balances depth, width, and compression efficiency. Experimental results across unimodal and multimodal tasks demonstrate that InherNet achieves higher performance compared to student networks of similar parameter sizes. Our findings reveal a promising direction for future research in efficient model compression beyond traditional distillation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09520",
        "abs_url": "https://arxiv.org/abs/2602.09520",
        "pdf_url": "https://arxiv.org/pdf/2602.09520",
        "title": "Rashomon Sets and Model Multiplicity in Federated Learning",
        "authors": [
            "Xenia Heilmann",
            "Luca Corbucci",
            "Mattia Cerrato"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "The Rashomon set captures the collection of models that achieve near-identical empirical performance yet may differ substantially in their decision boundaries. Understanding the differences among these models, i.e., their multiplicity, is recognized as a crucial step toward model transparency, fairness, and robustness, as it reveals decision boundaries instabilities that standard metrics obscure. However, the existing definitions of Rashomon set and multiplicity metrics assume centralized learning and do not extend naturally to decentralized, multi-party settings like Federated Learning (FL). In FL, multiple clients collaboratively train models under a central server's coordination without sharing raw data, which preserves privacy but introduces challenges from heterogeneous client data distribution and communication constraints. In this setting, the choice of a single best model may homogenize predictive behavior across diverse clients, amplify biases, or undermine fairness guarantees. In this work, we provide the first formalization of Rashomon sets in this http URL, we adapt the Rashomon set definition to FL, distinguishing among three perspectives: (I) a global Rashomon set defined over aggregated statistics across all clients, (II) a t-agreement Rashomon set representing the intersection of local Rashomon sets across a fraction t of clients, and (III) individual Rashomon sets specific to each client's local this http URL, we show how standard multiplicity metrics can be estimated under FL's privacy constraints. Finally, we introduce a multiplicity-aware FL pipeline and conduct an empirical study on standard FL benchmark datasets. Our results demonstrate that all three proposed federated Rashomon set definitions offer valuable insights, enabling clients to deploy models that better align with their local data, fairness considerations, and practical requirements.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09566",
        "abs_url": "https://arxiv.org/abs/2602.09566",
        "pdf_url": "https://arxiv.org/pdf/2602.09566",
        "title": "ECG-IMN: Interpretable Mesomorphic Neural Networks for 12-Lead Electrocardiogram Interpretation",
        "authors": [
            "Vajira Thambawita",
            "Jonas L. Isaksen",
            "JÃ¸rgen K. Kanters",
            "Hugo L. Hammer",
            "PÃ¥l Halvorsen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV); Methodology (stat.ME)",
        "abstract": "Deep learning has achieved expert-level performance in automated electrocardiogram (ECG) diagnosis, yet the \"black-box\" nature of these models hinders their clinical deployment. Trust in medical AI requires not just high accuracy but also transparency regarding the specific physiological features driving predictions. Existing explainability methods for ECGs typically rely on post-hoc approximations (e.g., Grad-CAM and SHAP), which can be unstable, computationally expensive, and unfaithful to the model's actual decision-making process. In this work, we propose the ECG-IMN, an Interpretable Mesomorphic Neural Network tailored for high-resolution 12-lead ECG classification. Unlike standard classifiers, the ECG-IMN functions as a hypernetwork: a deep convolutional backbone generates the parameters of a strictly linear model specific to each input sample. This architecture enforces intrinsic interpretability, as the decision logic is mathematically transparent and the generated weights (W) serve as exact, high-resolution feature attribution maps. We introduce a transition decoder that effectively maps latent features to sample-wise weights, enabling precise localization of pathological evidence (e.g., ST-elevation, T-wave inversion) in both time and lead dimensions. We evaluate our approach on the PTB-XL dataset for classification tasks, demonstrating that the ECG-IMN achieves competitive predictive performance (AUROC comparable to black-box baselines) while providing faithful, instance-specific explanations. By explicitly decoupling parameter generation from prediction execution, our framework bridges the gap between deep learning capability and clinical trustworthiness, offering a principled path toward \"white-box\" cardiac diagnostics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09569",
        "abs_url": "https://arxiv.org/abs/2602.09569",
        "pdf_url": "https://arxiv.org/pdf/2602.09569",
        "title": "Training deep physical neural networks with local physical information bottleneck",
        "authors": [
            "Hao Wang",
            "Ziao Wang",
            "Xiangpeng Liang",
            "Han Zhao",
            "Jianqi Hu",
            "Junjie Jiang",
            "Xing Fu",
            "Jianshi Tang",
            "Huaqiang Wu",
            "Sylvain Gigan",
            "Qiang Liu"
        ],
        "comments": "9 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG); Applied Physics (physics.app-ph)",
        "abstract": "Deep learning has revolutionized modern society but faces growing energy and latency constraints. Deep physical neural networks (PNNs) are interconnected computing systems that directly exploit analog dynamics for energy-efficient, ultrafast AI execution. Realizing this potential, however, requires universal training methods tailored to physical intricacies. Here, we present the Physical Information Bottleneck (PIB), a general and efficient framework that integrates information theory and local learning, enabling deep PNNs to learn under arbitrary physical dynamics. By allocating matrix-based information bottlenecks to each unit, we demonstrate supervised, unsupervised, and reinforcement learning across electronic memristive chips and optical computing platforms. PIB also adapts to severe hardware faults and allows for parallel training via geographically distributed resources. Bypassing auxiliary digital models and contrastive measurements, PIB recasts PNN training as an intrinsic, scalable information-theoretic process compatible with diverse physical substrates.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09578",
        "abs_url": "https://arxiv.org/abs/2602.09578",
        "pdf_url": "https://arxiv.org/pdf/2602.09578",
        "title": "Rollout-Training Co-Design for Efficient LLM-Based Multi-Agent Reinforcement Learning",
        "authors": [
            "Zhida Jiang",
            "Zhaolong Xing",
            "Jiawei Lu",
            "Yipei Niu",
            "Qingyuan Sang",
            "Liangxu Zhang",
            "Wenquan Dai",
            "Junhua Shu",
            "Jiaxing Wang",
            "Qiangyu Pei",
            "Qiong Chen",
            "Xinyu Liu",
            "Fangming Liu",
            "Ai Han",
            "Zhen Chen",
            "Ke Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Despite algorithm-level innovations for multi-agent reinforcement learning (MARL), the underlying networked infrastructure for large-scale MARL training remains underexplored. Existing training frameworks primarily optimize for single-agent scenarios and fail to address the unique system-level challenges of MARL, including rollout-training synchronization barriers, rollout load imbalance, and training resource underutilization. To bridge this gap, we propose FlexMARL, the first end-to-end training framework that holistically optimizes rollout, training, and their orchestration for large-scale LLM-based MARL. Specifically, FlexMARL introduces the joint orchestrator to manage data flow under the rollout-training disaggregated architecture. Building upon the experience store, a novel micro-batch driven asynchronous pipeline eliminates the synchronization barriers while providing strong consistency guarantees. Rollout engine adopts a parallel sampling scheme combined with hierarchical load balancing, which adapts to skewed inter/intra-agent request patterns. Training engine achieves on-demand hardware binding through agent-centric resource allocation. The training states of different agents are swapped via unified and location-agnostic communication. Empirical results on a large-scale production cluster demonstrate that FlexMARL achieves up to 7.3x speedup and improves hardware utilization by up to 5.6x compared to existing frameworks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09593",
        "abs_url": "https://arxiv.org/abs/2602.09593",
        "pdf_url": "https://arxiv.org/pdf/2602.09593",
        "title": "Why the Counterintuitive Phenomenon of Likelihood Rarely Appears in Tabular Anomaly Detection with Deep Generative Models?",
        "authors": [
            "Donghwan Kim",
            "Junghun Phee",
            "Hyunsoo Yoon"
        ],
        "comments": "47 pages, 11 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Deep generative models with tractable and analytically computable likelihoods, exemplified by normalizing flows, offer an effective basis for anomaly detection through likelihood-based scoring. We demonstrate that, unlike in the image domain where deep generative models frequently assign higher likelihoods to anomalous data, such counterintuitive behavior occurs far less often in tabular settings. We first introduce a domain-agnostic formulation that enables consistent detection and evaluation of the counterintuitive phenomenon, addressing the absence of precise definition. Through extensive experiments on 47 tabular datasets and 10 CV/NLP embedding datasets in ADBench, benchmarked against 13 baseline models, we demonstrate that the phenomenon, as defined, is consistently rare in general tabular data. We further investigate this phenomenon from both theoretical and empirical perspectives, focusing on the roles of data dimensionality and difference in feature correlation. Our results suggest that likelihood-only detection with normalizing flows offers a practical and reliable approach for anomaly detection in tabular domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09634",
        "abs_url": "https://arxiv.org/abs/2602.09634",
        "pdf_url": "https://arxiv.org/pdf/2602.09634",
        "title": "LLM-FS: Zero-Shot Feature Selection for Effective and Interpretable Malware Detection",
        "authors": [
            "Naveen Gill",
            "Ajvad Haneef K",
            "Madhu Kumar S D"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Feature selection (FS) remains essential for building accurate and interpretable detection models, particularly in high-dimensional malware datasets. Conventional FS methods such as Extra Trees, Variance Threshold, Tree-based models, Chi-Squared tests, ANOVA, Random Selection, and Sequential Attention rely primarily on statistical heuristics or model-driven importance scores, often overlooking the semantic context of features. Motivated by recent progress in LLM-driven FS, we investigate whether large language models (LLMs) can guide feature selection in a zero-shot setting, using only feature names and task descriptions, as a viable alternative to traditional approaches. We evaluate multiple LLMs (GPT-5.0, GPT-4.0, Gemini-2.5 etc.) on the EMBOD dataset (a fusion of EMBER and BODMAS benchmark datasets), comparing them against established FS methods across several classifiers, including Random Forest, Extra Trees, MLP, and KNN. Performance is assessed using accuracy, precision, recall, F1, AUC, MCC, and runtime. Our results demonstrate that LLM-guided zero-shot feature selection achieves competitive performance with traditional FS methods while offering additional advantages in interpretability, stability, and reduced dependence on labeled data. These findings position zero-shot LLM-based FS as a promising alternative strategy for effective and interpretable malware detection, paving the way for knowledge-guided feature selection in security-critical applications",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09639",
        "abs_url": "https://arxiv.org/abs/2602.09639",
        "pdf_url": "https://arxiv.org/pdf/2602.09639",
        "title": "Blind denoising diffusion models and the blessings of dimensionality",
        "authors": [
            "Zahra Kadkhodaie",
            "Aram-Alexandre Pooladian",
            "Sinho Chewi",
            "Eero Simoncelli"
        ],
        "comments": "40 pages, 12 figures",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We analyze, theoretically and empirically, the performance of generative diffusion models based on \\emph{blind denoisers}, in which the denoiser is not given the noise amplitude in either the training or sampling processes. Assuming that the data distribution has low intrinsic dimensionality, we prove that blind denoising diffusion models (BDDMs), despite not having access to the noise amplitude, \\emph{automatically} track a particular \\emph{implicit} noise schedule along the reverse process. Our analysis shows that BDDMs can accurately sample from the data distribution in polynomially many steps as a function of the intrinsic dimension. Empirical results corroborate these mathematical findings on both synthetic and image data, demonstrating that the noise variance is accurately estimated from the noisy image. Remarkably, we observe that schedule-free BDDMs produce samples of higher quality compared to their non-blind counterparts. We provide evidence that this performance gain arises because BDDMs correct the mismatch between the true residual noise (of the image) and the noise assumed by the schedule used in non-blind diffusion models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09667",
        "abs_url": "https://arxiv.org/abs/2602.09667",
        "pdf_url": "https://arxiv.org/pdf/2602.09667",
        "title": "Differentiable Modeling for Low-Inertia Grids: Benchmarking PINNs, NODEs, and DP for Identification and Control of SMIB System",
        "authors": [
            "Shinhoo Kang",
            "Sangwook Kim",
            "Sehyun Yun"
        ],
        "comments": "9 pages, 7 figures, 4 tables",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "The transition toward low-inertia power systems demands modeling frameworks that provide not only accurate state predictions but also physically consistent sensitivities for control. While scientific machine learning offers powerful nonlinear modeling tools, the control-oriented implications of different differentiable paradigms remain insufficiently understood. This paper presents a comparative study of Physics-Informed Neural Networks (PINNs), Neural Ordinary Differential Equations (NODEs), and Differentiable Programming (DP) for modeling, identification, and control of power system dynamics. Using the Single Machine Infinite Bus (SMIB) system as a benchmark, we evaluate their performance in trajectory extrapolation, parameter estimation, and Linear Quadratic Regulator (LQR) synthesis. Our results highlight a fundamental trade-off between data-driven flexibility and physical structure. NODE exhibits superior extrapolation by capturing the underlying vector field, whereas PINN shows limited generalization due to its reliance on a time-dependent solution map. In the inverse problem of parameter identification, while both DP and PINN successfully recover the unknown parameters, DP achieves significantly faster convergence by enforcing governing equations as hard constraints. Most importantly, for control synthesis, the DP framework yields closed-loop stability comparable to the theoretical optimum. Furthermore, we demonstrate that NODE serves as a viable data-driven surrogate when governing equations are unavailable.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09689",
        "abs_url": "https://arxiv.org/abs/2602.09689",
        "pdf_url": "https://arxiv.org/pdf/2602.09689",
        "title": "Model soups need only one ingredient",
        "authors": [
            "Alireza Abdollahpoorrostam",
            "Nikolaos Dimitriadis",
            "Adam Hazimeh",
            "Pascal Frossard"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Fine-tuning large pre-trained models on a target distribution often improves in-distribution (ID) accuracy, but at the cost of out-of-distribution (OOD) robustness as representations specialize to the fine-tuning data. Weight-space ensembling methods, such as Model Soups, mitigate this effect by averaging multiple checkpoints, but they are computationally prohibitive, requiring the training and storage of dozens of fine-tuned models. In this paper, we introduce MonoSoup, a simple, data-free, hyperparameter-free, post-hoc method that achieves a strong ID-OOD balance using only a single checkpoint. Our method applies Singular Value Decomposition (SVD) to each layer's update and decomposes it into high-energy directions that capture task-specific adaptation and low-energy directions that introduce noise but may still encode residual signals useful for robustness. MonoSoup then uses entropy-based effective rank to automatically re-weigh these components with layer-wise coefficients that account for the spectral and geometric structure of the model. Experiments on CLIP models fine-tuned on ImageNet and evaluated under natural distribution shifts, as well as on Qwen language models tested on mathematical reasoning and multiple-choice benchmarks, show that this plug-and-play approach is a practical and effective alternative to multi-checkpoint methods, retaining much of their benefits without their computational overhead.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09690",
        "abs_url": "https://arxiv.org/abs/2602.09690",
        "pdf_url": "https://arxiv.org/pdf/2602.09690",
        "title": "Contextual and Seasonal LSTMs for Time Series Anomaly Detection",
        "authors": [
            "Lingpei Zhang",
            "Qingming Li",
            "Yong Yang",
            "Jiahao Chen",
            "Rui Zeng",
            "Chenyang Lyu",
            "Shouling Ji"
        ],
        "comments": "Published as a conference paper at ICLR 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Univariate time series (UTS), where each timestamp records a single variable, serve as crucial indicators in web systems and cloud servers. Anomaly detection in UTS plays an essential role in both data mining and system reliability management. However, existing reconstruction-based and prediction-based methods struggle to capture certain subtle anomalies, particularly small point anomalies and slowly rising anomalies. To address these challenges, we propose a novel prediction-based framework named Contextual and Seasonal LSTMs (CS-LSTMs). CS-LSTMs are built upon a noise decomposition strategy and jointly leverage contextual dependencies and seasonal patterns, thereby strengthening the detection of subtle anomalies. By integrating both time-domain and frequency-domain representations, CS-LSTMs achieve more accurate modeling of periodic trends and anomaly localization. Extensive evaluations on public benchmark datasets demonstrate that CS-LSTMs consistently outperform state-of-the-art methods, highlighting their effectiveness and practical value in robust time series anomaly detection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09716",
        "abs_url": "https://arxiv.org/abs/2602.09716",
        "pdf_url": "https://arxiv.org/pdf/2602.09716",
        "title": "BRAVA-GNN: Betweenness Ranking Approximation Via Degree MAss Inspired Graph Neural Network",
        "authors": [
            "Justin Dachille",
            "Aurora Rossi",
            "Sunil Kumar Maurya",
            "Frederik Mallmann-Trenn",
            "Xin Liu",
            "FrÃ©dÃ©ric Giroire",
            "Tsuyoshi Murata",
            "Emanuele Natale"
        ],
        "comments": "Submitted to KDD",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Computing node importance in networks is a long-standing fundamental problem that has driven extensive study of various centrality measures. A particularly well-known centrality measure is betweenness centrality, which becomes computationally prohibitive on large-scale networks. Graph Neural Network (GNN) models have thus been proposed to predict node rankings according to their relative betweenness centrality. However, state-of-the-art methods fail to generalize to high-diameter graphs such as road networks. We propose BRAVA-GNN, a lightweight GNN architecture that leverages the empirically observed correlation linking betweenness centrality to degree-based quantities, in particular multi-hop degree mass. This correlation motivates the use of degree masses as size-invariant node features and synthetic training graphs that closely match the degree distributions of real networks. Furthermore, while previous work relies on scale-free synthetic graphs, we leverage the hyperbolic random graph model, which reproduces power-law exponents outside the scale-free regime, better capturing the structure of real-world graphs like road networks. This design enables BRAVA-GNN to generalize across diverse graph families while using 54x fewer parameters than the most lightweight existing GNN baseline. Extensive experiments on 19 real-world networks, spanning social, web, email, and road graphs, show that BRAVA-GNN achieves up to 214% improvement in Kendall-Tau correlation and up to 70x speedup in inference time over state-of-the-art GNN-based approaches, particularly on challenging road networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09757",
        "abs_url": "https://arxiv.org/abs/2602.09757",
        "pdf_url": "https://arxiv.org/pdf/2602.09757",
        "title": "Towards Poisoning Robustness Certification for Natural Language Generation",
        "authors": [
            "Mihnea Ghitu",
            "Matthew Wicker"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Understanding the reliability of natural language generation is critical for deploying foundation models in security-sensitive domains. While certified poisoning defenses provide provable robustness bounds for classification tasks, they are fundamentally ill-equipped for autoregressive generation: they cannot handle sequential predictions or the exponentially large output space of language models. To establish a framework for certified natural language generation, we formalize two security properties: stability (robustness to any change in generation) and validity (robustness to targeted, harmful changes in generation). We introduce Targeted Partition Aggregation (TPA), the first algorithm to certify validity/targeted attacks by computing the minimum poisoning budget needed to induce a specific harmful class, token, or phrase. Further, we extend TPA to provide tighter guarantees for multi-turn generations using mixed integer linear programming (MILP). Empirically, we demonstrate TPA's effectiveness across diverse settings including: certifying validity of agent tool-calling when adversaries modify up to 0.5% of the dataset and certifying 8-token stability horizons in preference-based alignment. Though inference-time latency remains an open challenge, our contributions enable certified deployment of language models in security-critical applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09781",
        "abs_url": "https://arxiv.org/abs/2602.09781",
        "pdf_url": "https://arxiv.org/pdf/2602.09781",
        "title": "Explainability in Generative Medical Diffusion Models: A Faithfulness-Based Analysis on MRI Synthesis",
        "authors": [
            "Surjo Dey",
            "Pallabi Saikia"
        ],
        "comments": "Accepted at 3rd World Congress on Smart Computing (WCSC2026) conference",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "This study investigates the explainability of generative diffusion models in the context of medical imaging, focusing on Magnetic resonance imaging (MRI) synthesis. Although diffusion models have shown strong performance in generating realistic medical images, their internal decision making process remains largely opaque. We present a faithfulness-based explainability framework that analyzes how prototype-based explainability methods like ProtoPNet (PPNet), Enhanced ProtoPNet (EPPNet), and ProtoPool can link the relationship between generated and training features. Our study focuses on understanding the reasoning behind image formation through denoising trajectory of diffusion model and subsequently prototype explainability with faithfulness analysis. Experimental analysis shows that EPPNet achieves the highest faithfulness (with score 0.1534), offering more reliable insights, and explainability into the generative process. The results highlight that diffusion models can be made more transparent and trustworthy through faithfulness-based explanations, contributing to safer and more interpretable applications of generative AI in healthcare.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09783",
        "abs_url": "https://arxiv.org/abs/2602.09783",
        "pdf_url": "https://arxiv.org/pdf/2602.09783",
        "title": "Why Linear Interpretability Works: Invariant Subspaces as a Result of Architectural Constraints",
        "authors": [
            "Andres Saurez",
            "Yousung Lee",
            "Dongsoo Har"
        ],
        "comments": "Submitted to ICML 2026. 19 pages, 13 figures",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Linear probes and sparse autoencoders consistently recover meaningful structure from transformer representations -- yet why should such simple methods succeed in deep, nonlinear systems? We show this is not merely an empirical regularity but a consequence of architectural necessity: transformers communicate information through linear interfaces (attention OV circuits, unembedding matrices), and any semantic feature decoded through such an interface must occupy a context-invariant linear subspace. We formalize this as the \\emph{Invariant Subspace Necessity} theorem and derive the \\emph{Self-Reference Property}: tokens directly provide the geometric direction for their associated features, enabling zero-shot identification of semantic structure without labeled data or learned probes. Empirical validation in eight classification tasks and four model families confirms the alignment between class tokens and semantically related instances. Our framework provides \\textbf{a principled architectural explanation} for why linear interpretability methods work, unifying linear probes and sparse autoencoders.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09784",
        "abs_url": "https://arxiv.org/abs/2602.09784",
        "pdf_url": "https://arxiv.org/pdf/2602.09784",
        "title": "Circuit Fingerprints: How Answer Tokens Encode Their Geometrical Path",
        "authors": [
            "Andres Saurez",
            "Neha Sengar",
            "Dongsoo Har"
        ],
        "comments": "Submitted to ICML 2026. 15 pages, 11 figures",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Circuit discovery and activation steering in transformers have developed as separate research threads, yet both operate on the same representational space. Are they two views of the same underlying structure? We show they follow a single geometric principle: answer tokens, processed in isolation, encode the directions that would produce them. This Circuit Fingerprint hypothesis enables circuit discovery without gradients or causal intervention -- recovering comparable structure to gradient-based methods through geometric alignment alone. We validate this on standard benchmarks (IOI, SVA, MCQA) across four model families, achieving circuit discovery performance comparable to gradient-based methods. The same directions that identify circuit components also enable controlled steering -- achieving 69.8\\% emotion classification accuracy versus 53.1\\% for instruction prompting while preserving factual accuracy. Beyond method development, this read-write duality reveals that transformer circuits are fundamentally geometric structures: interpretability and controllability are two facets of the same object.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09789",
        "abs_url": "https://arxiv.org/abs/2602.09789",
        "pdf_url": "https://arxiv.org/pdf/2602.09789",
        "title": "When Less is More: The LLM Scaling Paradox in Context Compression",
        "authors": [
            "Ruishan Guo",
            "Yibing Liu",
            "Guoxin Ma",
            "Yan Wang",
            "Yueyang Zhang",
            "Long Xia",
            "Kecheng Chen",
            "Zhiyuan Sun",
            "Daiting Shi"
        ],
        "comments": "10 pages, 4 figures, conference",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Scaling up model parameters has long been a prevalent training paradigm driven by the assumption that larger models yield superior generation capabilities. However, under lossy context compression in a compressor-decoder setup, we observe a Size-Fidelity Paradox: increasing the compressor size can lessen the faithfulness of reconstructed contexts though training loss decreases. Through extensive experiments across models from 0.6B to 90B, we coin this paradox arising from two dominant factors: 1) knowledge overwriting: larger models increasingly replace source facts with their own prior beliefs, e.g., ``the white strawberry'' $\\to$ ``the red strawberry''; and 2) semantic drift: larger models tend to paraphrase or restructure content instead of reproducing it verbatim, e.g., ``Alice hit Bob'' $\\to$ ``Bob hit Alice''. By holding model size fixed, we reflect on the emergent properties of compressed context representations. We show that the culprit is not parameter count itself, but the excessive semantic capacity and amplified generative uncertainty that accompany scaling. Specifically, the increased rank of context embeddings facilitates prior knowledge intrusion, whereas higher entropy over token prediction distributions promotes rewriting. Our results complement existing evaluations over context compression paradigm, underpinning a breakdown in scaling laws for faithful preservation in open-ended generation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09793",
        "abs_url": "https://arxiv.org/abs/2602.09793",
        "pdf_url": "https://arxiv.org/pdf/2602.09793",
        "title": "Fully-automated sleep staging: multicenter validation of a generalizable deep neural network for Parkinson's disease and isolated REM sleep behavior disorder",
        "authors": [
            "Jesper StrÃ¸m",
            "Casper SkjÃ¦rbÃ¦k",
            "Natasha Becker Bertelsen",
            "Steffen Torpe Simonsen",
            "Niels Okkels",
            "David Bertram",
            "Sinah RÃ¶ttgen",
            "Konstantin Kufer",
            "Kaare B. Mikkelsen",
            "Marit Otto",
            "Poul JÃ¸rgen Jennum",
            "Per Borghammer",
            "Michael Sommerauer",
            "Preben Kidmose"
        ],
        "comments": "21 pages excluding supplementary, 9 figures",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Isolated REM sleep behavior disorder (iRBD) is a key prodromal marker of Parkinson's disease (PD), and video-polysomnography (vPSG) remains the diagnostic gold standard. However, manual sleep staging is particularly challenging in neurodegenerative diseases due to EEG abnormalities and fragmented sleep, making PSG assessments a bottleneck for deploying new RBD screening technologies at scale. We adapted U-Sleep, a deep neural network, for generalizable sleep staging in PD and iRBD. A pretrained U-Sleep model, based on a large publicly available, multisite non-neurodegenerative dataset (PUB; 19,236 PSGs across 12 sites), was fine-tuned on research datasets from two centers (Lundbeck Foundation Parkinson's Disease Research Center (PACE) and the Cologne-Bonn Cohort (CBC); 112 PD, 138 iRBD, 89 age-matched controls. The resulting model was evaluated on an independent dataset from the Danish Center for Sleep Medicine (DCSM; 81 PD, 36 iRBD, 87 sleep-clinic controls). A subset of PSGs with low agreement between the human rater and the model (\\k{appa} < 0.6) was re-scored by a second blinded human rater to identify sources of disagreement. Finally, we applied confidence-based thresholds to optimize REM sleep staging. The pretrained model achieved mean \\k{appa} = 0.81 in PUB, but \\k{appa} = 0.66 when applied directly to PACE/CBC. By fine-tuning the model, we developed a generalized model with \\k{appa} = 0.74 on PACE/CBC (p < 0.001 vs. the pretrained model). In DCSM, mean and median \\k{appa} increased from 0.60 to 0.64 (p < 0.001) and 0.64 to 0.69 (p < 0.001), respectively. In the interrater study, PSGs with low agreement between the model and the initial scorer showed similarly low agreement between human scorers. Applying a confidence threshold increased the proportion of correctly identified REM sleep epochs from 85% to 95.5%, while preserving sufficient (> 5 min) REM sleep for 95% of subjects.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09824",
        "abs_url": "https://arxiv.org/abs/2602.09824",
        "pdf_url": "https://arxiv.org/pdf/2602.09824",
        "title": "PlugSI: Plug-and-Play Test-Time Graph Adaptation for Spatial Interpolation",
        "authors": [
            "Xuhang Wu",
            "Zhuoxuan Liang",
            "Wei Li",
            "Xiaohua Jia",
            "Sumi Helal"
        ],
        "comments": "Accepted at DASFAA 2026 (Full Research Paper)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "With the rapid advancement of IoT and edge computing, sensor networks have become indispensable, driving the need for large-scale sensor deployment. However, the high deployment cost hinders their scalability. To tackle the issues, Spatial Interpolation (SI) introduces virtual sensors to infer readings from observed sensors, leveraging graph structure. However, current graph-based SI methods rely on pre-trained models, lack adaptation to larger and unseen graphs at test-time, and overlook test data utilization. To address these issues, we propose PlugSI, a plug-and-play framework that refines test-time graph through two key innovations. First, we design an Unknown Topology Adapter (UTA) that adapts to the new graph structure of each small-batch at test-time, enhancing the generalization of SI pre-trained models. Second, we introduce a Temporal Balance Adapter (TBA) that maintains a stable historical consensus to guide UTA adaptation and prevent drifting caused by noise in the current batch. Empirically, extensive experiments demonstrate PlugSI can be seamlessly integrated into existing graph-based SI methods and provide significant improvement (e.g., a 10.81% reduction in MAE).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09851",
        "abs_url": "https://arxiv.org/abs/2602.09851",
        "pdf_url": "https://arxiv.org/pdf/2602.09851",
        "title": "CoFEH: LLM-driven Feature Engineering Empowered by Collaborative Bayesian Hyperparameter Optimization",
        "authors": [
            "Beicheng Xu",
            "Keyao Ding",
            "Wei Liu",
            "Yupeng Lu",
            "Bin Cui"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Feature Engineering (FE) is pivotal in automated machine learning (AutoML) but remains a bottleneck for traditional methods, which treat it as a black-box search, operating within rigid, predefined search spaces and lacking domain awareness. While Large Language Models (LLMs) offer a promising alternative by leveraging semantic reasoning to generate unbounded operators, existing methods fail to construct free-form FE pipelines, remaining confined to isolated subtasks such as feature generation. Most importantly, they are rarely optimized jointly with hyperparameter optimization (HPO) of the ML model, leading to greedy \"FE-then-HPO\" workflows that cannot capture strong FE-HPO interactions. In this paper, we present CoFEH, a collaborative framework that interleaves LLM-based FE and Bayesian HPO for robust end-to-end AutoML. CoFEH uses an LLM-driven FE optimizer powered by Tree of Thought (ToT) to explore flexible FE pipelines, a Bayesian optimization (BO) module to solve HPO, and a dynamic optimizer selector that realizes interleaved optimization by adaptively scheduling FE and HPO steps. Crucially, we introduce a mutual conditioning mechanism that shares context between LLM and BO, enabling mutually informed decisions. Experiments show that CoFEH not only outperforms traditional and LLM-based FE baselines, but also achieves superior end-to-end performance under joint optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09864",
        "abs_url": "https://arxiv.org/abs/2602.09864",
        "pdf_url": "https://arxiv.org/pdf/2602.09864",
        "title": "Differentiable Tripartite Modularity for Clustering Heterogeneous Graphs",
        "authors": [
            "BenoÃ®t Hurpeau"
        ],
        "comments": "12 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG); Social and Information Networks (cs.SI)",
        "abstract": "Clustering heterogeneous relational data remains a central challenge in graph learning, particularly when interactions involve more than two types of entities. While differentiable modularity objectives such as DMoN have enabled end-to-end community detection on homogeneous and bipartite graphs, extending these approaches to higher-order relational structures remains non-trivial. In this work, we introduce a differentiable formulation of tripartite modularity for graphs composed of three node types connected through mediated interactions. Community structure is defined in terms of weighted co-paths across the tripartite graph, together with an exact factorized computation that avoids the explicit construction of dense third-order tensors. A structural normalization at pivot nodes is introduced to control extreme degree heterogeneity and ensure stable optimization. The resulting objective can be optimized jointly with a graph neural network in an end-to-end manner, while retaining linear complexity in the number of edges. We validate the proposed framework on large-scale urban cadastral data, where it exhibits robust convergence behavior and produces spatially coherent partitions. These results highlight differentiable tripartite modularity as a generic methodological building block for unsupervised clustering of heterogeneous graphs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09869",
        "abs_url": "https://arxiv.org/abs/2602.09869",
        "pdf_url": "https://arxiv.org/pdf/2602.09869",
        "title": "Statistical benchmarking of transformer models in low signal-to-noise time-series forecasting",
        "authors": [
            "Cyril Garcia",
            "Guillaume Remy"
        ],
        "comments": "Submitted to ICML",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study the performance of transformer architectures for multivariate time-series forecasting in low-data regimes consisting of only a few years of daily observations. Using synthetically generated processes with known temporal and cross-sectional dependency structures and varying signal-to-noise ratios, we conduct bootstrapped experiments that enable direct evaluation via out-of-sample correlations with the optimal ground-truth predictor. We show that two-way attention transformers, which alternate between temporal and cross-sectional self-attention, can outperform standard baselines-Lasso, boosting methods, and fully connected multilayer perceptrons-across a wide range of settings, including low signal-to-noise regimes. We further introduce a dynamic sparsification procedure for attention matrices applied during training, and demonstrate that it becomes significantly effective in noisy environments, where the correlation between the target variable and the optimal predictor is on the order of a few percent. Analysis of the learned attention patterns reveals interpretable structure and suggests connections to sparsity-inducing regularization in classical regression, providing insight into why these models generalize effectively under noise.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09904",
        "abs_url": "https://arxiv.org/abs/2602.09904",
        "pdf_url": "https://arxiv.org/pdf/2602.09904",
        "title": "Safeguarding Privacy: Privacy-Preserving Detection of Mind Wandering and Disengagement Using Federated Learning in Online Education",
        "authors": [
            "Anna Bodonhelyi",
            "Mengdi Wang",
            "Efe Bozkir",
            "Babette BÃ¼hler",
            "Enkelejda Kasneci"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Human-Computer Interaction (cs.HC)",
        "abstract": "Since the COVID-19 pandemic, online courses have expanded access to education, yet the absence of direct instructor support challenges learners' ability to self-regulate attention and engagement. Mind wandering and disengagement can be detrimental to learning outcomes, making their automated detection via video-based indicators a promising approach for real-time learner support. However, machine learning-based approaches often require sharing sensitive data, raising privacy concerns. Federated learning offers a privacy-preserving alternative by enabling decentralized model training while also distributing computational load. We propose a framework exploiting cross-device federated learning to address different manifestations of behavioral and cognitive disengagement during remote learning, specifically behavioral disengagement, mind wandering, and boredom. We fit video-based cognitive disengagement detection models using facial expressions and gaze features. By adopting federated learning, we safeguard users' data privacy through privacy-by-design and introduce a novel solution with the potential for real-time learner support. We further address challenges posed by eyeglasses by incorporating related features, enhancing overall model performance. To validate the performance of our approach, we conduct extensive experiments on five datasets and benchmark multiple federated learning algorithms. Our results show great promise for privacy-preserving educational technologies promoting learner engagement.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09963",
        "abs_url": "https://arxiv.org/abs/2602.09963",
        "pdf_url": "https://arxiv.org/pdf/2602.09963",
        "title": "Drug Release Modeling using Physics-Informed Neural Networks",
        "authors": [
            "Daanish Aleem Qureshi",
            "Khemraj Shukla",
            "Vikas Srivastava"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Biomolecules (q-bio.BM)",
        "abstract": "Accurate modeling of drug release is essential for designing and developing controlled-release systems. Classical models (Fick, Higuchi, Peppas) rely on simplifying assumptions that limit their accuracy in complex geometries and release mechanisms. Here, we propose a novel approach using Physics-Informed Neural Networks (PINNs) and Bayesian PINNs (BPINNs) for predicting release from planar, 1D-wrinkled, and 2D-crumpled films. This approach uniquely integrates Fick's diffusion law with limited experimental data to enable accurate long-term predictions from short-term measurements, and is systematically benchmarked against classical drug release models. We embedded Fick's second law into PINN as loss with 10,000 Latin-hypercube collocation points and utilized previously published experimental datasets to assess drug release performance through mean absolute error (MAE) and root mean square error (RMSE), considering noisy conditions and limited-data scenarios. Our approach reduced mean error by up to 40% relative to classical baselines across all film types. The PINN formulation achieved RMSE <0.05 utilizing only the first 6% of the release time data (reducing 94% of release time required for the experiments) for the planar film. For wrinkled and crumpled films, the PINN reached RMSE <0.05 in 33% of the release time data. BPINNs provide tighter and more reliable uncertainty quantification under noise. By combining physical laws with experimental data, the proposed framework yields highly accurate long-term release predictions from short-term measurements, offering a practical route for accelerated characterization and more efficient early-stage drug release system formulation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09969",
        "abs_url": "https://arxiv.org/abs/2602.09969",
        "pdf_url": "https://arxiv.org/pdf/2602.09969",
        "title": "Causal Identification in Multi-Task Demand Learning with Confounding",
        "authors": [
            "Varun Gupta",
            "Vijay Kamble"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Econometrics (econ.EM); Machine Learning (stat.ML)",
        "abstract": "We study a canonical multi-task demand learning problem motivated by retail pricing, in which a firm seeks to estimate heterogeneous linear price-response functions across a large collection of decision contexts. Each context is characterized by rich observable covariates yet typically exhibits only limited historical price variation, motivating the use of multi-task learning to borrow strength across tasks. A central challenge in this setting is endogeneity: historical prices are chosen by managers or algorithms and may be arbitrarily correlated with unobserved, task-level demand determinants. Under such confounding by latent fundamentals, commonly used approaches, such as pooled regression and meta-learning, fail to identify causal price effects. We propose a new estimation framework that achieves causal identification despite arbitrary dependence between prices and latent task structure. Our approach, Decision-Conditioned Masked-Outcome Meta-Learning (DCMOML), involves carefully designing the information set of a meta-learner to leverage cross-task heterogeneity while accounting for endogenous decision histories. Under a mild restriction on price adaptivity in each task, we establish that this method identifies the conditional mean of the task-specific causal parameters given the designed information set. Our results provide guarantees for large-scale demand estimation with endogenous prices and small per-task samples, offering a principled foundation for deploying causal, data-driven pricing models in operational environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09985",
        "abs_url": "https://arxiv.org/abs/2602.09985",
        "pdf_url": "https://arxiv.org/pdf/2602.09985",
        "title": "Online Monitoring Framework for Automotive Time Series Data using JEPA Embeddings",
        "authors": [
            "Alexander Fertig",
            "Karthikeyan Chandra Sekaran",
            "Lakshman Balasubramanian",
            "Michael Botsch"
        ],
        "comments": "Accepted at the 2026 IEEE Intelligent Vehicles Symposium. Copyright 2026 IEEE. Permission from IEEE must be obtained for use in any current or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new collective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other works",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "As autonomous vehicles are rolled out, measures must be taken to ensure their safe operation. In order to supervise a system that is already in operation, monitoring frameworks are frequently employed. These run continuously online in the background, supervising the system status and recording anomalies. This work proposes an online monitoring framework to detect anomalies in object state representations. Thereby, a key challenge is creating a framework for anomaly detection without anomaly labels, which are usually unavailable for unknown anomalies. To address this issue, this work applies a self-supervised embedding method to translate object data into a latent representation space. For this, a JEPA-based self-supervised prediction task is constructed, allowing training without anomaly labels and the creation of rich object embeddings. The resulting expressive JEPA embeddings serve as input for established anomaly detection methods, in order to identify anomalies within object state representations. This framework is particularly useful for applications in real-world environments, where new or unknown anomalies may occur during operation for which there are no labels available. Experiments performed on the publicly available, real-world nuScenes dataset illustrate the framework's capabilities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09988",
        "abs_url": "https://arxiv.org/abs/2602.09988",
        "pdf_url": "https://arxiv.org/pdf/2602.09988",
        "title": "Empirical Stability Analysis of Kolmogorov-Arnold Networks in Hard-Constrained Recurrent Physics-Informed Discovery",
        "authors": [
            "Enzo Nicolas Spotorno",
            "Josafat Leal Filho",
            "Antonio Augusto Medeiros Frohlich"
        ],
        "comments": "5 pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computational Physics (physics.comp-ph)",
        "abstract": "We investigate the integration of Kolmogorov-Arnold Networks (KANs) into hard-constrained recurrent physics-informed architectures (HRPINN) to evaluate the fidelity of learned residual manifolds in oscillatory systems. Motivated by the Kolmogorov-Arnold representation theorem and preliminary gray-box results, we hypothesized that KANs would enable efficient recovery of unknown terms compared to MLPs. Through initial sensitivity analysis on configuration sensitivity, parameter scale, and training paradigm, we found that while small KANs are competitive on univariate polynomial residuals (Duffing), they exhibit severe hyperparameter fragility, instability in deeper configurations, and consistent failure on multiplicative terms (Van der Pol), generally outperformed by standard MLPs. These empirical challenges highlight limitations of the additive inductive bias in the original KAN formulation for state coupling and provide preliminary empirical evidence of inductive bias limitations for future hybrid modeling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10006",
        "abs_url": "https://arxiv.org/abs/2602.10006",
        "pdf_url": "https://arxiv.org/pdf/2602.10006",
        "title": "Answer First, Reason Later: Aligning Search Relevance via Mode-Balanced Reinforcement Learning",
        "authors": [
            "Shijie Zhang",
            "Xiang Guo",
            "Rujun Guo",
            "Shaoyu Liu",
            "Xiaozhao Wang",
            "Guanjun Jiang",
            "Kevin Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Building a search relevance model that achieves both low latency and high performance is a long-standing challenge in the search industry. To satisfy the millisecond-level response requirements of online systems while retaining the interpretable reasoning traces of Large Language Models (LLMs), we propose a novel \\textbf{Answer-First, Reason Later (AFRL)} paradigm. This paradigm requires the model to output the definitive relevance score in the very first token, followed by a structured logical explanation. Inspired by the success of reasoning models, we adopt a \"Supervised Fine-Tuning (SFT) + Reinforcement Learning (RL)\" pipeline to achieve AFRL. However, directly applying existing RL training often leads to \\textbf{mode collapse} in the search relevance task, where the model forgets complex long-tail rules in pursuit of high rewards. From an information theory perspective: RL inherently minimizes the \\textbf{Reverse KL divergence}, which tends to seek probability peaks (mode-seeking) and is prone to \"reward hacking.\" On the other hand, SFT minimizes the \\textbf{Forward KL divergence}, forcing the model to cover the data distribution (mode-covering) and effectively anchoring expert rules. Based on this insight, we propose a \\textbf{Mode-Balanced Optimization} strategy, incorporating an SFT auxiliary loss into Stepwise-GRPO training to balance these two properties. Furthermore, we construct an automated instruction evolution system and a multi-stage curriculum to ensure expert-level data quality. Extensive experiments demonstrate that our 32B teacher model achieves state-of-the-art performance. Moreover, the AFRL architecture enables efficient knowledge distillation, successfully transferring expert-level logic to a 0.6B model, thereby reconciling reasoning depth with deployment latency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10014",
        "abs_url": "https://arxiv.org/abs/2602.10014",
        "pdf_url": "https://arxiv.org/pdf/2602.10014",
        "title": "A Task-Centric Theory for Iterative Self-Improvement with Easy-to-Hard Curricula",
        "authors": [
            "Chenruo Liu",
            "Yijun Dong",
            "Yiqiu Shen",
            "Qi Lei"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Iterative self-improvement fine-tunes an autoregressive large language model (LLM) on reward-verified outputs generated by the LLM itself. In contrast to the empirical success of self-improvement, the theoretical foundation of this generative, iterative procedure in a practical, finite-sample setting remains limited. We make progress toward this goal by modeling each round of self-improvement as maximum-likelihood fine-tuning on a reward-filtered distribution and deriving finite-sample guarantees for the expected reward. Our analysis reveals an explicit feedback loop where better models accept more data per iteration, supporting sustained self-improvement while explaining eventual saturation of such improvement. Adopting a task-centric view by considering reasoning tasks with multiple difficulty levels, we further prove quantifiable conditions on model initialization, task difficulty, and sample budget where easy-to-hard curricula provably achieve better guarantees than training on fixed mixtures of tasks. Our analyses are validated via Monte-Carlo simulations and controlled experiments on graph-based reasoning tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10031",
        "abs_url": "https://arxiv.org/abs/2602.10031",
        "pdf_url": "https://arxiv.org/pdf/2602.10031",
        "title": "Position: Message-passing and spectral GNNs are two sides of the same coin",
        "authors": [
            "Antonis Vasileiou",
            "Juan Cervino",
            "Pascal Frossard",
            "Charilaos I. Kanatsoulis",
            "Christopher Morris",
            "Michael T. Schaub",
            "Pierre Vandergheynst",
            "Zhiyang Wang",
            "Guy Wolf",
            "Ron Levie"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph neural networks (GNNs) are commonly divided into message-passing neural networks (MPNNs) and spectral graph neural networks, reflecting two largely separate research traditions in machine learning and signal processing. This paper argues that this divide is mostly artificial, hindering progress in the field. We propose a viewpoint in which both MPNNs and spectral GNNs are understood as different parametrizations of permutation-equivariant operators acting on graph signals. From this perspective, many popular architectures are equivalent in expressive power, while genuine gaps arise only in specific regimes. We further argue that MPNNs and spectral GNNs offer complementary strengths. That is, MPNNs provide a natural language for discrete structure and expressivity analysis using tools from logic and graph isomorphism research, while the spectral perspective provides principled tools for understanding smoothing, bottlenecks, stability, and community structure. Overall, we posit that progress in graph learning will be accelerated by clearly understanding the key similarities and differences between these two types of GNNs, and by working towards unifying these perspectives within a common theoretical and conceptual framework rather than treating them as competing paradigms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10037",
        "abs_url": "https://arxiv.org/abs/2602.10037",
        "pdf_url": "https://arxiv.org/pdf/2602.10037",
        "title": "Effectiveness of Binary Autoencoders for QUBO-Based Optimization Problems",
        "authors": [
            "Tetsuro Abe",
            "Masashi Yamashita",
            "Shu Tanaka"
        ],
        "comments": "14 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG); Statistical Mechanics (cond-mat.stat-mech); Quantum Physics (quant-ph)",
        "abstract": "In black-box combinatorial optimization, objective evaluations are often expensive, so high quality solutions must be found under a limited budget. Factorization machine with quantum annealing (FMQA) builds a quadratic surrogate model from evaluated samples and optimizes it on an Ising machine. However, FMQA requires binary decision variables, and for nonbinary structures such as integer permutations, the choice of binary encoding strongly affects search efficiency. If the encoding fails to reflect the original neighborhood structure, small Hamming moves may not correspond to meaningful modifications in the original solution space, and constrained problems can yield many infeasible candidates that waste evaluations. Recent work combines FMQA with a binary autoencoder (bAE) that learns a compact binary latent code from feasible solutions, yet the mechanism behind its performance gains is unclear. Using a small traveling salesman problem as an interpretable testbed, we show that the bAE reconstructs feasible tours accurately and, compared with manually designed encodings at similar compression, better aligns tour distances with latent Hamming distances, yields smoother neighborhoods under small bit flips, and produces fewer local optima. These geometric properties explain why bAE+FMQA improves the approximation ratio faster while maintaining feasibility throughout optimization, and they provide guidance for designing latent representations for black-box optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10044",
        "abs_url": "https://arxiv.org/abs/2602.10044",
        "pdf_url": "https://arxiv.org/pdf/2602.10044",
        "title": "Optimistic World Models: Efficient Exploration in Model-Based Deep Reinforcement Learning",
        "authors": [
            "Akshay Mete",
            "Shahid Aamir Sheikh",
            "Tzu-Hsiang Lin",
            "Dileep Kalathil",
            "P. R. Kumar"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Systems and Control (eess.SY)",
        "abstract": "Efficient exploration remains a central challenge in reinforcement learning (RL), particularly in sparse-reward environments. We introduce Optimistic World Models (OWMs), a principled and scalable framework for optimistic exploration that brings classical reward-biased maximum likelihood estimation (RBMLE) from adaptive control into deep RL. In contrast to upper confidence bound (UCB)-style exploration methods, OWMs incorporate optimism directly into model learning by augmentation with an optimistic dynamics loss that biases imagined transitions toward higher-reward outcomes. This fully gradient-based loss requires neither uncertainty estimates nor constrained optimization. Our approach is plug-and-play with existing world model frameworks, preserving scalability while requiring only minimal modifications to standard training procedures. We instantiate OWMs within two state-of-the-art world model architectures, leading to Optimistic DreamerV3 and Optimistic STORM, which demonstrate significant improvements in sample efficiency and cumulative return compared to their baseline counterparts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10056",
        "abs_url": "https://arxiv.org/abs/2602.10056",
        "pdf_url": "https://arxiv.org/pdf/2602.10056",
        "title": "WildCat: Near-Linear Attention in Theory and Practice",
        "authors": [
            "Tobias SchrÃ¶der",
            "Lester Mackey"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We introduce WildCat, a high-accuracy, low-cost approach to compressing the attention mechanism in neural networks. While attention is a staple of modern network architectures, it is also notoriously expensive to deploy due to resource requirements that scale quadratically with the input sequence length $n$. WildCat avoids these quadratic costs by only attending over a small weighted coreset. Crucially, we select the coreset using a fast but spectrally-accurate subsampling algorithm -- randomly pivoted Cholesky -- and weight the elements optimally to minimise reconstruction error. Remarkably, given bounded inputs, WildCat approximates exact attention with super-polynomial $O(n^{-\\sqrt{\\log(\\log(n))}})$ error decay while running in near-linear $O(n^{1+o(1)})$ time. In contrast, prior practical approximations either lack error guarantees or require quadratic runtime to guarantee such high fidelity. We couple this advance with a GPU-optimized PyTorch implementation and a suite of benchmark experiments demonstrating the benefits of WildCat for image generation, image classification, and language model KV cache compression.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10067",
        "abs_url": "https://arxiv.org/abs/2602.10067",
        "pdf_url": "https://arxiv.org/pdf/2602.10067",
        "title": "Features as Rewards: Scalable Supervision for Open-Ended Tasks via Interpretability",
        "authors": [
            "Aaditya Vikram Prasad",
            "Connor Watts",
            "Jack Merullo",
            "Dhruvil Gala",
            "Owen Lewis",
            "Thomas McGrath",
            "Ekdeep Singh Lubana"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Language models trained on large-scale datasets have been shown to learn features that encode abstract concepts such as factuality or intent. Such features are traditionally used for test-time monitoring or steering. We present an alternative affordance: features as scalable supervision for open-ended tasks. We consider the case of hallucination-reduction as a desirable, yet open-ended behavior and design a reinforcement learning (RL) pipeline, titled RLFR (Reinforcement Learning from Feature Rewards), that uses features as reward functions. Grounded in a novel probing framework that identifies candidate hallucinated claims, our pipeline teaches a model to intervene and correct its completions when it is uncertain of their factuality. Furthermore, the pipeline enables scalable test-time compute, guided once more by our reward features. This end-to-end process operationalized on Gemma-3-12B-IT results in a policy that is 58% less likely to hallucinate compared to the original model, while preserving performance on standard benchmarks. Taken together, by grounding supervision in the language of features, this paper introduces a novel paradigm in the use of interpretability for learning open-ended tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10097",
        "abs_url": "https://arxiv.org/abs/2602.10097",
        "pdf_url": "https://arxiv.org/pdf/2602.10097",
        "title": "Step-resolved data attribution for looped transformers",
        "authors": [
            "Georgios Kaissis",
            "David Mildenberger",
            "Juan Felipe Gomez",
            "Martin J. Menten",
            "Eleni Triantafillou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We study how individual training examples shape the internal computation of looped transformers, where a shared block is applied for $\\tau$ recurrent iterations to enable latent reasoning. Existing training-data influence estimators such as TracIn yield a single scalar score that aggregates over all loop iterations, obscuring when during the recurrent computation a training example matters. We introduce \\textit{Step-Decomposed Influence (SDI)}, which decomposes TracIn into a length-$\\tau$ influence trajectory by unrolling the recurrent computation graph and attributing influence to specific loop iterations. To make SDI practical at transformer scale, we propose a TensorSketch implementation that never materialises per-example gradients. Experiments on looped GPT-style models and algorithmic reasoning tasks show that SDI scales excellently, matches full-gradient baselines with low error and supports a broad range of data attribution and interpretability tasks with per-step insights into the latent reasoning process.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10100",
        "abs_url": "https://arxiv.org/abs/2602.10100",
        "pdf_url": "https://arxiv.org/pdf/2602.10100",
        "title": "Towards Explainable Federated Learning: Understanding the Impact of Differential Privacy",
        "authors": [
            "JÃºlio Oliveira",
            "Rodrigo Ferreira",
            "AndrÃ© Riker",
            "Glaucio H. S. Carvalho",
            "Eirini Eleni Tsilopoulou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Data privacy and eXplainable Artificial Intelligence (XAI) are two important aspects for modern Machine Learning systems. To enhance data privacy, recent machine learning models have been designed as a Federated Learning (FL) system. On top of that, additional privacy layers can be added, via Differential Privacy (DP). On the other hand, to improve explainability, ML must consider more interpretable approaches with reduced number of features and less complex internal architecture. In this context, this paper aims to achieve a machine learning (ML) model that combines enhanced data privacy with explainability. So, we propose a FL solution, called Federated EXplainable Trees with Differential Privacy (FEXT-DP), that: (i) is based on Decision Trees, since they are lightweight and have superior explainability than neural networks-based FL systems; (ii) provides additional layer of data privacy protection applying Differential Privacy (DP) to the Tree-Based model. However, there is a side effect adding DP: it harms the explainability of the system. So, this paper also presents the impact of DP protection on the explainability of the ML model. The carried out performance assessment shows improvements of FEXT-DP in terms of a faster training, i.e., numbers of rounds, Mean Squared Error and explainability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10117",
        "abs_url": "https://arxiv.org/abs/2602.10117",
        "pdf_url": "https://arxiv.org/pdf/2602.10117",
        "title": "Biases in the Blind Spot: Detecting What LLMs Fail to Mention",
        "authors": [
            "IvÃ¡n Arcuschin",
            "David Chanin",
            "AdriÃ  Garriga-Alonso",
            "Oana-Maria Camburu"
        ],
        "comments": "10 pages, Under review at ICML 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Large Language Models (LLMs) often provide chain-of-thought (CoT) reasoning traces that appear plausible, but may hide internal biases. We call these *unverbalized biases*. Monitoring models via their stated reasoning is therefore unreliable, and existing bias evaluations typically require predefined categories and hand-crafted datasets. In this work, we introduce a fully automated, black-box pipeline for detecting task-specific unverbalized biases. Given a task dataset, the pipeline uses LLM autoraters to generate candidate bias concepts. It then tests each concept on progressively larger input samples by generating positive and negative variations, and applies statistical techniques for multiple testing and early stopping. A concept is flagged as an unverbalized bias if it yields statistically significant performance differences while not being cited as justification in the model's CoTs. We evaluate our pipeline across six LLMs on three decision tasks (hiring, loan approval, and university admissions). Our technique automatically discovers previously unknown biases in these models (e.g., Spanish fluency, English proficiency, writing formality). In the same run, the pipeline also validates biases that were manually identified by prior work (gender, race, religion, ethnicity). More broadly, our proposed approach provides a practical, scalable path to automatic task-specific bias discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09036",
        "abs_url": "https://arxiv.org/abs/2602.09036",
        "pdf_url": "https://arxiv.org/pdf/2602.09036",
        "title": "Predicting Gene Disease Associations in Type 2 Diabetes Using Machine Learning on Single-Cell RNA-Seq Data",
        "authors": [
            "Maria De La Luz Lomboy Toledo",
            "Daniel Onah"
        ],
        "comments": "11 pages, 7 figures. Preprint",
        "subjects": "Genomics (q-bio.GN); Machine Learning (cs.LG)",
        "abstract": "Diabetes is a chronic metabolic disorder characterized by elevated blood glucose levels due to impaired insulin production or function. Two main forms are recognized: type 1 diabetes (T1D), which involves autoimmune destruction of insulin-producing \\b{eta}-cells, and type 2 diabetes (T2D), which arises from insulin resistance and progressive \\b{eta}-cell dysfunction. Understanding the molecular mechanisms underlying these diseases is essential for the development of improved therapeutic strategies, particularly those targeting \\b{eta}-cell dysfunction. To investigate these mechanisms in a controlled and biologically interpretable setting, mouse models have played a central role in diabetes research. Owing to their genetic and physiological similarity to humans, together with the ability to precisely manipulate their genome, mice enable detailed investigation of disease progression and gene function. In particular, mouse models have provided critical insights into \\b{eta}-cell development, cellular heterogeneity, and functional failure under diabetic conditions. Building on these experimental advances, this study applies machine learning methods to single-cell transcriptomic data from mouse pancreatic islets. Specifically, we evaluate two supervised approaches identified in the literature; Extra Trees Classifier (ETC) and Partial Least Squares Discriminant Analysis (PLS-DA), to assess their ability to identify T2D-associated gene expression signatures at single-cell resolution. Model performance is evaluated using standard classification metrics, with an emphasis on interpretability and biological relevance",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09043",
        "abs_url": "https://arxiv.org/abs/2602.09043",
        "pdf_url": "https://arxiv.org/pdf/2602.09043",
        "title": "Windowed SummaryMixing: An Efficient Fine-Tuning of Self-Supervised Learning Models for Low-resource Speech Recognition",
        "authors": [
            "Aditya Srinivas Menon",
            "Kumud Tripathi",
            "Raj Gohil",
            "Pankaj Wasnik"
        ],
        "comments": "The paper has been accepted at ICASSP 2026, Barcelona, Spain",
        "subjects": "Audio and Speech Processing (eess.AS); Machine Learning (cs.LG); Sound (cs.SD)",
        "abstract": "Self-supervised learning (SSL) has advanced speech processing but suffers from quadratic complexity due to self-attention. To address this, SummaryMixing (SM) has been proposed as a linear-time alternative that summarizes entire utterances using mean pooling but lacks sufficient local context. In this work, we introduce Windowed SummaryMixing (WSM), which enhances SM by integrating local neighborhood summaries alongside the global summary, maintaining efficiency while improving temporal dependencies. Additionally, we introduce a selective fine-tuning approach, replacing self-attention layers in SSL models with WSM blocks and fine-tuning only these blocks in low-resource settings. Our approach improves ASR performance while reducing peak VRAM usage by 40\\% in the SSL models. WSM blocks have linear-time complexity with enhanced context awareness. Selectively replacing some attention layers reduces compute, memory, and latency, making it ideal for low-resource speech recognition.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09057",
        "abs_url": "https://arxiv.org/abs/2602.09057",
        "pdf_url": "https://arxiv.org/pdf/2602.09057",
        "title": "SVD-Preconditioned Gradient Descent Method for Solving Nonlinear Least Squares Problems",
        "authors": [
            "Zhipeng Chang",
            "Wenrui Hao",
            "Nian Liu"
        ],
        "comments": "",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "This paper introduces a novel optimization algorithm designed for nonlinear least-squares problems. The method is derived by preconditioning the gradient descent direction using the Singular Value Decomposition (SVD) of the Jacobian. This SVD-based preconditioner is then integrated with the first- and second-moment adaptive learning rate mechanism of the Adam optimizer. We establish the local linear convergence of the proposed method under standard regularity assumptions and prove global convergence for a modified version of the algorithm under suitable conditions. The effectiveness of the approach is demonstrated experimentally across a range of tasks, including function approximation, partial differential equation (PDE) solving, and image classification on the CIFAR-10 dataset. Results show that the proposed method consistently outperforms standard Adam, achieving faster convergence and lower error in both regression and classification settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09064",
        "abs_url": "https://arxiv.org/abs/2602.09064",
        "pdf_url": "https://arxiv.org/pdf/2602.09064",
        "title": "Predicting Open Source Software Sustainability with Deep Temporal Neural Hierarchical Architectures and Explainable AI",
        "authors": [
            "S M Rakib Ul Karim",
            "Wenyi Lu",
            "Enock Kasaadha",
            "Sean Goggins"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Open Source Software (OSS) projects follow diverse lifecycle trajectories shaped by evolving patterns of contribution, coordination, and community engagement. Understanding these trajectories is essential for stakeholders seeking to assess project organization and health at scale. However, prior work has largely relied on static or aggregated metrics, such as project age or cumulative activity, providing limited insight into how OSS sustainability unfolds over time. In this paper, we propose a hierarchical predictive framework that models OSS projects as belonging to distinct lifecycle stages grounded in established socio-technical categorizations of OSS development. Rather than treating sustainability solely as project longevity, these lifecycle stages operationalize sustainability as a multidimensional construct integrating contribution activity, community participation, and maintenance dynamics. The framework combines engineered tabular indicators with 24-month temporal activity sequences and employs a multi-stage classification pipeline to distinguish lifecycle stages associated with different coordination and participation regimes. To support transparency, we incorporate explainable AI techniques to examine the relative contribution of feature categories to model predictions. Evaluated on a large corpus of OSS repositories, the proposed approach achieves over 94\\% overall accuracy in lifecycle stage classification. Attribution analyses consistently identify contribution activity and community-related features as dominant signals, highlighting the central role of collective participation dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09082",
        "abs_url": "https://arxiv.org/abs/2602.09082",
        "pdf_url": "https://arxiv.org/pdf/2602.09082",
        "title": "UI-Venus-1.5 Technical Report",
        "authors": [
            "Veuns-Team",
            "Changlong Gao",
            "Zhangxuan Gu",
            "Yulin Liu",
            "Xinyu Qiu",
            "Shuheng Shen",
            "Yue Wen",
            "Tianyu Xia",
            "Zhenyu Xu",
            "Zhengwen Zeng",
            "Beitong Zhou",
            "Xingran Zhou",
            "Weizhi Chen",
            "Sunhao Dai",
            "Jingya Dou",
            "Yichen Gong",
            "Yuan Guo",
            "Zhenlin Guo",
            "Feng Li",
            "Qian Li",
            "Jinzhen Lin",
            "Yuqi Zhou",
            "Linchao Zhu",
            "Liang Chen",
            "Zhenyu Guo",
            "Changhua Meng",
            "Weiqiang Wang"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "GUI agents have emerged as a powerful paradigm for automating interactions in digital environments, yet achieving both broad generality and consistently strong task performance remains this http URL this report, we present UI-Venus-1.5, a unified, end-to-end GUI Agent designed for robust real-world this http URL proposed model family comprises two dense variants (2B and 8B) and one mixture-of-experts variant (30B-A3B) to meet various downstream application this http URL to our previous version, UI-Venus-1.5 introduces three key technical advances: (1) a comprehensive Mid-Training stage leveraging 10 billion tokens across 30+ datasets to establish foundational GUI semantics; (2) Online Reinforcement Learning with full-trajectory rollouts, aligning training objectives with long-horizon, dynamic navigation in large-scale environments; and (3) a single unified GUI Agent constructed via Model Merging, which synthesizes domain-specific models (grounding, web, and mobile) into one cohesive checkpoint. Extensive evaluations demonstrate that UI-Venus-1.5 establishes new state-of-the-art performance on benchmarks such as ScreenSpot-Pro (69.6%), VenusBench-GD (75.0%), and AndroidWorld (77.6%), significantly outperforming previous strong baselines. In addition, UI-Venus-1.5 demonstrates robust navigation capabilities across a variety of Chinese mobile apps, effectively executing user instructions in real-world scenarios. Code: this https URL Model: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09093",
        "abs_url": "https://arxiv.org/abs/2602.09093",
        "pdf_url": "https://arxiv.org/pdf/2602.09093",
        "title": "Predicting magnetism with first-principles AI",
        "authors": [
            "Max Geier",
            "Liang Fu"
        ],
        "comments": "6+3 pages, 3+4 figures",
        "subjects": "Strongly Correlated Electrons (cond-mat.str-el); Machine Learning (cs.LG)",
        "abstract": "Computational discovery of magnetic materials remains challenging because magnetism arises from the competition between kinetic energy and Coulomb interaction that is often beyond the reach of standard electronic-structure methods. Here we tackle this challenge by directly solving the many-electron SchrÃ¶dinger equation with neural-network variational Monte Carlo, which provides a highly expressive variational wavefunction for strongly correlated systems. Applying this technique to transition metal dichalcogenide moirÃ© semicondutors, we predict itinerant ferromagnetism in WSe$_2$/WS$_2$ and an antiferromagnetic insulator in twisted $\\Gamma$-valley homobilayer, using the same neural network without any physics input beyond the microscopic Hamiltonian. Crucially, both types of magnetic states are obtained from a single calculation within the $S_z=0$ sector, removing the need to compute and compare multiple $S_z$ sectors. This significantly reduces computational cost and paves the way for faster and more reliable magnetic material design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09161",
        "abs_url": "https://arxiv.org/abs/2602.09161",
        "pdf_url": "https://arxiv.org/pdf/2602.09161",
        "title": "Minimum Distance Summaries for Robust Neural Posterior Estimation",
        "authors": [
            "Sherman Khoo",
            "Dennis Prangle",
            "Song Liu",
            "Mark Beaumont"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Simulation-based inference (SBI) enables amortized Bayesian inference by first training a neural posterior estimator (NPE) on prior-simulator pairs, typically through low-dimensional summary statistics, which can then be cheaply reused for fast inference by querying it on new test observations. Because NPE is estimated under the training data distribution, it is susceptible to misspecification when observations deviate from the training distribution. Many robust SBI approaches address this by modifying NPE training or introducing error models, coupling robustness to the inference network and compromising amortization and modularity. We introduce minimum-distance summaries, a plug-in robust NPE method that adapts queried test-time summaries independently of the pretrained NPE. Leveraging the maximum mean discrepancy (MMD) as a distance between observed data and a summary-conditional predictive distribution, the adapted summary inherits strong robustness properties from the MMD. We demonstrate that the algorithm can be implemented efficiently with random Fourier feature approximations, yielding a lightweight, model-free test-time adaptation procedure. We provide theoretical guarantees for the robustness of our algorithm and empirically evaluate it on a range of synthetic and real-world tasks, demonstrating substantial robustness gains with minimal additional overhead.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09182",
        "abs_url": "https://arxiv.org/abs/2602.09182",
        "pdf_url": "https://arxiv.org/pdf/2602.09182",
        "title": "One RNG to Rule Them All: How Randomness Becomes an Attack Vector in Machine Learning",
        "authors": [
            "Kotekar Annapoorna Prabhu",
            "Andrew Gan",
            "Zahra Ghodsi"
        ],
        "comments": "This work has been accepted for publication at the IEEE Conference on Secure and Trustworthy Machine Learning (SaTML). The final version will be available on IEEE Xplore",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Machine learning relies on randomness as a fundamental component in various steps such as data sampling, data augmentation, weight initialization, and optimization. Most machine learning frameworks use pseudorandom number generators as the source of randomness. However, variations in design choices and implementations across different frameworks, software dependencies, and hardware backends along with the lack of statistical validation can lead to previously unexplored attack vectors on machine learning systems. Such attacks on randomness sources can be extremely covert, and have a history of exploitation in real-world systems. In this work, we examine the role of randomness in the machine learning development pipeline from an adversarial point of view, and analyze the implementations of PRNGs in major machine learning frameworks. We present RNGGuard to help machine learning engineers secure their systems with low effort. RNGGuard statically analyzes a target library's source code and identifies instances of random functions and modules that use them. At runtime, RNGGuard enforces secure execution of random functions by replacing insecure function calls with RNGGuard's implementations that meet security specifications. Our evaluations show that RNGGuard presents a practical approach to close existing gaps in securing randomness sources in machine learning systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09206",
        "abs_url": "https://arxiv.org/abs/2602.09206",
        "pdf_url": "https://arxiv.org/pdf/2602.09206",
        "title": "EExApp: GNN-Based Reinforcement Learning for Radio Unit Energy Optimization in 5G O-RAN",
        "authors": [
            "Jie Lu",
            "Peihao Yan",
            "Huacheng Zeng"
        ],
        "comments": "Accepted by IEEE INFOCOM 2026",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "With over 3.5 million 5G base stations deployed globally, their collective energy consumption (projected to exceed 131 TWh annually) raises significant concerns over both operational costs and environmental impacts. In this paper, we present EExAPP, a deep reinforcement learning (DRL)-based xApp for 5G Open Radio Access Network (O-RAN) that jointly optimizes radio unit (RU) sleep scheduling and distributed unit (DU) resource slicing. EExAPP uses a dual-actor-dual-critic Proximal Policy Optimization (PPO) architecture, with dedicated actor-critic pairs targeting energy efficiency and quality-of-service (QoS) compliance. A transformer-based encoder enables scalable handling of variable user equipment (UE) populations by encoding all-UE observations into fixed-dimensional representations. To coordinate the two optimization objectives, a bipartite Graph Attention Network (GAT) is used to modulate actor updates based on both critic outputs, enabling adaptive tradeoffs between power savings and QoS. We have implemented EExAPP and deployed it on a real-world 5G O-RAN testbed with live traffic, commercial RU and smartphones. Extensive over-the-air experiments and ablation studies confirm that EExAPP significantly outperforms existing methods in reducing the energy consumption of RU while maintaining QoS.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09240",
        "abs_url": "https://arxiv.org/abs/2602.09240",
        "pdf_url": "https://arxiv.org/pdf/2602.09240",
        "title": "Optimal Estimation in Orthogonally Invariant Generalized Linear Models: Spectral Initialization and Approximate Message Passing",
        "authors": [
            "Yihan Zhang",
            "Hong Chang Ji",
            "Ramji Venkataramanan",
            "Marco Mondelli"
        ],
        "comments": "",
        "subjects": "Statistics Theory (math.ST); Information Theory (cs.IT); Machine Learning (cs.LG); Probability (math.PR); Machine Learning (stat.ML)",
        "abstract": "We consider the problem of parameter estimation from a generalized linear model with a random design matrix that is orthogonally invariant in law. Such a model allows the design have an arbitrary distribution of singular values and only assumes that its singular vectors are generic. It is a vast generalization of the i.i.d. Gaussian design typically considered in the theoretical literature, and is motivated by the fact that real data often have a complex correlation structure so that methods relying on i.i.d. assumptions can be highly suboptimal. Building on the paradigm of spectrally-initialized iterative optimization, this paper proposes optimal spectral estimators and combines them with an approximate message passing (AMP) algorithm, establishing rigorous performance guarantees for these two algorithmic steps. Both the spectral initialization and the subsequent AMP meet existing conjectures on the fundamental limits to estimation -- the former on the optimal sample complexity for efficient weak recovery, and the latter on the optimal errors. Numerical experiments suggest the effectiveness of our methods and accuracy of our theory beyond orthogonally invariant data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09277",
        "abs_url": "https://arxiv.org/abs/2602.09277",
        "pdf_url": "https://arxiv.org/pdf/2602.09277",
        "title": "Mutual Information Collapse Explains Disentanglement Failure in $Î²$-VAEs",
        "authors": [
            "Minh Vu",
            "Xiaoliang Wan",
            "Shuangqing Wei"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "The $\\beta$-VAE is a foundational framework for unsupervised disentanglement, using $\\beta$ to regulate the trade-off between latent factorization and reconstruction fidelity. Empirically, however, disentanglement performance exhibits a pervasive non-monotonic trend: benchmarks such as MIG and SAP typically peak at intermediate $\\beta$ and collapse as regularization increases. We demonstrate that this collapse is a fundamental information-theoretic failure, where strong Kullback-Leibler pressure promotes marginal independence at the expense of the latent channel's semantic informativeness. By formalizing this mechanism in a linear-Gaussian setting, we prove that for $\\beta > 1$, stationarity-induced dynamics trigger a spectral contraction of the encoder gain, driving latent-factor mutual information to zero. To resolve this, we introduce the $\\lambda\\beta$-VAE, which decouples regularization pressure from informational collapse via an auxiliary $L_2$ reconstruction penalty $\\lambda$. Extensive experiments on dSprites, Shapes3D, and MPI3D-real confirm that $\\lambda > 0$ stabilizes disentanglement and restores latent informativeness over a significantly broader range of $\\beta$, providing a principled theoretical justification for dual-parameter regularization in variational inference backbones.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09309",
        "abs_url": "https://arxiv.org/abs/2602.09309",
        "pdf_url": "https://arxiv.org/pdf/2602.09309",
        "title": "How Far Can You Grow? Characterizing the Extrapolation Frontier of Graph Generative Models for Materials Science",
        "authors": [
            "Can Polat",
            "Erchin Serpedin",
            "Mustafa Kurban",
            "Hasan Kurban"
        ],
        "comments": "",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Machine Learning (cs.LG); Atomic and Molecular Clusters (physics.atm-clus)",
        "abstract": "Every generative model for crystalline materials harbors a critical structure size beyond which its outputs quietly become unreliable -- we call this the extrapolation frontier. Despite its direct consequences for nanomaterial design, this frontier has never been systematically measured. We introduce RADII, a radius-resolved benchmark of ${\\sim}$75,000 nanoparticle structures (55-11,298 atoms) that treats radius as a continuous scaling knob to trace generation quality from in-distribution to out-of-distribution regimes under leakage-free splits. RADII provides frontier-specific diagnostics: per-radius error profiles pinpoint each architecture's scaling ceiling, surface-interior decomposition tests whether failures originate at boundaries or in bulk, and cross-metric failure sequencing reveals which aspect of structural fidelity breaks first. Benchmarking five state-of-the-art architectures, we find that: (i) all models degrade by ${\\sim}13\\%$ in global positional error beyond training radii, yet local bond fidelity diverges wildly across architectures -- from near-zero to over $2\\times$ collapse; (ii) no two architectures share the same failure sequence, revealing the frontier as a multi-dimensional surface shaped by model family; and (iii) well-behaved models obey a power-law scaling exponent $\\alpha \\approx 1/3$ whose in-distribution fit accurately predicts out-of-distribution error, making their frontiers quantitatively forecastable. These findings establish output scale as a first-class evaluation axis for geometric generative models. The dataset and code are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09331",
        "abs_url": "https://arxiv.org/abs/2602.09331",
        "pdf_url": "https://arxiv.org/pdf/2602.09331",
        "title": "Beyond Uniform Credit: Causal Credit Assignment for Policy Optimization",
        "authors": [
            "Mykola Khandoga",
            "Rui Yuan",
            "Vinay Kumar Sankarapu"
        ],
        "comments": "12 pages, 1 figure",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Policy gradient methods for language model reasoning, such as GRPO and DAPO, assign uniform credit to all generated tokens - the filler phrase \"Let me think\" receives the same gradient update as the critical calculation \"23 + 45 = 68.\" We propose counterfactual importance weighting: mask reasoning spans, measure the drop in answer probability, and upweight tokens accordingly during policy gradient updates. Our method requires no auxiliary models or external annotation, instead importance is estimated directly from the policy model's own probability shifts. Experiments on GSM8K across three models spanning the Qwen and Llama families demonstrate consistent improvements over uniform baselines and faster convergence to equivalent accuracy. Inverting the importance signal hurts performance, confirming we capture genuine causal structure rather than noise. Analysis shows the method correctly prioritizes calculation steps over scaffolding text. We view these findings as establishing counterfactual importance weighting as a foundation for further research rather than a complete solution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09389",
        "abs_url": "https://arxiv.org/abs/2602.09389",
        "pdf_url": "https://arxiv.org/pdf/2602.09389",
        "title": "TVTSyn: Content-Synchronous Time-Varying Timbre for Streaming Voice Conversion and Anonymization",
        "authors": [
            "Waris Quamer",
            "Mu-Ruei Tseng",
            "Ghady Nasrallah",
            "Ricardo Gutierrez-Osuna"
        ],
        "comments": "",
        "subjects": "Audio and Speech Processing (eess.AS); Computation and Language (cs.CL); Machine Learning (cs.LG); Sound (cs.SD)",
        "abstract": "Real-time voice conversion and speaker anonymization require causal, low-latency synthesis without sacrificing intelligibility or naturalness. Current systems have a core representational mismatch: content is time-varying, while speaker identity is injected as a static global embedding. We introduce a streamable speech synthesizer that aligns the temporal granularity of identity and content via a content-synchronous, time-varying timbre (TVT) representation. A Global Timbre Memory expands a global timbre instance into multiple compact facets; frame-level content attends to this memory, a gate regulates variation, and spherical interpolation preserves identity geometry while enabling smooth local changes. In addition, a factorized vector-quantized bottleneck regularizes content to reduce residual speaker leakage. The resulting system is streamable end-to-end, with <80 ms GPU latency. Experiments show improvements in naturalness, speaker transfer, and anonymization compared to SOTA streaming baselines, establishing TVT as a scalable approach for privacy-preserving and expressive speech synthesis under strict latency budgets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09405",
        "abs_url": "https://arxiv.org/abs/2602.09405",
        "pdf_url": "https://arxiv.org/pdf/2602.09405",
        "title": "Is Memorization Helpful or Harmful? Prior Information Sets the Threshold",
        "authors": [
            "Chen Cheng",
            "Rina Foygel Barber"
        ],
        "comments": "33 pages, 3 figures",
        "subjects": "Machine Learning (stat.ML); Information Theory (cs.IT); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "We examine the connection between training error and generalization error for arbitrary estimating procedures, working in an overparameterized linear model under general priors in a Bayesian setup. We find determining factors inherent to the prior distribution $\\pi$, giving explicit conditions under which optimal generalization necessitates that the training error be (i) near interpolating relative to the noise size (i.e., memorization is necessary), or (ii) close to the noise level (i.e., overfitting is harmful). Remarkably, these phenomena occur when the noise reaches thresholds determined by the Fisher information and the variance parameters of the prior $\\pi$.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09425",
        "abs_url": "https://arxiv.org/abs/2602.09425",
        "pdf_url": "https://arxiv.org/pdf/2602.09425",
        "title": "Bridging the Modality Gap in Roadside LiDAR: A Training-Free Vision-Language Model Framework for Vehicle Classification",
        "authors": [
            "Yiqiao Li",
            "Bo Shang",
            "Jie Wei"
        ],
        "comments": "12 pages, 10 figures, 4 tables",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Fine-grained truck classification is critical for intelligent transportation systems (ITS), yet current LiDAR-based methods face scalability challenges due to their reliance on supervised deep learning and labor-intensive manual annotation. Vision-Language Models (VLMs) offer promising few-shot generalization, but their application to roadside LiDAR is limited by a modality gap between sparse 3D point clouds and dense 2D imagery. We propose a framework that bridges this gap by adapting off-the-shelf VLMs for fine-grained truck classification without parameter fine-tuning. Our new depth-aware image generation pipeline applies noise removal, spatial and temporal registration, orientation rectification, morphological operations, and anisotropic smoothing to transform sparse, occluded LiDAR scans into depth-encoded 2D visual proxies. Validated on a real-world dataset of 20 vehicle classes, our approach achieves competitive classification accuracy with as few as 16-30 examples per class, offering a scalable alternative to data-intensive supervised baselines. We further observe a \"Semantic Anchor\" effect: text-based guidance regularizes performance in ultra-low-shot regimes $k < 4$, but degrades accuracy in more-shot settings due to semantic mismatch. Furthermore, we demonstrate the efficacy of this framework as a Cold Start strategy, using VLM-generated labels to bootstrap lightweight supervised models. Notably, the few-shot VLM-based model achieves over correct classification rate of 75 percent for specific drayage categories (20ft, 40ft, and 53ft containers) entirely without the costly training or fine-tuning, significantly reducing the intensive demands of initial manual labeling, thus achieving a method of practical use in ITS applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09448",
        "abs_url": "https://arxiv.org/abs/2602.09448",
        "pdf_url": "https://arxiv.org/pdf/2602.09448",
        "title": "The Wisdom of Many Queries: Complexity-Diversity Principle for Dense Retriever Training",
        "authors": [
            "Xincan Feng",
            "Noriki Nishida",
            "Yusuke Sakai",
            "Yuji Matsumoto"
        ],
        "comments": "Under review",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Prior work reports conflicting results on query diversity in synthetic data generation for dense retrieval. We identify this conflict and design Q-D metrics to quantify diversity's impact, making the problem measurable. Through experiments on 4 benchmark types (31 datasets), we find query diversity especially benefits multi-hop retrieval. Deep analysis on multi-hop data reveals that diversity benefit correlates strongly with query complexity ($r$$\\geq$0.95, $p$$<$0.05 in 12/14 conditions), measured by content words (CW). We formalize this as the Complexity-Diversity Principle (CDP): query complexity determines optimal diversity. CDP provides actionable thresholds (CW$>$10: use diversity; CW$<$7: avoid it). Guided by CDP, we propose zero-shot multi-query synthesis for multi-hop tasks, achieving state-of-the-art performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09455",
        "abs_url": "https://arxiv.org/abs/2602.09455",
        "pdf_url": "https://arxiv.org/pdf/2602.09455",
        "title": "Enhancing Affine Maximizer Auctions with Correlation-Aware Payment",
        "authors": [
            "Haoran Sun",
            "Xuanzhi Xia",
            "Xu Chu",
            "Xiaotie Deng"
        ],
        "comments": "22 pages. Work in progress",
        "subjects": "Computer Science and Game Theory (cs.GT); Machine Learning (cs.LG)",
        "abstract": "Affine Maximizer Auctions (AMAs), a generalized mechanism family from VCG, are widely used in automated mechanism design due to their inherent dominant-strategy incentive compatibility (DSIC) and individual rationality (IR). However, as the payment form is fixed, AMA's expressiveness is restricted, especially in distributions where bidders' valuations are correlated. In this paper, we propose Correlation-Aware AMA (CA-AMA), a novel framework that augments AMA with a new correlation-aware payment. We show that any CA-AMA preserves the DSIC property and formalize finding optimal CA-AMA as a constraint optimization problem subject to the IR constraint. Then, we theoretically characterize scenarios where classic AMAs can perform arbitrarily poorly compared to the optimal revenue, while the CA-AMA can reach the optimal revenue. For optimizing CA-AMA, we design a practical two-stage training algorithm. We derive that the target function's continuity and the generalization bound on the degree of deviation from strict IR. Finally, extensive experiments showcase that our algorithm can find an approximate optimal CA-AMA in various distributions with improved revenue and a low degree of violation of IR.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09457",
        "abs_url": "https://arxiv.org/abs/2602.09457",
        "pdf_url": "https://arxiv.org/pdf/2602.09457",
        "title": "From Average Sensitivity to Small-Loss Regret Bounds under Random-Order Model",
        "authors": [
            "Shinsaku Sakaue",
            "Yuichi Yoshida"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG)",
        "abstract": "We study online learning in the random-order model, where the multiset of loss functions is chosen adversarially but revealed in a uniformly random order. Building on the batch-to-online conversion by Dong and Yoshida (2023), we show that if an offline algorithm admits a $(1+\\varepsilon)$-approximation guarantee and the effect of $\\varepsilon$ on its average sensitivity is characterized by a function $\\varphi(\\varepsilon)$, then an adaptive choice of $\\varepsilon$ yields a small-loss regret bound of $\\tilde O(\\varphi^{\\star}(\\mathrm{OPT}_T))$, where $\\varphi^{\\star}$ is the concave conjugate of $\\varphi$, $\\mathrm{OPT}_T$ is the offline optimum over $T$ rounds, and $\\tilde O$ hides polylogarithmic factors in $T$. Our method requires no regularity assumptions on loss functions, such as smoothness, and can be viewed as a generalization of the AdaGrad-style tuning applied to the approximation parameter $\\varepsilon$. Our result recovers and strengthens the $(1+\\varepsilon)$-approximate regret bounds of Dong and Yoshida (2023) and yields small-loss regret bounds for online $k$-means clustering, low-rank approximation, and regression. We further apply our framework to online submodular function minimization using $(1\\pm\\varepsilon)$-cut sparsifiers of submodular hypergraphs, obtaining a small-loss regret bound of $\\tilde O(n^{3/4}(1 + \\mathrm{OPT}_T^{3/4}))$, where $n$ is the ground-set size. Our approach sheds light on the power of sparsification and related techniques in establishing small-loss regret bounds in the random-order model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09572",
        "abs_url": "https://arxiv.org/abs/2602.09572",
        "pdf_url": "https://arxiv.org/pdf/2602.09572",
        "title": "Predictive Query Language: A Domain-Specific Language for Predictive Modeling on Relational Databases",
        "authors": [
            "Vid Kocijan",
            "Jinu Sunil",
            "Jan Eric Lenssen",
            "Viman Deb",
            "Xinwei Xe",
            "Federco Reyes Gomez",
            "Matthias Fey",
            "Jure Leskovec"
        ],
        "comments": "",
        "subjects": "Databases (cs.DB); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "The purpose of predictive modeling on relational data is to predict future or missing values in a relational database, for example, future purchases of a user, risk of readmission of the patient, or the likelihood that a financial transaction is fraudulent. Typically powered by machine learning methods, predictive models are used in recommendations, financial fraud detection, supply chain optimization, and other systems, providing billions of predictions every day. However, training a machine learning model requires manual work to extract the required training examples - prediction entities and target labels - from the database, which is slow, laborious, and prone to mistakes. Here, we present the Predictive Query Language (PQL), a SQL-inspired declarative language for defining predictive tasks on relational databases. PQL allows specifying a predictive task in a single declarative query, enabling the automatic computation training labels for a large variety of machine learning tasks, such as regression, classification, time-series forecasting, and recommender systems. PQL is already successfully integrated and used in a collection of use cases as part of a predictive AI platform. The versatility of the language can be demonstrated through its many ongoing use cases, including financial fraud, item recommendations, and workload prediction. We demonstrate its versatile design through two implementations; one for small-scale, low-latency use and one that can handle large-scale databases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09580",
        "abs_url": "https://arxiv.org/abs/2602.09580",
        "pdf_url": "https://arxiv.org/pdf/2602.09580",
        "title": "Sample-Efficient Real-World Dexterous Policy Fine-Tuning via Action-Chunked Critics and Normalizing Flows",
        "authors": [
            "Chenyu Yang",
            "Denis Tarasov",
            "Davide Liconti",
            "Hehui Zheng",
            "Robert K. Katzschmann"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Real-world fine-tuning of dexterous manipulation policies remains challenging due to limited real-world interaction budgets and highly multimodal action distributions. Diffusion-based policies, while expressive, do not permit conservative likelihood-based updates during fine-tuning because action probabilities are intractable. In contrast, conventional Gaussian policies collapse under multimodality, particularly when actions are executed in chunks, and standard per-step critics fail to align with chunked execution, leading to poor credit assignment. We present SOFT-FLOW, a sample-efficient off-policy fine-tuning framework with normalizing flow (NF) to address these challenges. The normalizing flow policy yields exact likelihoods for multimodal action chunks, allowing conservative, stable policy updates through likelihood regularization and thereby improving sample efficiency. An action-chunked critic evaluates entire action sequences, aligning value estimation with the policy's temporal structure and improving long-horizon credit assignment. To our knowledge, this is the first demonstration of a likelihood-based, multimodal generative policy combined with chunk-level value learning on real robotic hardware. We evaluate SOFT-FLOW on two challenging dexterous manipulation tasks in the real world: cutting tape with scissors retrieved from a case, and in-hand cube rotation with a palm-down grasp -- both of which require precise, dexterous control over long horizons. On these tasks, SOFT-FLOW achieves stable, sample-efficient adaptation where standard methods struggle.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09613",
        "abs_url": "https://arxiv.org/abs/2602.09613",
        "pdf_url": "https://arxiv.org/pdf/2602.09613",
        "title": "Tracking Finite-Time Lyapunov Exponents to Robustify Neural ODEs",
        "authors": [
            "Tobias WÃ¶hrer",
            "Christian Kuehn"
        ],
        "comments": "Lyapunov exponents, neural ODEs, deep learning, adversarial robustness, Lagrangian coherent structures",
        "subjects": "Dynamical Systems (math.DS); Machine Learning (cs.LG)",
        "abstract": "We investigate finite-time Lyapunov exponents (FTLEs), a measure for exponential separation of input perturbations, of deep neural networks within the framework of continuous-depth neural ODEs. We demonstrate that FTLEs are powerful organizers for input-output dynamics, allowing for better interpretability and the comparison of distinct model architectures. We establish a direct connection between Lyapunov exponents and adversarial vulnerability, and propose a novel training algorithm that improves robustness by FTLE regularization. The key idea is to suppress exponents far from zero in the early stage of the input dynamics. This approach enhances robustness and reduces computational cost compared to full-interval regularization, as it avoids a full ``double'' backpropagation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09621",
        "abs_url": "https://arxiv.org/abs/2602.09621",
        "pdf_url": "https://arxiv.org/pdf/2602.09621",
        "title": "AlignTune: Modular Toolkit for Post-Training Alignment of Large Language Models",
        "authors": [
            "R E Zera Marveen Lyngkhoi",
            "Chirag Chawla",
            "Pratinav Seth",
            "Utsav Avaiya",
            "Soham Bhattacharjee",
            "Mykola Khandoga",
            "Rui Yuan",
            "Vinay Kumar Sankarapu"
        ],
        "comments": "this https URL",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Post-training alignment is central to deploying large language models (LLMs), yet practical workflows remain split across backend-specific tools and ad-hoc glue code, making experiments hard to reproduce. We identify backend interference, reward fragmentation, and irreproducible pipelines as key obstacles in alignment research. We introduce AlignTune, a modular toolkit exposing a unified interface for supervised fine-tuning (SFT) and RLHF-style optimization with interchangeable TRL and Unsloth backends. AlignTune standardizes configuration, provides an extensible reward layer (rule-based and learned), and integrates evaluation over standard benchmarks and custom tasks. By isolating backend-specific logic behind a single factory boundary, AlignTune enables controlled comparisons and reproducible alignment experiments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09651",
        "abs_url": "https://arxiv.org/abs/2602.09651",
        "pdf_url": "https://arxiv.org/pdf/2602.09651",
        "title": "The Entropic Signature of Class Speciation in Diffusion Models",
        "authors": [
            "Florian Handke",
            "Dejan StanÄeviÄ‡",
            "Felix Koulischer",
            "Thomas Demeester",
            "Luca Ambrogioni"
        ],
        "comments": "21 pages",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Diffusion models do not recover semantic structure uniformly over time. Instead, samples transition from semantic ambiguity to class commitment within a narrow regime. Recent theoretical work attributes this transition to dynamical instabilities along class-separating directions, but practical methods to detect and exploit these windows in trained models are still limited. We show that tracking the class-conditional entropy of a latent semantic variable given the noisy state provides a reliable signature of these transition regimes. By restricting the entropy to semantic partitions, the entropy can furthermore resolve semantic decisions at different levels of abstraction. We analyze this behavior in high-dimensional Gaussian mixture models and show that the entropy rate concentrates on the same logarithmic time scale as the speciation symmetry-breaking instability previously identified in variance-preserving diffusion. We validate our method on EDM2-XS and Stable Diffusion 1.5, where class-conditional entropy consistently isolates the noise regimes critical for semantic structure formation. Finally, we use our framework to quantify how guidance redistributes semantic information over time. Together, these results connect information-theoretic and statistical physics perspectives on diffusion and provide a principled basis for time-localized control.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09691",
        "abs_url": "https://arxiv.org/abs/2602.09691",
        "pdf_url": "https://arxiv.org/pdf/2602.09691",
        "title": "Life Cycle-Aware Evaluation of Knowledge Distillation for Machine Translation: Environmental Impact and Translation Quality Trade-offs",
        "authors": [
            "Joseph Attieh",
            "Timothee Mickus",
            "Anne-Laure Ligozat",
            "AurÃ©lie NÃ©vÃ©ol",
            "JÃ¶rg Tiedemann"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Knowledge distillation (KD) is a tool to compress a larger system (teacher) into a smaller one (student). In machine translation, studies typically report only the translation quality of the student and omit the computational complexity of performing KD, making it difficult to select among the many available KD choices under compute-induced constraints. In this study, we evaluate representative KD methods by considering both translation quality and computational cost. We express computational cost as a carbon footprint using the machine learning life cycle assessment (MLCA) tool. This assessment accounts for runtime operational emissions and amortized hardware production costs throughout the KD model life cycle (teacher training, distillation, and inference). We find that (i) distillation overhead dominates the total footprint at small deployment volumes, (ii) inference dominates at scale, making KD beneficial only beyond a task-dependent usage threshold, and (iii) word-level distillation typically offers more favorable footprint-quality trade-offs than sequence-level distillation. Our protocol provides reproducible guidance for selecting KD methods under explicit quality and compute-induced constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09718",
        "abs_url": "https://arxiv.org/abs/2602.09718",
        "pdf_url": "https://arxiv.org/pdf/2602.09718",
        "title": "SAQNN: Spectral Adaptive Quantum Neural Network as a Universal Approximator",
        "authors": [
            "Jialiang Tang",
            "Jialin Zhang",
            "Xiaoming Sun"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "Quantum machine learning (QML), as an interdisciplinary field bridging quantum computing and machine learning, has garnered significant attention in recent years. Currently, the field as a whole faces challenges due to incomplete theoretical foundations for the expressivity of quantum neural networks (QNNs). In this paper we propose a constructive QNN model and demonstrate that it possesses the universal approximation property (UAP), which means it can approximate any square-integrable function up to arbitrary accuracy. Furthermore, it supports switching function bases, thus adaptable to various scenarios in numerical approximation and machine learning. Our model has asymptotic advantages over the best classical feed-forward neural networks in terms of circuit size and achieves optimal parameter complexity when approximating Sobolev functions under $L_2$ norm.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 113,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09720",
        "abs_url": "https://arxiv.org/abs/2602.09720",
        "pdf_url": "https://arxiv.org/pdf/2602.09720",
        "title": "Continual Learning for non-stationary regression via Memory-Efficient Replay",
        "authors": [
            "Pablo GarcÃ­a-Santaclara",
            "Bruno FernÃ¡ndez-Castro",
            "RebecaP.DÃ­az-Redondo",
            "MartÃ­n Alonso-Gamarra"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Data streams are rarely static in dynamic environments like Industry 4.0. Instead, they constantly change, making traditional offline models outdated unless they can quickly adjust to the new data. This need can be adequately addressed by continual learning (CL), which allows systems to gradually acquire knowledge without incurring the prohibitive costs of retraining them from scratch. Most research on continual learning focuses on classification problems, while very few studies address regression tasks. We propose the first prototype-based generative replay framework designed for online task-free continual regression. Our approach defines an adaptive output-space discretization model, enabling prototype-based generative replay for continual regression without storing raw data. Evidence obtained from several benchmark datasets shows that our framework reduces forgetting and provides more stable performance than other state-of-the-art solutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 114,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09748",
        "abs_url": "https://arxiv.org/abs/2602.09748",
        "pdf_url": "https://arxiv.org/pdf/2602.09748",
        "title": "Linear Model Extraction via Factual and Counterfactual Queries",
        "authors": [
            "Daan Otto",
            "Jannis Kurtz",
            "Dick den Hertog",
            "Ilker Birbil"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "In model extraction attacks, the goal is to reveal the parameters of a black-box machine learning model by querying the model for a selected set of data points. Due to an increasing demand for explanations, this may involve counterfactual queries besides the typically considered factual queries. In this work, we consider linear models and three types of queries: factual, counterfactual, and robust counterfactual. First, for an arbitrary set of queries, we derive novel mathematical formulations for the classification regions for which the decision of the unknown model is known, without recovering any of the model parameters. Second, we derive bounds on the number of queries needed to extract the model's parameters for (robust) counterfactual queries under arbitrary norm-based distances. We show that the full model can be recovered using just a single counterfactual query when differentiable distance measures are employed. In contrast, when using polyhedral distances for instance, the number of required queries grows linearly with the dimension of the data space. For robust counterfactuals, the latter number of queries doubles. Consequently, the applied distance function and robustness of counterfactuals have a significant impact on the model's security.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 115,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09791",
        "abs_url": "https://arxiv.org/abs/2602.09791",
        "pdf_url": "https://arxiv.org/pdf/2602.09791",
        "title": "Toeplitz Based Spectral Methods for Data-driven Dynamical Systems",
        "authors": [
            "Vladimir R. Kostic",
            "Karim Lounici",
            "Massimiliano Pontil"
        ],
        "comments": "18 pages, 3 figures",
        "subjects": "Dynamical Systems (math.DS); Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "We introduce a Toeplitz-based framework for data-driven spectral estimation of linear evolution operators in dynamical systems. Focusing on transfer and Koopman operators from equilibrium trajectories without access to the underlying equations of motion, our method applies Toeplitz filters to the infinitesimal generator to extract eigenvalues, eigenfunctions, and spectral measures. Structural prior knowledge, such as self-adjointness or skew-symmetry, can be incorporated by design. The approach is statistically consistent and computationally efficient, leveraging both primal and dual algorithms commonly used in statistical learning. Numerical experiments on deterministic and chaotic systems demonstrate that the framework can recover spectral properties beyond the reach of standard data-driven methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 116,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09841",
        "abs_url": "https://arxiv.org/abs/2602.09841",
        "pdf_url": "https://arxiv.org/pdf/2602.09841",
        "title": "Hybrid Responsible AI-Stochastic Approach for SLA Compliance in Multivendor 6G Networks",
        "authors": [
            "Emanuel Figetakis",
            "Ahmed Refaey Hussein"
        ],
        "comments": "6 pages, 4 figures",
        "subjects": "Networking and Internet Architecture (cs.NI); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "The convergence of AI and 6G network automation introduces new challenges in maintaining transparency, fairness, and accountability across multivendor management systems. Although closed-loop AI orchestration improves adaptability and self-optimization, it also creates a responsibility gap, where violations of SLAs cannot be causally attributed to specific agents or vendors. This paper presents a hybrid responsible AI-stochastic learning framework that embeds fairness, robustness, and auditability directly into the network control loop. The framework integrates RAI games with stochastic optimization, enabling dynamic adversarial reweighting and probabilistic exploration across heterogeneous vendor domains. An RAAP continuously records AI-driven decision trajectories and produces dual accountability reports: user-level SLA summaries and operator-level responsibility analytics. Experimental evaluations on synthetic two-class multigroup datasets demonstrate that the proposed hybrid model improves the accuracy of the worst group by up to 10.5\\%. Specifically, hybrid RAI achieved a WGAcc of 60.5\\% and an AvgAcc of 72.7\\%, outperforming traditional RAI-GA (50.0\\%) and ERM (21.5\\%). The audit mechanism successfully traced 99\\% simulated SLA violations to the AI entities responsible, producing both vendor and agent-level accountability indices. These results confirm that the proposed hybrid approach enhances fairness and robustness as well as establishes a concrete accountability framework for autonomous SLA assurance in multivendor 6G networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 117,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09842",
        "abs_url": "https://arxiv.org/abs/2602.09842",
        "pdf_url": "https://arxiv.org/pdf/2602.09842",
        "title": "Step-Size Stability in Stochastic Optimization: A Theoretical Perspective",
        "authors": [
            "Fabian Schaipp",
            "Robert M. Gower",
            "Adrien Taylor"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "We present a theoretical analysis of stochastic optimization methods in terms of their sensitivity with respect to the step size. We identify a key quantity that, for each method, describes how the performance degrades as the step size becomes too large. For convex problems, we show that this quantity directly impacts the suboptimality bound of the method. Most importantly, our analysis provides direct theoretical evidence that adaptive step-size methods, such as SPS or NGN, are more robust than SGD. This allows us to quantify the advantage of these adaptive methods beyond empirical evaluation. Finally, we show through experiments that our theoretical bound qualitatively mirrors the actual performance as a function of the step size, even for nonconvex problems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 118,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09847",
        "abs_url": "https://arxiv.org/abs/2602.09847",
        "pdf_url": "https://arxiv.org/pdf/2602.09847",
        "title": "Stabilized Maximum-Likelihood Iterative Quantum Amplitude Estimation for Structural CVaR under Correlated Random Fields",
        "authors": [
            "Alireza Tabarraei"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Conditional Value-at-Risk (CVaR) is a central tail-risk measure in stochastic structural mechanics, yet its accurate evaluation under high-dimensional, spatially correlated material uncertainty remains computationally prohibitive for classical Monte Carlo methods. Leveraging bounded-expectation reformulations of CVaR compatible with quantum amplitude estimation, we develop a quantum-enhanced inference framework that casts CVaR evaluation as a statistically consistent, confidence-constrained maximum-likelihood amplitude estimation problem. The proposed method extends iterative quantum amplitude estimation (IQAE) by embedding explicit maximum-likelihood inference within a rigorously controlled interval-tracking architecture. To ensure global correctness under finite-shot noise and the non-injective oscillatory response induced by Grover amplification, we introduce a stabilized inference scheme incorporating multi-hypothesis feasibility tracking, periodic low-depth disambiguation, and a bounded restart mechanism governed by an explicit failure-probability budget. This formulation preserves the quadratic oracle-complexity advantage of amplitude estimation while providing finite-sample confidence guarantees and reduced estimator variance. The framework is demonstrated on benchmark problems with spatially correlated lognormal Young's modulus fields generated using a Nystrom low-rank Gaussian kernel model. Numerical results show that the proposed estimator achieves substantially lower oracle complexity than classical Monte Carlo CVaR estimation at comparable confidence levels, while maintaining rigorous statistical reliability. This work establishes a practically robust and theoretically grounded quantum-enhanced methodology for tail-risk quantification in stochastic continuum mechanics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 119,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09848",
        "abs_url": "https://arxiv.org/abs/2602.09848",
        "pdf_url": "https://arxiv.org/pdf/2602.09848",
        "title": "Robust Processing and Learning: Principles, Methods, and Wireless Applications",
        "authors": [
            "Shixiong Wang",
            "Wei Dai",
            "Li-Chun Wang",
            "Geoffrey Ye Li"
        ],
        "comments": "",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "This tutorial-style overview article examines the fundamental principles and methods of robustness, using wireless sensing and communication (WSC) as the narrative and exemplifying framework. First, we formalize the conceptual and mathematical foundations of robustness, highlighting the interpretations and relations across robust statistics, optimization, and machine learning. Key techniques, such as robust estimation and testing, distributionally robust optimization, and regularized and adversary training, are investigated. Together, the costs of robustness in system design, for example, the compromised nominal performances and the extra computational burdens, are discussed. Second, we review recent robust signal processing solutions for WSC that address model mismatch, data scarcity, adversarial perturbation, and distributional shift. Specific applications include robust ranging-based localization, modality sensing, channel estimation, receive combining, waveform design, and federated learning. Through this effort, we aim to introduce the classical developments and recent advances in robustness theory to the general signal processing community, exemplifying how robust statistical, optimization, and machine learning approaches can address the uncertainties inherent in WSC systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 120,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09891",
        "abs_url": "https://arxiv.org/abs/2602.09891",
        "pdf_url": "https://arxiv.org/pdf/2602.09891",
        "title": "Stemphonic: All-at-once Flexible Multi-stem Music Generation",
        "authors": [
            "Shih-Lun Wu",
            "Ge Zhu",
            "Juan-Pablo Caceres",
            "Cheng-Zhi Anna Huang",
            "Nicholas J. Bryan"
        ],
        "comments": "Accepted for publication at Int. Conf. on Acoustics, Speech, and Signal Processing (ICASSP) 2026",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG); Multimedia (cs.MM)",
        "abstract": "Music stem generation, the task of producing musically-synchronized and isolated instrument audio clips, offers the potential of greater user control and better alignment with musician workflows compared to conventional text-to-music models. Existing stem generation approaches, however, either rely on fixed architectures that output a predefined set of stems in parallel, or generate only one stem at a time, resulting in slow inference despite flexibility in stem combination. We propose Stemphonic, a diffusion-/flow-based framework that overcomes this trade-off and generates a variable set of synchronized stems in one inference pass. During training, we treat each stem as a batch element, group synchronized stems in a batch, and apply a shared noise latent to each group. At inference-time, we use a shared initial noise latent and stem-specific text inputs to generate synchronized multi-stem outputs in one pass. We further expand our approach to enable one-pass conditional multi-stem generation and stem-wise activity controls to empower users to iteratively generate and orchestrate the temporal layering of a mix. We benchmark our results on multiple open-source stem evaluation sets and show that Stemphonic produces higher-quality outputs while accelerating the full mix generation process by 25 to 50%. Demos at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 121,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09924",
        "abs_url": "https://arxiv.org/abs/2602.09924",
        "pdf_url": "https://arxiv.org/pdf/2602.09924",
        "title": "LLMs Encode Their Failures: Predicting Success from Pre-Generation Activations",
        "authors": [
            "William Lugoloobi",
            "Thomas Foster",
            "William Bankes",
            "Chris Russell"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Running LLMs with extended reasoning on every problem is expensive, but determining which inputs actually require additional compute remains challenging. We investigate whether their own likelihood of success is recoverable from their internal representations before generation, and if this signal can guide more efficient inference. We train linear probes on pre-generation activations to predict policy-specific success on math and coding tasks, substantially outperforming surface features such as question length and TF-IDF. Using E2H-AMC, which provides both human and model performance on identical problems, we show that models encode a model-specific notion of difficulty that is distinct from human difficulty, and that this distinction increases with extended reasoning. Leveraging these probes, we demonstrate that routing queries across a pool of models can exceed the best-performing model whilst reducing inference cost by up to 70\\% on MATH, showing that internal representations enable practical efficiency gains even when they diverge from human intuitions about difficulty. Our code is available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 122,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09936",
        "abs_url": "https://arxiv.org/abs/2602.09936",
        "pdf_url": "https://arxiv.org/pdf/2602.09936",
        "title": "The Catastrophic Failure of The k-Means Algorithm in High Dimensions, and How Hartigan's Algorithm Avoids It",
        "authors": [
            "Roy R. Lederman",
            "David Silva-SÃ¡nchez",
            "Ziling Chen",
            "Gilles Mordant",
            "Amnon Balanov",
            "Tamir Bendory"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "Lloyd's k-means algorithm is one of the most widely used clustering methods. We prove that in high-dimensional, high-noise settings, the algorithm exhibits catastrophic failure: with high probability, essentially every partition of the data is a fixed point. Consequently, Lloyd's algorithm simply returns its initial partition - even when the underlying clusters are trivially recoverable by other methods. In contrast, we prove that Hartigan's k-means algorithm does not exhibit this pathology. Our results show the stark difference between these algorithms and offer a theoretical explanation for the empirical difficulties often observed with k-means in high dimensions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 123,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.09959",
        "abs_url": "https://arxiv.org/abs/2602.09959",
        "pdf_url": "https://arxiv.org/pdf/2602.09959",
        "title": "Statistical-Computational Trade-offs in Learning Multi-Index Models via Harmonic Analysis",
        "authors": [
            "Hugo Latourelle-Vigeant",
            "Theodor Misiakiewicz"
        ],
        "comments": "91 pages",
        "subjects": "Statistics Theory (math.ST); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study the problem of learning multi-index models (MIMs), where the label depends on the input $\\boldsymbol{x} \\in \\mathbb{R}^d$ only through an unknown $\\mathsf{s}$-dimensional projection $\\boldsymbol{W}_*^\\mathsf{T} \\boldsymbol{x} \\in \\mathbb{R}^\\mathsf{s}$. Exploiting the equivariance of this problem under the orthogonal group $\\mathcal{O}_d$, we obtain a sharp harmonic-analytic characterization of the learning complexity for MIMs with spherically symmetric inputs -- which refines and generalizes previous Gaussian-specific analyses. Specifically, we derive statistical and computational complexity lower bounds within the Statistical Query (SQ) and Low-Degree Polynomial (LDP) frameworks. These bounds decompose naturally across spherical harmonic subspaces. Guided by this decomposition, we construct a family of spectral algorithms based on harmonic tensor unfolding that sequentially recover the latent directions and (nearly) achieve these SQ and LDP lower bounds. Depending on the choice of harmonic degree sequence, these estimators can realize a broad range of trade-offs between sample and runtime complexity. From a technical standpoint, our results build on the semisimple decomposition of the $\\mathcal{O}_d$-action on $L^2 (\\mathbb{S}^{d-1})$ and the intertwining isomorphism between spherical harmonics and traceless symmetric tensors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 124,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10045",
        "abs_url": "https://arxiv.org/abs/2602.10045",
        "pdf_url": "https://arxiv.org/pdf/2602.10045",
        "title": "Conformal Prediction Sets for Instance Segmentation",
        "authors": [
            "Kerri Lu",
            "Dan M. Kluger",
            "Stephen Bates",
            "Sherrie Wang"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Methodology (stat.ME); Machine Learning (stat.ML)",
        "abstract": "Current instance segmentation models achieve high performance on average predictions, but lack principled uncertainty quantification: their outputs are not calibrated, and there is no guarantee that a predicted mask is close to the ground truth. To address this limitation, we introduce a conformal prediction algorithm to generate adaptive confidence sets for instance segmentation. Given an image and a pixel coordinate query, our algorithm generates a confidence set of instance predictions for that pixel, with a provable guarantee for the probability that at least one of the predictions has high Intersection-Over-Union (IoU) with the true object instance mask. We apply our algorithm to instance segmentation examples in agricultural field delineation, cell segmentation, and vehicle detection. Empirically, we find that our prediction sets vary in size based on query difficulty and attain the target coverage, outperforming existing baselines such as Learn Then Test, Conformal Risk Control, and morphological dilation-based methods. We provide versions of the algorithm with asymptotic and finite sample guarantees.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 125,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10058",
        "abs_url": "https://arxiv.org/abs/2602.10058",
        "pdf_url": "https://arxiv.org/pdf/2602.10058",
        "title": "Evaluating Disentangled Representations for Controllable Music Generation",
        "authors": [
            "Laura IbÃ¡Ã±ez-MartÃ­nez",
            "Chukwuemeka Nkama",
            "Andrea Poltronieri",
            "Xavier Serra",
            "MartÃ­n Rocamora"
        ],
        "comments": "Accepted at ICASSP 2026",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG); Audio and Speech Processing (eess.AS)",
        "abstract": "Recent approaches in music generation rely on disentangled representations, often labeled as structure and timbre or local and global, to enable controllable synthesis. Yet the underlying properties of these embeddings remain underexplored. In this work, we evaluate such disentangled representations in a set of music audio models for controllable generation using a probing-based framework that goes beyond standard downstream tasks. The selected models reflect diverse unsupervised disentanglement strategies, including inductive biases, data augmentations, adversarial objectives, and staged training procedures. We further isolate specific strategies to analyze their effect. Our analysis spans four key axes: informativeness, equivariance, invariance, and disentanglement, which are assessed across datasets, tasks, and controlled transformations. Our findings reveal inconsistencies between intended and actual semantics of the embeddings, suggesting that current strategies fall short of producing truly disentangled representations, and prompting a re-examination of how controllability is approached in music generation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 126,
        "date": "2026-02-11",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-11?abs=True",
        "arxiv_id": "2602.10095",
        "abs_url": "https://arxiv.org/abs/2602.10095",
        "pdf_url": "https://arxiv.org/pdf/2602.10095",
        "title": "Causality in Video Diffusers is Separable from Denoising",
        "authors": [
            "Xingjian Bai",
            "Guande He",
            "Zhengqi Li",
            "Eli Shechtman",
            "Xun Huang",
            "Zongze Wu"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Causality -- referring to temporal, uni-directional cause-effect relationships between components -- underlies many complex generative processes, including videos, language, and robot trajectories. Current causal diffusion models entangle temporal reasoning with iterative denoising, applying causal attention across all layers, at every denoising step, and over the entire context. In this paper, we show that the causal reasoning in these models is separable from the multi-step denoising process. Through systematic probing of autoregressive video diffusers, we uncover two key regularities: (1) early layers produce highly similar features across denoising steps, indicating redundant computation along the diffusion trajectory; and (2) deeper layers exhibit sparse cross-frame attention and primarily perform intra-frame rendering. Motivated by these findings, we introduce Separable Causal Diffusion (SCD), a new architecture that explicitly decouples once-per-frame temporal reasoning, via a causal transformer encoder, from multi-step frame-wise rendering, via a lightweight diffusion decoder. Extensive experiments on both pretraining and post-training tasks across synthetic and real benchmarks show that SCD significantly improves throughput and per-frame latency while matching or surpassing the generation quality of strong causal diffusion baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]