[
    {
        "order": 1,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06093",
        "abs_url": "https://arxiv.org/abs/2602.06093",
        "pdf_url": "https://arxiv.org/pdf/2602.06093",
        "title": "NanoNet: Parameter-Efficient Learning with Label-Scarce Supervision for Lightweight Text Mining Model",
        "authors": [
            "Qianren Mao",
            "Yashuo Luo",
            "Ziqi Qin",
            "Junnan Liu",
            "Weifeng Jiang",
            "Zhijun Chen",
            "Zhuoran Li",
            "Likang Xiao",
            "Chuou Xu",
            "Qili Zhang",
            "Hanwen Hao",
            "Jingzheng Li",
            "Chunghua Lin",
            "Jianxin Li",
            "Philip S. Yu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "The lightweight semi-supervised learning (LSL) strategy provides an effective approach of conserving labeled samples and minimizing model inference costs. Prior research has effectively applied knowledge transfer learning and co-training regularization from large to small models in LSL. However, such training strategies are computationally intensive and prone to local optima, thereby increasing the difficulty of finding the optimal solution. This has prompted us to investigate the feasibility of integrating three low-cost scenarios for text mining tasks: limited labeled supervision, lightweight fine-tuning, and rapid-inference small models. We propose NanoNet, a novel framework for lightweight text mining that implements parameter-efficient learning with limited supervision. It employs online knowledge distillation to generate multiple small models and enhances their performance through mutual learning regularization. The entire process leverages parameter-efficient learning, reducing training costs and minimizing supervision requirements, ultimately yielding a lightweight model for downstream inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06097",
        "abs_url": "https://arxiv.org/abs/2602.06097",
        "pdf_url": "https://arxiv.org/pdf/2602.06097",
        "title": "Agentic Workflow Using RBA$_θ$ for Event Prediction",
        "authors": [
            "Purbak Sengupta",
            "Sambeet Mishra",
            "Sonal Shreya"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Wind power ramp events are difficult to forecast due to strong variability, multi-scale dynamics, and site-specific meteorological effects. This paper proposes an event-first, frequency-aware forecasting paradigm that directly predicts ramp events and reconstructs the power trajectory thereafter, rather than inferring events from dense forecasts. The framework is built on an enhanced Ramping Behaviour Analysis (RBA$_\\theta$) method's event representation and progressively integrates statistical, machine-learning, and deep-learning models. Traditional forecasting models with post-hoc event extraction provides a strong interpretable baseline but exhibits limited generalisation across sites. Direct event prediction using Random Forests improves robustness over survival-based formulations, motivating fully event-aware modelling. To capture the multi-scale nature of wind ramps, we introduce an event-first deep architecture that integrates wavelet-based frequency decomposition, temporal excitation features, and adaptive feature selection. The resulting sequence models enable stable long-horizon event prediction, physically consistent trajectory reconstruction, and zero-shot transfer to previously unseen wind farms. Empirical analysis shows that ramp magnitude and duration are governed by distinct mid-frequency bands, allowing accurate signal reconstruction from sparse event forecasts. An agentic forecasting layer is proposed, in which specialised workflows are selected dynamically based on operational context. Together, the framework demonstrates that event-first, frequency-aware forecasting provides a transferable and operationally aligned alternative to trajectory-first wind-power prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06103",
        "abs_url": "https://arxiv.org/abs/2602.06103",
        "pdf_url": "https://arxiv.org/pdf/2602.06103",
        "title": "Toward Faithful and Complete Answer Construction from a Single Document",
        "authors": [
            "Zhaoyang Chen",
            "Cody Fleming"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Modern large language models (LLMs) are powerful generators driven by statistical next-token prediction. While effective at producing fluent text, this design biases models toward high-probability continuations rather than exhaustive and faithful answers grounded in source content. As a result, directly applying LLMs lacks systematic mechanisms to ensure both completeness (avoiding omissions) and faithfulness (avoiding unsupported content), which fundamentally conflicts with core AI safety principles. To address this limitation, we present EVE, a structured framework for document-grounded reasoning. Unlike free-form prompting, EVE constrains generation to a structured, verifiable pipeline that decomposes high-rigor reasoning into extraction, validation, and enumeration. Empirically, this design enables consistent and simultaneous improvements in recall, precision, and F1-score: recall and precision increase by up to 24\\% and 29\\%, respectively, with a corresponding 31\\% gain in F1-score. This effectively breaks the long-standing trade-off between coverage and accuracy typical of single-pass LLM generation, while also mitigating generation truncation caused by length limitations. At the same time, we emphasize that EVE exhibits performance saturation due to the inherent ambiguity of natural language, reflecting fundamental limits of language-based reasoning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06104",
        "abs_url": "https://arxiv.org/abs/2602.06104",
        "pdf_url": "https://arxiv.org/pdf/2602.06104",
        "title": "Pragmatic Curiosity: A Hybrid Learning-Optimization Paradigm via Active Inference",
        "authors": [
            "Yingke Li",
            "Anjali Parashar",
            "Enlu Zhou",
            "Chuchu Fan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Many engineering and scientific workflows depend on expensive black-box evaluations, requiring decision-making that simultaneously improves performance and reduces uncertainty. Bayesian optimization (BO) and Bayesian experimental design (BED) offer powerful yet largely separate treatments of goal-seeking and information-seeking, providing limited guidance for hybrid settings where learning and optimization are intrinsically coupled. We propose \"pragmatic curiosity,\" a hybrid learning-optimization paradigm derived from active inference, in which actions are selected by minimizing the expected free energy--a single objective that couples pragmatic utility with epistemic information gain. We demonstrate the practical effectiveness and flexibility of pragmatic curiosity on various real-world hybrid tasks, including constrained system identification, targeted active search, and composite optimization with unknown preferences. Across these benchmarks, pragmatic curiosity consistently outperforms strong BO-type and BED-type baselines, delivering higher estimation accuracy, better critical-region coverage, and improved final solution quality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06110",
        "abs_url": "https://arxiv.org/abs/2602.06110",
        "pdf_url": "https://arxiv.org/pdf/2602.06110",
        "title": "Private and interpretable clinical prediction with quantum-inspired tensor train models",
        "authors": [
            "José Ramón Pareja Monturiol",
            "Juliette Sinnott",
            "Roger G. Melko",
            "Mohammad Kohandel"
        ],
        "comments": "21 pages, 5 figures, 9 tables. The code for the experiments is publicly available at this https URL",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR); Quantum Physics (quant-ph)",
        "abstract": "Machine learning in clinical settings must balance predictive accuracy, interpretability, and privacy. Models such as logistic regression (LR) offer transparency, while neural networks (NNs) provide greater predictive power; yet both remain vulnerable to privacy attacks. We empirically assess these risks by designing attacks that identify which public datasets were used to train a model under varying levels of adversarial access, applying them to LORIS, a publicly available LR model for immunotherapy response prediction, as well as to additional shallow NN models trained for the same task. Our results show that both models leak significant training-set information, with LRs proving particularly vulnerable in white-box scenarios. Moreover, we observe that common practices such as cross-validation in LRs exacerbate these risks. To mitigate these vulnerabilities, we propose a quantum-inspired defense based on tensorizing discretized models into tensor trains (TTs), which fully obfuscates parameters while preserving accuracy, reducing white-box attacks to random guessing and degrading black-box attacks comparably to Differential Privacy. TT models retain LR interpretability and extend it through efficient computation of marginal and conditional distributions, while also enabling this higher level of interpretability for NNs. Our results demonstrate that tensorization is widely applicable and establishes a practical foundation for private, interpretable, and effective clinical prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06127",
        "abs_url": "https://arxiv.org/abs/2602.06127",
        "pdf_url": "https://arxiv.org/pdf/2602.06127",
        "title": "Compressing LLMs with MoP: Mixture of Pruners",
        "authors": [
            "Bruno Lopes Yamamoto",
            "Lucas Lauton de Alcantara",
            "Victor Zacarias",
            "Leandro Giusti Mugnaini",
            "Keith Ando Ogawa",
            "Lucas Pellicer",
            "Rosimeire Pereira Costa",
            "Edson Bollis",
            "Anna Helena Reali Costa",
            "Artur Jordao"
        ],
        "comments": "Code and models are available at: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The high computational demands of Large Language Models (LLMs) motivate methods that reduce parameter count and accelerate inference. In response, model pruning emerges as an effective strategy, yet current methods typically focus on a single dimension-depth or width. We introduce MoP (Mixture of Pruners), an iterative framework that unifies these dimensions. At each iteration, MoP generates two branches-pruning in depth versus pruning in width-and selects a candidate to advance the path. On LLaMA-2 and LLaMA-3, MoP advances the frontier of structured pruning, exceeding the accuracy of competing methods across a broad set of compression regimes. It also consistently outperforms depth-only and width-only pruning. Furthermore, MoP translates structural pruning into real speedup, reducing end-to-end latency by 39% at 40% compression. Finally, extending MoP to the vision-language model LLaVA-1.5, we notably improve computational efficiency and demonstrate that text-only recovery fine-tuning can restore performance even on visual tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06130",
        "abs_url": "https://arxiv.org/abs/2602.06130",
        "pdf_url": "https://arxiv.org/pdf/2602.06130",
        "title": "Self-Improving World Modelling with Latent Actions",
        "authors": [
            "Yifu Qiu",
            "Zheng Zhao",
            "Waylon Li",
            "Yftah Ziser",
            "Anna Korhonen",
            "Shay B. Cohen",
            "Edoardo M. Ponti"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Internal modelling of the world -- predicting transitions between previous states $X$ and next states $Y$ under actions $Z$ -- is essential to reasoning and planning for LLMs and VLMs. Learning such models typically requires costly action-labelled trajectories. We propose SWIRL, a self-improvement framework that learns from state-only sequences by treating actions as a latent variable and alternating between Forward World Modelling (FWM) $P_\\theta(Y|X,Z)$ and an Inverse Dynamics Modelling (IDM) $Q_\\phi(Z|X,Y)$. SWIRL iterates two phases: (1) Variational Information Maximisation, which updates the FWM to generate next states that maximise conditional mutual information with latent actions given prior states, encouraging identifiable consistency; and (2) ELBO Maximisation, which updates the IDM to explain observed transitions, effectively performing coordinate ascent. Both models are trained with reinforcement learning (specifically, GRPO) with the opposite frozen model's log-probability as a reward signal. We provide theoretical learnability guarantees for both updates, and evaluate SWIRL on LLMs and VLMs across multiple environments: single-turn and multi-turn open-world visual dynamics and synthetic textual environments for physics, web, and tool calling. SWIRL achieves gains of 16% on AURORABench, 28% on ByteMorph, 16% on WorldPredictionBench, and 14% on StableToolBench.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06138",
        "abs_url": "https://arxiv.org/abs/2602.06138",
        "pdf_url": "https://arxiv.org/pdf/2602.06138",
        "title": "Flow Matching for Offline Reinforcement Learning with Discrete Actions",
        "authors": [
            "Fairoz Nower Khan",
            "Nabuat Zaman Nahim",
            "Ruiquan Huang",
            "Haibo Yang",
            "Peizhong Ju"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Generative policies based on diffusion models and flow matching have shown strong promise for offline reinforcement learning (RL), but their applicability remains largely confined to continuous action spaces. To address a broader range of offline RL settings, we extend flow matching to a general framework that supports discrete action spaces with multiple objectives. Specifically, we replace continuous flows with continuous-time Markov chains, trained using a Q-weighted flow matching objective. We then extend our design to multi-agent settings, mitigating the exponential growth of joint action spaces via a factorized conditional path. We theoretically show that, under idealized conditions, optimizing this objective recovers the optimal policy. Extensive experiments further demonstrate that our method performs robustly in practical scenarios, including high-dimensional control, multi-modal decision-making, and dynamically changing preferences over multiple objectives. Our discrete framework can also be applied to continuous-control problems through action quantization, providing a flexible trade-off between representational complexity and performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06146",
        "abs_url": "https://arxiv.org/abs/2602.06146",
        "pdf_url": "https://arxiv.org/pdf/2602.06146",
        "title": "Optimistic Training and Convergence of Q-Learning -- Extended Version",
        "authors": [
            "Prashant Mehta",
            "Sean Meyn"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "In recent work it is shown that Q-learning with linear function approximation is stable, in the sense of bounded parameter estimates, under the $(\\varepsilon,\\kappa)$-tamed Gibbs policy; $\\kappa$ is inverse temperature, and $\\varepsilon>0$ is introduced for additional exploration. Under these assumptions it also follows that there is a solution to the projected Bellman equation (PBE). Left open is uniqueness of the solution, and criteria for convergence outside of the standard tabular or linear MDP settings. The present work extends these results to other variants of Q-learning, and clarifies prior work: a one dimensional example shows that under an oblivious policy for training there may be no solution to the PBE, or multiple solutions, and in each case the algorithm is not stable under oblivious training. The main contribution is that far more structure is required for convergence. An example is presented for which the basis is ideal, in the sense that the true Q-function is in the span of the basis. However, there are two solutions to the PBE under the greedy policy, and hence also for the $(\\varepsilon,\\kappa)$-tamed Gibbs policy for all sufficiently small $\\varepsilon>0$ and $\\kappa\\ge 1$.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06154",
        "abs_url": "https://arxiv.org/abs/2602.06154",
        "pdf_url": "https://arxiv.org/pdf/2602.06154",
        "title": "MoSE: Mixture of Slimmable Experts for Efficient and Adaptive Language Models",
        "authors": [
            "Nurbek Tastan",
            "Stefanos Laskaridis",
            "Karthik Nandakumar",
            "Samuel Horvath"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Mixture-of-Experts (MoE) models scale large language models efficiently by sparsely activating experts, but once an expert is selected, it is executed fully. Hence, the trade-off between accuracy and computation in an MoE model typically exhibits large discontinuities. We propose Mixture of Slimmable Experts (MoSE), an MoE architecture in which each expert has a nested, slimmable structure that can be executed at variable widths. This enables conditional computation not only over which experts are activated, but also over how much of each expert is utilized. Consequently, a single pretrained MoSE model can support a more continuous spectrum of accuracy-compute trade-offs at inference time. We present a simple and stable training recipe for slimmable experts under sparse routing, combining multi-width training with standard MoE objectives. During inference, we explore strategies for runtime width determination, including a lightweight test-time training mechanism that learns how to map router confidence/probabilities to expert widths under a fixed budget. Experiments on GPT models trained on OpenWebText demonstrate that MoSE matches or improves upon standard MoE at full width and consistently shifts the Pareto frontier for accuracy vs. cost, achieving comparable performance with significantly fewer FLOPs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06155",
        "abs_url": "https://arxiv.org/abs/2602.06155",
        "pdf_url": "https://arxiv.org/pdf/2602.06155",
        "title": "Latent Structure Emergence in Diffusion Models via Confidence-Based Filtering",
        "authors": [
            "Wei Wei",
            "Yizhou Zeng",
            "Kuntian Chen",
            "Sophie Langer",
            "Mariia Seleznova",
            "Hung-Hsu Chou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Diffusion models rely on a high-dimensional latent space of initial noise seeds, yet it remains unclear whether this space contains sufficient structure to predict properties of the generated samples, such as their classes. In this work, we investigate the emergence of latent structure through the lens of confidence scores assigned by a pre-trained classifier to generated samples. We show that while the latent space appears largely unstructured when considering all noise realizations, restricting attention to initial noise seeds that produce high-confidence samples reveals pronounced class separability. By comparing class predictability across noise subsets of varying confidence and examining the class separability of the latent space, we find evidence of class-relevant latent structure that becomes observable only under confidence-based filtering. As a practical implication, we discuss how confidence-based filtering enables conditional generation as an alternative to guidance-based methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06157",
        "abs_url": "https://arxiv.org/abs/2602.06157",
        "pdf_url": "https://arxiv.org/pdf/2602.06157",
        "title": "SCONE: A Practical, Constraint-Aware Plug-in for Latent Encoding in Learned DNA Storage",
        "authors": [
            "Cihan Ruan",
            "Lebin Zhou",
            "Rongduo Han",
            "Linyi Han",
            "Bingqing Zhao",
            "Chenchen Zhu",
            "Wei Jiang",
            "Wei Wang",
            "Nam Ling"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "DNA storage has matured from concept to practical stage, yet its integration with neural compression pipelines remains inefficient. Early DNA encoders applied redundancy-heavy constraint layers atop raw binary data - workable but primitive. Recent neural codecs compress data into learned latent representations with rich statistical structure, yet still convert these latents to DNA via naive binary-to-quaternary transcoding, discarding the entropy model's optimization. This mismatch undermines compression efficiency and complicates the encoding stack. A plug-in module that collapses latent compression and DNA encoding into a single step. SCONE performs quaternary arithmetic coding directly on the latent space in DNA bases. Its Constraint-Aware Adaptive Coding module dynamically steers the entropy encoder's learned probability distribution to enforce biochemical constraints - Guanine-Cytosine (GC) balance and homopolymer suppression - deterministically during encoding, eliminating post-hoc correction. The design preserves full reversibility and exploits the hyperprior model's learned priors without modification. Experiments show SCONE achieves near-perfect constraint satisfaction with negligible computational overhead (<2% latency), establishing a latent-agnostic interface for end-to-end DNA-compatible learned codecs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06183",
        "abs_url": "https://arxiv.org/abs/2602.06183",
        "pdf_url": "https://arxiv.org/pdf/2602.06183",
        "title": "To 2:4 Sparsity and Beyond: Neuron-level Activation Function to Accelerate LLM Pre-Training",
        "authors": [
            "Meghana Madhyastha",
            "Daniel Haziza",
            "Jesse Cai",
            "Newsha Ardalani",
            "Zhiqi Bu",
            "Carole-Jean Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Trainings of Large Language Models are generally bottlenecked by matrix multiplications. In the Transformer architecture, a large portion of these operations happens in the Feed Forward Network (FFN), and this portion increases for larger models, up to 50% of the total pretraining floating point operations. We show that we can leverage hardware-accelerated sparsity to accelerate all matrix multiplications in the FFN, with 2:4 sparsity for weights and v:n:m (Venom) sparsity for activations. Our recipe relies on sparse training steps to accelerate a large part of the pretraining, associated with regular dense training steps towards the end. Overall, models trained with this approach exhibit the same performance on our quality benchmarks, and can speed up training end-to-end by 1.4 to 1.7x. This approach is applicable to all NVIDIA GPUs starting with the A100 generation, and is orthogonal to common optimization techniques, such as, quantization, and can also be applied to mixture-of-experts model architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06187",
        "abs_url": "https://arxiv.org/abs/2602.06187",
        "pdf_url": "https://arxiv.org/pdf/2602.06187",
        "title": "$f$-FUM: Federated Unlearning via min--max and $f$-divergence",
        "authors": [
            "Radmehr Karimian",
            "Amirhossein Bagheri",
            "Meghdad Kurmanji",
            "Nicholas D. Lane",
            "Gholamali Aminian"
        ],
        "comments": "16 pages, 1 figure",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated Learning (FL) has emerged as a powerful paradigm for collaborative machine learning across decentralized data sources, preserving privacy by keeping data local. However, increasing legal and ethical demands, such as the \"right to be forgotten\", and the need to mitigate data poisoning attacks have underscored the urgent necessity for principled data unlearning in FL. Unlike centralized settings, the distributed nature of FL complicates the removal of individual data contributions. In this paper, we propose a novel federated unlearning framework formulated as a min-max optimization problem, where the objective is to maximize an $f$-divergence between the model trained with all data and the model retrained without specific data points, while minimizing the degradation on retained data. Our framework could act like a plugin and be added to almost any federated setup, unlike SOTA methods like (\\cite{10269017} which requires model degradation in server, or \\cite{khalil2025notfederatedunlearningweight} which requires to involve model architecture and model weights). This formulation allows for efficient approximation of data removal effects in a federated setting. We provide empirical evaluations to show that our method achieves significant speedups over naive retraining, with minimal impact on utility.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06204",
        "abs_url": "https://arxiv.org/abs/2602.06204",
        "pdf_url": "https://arxiv.org/pdf/2602.06204",
        "title": "Learning Rate Scaling across LoRA Ranks and Transfer to Full Finetuning",
        "authors": [
            "Nan Chen",
            "Soledad Villar",
            "Soufiane Hayou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Low-Rank Adaptation (LoRA) is a standard tool for parameter-efficient finetuning of large models. While it induces a small memory footprint, its training dynamics can be surprisingly complex as they depend on several hyperparameters such as initialization, adapter rank, and learning rate. In particular, it is unclear how the optimal learning rate scales with adapter rank, which forces practitioners to re-tune the learning rate whenever the rank is changed. In this paper, we introduce Maximal-Update Adaptation ($\\mu$A), a theoretical framework that characterizes how the \"optimal\" learning rate should scale with model width and adapter rank to produce stable, non-vanishing feature updates under standard configurations. $\\mu$A is inspired from the Maximal-Update Parametrization ($\\mu$P) in pretraining. Our analysis leverages techniques from hyperparameter transfer and reveals that the optimal learning rate exhibits different scaling patterns depending on initialization and LoRA scaling factor. Specifically, we identify two regimes: one where the optimal learning rate remains roughly invariant across ranks, and another where it scales inversely with rank. We further identify a configuration that allows learning rate transfer from LoRA to full finetuning, drastically reducing the cost of learning rate tuning for full finetuning. Experiments across language, vision, vision--language, image generation, and reinforcement learning tasks validate our scaling rules and show that learning rates tuned on LoRA transfer reliably to full finetuning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06208",
        "abs_url": "https://arxiv.org/abs/2602.06208",
        "pdf_url": "https://arxiv.org/pdf/2602.06208",
        "title": "Emergent Low-Rank Training Dynamics in MLPs with Smooth Activations",
        "authors": [
            "Alec S. Xu",
            "Can Yaras",
            "Matthew Asato",
            "Qing Qu",
            "Laura Balzano"
        ],
        "comments": "41 pages, 15 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Recent empirical evidence has demonstrated that the training dynamics of large-scale deep neural networks occur within low-dimensional subspaces. While this has inspired new research into low-rank training, compression, and adaptation, theoretical justification for these dynamics in nonlinear networks remains limited. %compared to deep linear settings. To address this gap, this paper analyzes the learning dynamics of multi-layer perceptrons (MLPs) under gradient descent (GD). We demonstrate that the weight dynamics concentrate within invariant low-dimensional subspaces throughout training. Theoretically, we precisely characterize these invariant subspaces for two-layer networks with smooth nonlinear activations, providing insight into their emergence. Experimentally, we validate that this phenomenon extends beyond our theoretical assumptions. Leveraging these insights, we empirically show there exists a low-rank MLP parameterization that, when initialized within the appropriate subspaces, matches the classification performance of fully-parameterized counterparts on a variety of classification tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06232",
        "abs_url": "https://arxiv.org/abs/2602.06232",
        "pdf_url": "https://arxiv.org/pdf/2602.06232",
        "title": "RuleSmith: Multi-Agent LLMs for Automated Game Balancing",
        "authors": [
            "Ziyao Zeng",
            "Chen Liu",
            "Tianyu Liu",
            "Hao Wang",
            "Xiatao Sun",
            "Fengyu Yang",
            "Xiaofeng Liu",
            "Zhiwen Fan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computer Science and Game Theory (cs.GT); Multiagent Systems (cs.MA)",
        "abstract": "Game balancing is a longstanding challenge requiring repeated playtesting, expert intuition, and extensive manual tuning. We introduce RuleSmith, the first framework that achieves automated game balancing by leveraging the reasoning capabilities of multi-agent LLMs. It couples a game engine, multi-agent LLMs self-play, and Bayesian optimization operating over a multi-dimensional rule space. As a proof of concept, we instantiate RuleSmith on CivMini, a simplified civilization-style game containing heterogeneous factions, economy systems, production rules, and combat mechanics, all governed by tunable parameters. LLM agents interpret textual rulebooks and game states to generate actions, to conduct fast evaluation of balance metrics such as win-rate disparities. To search the parameter landscape efficiently, we integrate Bayesian optimization with acquisition-based adaptive sampling and discrete projection: promising candidates receive more evaluation games for accurate assessment, while exploratory candidates receive fewer games for efficient exploration. Experiments show that RuleSmith converges to highly balanced configurations and provides interpretable rule adjustments that can be directly applied to downstream game systems. Our results illustrate that LLM simulation can serve as a powerful surrogate for automating design and balancing in complex multi-agent environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06239",
        "abs_url": "https://arxiv.org/abs/2602.06239",
        "pdf_url": "https://arxiv.org/pdf/2602.06239",
        "title": "Provably avoiding over-optimization in Direct Preference Optimization without knowing the data distribution",
        "authors": [
            "Adam Barla",
            "Emanuele Nevali",
            "Luca Viano",
            "Volkan Cevher"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce PEPO (Pessimistic Ensemble based Preference Optimization), a single-step Direct Preference Optimization (DPO)-like algorithm to mitigate the well-known over-optimization issue in preference learning without requiring the knowledge of the data-generating distribution or learning an explicit reward model. PEPO achieves pessimism via an ensemble of preference-optimized policies trained on disjoint data subsets and then aggregates them through a worst case construction that favors the agreement across models. In the tabular setting, PEPO achieves sample complexity guarantees depending only on a single-policy concentrability coefficient, thus avoiding the all-policy concentrability which affects the guarantees of algorithms prone to over-optimization, such as DPO. The theoretical findings are corroborated by a convincing practical performance, while retaining the simplicity and the practicality of DPO-style training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06241",
        "abs_url": "https://arxiv.org/abs/2602.06241",
        "pdf_url": "https://arxiv.org/pdf/2602.06241",
        "title": "A Fast and Generalizable Fourier Neural Operator-Based Surrogate for Melt-Pool Prediction in Laser Processing",
        "authors": [
            "Alix Benoit",
            "Toni Ivas",
            "Mateusz Papierz",
            "Asel Sagingalieva",
            "Alexey Melnikov",
            "Elia Iseli"
        ],
        "comments": "29 pages, 12 figures, 6 tables",
        "subjects": "Machine Learning (cs.LG); Computational Engineering, Finance, and Science (cs.CE)",
        "abstract": "High-fidelity simulations of laser welding capture complex thermo-fluid phenomena, including phase change, free-surface deformation, and keyhole dynamics, however their computational cost limits large-scale process exploration and real-time use. In this work we present the Laser Processing Fourier Neural Operator (LP-FNO), a Fourier Neural Operator (FNO) based surrogate model that learns the parametric solution operator of various laser processes from multiphysics simulations generated with FLOW-3D WELD (registered trademark). Through a novel approach of reformulating the transient problem in the moving laser frame and applying temporal averaging, the system results in a quasi-steady state setting suitable for operator learning, even in the keyhole welding regime. The proposed LP-FNO maps process parameters to three-dimensional temperature fields and melt-pool boundaries across a broad process window spanning conduction and keyhole regimes using the non-dimensional normalized enthalpy formulation. The model achieves temperature prediction errors on the order of 1% and intersection-over-union scores for melt-pool segmentation over 0.9. We demonstrate that a LP-FNO model trained on coarse-resolution data can be evaluated on finer grids, yielding accurate super-resolved predictions in mesh-converged conduction regimes, whereas discrepancies in keyhole regimes reflect unresolved dynamics in the coarse-mesh training data. These results indicate that the LP-FNO provides an efficient surrogate modeling framework for laser welding, enabling prediction of full three-dimensional fields and phase interfaces over wide parameter ranges in just tens of milliseconds, up to a hundred thousand times faster than traditional Finite Volume multi-physics software.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06246",
        "abs_url": "https://arxiv.org/abs/2602.06246",
        "pdf_url": "https://arxiv.org/pdf/2602.06246",
        "title": "Adaptive Sparse Möbius Transforms for Learning Polynomials",
        "authors": [
            "Yigit Efe Erginbas",
            "Justin Singh Kang",
            "Elizabeth Polito",
            "Kannan Ramchandran"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We consider the problem of exactly learning an $s$-sparse real-valued Boolean polynomial of degree $d$ of the form $f:\\{ 0,1\\}^n \\rightarrow \\mathbb{R}$. This problem corresponds to decomposing functions in the AND basis and is known as taking a Möbius transform. While the analogous problem for the parity basis (Fourier transform) $f: \\{-1,1 \\}^n \\rightarrow \\mathbb{R}$ is well-understood, the AND basis presents a unique challenge: the basis vectors are coherent, precluding standard compressed sensing methods. We overcome this challenge by identifying that we can exploit adaptive group testing to provide a constructive, query-efficient implementation of the Möbius transform (also known as Möbius inversion) for sparse functions. We present two algorithms based on this insight. The Fully-Adaptive Sparse Möbius Transform (FASMT) uses $O(sd \\log(n/d))$ adaptive queries in $O((sd + n) sd \\log(n/d))$ time, which we show is near-optimal in query complexity. Furthermore, we also present the Partially-Adaptive Sparse Möbius Transform (PASMT), which uses $O(sd^2\\log(n/d))$ queries, trading a factor of $d$ to reduce the number of adaptive rounds to $O(d^2\\log(n/d))$, with no dependence on $s$. When applied to hypergraph reconstruction from edge-count queries, our results improve upon baselines by avoiding the combinatorial explosion in the rank $d$. We demonstrate the practical utility of our method for hypergraph reconstruction by applying it to learning real hypergraphs in simulations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06256",
        "abs_url": "https://arxiv.org/abs/2602.06256",
        "pdf_url": "https://arxiv.org/pdf/2602.06256",
        "title": "Steering Safely or Off a Cliff? Rethinking Specificity and Robustness in Inference-Time Interventions",
        "authors": [
            "Navita Goyal",
            "Hal Daumé III"
        ],
        "comments": "EACL 2026 Main, Long Paper",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Model steering, which involves intervening on hidden representations at inference time, has emerged as a lightweight alternative to finetuning for precisely controlling large language models. While steering efficacy has been widely studied, evaluations of whether interventions alter only the intended property remain limited, especially with respect to unintended changes in behaviors related to the target property. We call this notion specificity. We propose a framework that distinguishes three dimensions of specificity: general (preserving fluency and unrelated abilities), control (preserving related control properties), and robustness (preserving control properties under distribution shifts). We study two safety-critical use cases: steering models to reduce overrefusal and faithfulness hallucinations, and show that while steering achieves high efficacy and largely maintains general and control specificity, it consistently fails to preserve robustness specificity. In the case of overrefusal steering, for example, all steering methods reduce overrefusal without harming general abilities and refusal on harmful queries; however, they substantially increase vulnerability to jailbreaks. Our work provides the first systematic evaluation of specificity in model steering, showing that standard efficacy and specificity checks are insufficient, because without robustness evaluation, steering methods may appear reliable even when they compromise model safety.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06257",
        "abs_url": "https://arxiv.org/abs/2602.06257",
        "pdf_url": "https://arxiv.org/pdf/2602.06257",
        "title": "On Randomized Algorithms in Online Strategic Classification",
        "authors": [
            "Chase Hutton",
            "Adam Melrod",
            "Han Shao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Science and Game Theory (cs.GT)",
        "abstract": "Online strategic classification studies settings in which agents strategically modify their features to obtain favorable predictions. For example, given a classifier that determines loan approval based on credit scores, applicants may open or close credit cards and bank accounts to obtain a positive prediction. The learning goal is to achieve low mistake or regret bounds despite such strategic behavior. While randomized algorithms have the potential to offer advantages to the learner in strategic settings, they have been largely underexplored. In the realizable setting, no lower bound is known for randomized algorithms, and existing lower bound constructions for deterministic learners can be circumvented by randomization. In the agnostic setting, the best known regret upper bound is $O(T^{3/4}\\log^{1/4}T|\\mathcal H|)$, which is far from the standard online learning rate of $O(\\sqrt{T\\log|\\mathcal H|})$. In this work, we provide refined bounds for online strategic classification in both settings. In the realizable setting, we extend, for $T > \\mathrm{Ldim}(\\mathcal{H}) \\Delta^2$, the existing lower bound $\\Omega(\\mathrm{Ldim}(\\mathcal{H}) \\Delta)$ for deterministic learners to all learners. This yields the first lower bound that applies to randomized learners. We also provide the first randomized learner that improves the known (deterministic) upper bound of $O(\\mathrm{Ldim}(\\mathcal H) \\cdot \\Delta \\log \\Delta)$. In the agnostic setting, we give a proper learner using convex optimization techniques to improve the regret upper bound to $O(\\sqrt{T \\log |\\mathcal{H}|} + |\\mathcal{H}| \\log(T|\\mathcal{H}|))$. We show a matching lower bound up to logarithmic factors for all proper learning rules, demonstrating the optimality of our learner among proper learners. As such, improper learning is necessary to further improve regret guarantees.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06264",
        "abs_url": "https://arxiv.org/abs/2602.06264",
        "pdf_url": "https://arxiv.org/pdf/2602.06264",
        "title": "Swap Regret Minimization Through Response-Based Approachability",
        "authors": [
            "Ioannis Anagnostides",
            "Gabriele Farina",
            "Maxwell Fishelson",
            "Haipeng Luo",
            "Jon Schneider"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We consider the problem of minimizing different notions of swap regret in online optimization. These forms of regret are tightly connected to correlated equilibrium concepts in games, and have been more recently shown to guarantee non-manipulability against strategic adversaries. The only computationally efficient algorithm for minimizing linear swap regret over a general convex set in $\\mathbb{R}^d$ was developed recently by Daskalakis, Farina, Fishelson, Pipis, and Schneider (STOC '25). However, it incurs a highly suboptimal regret bound of $\\Omega(d^4 \\sqrt{T})$ and also relies on computationally intensive calls to the ellipsoid algorithm at each iteration. In this paper, we develop a significantly simpler, computationally efficient algorithm that guarantees $O(d^{3/2} \\sqrt{T})$ linear swap regret for a general convex set and $O(d \\sqrt{T})$ when the set is centrally symmetric. Our approach leverages the powerful response-based approachability framework of Bernstein and Shimkin (JMLR '15) -- previously overlooked in the line of work on swap regret minimization -- combined with geometric preconditioning via the John ellipsoid. Our algorithm simultaneously minimizes profile swap regret, which was recently shown to guarantee non-manipulability. Moreover, we establish a matching information-theoretic lower bound: any learner must incur in expectation $\\Omega(d \\sqrt{T})$ linear swap regret for large enough $T$, even when the set is centrally symmetric. This also shows that the classic algorithm of Gordon, Greenwald, and Marks (ICML '08) is existentially optimal for minimizing linear swap regret, although it is computationally inefficient. Finally, we extend our approach to minimize regret with respect to the set of swap deviations with polynomial dimension, unifying and strengthening recent results in equilibrium computation and online learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06269",
        "abs_url": "https://arxiv.org/abs/2602.06269",
        "pdf_url": "https://arxiv.org/pdf/2602.06269",
        "title": "PurSAMERE: Reliable Adversarial Purification via Sharpness-Aware Minimization of Expected Reconstruction Error",
        "authors": [
            "Vinh Hoang",
            "Sebastian Krumscheid",
            "Holger Rauhut",
            "Raúl Tempone"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Probability (math.PR)",
        "abstract": "We propose a novel deterministic purification method to improve adversarial robustness by mapping a potentially adversarial sample toward a nearby sample that lies close to a mode of the data distribution, where classifiers are more reliable. We design the method to be deterministic to ensure reliable test accuracy and to prevent the degradation of effective robustness observed in stochastic purification approaches when the adversary has full knowledge of the system and its randomness. We employ a score model trained by minimizing the expected reconstruction error of noise-corrupted data, thereby learning the structural characteristics of the input data distribution. Given a potentially adversarial input, the method searches within its local neighborhood for a purified sample that minimizes the expected reconstruction error under noise corruption and then feeds this purified sample to the classifier. During purification, sharpness-aware minimization is used to guide the purified samples toward flat regions of the expected reconstruction error landscape, thereby enhancing robustness. We further show that, as the noise level decreases, minimizing the expected reconstruction error biases the purified sample toward local maximizers of the Gaussian-smoothed density; under additional local assumptions on the score model, we prove recovery of a local maximizer in the small-noise limit. Experimental results demonstrate significant gains in adversarial robustness over state-of-the-art methods under strong deterministic white-box attacks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06276",
        "abs_url": "https://arxiv.org/abs/2602.06276",
        "pdf_url": "https://arxiv.org/pdf/2602.06276",
        "title": "Statistical Learning from Attribution Sets",
        "authors": [
            "Lorne Applebaum",
            "Robert Busa-Fekete",
            "August Y. Chen",
            "Claudio Gentile",
            "Tomer Koren",
            "Aryan Mokhtari"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We address the problem of training conversion prediction models in advertising domains under privacy constraints, where direct links between ad clicks and conversions are unavailable. Motivated by privacy-preserving browser APIs and the deprecation of third-party cookies, we study a setting where the learner observes a sequence of clicks and a sequence of conversions, but can only link a conversion to a set of candidate clicks (an attribution set) rather than a unique source. We formalize this as learning from attribution sets generated by an oblivious adversary equipped with a prior distribution over the candidates. Despite the lack of explicit labels, we construct an unbiased estimator of the population loss from these coarse signals via a novel approach. Leveraging this estimator, we show that Empirical Risk Minimization achieves generalization guarantees that scale with the informativeness of the prior and is also robust against estimation errors in the prior, despite complex dependencies among attribution sets. Simple empirical evaluations on standard datasets suggest our unbiased approach significantly outperforms common industry heuristics, particularly in regimes where attribution sets are large or overlapping.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06283",
        "abs_url": "https://arxiv.org/abs/2602.06283",
        "pdf_url": "https://arxiv.org/pdf/2602.06283",
        "title": "SOCKET: SOft Collison Kernel EsTimator for Sparse Attention",
        "authors": [
            "Sahil Joshi",
            "Agniva Chowdhury",
            "Wyatt Bellinger",
            "Amar Kanakamedala",
            "Ekam Singh",
            "Hoang Anh Duy Le",
            "Aditya Desai",
            "Anshumali Shrivastava"
        ],
        "comments": "11 figures, 5 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Exploiting sparsity during long-context inference is central to scaling large language models, as attention dominates the cost of autoregressive decoding. Sparse attention reduces this cost by restricting computation to a subset of tokens, but its effectiveness depends critically on efficient scoring and selection of relevant tokens at inference time. We revisit Locality-Sensitive Hashing (LSH) as a sparsification primitive and introduce SOCKET, a SOft Collision Kernel EsTimator that replaces hard bucket matches with probabilistic, similarity-aware aggregation. Our key insight is that hard LSH produces discrete collision signals and is therefore poorly suited for ranking. In contrast, soft LSH aggregates graded collision evidence across hash tables, preserving the stability of relative ordering among the true top-$k$ tokens. This transformation elevates LSH from a candidate-generation heuristic to a principled and mathematically grounded scoring kernel for sparse attention. Leveraging this property, SOCKET enables efficient token selection without ad-hoc voting mechanism, and matches or surpasses established sparse attention baselines across multiple long-context benchmarks using diverse set of models. With a custom CUDA kernel for scoring keys and a Flash Decode Triton backend for sparse attention, SOCKET achieves up to 1.5$\\times$ higher throughput than FlashAttention, making it an effective tool for long-context inference. Code is open-sourced at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06317",
        "abs_url": "https://arxiv.org/abs/2602.06317",
        "pdf_url": "https://arxiv.org/pdf/2602.06317",
        "title": "The Condensate Theorem: Transformers are O(n), Not $O(n^2)$",
        "authors": [
            "Jorge L. Ruiz Williams"
        ],
        "comments": "13 pages, 4 figures, 8 tables",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "We present the Condensate Theorem: attention sparsity is a learned topological property, not an architectural constraint. Through empirical analysis of trained language models, we find that attention mass concentrates on a distinct topological manifold -- and this manifold can be identified dynamically without checking every position. We prove a general result: for any query, projecting attention onto the Condensate Manifold (Anchor + Window + Dynamic Top-k) achieves 100% output equivalence with full $O(n^2)$ attention. This is not an approximation -- it is lossless parity. We validate this across GPT-2, Pythia, Qwen2, TinyLlama, and Mistral, demonstrating bit-exact token matching on 1,500+ generated tokens. By mapping this topology to hardware, our Topological Attention kernel achieves a 159x measured speedup at 131K tokens (3.94ms vs 628ms) and a projected >1,200x speedup at 1M tokens, reducing inference costs by >99.9% compared to Flash Attention. We conclude that the quadratic bottleneck is an artifact of naive implementation, not intelligence.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06323",
        "abs_url": "https://arxiv.org/abs/2602.06323",
        "pdf_url": "https://arxiv.org/pdf/2602.06323",
        "title": "How (Not) to Hybridize Neural and Mechanistic Models for Epidemiological Forecasting",
        "authors": [
            "Yiqi Su",
            "Ray Lee",
            "Jiaming Cui",
            "Naren Ramakrishnan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Epidemiological forecasting from surveillance data is a hard problem and hybridizing mechanistic compartmental models with neural models is a natural direction. The mechanistic structure helps keep trajectories epidemiologically plausible, while neural components can capture non-stationary, data-adaptive effects. In practice, however, many seemingly straightforward couplings fail under partial observability and continually shifting transmission dynamics driven by behavior, waning immunity, seasonality, and interventions. We catalog these failure modes and show that robust performance requires making non-stationarity explicit: we extract multi-scale structure from the observed infection series and use it as an interpretable control signal for a controlled neural ODE coupled to an epidemiological model. Concretely, we decompose infections into trend, seasonal, and residual components and use these signals to drive continuous-time latent dynamics while jointly forecasting and inferring time-varying transmission, recovery, and immunity-loss rates. Across seasonal and non-seasonal settings, including early outbreaks and multi-wave regimes, our approach reduces long-horizon RMSE by 15-35%, improves peak timing error by 1-3 weeks, and lowers peak magnitude bias by up to 30% relative to strong time-series, neural ODE, and hybrid baselines, without relying on auxiliary covariates.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06326",
        "abs_url": "https://arxiv.org/abs/2602.06326",
        "pdf_url": "https://arxiv.org/pdf/2602.06326",
        "title": "Online Adaptive Reinforcement Learning with Echo State Networks for Non-Stationary Dynamics",
        "authors": [
            "Aoi Yoshimura",
            "Gouhei Tanaka"
        ],
        "comments": "Submitted to IJCNN 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reinforcement learning (RL) policies trained in simulation often suffer from severe performance degradation when deployed in real-world environments due to non-stationary dynamics. While Domain Randomization (DR) and meta-RL have been proposed to address this issue, they typically rely on extensive pretraining, privileged information, or high computational cost, limiting their applicability to real-time and edge systems. In this paper, we propose a lightweight online adaptation framework for RL based on Reservoir Computing. Specifically, we integrate an Echo State Networks (ESNs) as an adaptation module that encodes recent observation histories into a latent context representation, and update its readout weights online using Recursive Least Squares (RLS). This design enables rapid adaptation without backpropagation, pretraining, or access to privileged information. We evaluate the proposed method on CartPole and HalfCheetah tasks with severe and abrupt environment changes, including periodic external disturbances and extreme friction variations. Experimental results demonstrate that the proposed approach significantly outperforms DR and representative adaptive baselines under out-of-distribution dynamics, achieving stable adaptation within a few control steps. Notably, the method successfully handles intra-episode environment changes without resetting the policy. Due to its computational efficiency and stability, the proposed framework provides a practical solution for online adaptation in non-stationary environments and is well suited for real-world robotic control and edge deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06331",
        "abs_url": "https://arxiv.org/abs/2602.06331",
        "pdf_url": "https://arxiv.org/pdf/2602.06331",
        "title": "Don't Break the Boundary: Continual Unlearning for OOD Detection Based on Free Energy Repulsion",
        "authors": [
            "Ningkang Peng",
            "Kun Shao",
            "Jingyang Mao",
            "Linjing Qian",
            "Xiaoqian Peng",
            "Xichen Yang",
            "Yanhui Gu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deploying trustworthy AI in open-world environments faces a dual challenge: the necessity for robust Out-of-Distribution (OOD) detection to ensure system safety, and the demand for flexible machine unlearning to satisfy privacy compliance and model rectification. However, this objective encounters a fundamental geometric contradiction: current OOD detectors rely on a static and compact data manifold, whereas traditional classification-oriented unlearning methods disrupt this delicate structure, leading to a catastrophic loss of the model's capability to discriminate anomalies while erasing target classes. To resolve this dilemma, we first define the problem of boundary-preserving class unlearning and propose a pivotal conceptual shift: in the context of OOD detection, effective unlearning is mathematically equivalent to transforming the target class into OOD samples. Based on this, we propose the TFER (Total Free Energy Repulsion) framework. Inspired by the free energy principle, TFER constructs a novel Push-Pull game mechanism: it anchors retained classes within a low-energy ID manifold through a pull mechanism, while actively expelling forgotten classes to high-energy OOD regions using a free energy repulsion force. This approach is implemented via parameter-efficient fine-tuning, circumventing the prohibitive cost of full retraining. Extensive experiments demonstrate that TFER achieves precise unlearning while maximally preserving the model's discriminative performance on remaining classes and external OOD data. More importantly, our study reveals that the unique Push-Pull equilibrium of TFER endows the model with inherent structural stability, allowing it to effectively resist catastrophic forgetting without complex additional constraints, thereby demonstrating exceptional potential in continual unlearning tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06348",
        "abs_url": "https://arxiv.org/abs/2602.06348",
        "pdf_url": "https://arxiv.org/pdf/2602.06348",
        "title": "Adversarial Learning in Games with Bandit Feedback: Logarithmic Pure-Strategy Maximin Regret",
        "authors": [
            "Shinji Ito",
            "Haipeng Luo",
            "Arnab Maiti",
            "Taira Tsuchiya",
            "Yue Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Science and Game Theory (cs.GT)",
        "abstract": "Learning to play zero-sum games is a fundamental problem in game theory and machine learning. While significant progress has been made in minimizing external regret in the self-play settings or with full-information feedback, real-world applications often force learners to play against unknown, arbitrary opponents and restrict learners to bandit feedback where only the payoff of the realized action is observable. In such challenging settings, it is well-known that $\\Omega(\\sqrt{T})$ external regret is unavoidable (where T is the number of rounds). To overcome this barrier, we investigate adversarial learning in zero-sum games under bandit feedback, aiming to minimize the deficit against the maximin pure strategy -- a metric we term Pure-Strategy Maximin Regret. We analyze this problem under two bandit feedback models: uninformed (only the realized reward is revealed) and informed (both the reward and the opponent's action are revealed). For uninformed bandit learning of normal-form games, we show that the Tsallis-INF algorithm achieves $O(c \\log T)$ instance-dependent regret with a game-dependent parameter $c$. Crucially, we prove an information-theoretic lower bound showing that the dependence on c is necessary. To overcome this hardness, we turn to the informed setting and introduce Maximin-UCB, which obtains another regret bound of the form $O(c' \\log T)$ for a different game-dependent parameter $c'$ that could potentially be much smaller than $c$. Finally, we generalize both results to bilinear games over an arbitrary, large action set, proposing Tsallis-FTRL-SPM and Maximin-LinUCB for the uninformed and informed setting respectively and establishing similar game-dependent logarithmic regret bounds.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06353",
        "abs_url": "https://arxiv.org/abs/2602.06353",
        "pdf_url": "https://arxiv.org/pdf/2602.06353",
        "title": "Enhance and Reuse: A Dual-Mechanism Approach to Boost Deep Forest for Label Distribution Learning",
        "authors": [
            "Jia-Le Xu",
            "Shen-Huan Lyu",
            "Yu-Nian Wang",
            "Ning Chen",
            "Zhihao Qu",
            "Bin Tang",
            "Baoliu Ye"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Label distribution learning (LDL) requires the learner to predict the degree of correlation between each sample and each label. To achieve this, a crucial task during learning is to leverage the correlation among labels. Deep Forest (DF) is a deep learning framework based on tree ensembles, whose training phase does not rely on backpropagation. DF performs in-model feature transform using the prediction of each layer and achieves competitive performance on many tasks. However, its exploration in the field of LDL is still in its infancy. The few existing methods that apply DF to the field of LDL do not have effective ways to utilize the correlation among labels. Therefore, we propose a method named Enhanced and Reused Feature Deep Forest (ERDF). It mainly contains two mechanisms: feature enhancement exploiting label correlation and measure-aware feature reuse. The first one is to utilize the correlation among labels to enhance the original features, enabling the samples to acquire more comprehensive information for the task of LDL. The second one performs a reuse operation on the features of samples that perform worse than the previous layer on the validation set, in order to ensure the stability of the training process. This kind of Enhance-Reuse pattern not only enables samples to enrich their features but also validates the effectiveness of their new features and conducts a reuse process to prevent the noise from spreading further. Experiments show that our method outperforms other comparison algorithms on six evaluation metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06357",
        "abs_url": "https://arxiv.org/abs/2602.06357",
        "pdf_url": "https://arxiv.org/pdf/2602.06357",
        "title": "Evaluating LLM-persona Generated Distributions for Decision-making",
        "authors": [
            "Jackie Baek",
            "Yunhan Chen",
            "Ziyu Chi",
            "Will Ma"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "LLMs can generate a wealth of data, ranging from simulated personas imitating human valuations and preferences, to demand forecasts based on world knowledge. But how well do such LLM-generated distributions support downstream decision-making? For example, when pricing a new product, a firm could prompt an LLM to simulate how much consumers are willing to pay based on a product description, but how useful is the resulting distribution for optimizing the price? We refer to this approach as LLM-SAA, in which an LLM is used to construct an estimated distribution and the decision is then optimized under that distribution. In this paper, we study metrics to evaluate the quality of these LLM-generated distributions, based on the decisions they induce. Taking three canonical decision-making problems (assortment optimization, pricing, and newsvendor) as examples, we find that LLM-generated distributions are practically useful, especially in low-data regimes. We also show that decision-agnostic metrics such as Wasserstein distance can be misleading when evaluating these distributions for decision-making.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06385",
        "abs_url": "https://arxiv.org/abs/2602.06385",
        "pdf_url": "https://arxiv.org/pdf/2602.06385",
        "title": "Uniform Spectral Growth and Convergence of Muon in LoRA-Style Matrix Factorization",
        "authors": [
            "Changmin Kang",
            "Jihun Yun",
            "Baekrok Shin",
            "Yeseul Cho",
            "Chulhee Yun"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Spectral gradient descent (SpecGD) orthogonalizes the matrix parameter updates and has inspired practical optimizers such as Muon. They often perform well in large language model (LLM) training, but their dynamics remain poorly understood. In the low-rank adaptation (LoRA) setting, where weight updates are parameterized as a product of two low-rank factors, we find a distinctive spectral phenomenon under Muon in LoRA fine-tuning of LLMs: singular values of the LoRA product show near-uniform growth across the spectrum, despite orthogonalization being performed on the two factors separately. Motivated by this observation, we analyze spectral gradient flow (SpecGF)-a continuous-time analogue of SpecGD-in a simplified LoRA-style matrix factorization setting and prove \"equal-rate\" dynamics: all singular values grow at equal rates up to small deviations. Consequently, smaller singular values attain their target values earlier than larger ones, sharply contrasting with the largest-first stepwise learning observed in standard gradient flow. Moreover, we prove that SpecGF in our setting converges to global minima from almost all initializations, provided the factor norms remain bounded; with $\\ell_2$ regularization, we obtain global convergence. Lastly, we corroborate our theory with experiments in the same setting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06390",
        "abs_url": "https://arxiv.org/abs/2602.06390",
        "pdf_url": "https://arxiv.org/pdf/2602.06390",
        "title": "Generating High-quality Privacy-preserving Synthetic Data",
        "authors": [
            "David Yavo",
            "Richard Khoury",
            "Christophe Pere",
            "Sadoune Ait Kaci Azzou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Synthetic tabular data enables sharing and analysis of sensitive records, but its practical deployment requires balancing distributional fidelity, downstream utility, and privacy protection. We study a simple, model agnostic post processing framework that can be applied on top of any synthetic data generator to improve this trade off. First, a mode patching step repairs categories that are missing or severely underrepresented in the synthetic data, while largely preserving learned dependencies. Second, a k nearest neighbor filter replaces synthetic records that lie too close to real data points, enforcing a minimum distance between real and synthetic samples. We instantiate this framework for two neural generative models for tabular data, a feed forward generator and a variational autoencoder, and evaluate it on three public datasets covering credit card transactions, cardiovascular health, and census based income. We assess marginal and joint distributional similarity, the performance of models trained on synthetic data and evaluated on real data, and several empirical privacy indicators, including nearest neighbor distances and attribute inference attacks. With moderate thresholds between 0.2 and 0.35, the post processing reduces divergence between real and synthetic categorical distributions by up to 36 percent and improves a combined measure of pairwise dependence preservation by 10 to 14 percent, while keeping downstream predictive performance within about 1 percent of the unprocessed baseline. At the same time, distance based privacy indicators improve and the success rate of attribute inference attacks remains largely unchanged. These results provide practical guidance for selecting thresholds and applying post hoc repairs to improve the quality and empirical privacy of synthetic tabular data, while complementing approaches that provide formal differential privacy guarantees.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06404",
        "abs_url": "https://arxiv.org/abs/2602.06404",
        "pdf_url": "https://arxiv.org/pdf/2602.06404",
        "title": "Near-Optimal Regret for Distributed Adversarial Bandits: A Black-Box Approach",
        "authors": [
            "Hao Qiu",
            "Mengxiao Zhang",
            "Nicolò Cesa-Bianchi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study distributed adversarial bandits, where $N$ agents cooperate to minimize the global average loss while observing only their own local losses. We show that the minimax regret for this problem is $\\tilde{\\Theta}(\\sqrt{(\\rho^{-1/2}+K/N)T})$, where $T$ is the horizon, $K$ is the number of actions, and $\\rho$ is the spectral gap of the communication matrix. Our algorithm, based on a novel black-box reduction to bandits with delayed feedback, requires agents to communicate only through gossip. It achieves an upper bound that significantly improves over the previous best bound $\\tilde{O}(\\rho^{-1/3}(KT)^{2/3})$ of Yi and Vojnovic (2023). We complement this result with a matching lower bound, showing that the problem's difficulty decomposes into a communication cost $\\rho^{-1/4}\\sqrt{T}$ and a bandit cost $\\sqrt{KT/N}$. We further demonstrate the versatility of our approach by deriving first-order and best-of-both-worlds bounds in the distributed adversarial setting. Finally, we extend our framework to distributed linear bandits in $R^d$, obtaining a regret bound of $\\tilde{O}(\\sqrt{(\\rho^{-1/2}+1/N)dT})$, achieved with only $O(d)$ communication cost per agent and per round via a volumetric spanner.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06411",
        "abs_url": "https://arxiv.org/abs/2602.06411",
        "pdf_url": "https://arxiv.org/pdf/2602.06411",
        "title": "EEG Emotion Classification Using an Enhanced Transformer-CNN-BiLSTM Architecture with Dual Attention Mechanisms",
        "authors": [
            "S M Rakib UI Karim",
            "Wenyi Lu",
            "Diponkor Bala",
            "Rownak Ara Rasul",
            "Sean Goggins"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Electroencephalography (EEG)-based emotion recognition plays a critical role in affective computing and emerging decision-support systems, yet remains challenging due to high-dimensional, noisy, and subject-dependent signals. This study investigates whether hybrid deep learning architectures that integrate convolutional, recurrent, and attention-based components can improve emotion classification performance and robustness in EEG data. We propose an enhanced hybrid model that combines convolutional feature extraction, bidirectional temporal modeling, and self-attention mechanisms with regularization strategies to mitigate overfitting. Experiments conducted on a publicly available EEG dataset spanning three emotional states (neutral, positive, and negative) demonstrate that the proposed approach achieves state-of-the-art classification performance, significantly outperforming classical machine learning and neural baselines. Statistical tests confirm the robustness of these performance gains under cross-validation. Feature-level analyses further reveal that covariance-based EEG features contribute most strongly to emotion discrimination, highlighting the importance of inter-channel relationships in affective modeling. These findings suggest that carefully designed hybrid architectures can effectively balance predictive accuracy, robustness, and interpretability in EEG-based emotion recognition, with implications for applied affective computing and human-centered intelligent systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06418",
        "abs_url": "https://arxiv.org/abs/2602.06418",
        "pdf_url": "https://arxiv.org/pdf/2602.06418",
        "title": "Adaptive Protein Tokenization",
        "authors": [
            "Rohit Dilip",
            "Ayush Varshney",
            "David Van Valen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Biomolecules (q-bio.BM)",
        "abstract": "Tokenization is a promising path to multi-modal models capable of jointly understanding protein sequences, structure, and function. Existing protein structure tokenizers create tokens by pooling information from local neighborhoods, an approach that limits their performance on generative and representation tasks. In this work, we present a method for global tokenization of protein structures in which successive tokens contribute increasing levels of detail to a global representation. This change resolves several issues with generative models based on local protein tokenization: it mitigates error accumulation, provides embeddings without sequence-reduction operations, and allows task-specific adaptation of a tokenized sequence's information content. We validate our method on reconstruction, generative, and representation tasks and demonstrate that it matches or outperforms existing models based on local protein structure tokenizers. We show how adaptive tokens enable inference criteria based on information content, which boosts designability. We validate representations generated from our tokenizer on CATH classification tasks and demonstrate that non-linear probing on our tokenized sequences outperforms equivalent probing on representations from other tokenizers. Finally, we demonstrate how our method supports zero-shot protein shrinking and affinity maturation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06426",
        "abs_url": "https://arxiv.org/abs/2602.06426",
        "pdf_url": "https://arxiv.org/pdf/2602.06426",
        "title": "Beyond Code Contributions: How Network Position, Temporal Bursts, and Code Review Activities Shape Contributor Influence in Large-Scale Open Source Ecosystems",
        "authors": [
            "S M Rakib Ul Karim",
            "Wenyi Lu",
            "Sean Goggins"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Open source software (OSS) projects rely on complex networks of contributors whose interactions drive innovation and sustainability. This study presents a comprehensive analysis of OSS contributor networks using advanced graph neural networks and temporal network analysis on data spanning 25 years from the Cloud Native Computing Foundation ecosystem, encompassing sandbox, incubating, and graduated projects. Our analysis of thousands of contributors across hundreds of repositories reveals that OSS networks exhibit strong power-law distributions in influence, with the top 1\\% of contributors controlling a substantial portion of network influence. Using GPU-accelerated PageRank, betweenness centrality, and custom LSTM models, we identify five distinct contributor roles: Core, Bridge, Connector, Regular, and Peripheral, each with unique network positions and structural importance. Statistical analysis reveals significant correlations between specific action types (commits, pull requests, issues) and contributor influence, with multiple regression models explaining substantial variance in influence metrics. Temporal analysis shows that network density, clustering coefficients, and modularity exhibit statistically significant temporal trends, with distinct regime changes coinciding with major project milestones. Structural integrity simulations show that Bridge contributors, despite representing a small fraction of the network, have a disproportionate impact on network cohesion when removed. Our findings provide empirical evidence for strategic contributor retention policies and offer actionable insights into community health metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06429",
        "abs_url": "https://arxiv.org/abs/2602.06429",
        "pdf_url": "https://arxiv.org/pdf/2602.06429",
        "title": "Reclaiming First Principles: A Differentiable Framework for Conceptual Hydrologic Models",
        "authors": [
            "Jasper A. Vrugt",
            "Jonathan M. Frame",
            "Ethan Bollman"
        ],
        "comments": "85 pages, 14 figures",
        "subjects": "Machine Learning (cs.LG); Geophysics (physics.geo-ph)",
        "abstract": "Conceptual hydrologic models remain the cornerstone of rainfall-runoff modeling, yet their calibration is often slow and numerically fragile. Most gradient-based parameter estimation methods rely on finite-difference approximations or automatic differentiation frameworks (e.g., JAX, PyTorch and TensorFlow), which are computationally demanding and introduce truncation errors, solver instabilities, and substantial overhead. These limitations are particularly acute for the ODE systems of conceptual watershed models. Here we introduce a fully analytic and computationally efficient framework for differentiable hydrologic modeling based on exact parameter sensitivities. By augmenting the governing ODE system with sensitivity equations, we jointly evolve the model states and the Jacobian matrix with respect to all parameters. This Jacobian then provides fully analytic gradient vectors for any differentiable loss function. These include classical objective functions such as the sum of absolute and squared residuals, widely used hydrologic performance metrics such as the Nash-Sutcliffe and Kling-Gupta efficiencies, robust loss functions that down-weight extreme events, and hydrograph-based functionals such as flow-duration and recession curves. The analytic sensitivities eliminate the step-size dependence and noise inherent to numerical differentiation, while avoiding the instability of adjoint methods and the overhead of modern machine-learning autodiff toolchains. The resulting gradients are deterministic, physically interpretable, and straightforward to embed in gradient-based optimizers. Overall, this work enables rapid, stable, and transparent gradient-based calibration of conceptual hydrologic models, unlocking the full potential of differentiable modeling without reliance on external, opaque, or CPU-intensive automatic-differentiation libraries.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06441",
        "abs_url": "https://arxiv.org/abs/2602.06441",
        "pdf_url": "https://arxiv.org/pdf/2602.06441",
        "title": "Is Gradient Ascent Really Necessary? Memorize to Forget for Machine Unlearning",
        "authors": [
            "Zhuo Huang",
            "Qizhou Wang",
            "Ziming Hong",
            "Shanshan Ye",
            "Bo Han",
            "Tongliang Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "For ethical and safe AI, machine unlearning rises as a critical topic aiming to protect sensitive, private, and copyrighted knowledge from misuse. To achieve this goal, it is common to conduct gradient ascent (GA) to reverse the training on undesired data. However, such a reversal is prone to catastrophic collapse, which leads to serious performance degradation in general tasks. As a solution, we propose model extrapolation as an alternative to GA, which reaches the counterpart direction in the hypothesis space from one model given another reference model. Therefore, we leverage the original model as the reference, further train it to memorize undesired data while keeping prediction consistency on the rest retained data, to obtain a memorization model. Counterfactual as it might sound, a forget model can be obtained via extrapolation from the memorization model to the reference model. Hence, we avoid directly acquiring the forget model using GA, but proceed with gradient descent for the memorization model, which successfully stabilizes the machine unlearning process. Our model extrapolation is simple and efficient to implement, and it can also effectively converge throughout training to achieve improved unlearning performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06451",
        "abs_url": "https://arxiv.org/abs/2602.06451",
        "pdf_url": "https://arxiv.org/pdf/2602.06451",
        "title": "BrokenBind: Universal Modality Exploration beyond Dataset Boundaries",
        "authors": [
            "Zhuo Huang",
            "Runnan Chen",
            "Bo Han",
            "Gang Niu",
            "Masashi Sugiyama",
            "Tongliang Liu"
        ],
        "comments": "17 pages, 8 figures, and 10 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multi-modal learning combines various modalities to provide a comprehensive understanding of real-world problems. A common strategy is to directly bind different modalities together in a specific joint embedding space. However, the capability of existing methods is restricted within the modalities presented in the given dataset, thus they are biased when generalizing to unpresented modalities in downstream tasks. As a result, due to such inflexibility, the viability of previous methods is seriously hindered by the cost of acquiring multi-modal datasets. In this paper, we introduce BrokenBind, which focuses on binding modalities that are presented from different datasets. To achieve this, BrokenBind simultaneously leverages multiple datasets containing the modalities of interest and one shared modality. Though the two datasets do not correspond to each other due to distribution mismatch, we can capture their relationship to generate pseudo embeddings to fill in the missing modalities of interest, enabling flexible and generalized multi-modal learning. Under our framework, any two modalities can be bound together, free from the dataset limitation, to achieve universal modality exploration. Further, to reveal the capability of our method, we study intensified scenarios where more than two datasets are needed for modality binding and show the effectiveness of BrokenBind in low-data regimes. Through extensive evaluation, we carefully justify the superiority of BrokenBind compared to well-known multi-modal baseline methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06453",
        "abs_url": "https://arxiv.org/abs/2602.06453",
        "pdf_url": "https://arxiv.org/pdf/2602.06453",
        "title": "On the Plasticity and Stability for Post-Training Large Language Models",
        "authors": [
            "Wenwen Qiang",
            "Ziyin Gu",
            "Jiahuan Zhou",
            "Jie Hu",
            "Jingyao Wang",
            "Changwen Zheng",
            "Hui Xiong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Training stability remains a critical bottleneck for Group Relative Policy Optimization (GRPO), often manifesting as a trade-off between reasoning plasticity and general capability retention. We identify a root cause as the geometric conflict between plasticity and stability gradients, which leads to destructive interference. Crucially, we argue that deterministic projection methods are suboptimal for GRPO as they overlook the intrinsic stochasticity of group-based gradient estimates. To address this, we propose Probabilistic Conflict Resolution (PCR), a Bayesian framework that models gradients as random variables. PCR dynamically arbitrates conflicts via an uncertainty-aware ``soft projection'' mechanism, optimizing the signal-to-noise ratio. Extensive experiments demonstrate that PCR significantly smooths the training trajectory and achieves superior performance in various reasoning tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06456",
        "abs_url": "https://arxiv.org/abs/2602.06456",
        "pdf_url": "https://arxiv.org/pdf/2602.06456",
        "title": "The Window Dilemma: Why Concept Drift Detection is Ill-Posed",
        "authors": [
            "Brandon Gower-Winter",
            "Misja Groen",
            "Georg Krempl"
        ],
        "comments": "12 pages, 1 Figure, 5 Tables. Accepted to the 24th International Symposium on Intelligent Data Analysis (IDA) (2026)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Non-stationarity of an underlying data generating process that leads to distributional changes over time is a key characteristic of Data Streams. This phenomenon, commonly referred to as Concept Drift, has been intensively studied, and Concept Drift Detectors have been established as a class of methods for detecting such changes (drifts). For the most part, Drift Detectors compare regions (windows) of the data stream and detect drift if those windows are sufficiently dissimilar. In this work, we introduce the Window Dilemma, an observation that perceived drift is a product of windowing and not necessarily the underlying data generating process. Additionally, we highlight that drift detection is ill-posed, primarily because verification of drift events are implausible in practice. We demonstrate these contributions first by an illustrative example, followed by empirical comparisons of drift detectors against a variety of alternative adaptation strategies. Our main finding is that traditional batch learning techniques often perform better than their drift-aware counterparts further bringing into question the purpose of detectors in Stream Classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06457",
        "abs_url": "https://arxiv.org/abs/2602.06457",
        "pdf_url": "https://arxiv.org/pdf/2602.06457",
        "title": "Achieving Better Local Regret Bound for Online Non-Convex Bilevel Optimization",
        "authors": [
            "Tingkai Jia",
            "Haiguang Wang",
            "Cheng Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Online bilevel optimization (OBO) has emerged as a powerful framework for many machine learning problems. Prior works have developed several algorithms that minimize the standard bilevel local regret or the window-averaged bilevel local regret of the OBO problem, but the optimality of existing regret bounds remains unclear. In this work, we establish optimal regret bounds for both settings. For standard bilevel local regret, we propose an algorithm that achieves the optimal regret $\\Omega(1+V_T)$ with at most $O(T\\log T)$ total inner-level gradient evaluations. We further develop a fully single-loop algorithm whose regret bound includes an additional gradient-variation terms. For the window-averaged bilevel local regret, we design an algorithm that captures sublinear environmental variation through a window-based analysis and achieves the optimal regret $\\Omega(T/W^2)$. Experiments validate our theoretical findings and demonstrate the practical effectiveness of the proposed methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06475",
        "abs_url": "https://arxiv.org/abs/2602.06475",
        "pdf_url": "https://arxiv.org/pdf/2602.06475",
        "title": "Towards Generalizable Reasoning: Group Causal Counterfactual Policy Optimization for LLM Reasoning",
        "authors": [
            "Jingyao Wang",
            "Peizheng Guo",
            "Wenwen Qiang",
            "Jiahuan Zhou",
            "Huijie Guo",
            "Changwen Zheng",
            "Hui Xiong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) excel at complex tasks with advances in reasoning capabilities. However, existing reward mechanisms remain tightly coupled to final correctness and pay little attention to the underlying reasoning process: trajectories with sound reasoning but wrong answers receive low credit, while lucky guesses with flawed logic may be highly rewarded, affecting reasoning generalization. From a causal perspective, we interpret multi-candidate reasoning for a fixed question as a family of counterfactual experiments with theoretical supports. Building on this, we propose Group Causal Counterfactual Policy Optimization to explicitly train LLMs to learn generalizable reasoning patterns. It proposes an episodic causal counterfactual reward that jointly captures (i) robustness, encouraging the answer distribution induced by a reasoning step to remain stable under counterfactual perturbations; and (ii) effectiveness, enforcing sufficient variability so that the learned reasoning strategy can transfer across questions. We then construct token-level advantages from this reward and optimize the policy, encouraging LLMs to favor reasoning patterns that are process-valid and counterfactually robust. Extensive experiments on diverse benchmarks demonstrate its advantages.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06493",
        "abs_url": "https://arxiv.org/abs/2602.06493",
        "pdf_url": "https://arxiv.org/pdf/2602.06493",
        "title": "Adaptive Uncertainty-Aware Tree Search for Robust Reasoning",
        "authors": [
            "Zeen Song",
            "Zihao Ma",
            "Wenwen Qiang",
            "Changwen Zheng",
            "Gang Hua"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Inference-time reasoning scaling has significantly advanced the capabilities of Large Language Models (LLMs) in complex problem-solving. A prevalent approach involves external search guided by Process Reward Models (PRMs). However, a fundamental limitation of this framework is the epistemic uncertainty of PRMs when evaluating reasoning paths that deviate from their training distribution. In this work, we conduct a systematic analysis of this challenge. We first provide empirical evidence that PRMs exhibit high uncertainty and unreliable scoring on out-of-distribution (OOD) samples. We then establish a theoretical framework proving that while standard search incurs linear regret accumulation, an uncertainty-aware strategy can achieve sublinear regret. Motivated by these findings, we propose Uncertainty-Aware Tree Search (UATS), a unified method that estimates uncertainty via Monte Carlo Dropout and dynamically allocates compute budget using a reinforcement learning-based controller. Extensive experiments demonstrate that our approach effectively mitigates the impact of OOD errors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06500",
        "abs_url": "https://arxiv.org/abs/2602.06500",
        "pdf_url": "https://arxiv.org/pdf/2602.06500",
        "title": "Can Microcanonical Langevin Dynamics Leverage Mini-Batch Gradient Noise?",
        "authors": [
            "Emanuel Sommer",
            "Kangning Diao",
            "Jakob Robnik",
            "Uros Seljak",
            "David Rügamer"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Scaling inference methods such as Markov chain Monte Carlo to high-dimensional models remains a central challenge in Bayesian deep learning. A promising recent proposal, microcanonical Langevin Monte Carlo, has shown state-of-the-art performance across a wide range of problems. However, its reliance on full-dataset gradients makes it prohibitively expensive for large-scale problems. This paper addresses a fundamental question: Can microcanonical dynamics effectively leverage mini-batch gradient noise? We provide the first systematic study of this problem, establishing a novel continuous-time theoretical analysis of stochastic-gradient microcanonical dynamics. We reveal two critical failure modes: a theoretically derived bias due to anisotropic gradient noise and numerical instabilities in complex high-dimensional posteriors. To tackle these issues, we propose a principled gradient noise preconditioning scheme shown to significantly reduce this bias and develop a novel, energy-variance-based adaptive tuner that automates step size selection and dynamically informs numerical guardrails. The resulting algorithm is a robust and scalable microcanonical Monte Carlo sampler that achieves state-of-the-art performance on challenging high-dimensional inference tasks like Bayesian neural networks. Combined with recent ensemble techniques, our work unlocks a new class of stochastic microcanonical Langevin ensemble (SMILE) samplers for large-scale Bayesian inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06511",
        "abs_url": "https://arxiv.org/abs/2602.06511",
        "pdf_url": "https://arxiv.org/pdf/2602.06511",
        "title": "Evolutionary Generation of Multi-Agent Systems",
        "authors": [
            "Yuntong Hu",
            "Matthew Trager",
            "Yuting Zhang",
            "Yi Zhang",
            "Shuo Yang",
            "Wei Xia",
            "Stefano Soatto"
        ],
        "comments": "26 pages, 15 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large language model (LLM)-based multi-agent systems (MAS) show strong promise for complex reasoning, planning, and tool-augmented tasks, but designing effective MAS architectures remains labor-intensive, brittle, and hard to generalize. Existing automatic MAS generation methods either rely on code generation, which often leads to executability and robustness failures, or impose rigid architectural templates that limit expressiveness and adaptability. We propose Evolutionary Generation of Multi-Agent Systems (EvoMAS), which formulates MAS generation as structured configuration generation. EvoMAS performs evolutionary generation in configuration space. Specifically, EvoMAS selects initial configurations from a pool, applies feedback-conditioned mutation and crossover guided by execution traces, and iteratively refines both the candidate pool and an experience memory. We evaluate EvoMAS on diverse benchmarks, including BBEH, SWE-Bench, and WorkBench, covering reasoning, software engineering, and tool-use tasks. EvoMAS consistently improves task performance over both human-designed MAS and prior automatic MAS generation methods, while producing generated systems with higher executability and runtime robustness. EvoMAS outperforms the agent evolution method EvoAgent by +10.5 points on BBEH reasoning and +7.1 points on WorkBench. With Claude-4.5-Sonnet, EvoMAS also reaches 79.1% on SWE-Bench-Verified, matching the top of the leaderboard.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06519",
        "abs_url": "https://arxiv.org/abs/2602.06519",
        "pdf_url": "https://arxiv.org/pdf/2602.06519",
        "title": "Topography scanning as a part of process monitoring in power cable insulation process",
        "authors": [
            "Janne Harjuhahto",
            "Jaakko Harjuhahto",
            "Mikko Lahti",
            "Jussi Hanhirova",
            "Björn Sonerud"
        ],
        "comments": "6 pages, 14 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present a novel topography scanning system developed to XLPE cable core monitoring. Modern measurement technology is utilized together with embedded high-performance computing to build a complete and detailed 3D surface map of the insulated core. Cross sectional and lengthwise geometry errors are studied, and melt homogeneity is identified as one major factor for these errors. A surface defect detection system has been developed utilizing deep learning methods. Our results show that convolutional neural networks are well suited for real time analysis of surface measurement data enabling reliable detection of surface defects.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06542",
        "abs_url": "https://arxiv.org/abs/2602.06542",
        "pdf_url": "https://arxiv.org/pdf/2602.06542",
        "title": "Live Knowledge Tracing: Real-Time Adaptation using Tabular Foundation Models",
        "authors": [
            "Mounir Lbath",
            "Alexandre Paresy",
            "Abdelkayoum Kaddouri",
            "Alan André",
            "Alexandre Ittah",
            "Jill-Jênn Vie"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep knowledge tracing models have achieved significant breakthroughs in modeling student learning trajectories. However, these architectures require substantial training time and are prone to overfitting on datasets with short sequences. In this paper, we explore a new paradigm for knowledge tracing by leveraging tabular foundation models (TFMs). Unlike traditional methods that require offline training on a fixed training set, our approach performs real-time ''live'' knowledge tracing in an online way. The core of our method lies in a two-way attention mechanism: while attention knowledge tracing models only attend across earlier time steps, TFMs simultaneously attend across both time steps and interactions of other students in the training set. They align testing sequences with relevant training sequences at inference time, therefore skipping the training step entirely. We demonstrate, using several datasets of increasing size, that our method achieves competitive predictive performance with up to 273x speedups, in a setting where more student interactions are observed over time.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06549",
        "abs_url": "https://arxiv.org/abs/2602.06549",
        "pdf_url": "https://arxiv.org/pdf/2602.06549",
        "title": "Refining the Information Bottleneck via Adversarial Information Separation",
        "authors": [
            "Shuai Ning",
            "Zhenpeng Wang",
            "Lin Wang",
            "Bing Chen",
            "Shuangrong Liu",
            "Xu Wu",
            "Jin Zhou",
            "Bo Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Generalizing from limited data is particularly critical for models in domains such as material science, where task-relevant features in experimental datasets are often heavily confounded by measurement noise and experimental artifacts. Standard regularization techniques fail to precisely separate meaningful features from noise, while existing adversarial adaptation methods are limited by their reliance on explicit separation labels. To address this challenge, we propose the Adversarial Information Separation Framework (AdverISF), which isolates task-relevant features from noise without requiring explicit supervision. AdverISF introduces a self-supervised adversarial mechanism to enforce statistical independence between task-relevant features and noise representations. It further employs a multi-layer separation architecture that progressively recycles noise information across feature hierarchies to recover features inadvertently discarded as noise, thereby enabling finer-grained feature extraction. Extensive experiments demonstrate that AdverISF outperforms state-of-the-art methods in data-scarce scenarios. In addition, evaluations on real-world material design tasks show that it achieves superior generalization performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06552",
        "abs_url": "https://arxiv.org/abs/2602.06552",
        "pdf_url": "https://arxiv.org/pdf/2602.06552",
        "title": "Fine-Grained Model Merging via Modular Expert Recombination",
        "authors": [
            "Haiyun Qiu",
            "Xingyu Wu",
            "Liang Feng",
            "Kay Chen Tan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Model merging constructs versatile models by integrating task-specific models without requiring labeled data or expensive joint retraining. Although recent methods improve adaptability to heterogeneous tasks by generating customized merged models for each instance, they face two critical limitations. First, the instance-specific merged models lack reusability, restricting the exploitation of high-quality merging configurations and efficient batch inference. Second, these methods treat each task-specific model as a monolithic whole, overlooking the diverse mergeability of homologous components such as attention and multilayer perceptron layers, and the differing merging sensitivities across components. To address these limitations, we propose MERGE (\\underline{M}odular \\underline{E}xpert \\underline{R}ecombination for fine-\\underline{G}rained m\\underline{E}rging), a method that enables component-wise model merging and input-aware, on-demand module recombination at inference. MERGE formulates component-wise merging as a bi-objective optimization problem that balances cross-task performance and storage efficiency, and develops a surrogate-assisted evolutionary algorithm to efficiently identify Pareto-optimal merging configurations. These high-quality configurations underpin a reusable modular expert library, from which a lightweight routing network dynamically activates and recombines modular experts to assemble input-specific models and enable efficient inference under storage constraints. Extensive experiments across various model scales, task types, and fine-tuning strategies demonstrate that MERGE consistently outperforms strong baselines and generalizes effectively.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06557",
        "abs_url": "https://arxiv.org/abs/2602.06557",
        "pdf_url": "https://arxiv.org/pdf/2602.06557",
        "title": "Which Graph Shift Operator? A Spectral Answer to an Empirical Question",
        "authors": [
            "Yassine Abbahaddou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Machine Learning (stat.ML)",
        "abstract": "Graph Neural Networks (GNNs) have established themselves as the leading models for learning on graph-structured data, generally categorized into spatial and spectral approaches. Central to these architectures is the Graph Shift Operator (GSO), a matrix representation of the graph structure used to filter node signals. However, selecting the optimal GSO, whether fixed or learnable, remains largely empirical. In this paper, we introduce a novel alignment gain metric that quantifies the geometric distortion between the input signal and label subspaces. Crucially, our theoretical analysis connects this alignment directly to generalization bounds via a spectral proxy for the Lipschitz constant. This yields a principled, computation-efficient criterion to rank and select the optimal GSO for any prediction task prior to training, eliminating the need for extensive search.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06565",
        "abs_url": "https://arxiv.org/abs/2602.06565",
        "pdf_url": "https://arxiv.org/pdf/2602.06565",
        "title": "Learning to Allocate Resources with Censored Feedback",
        "authors": [
            "Giovanni Montanari",
            "Côme Fiegel",
            "Corentin Pla",
            "Aadirupa Saha",
            "Vianney Perchet"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Science and Game Theory (cs.GT)",
        "abstract": "We study the online resource allocation problem in which at each round, a budget $B$ must be allocated across $K$ arms under censored feedback. An arm yields a reward if and only if two conditions are satisfied: (i) the arm is activated according to an arm-specific Bernoulli random variable with unknown parameter, and (ii) the allocated budget exceeds a random threshold drawn from a parametric distribution with unknown parameter. Over $T$ rounds, the learner must jointly estimate the unknown parameters and allocate the budget so as to maximize cumulative reward facing the exploration--exploitation trade-off. We prove an information-theoretic regret lower bound $\\Omega(T^{1/3})$, demonstrating the intrinsic difficulty of the problem. We then propose RA-UCB, an optimistic algorithm that leverages non-trivial parameter estimation and confidence bounds. When the budget $B$ is known at the beginning of each round, RA-UCB achieves a regret of order $\\widetilde{\\mathcal{O}}(\\sqrt{T})$, and even $\\mathcal{O}(\\mathrm{poly}\\text{-}\\log T)$ under stronger assumptions. As for unknown, round dependent budget, we introduce MG-UCB, which allows within-round switching and infinitesimal allocations, and matches the regret guarantees of RA-UCB. We then validate our theoretical results through experiments on real-world datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06574",
        "abs_url": "https://arxiv.org/abs/2602.06574",
        "pdf_url": "https://arxiv.org/pdf/2602.06574",
        "title": "Transformer-based Parameter Fitting of Models derived from Bloch-McConnell Equations for CEST MRI Analysis",
        "authors": [
            "Christof Duhme",
            "Chris Lippe",
            "Verena Hoerr",
            "Xiaoyi Jiang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Chemical exchange saturation transfer (CEST) MRI is a non-invasive imaging modality for detecting metabolites. It offers higher resolution and sensitivity compared to conventional magnetic resonance spectroscopy (MRS). However, quantification of CEST data is challenging because the measured signal results from a complex interplay of many physiological variables. Here, we introduce a transformer-based neural network to fit parameters such as metabolite concentrations, exchange and relaxation rates of a physical model derived from Bloch-McConnell equations to in-vitro CEST spectra. We show that our self-supervised trained neural network clearly outperforms the solution of classical gradient-based solver.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06578",
        "abs_url": "https://arxiv.org/abs/2602.06578",
        "pdf_url": "https://arxiv.org/pdf/2602.06578",
        "title": "Exploring Sparsity and Smoothness of Arbitrary $\\ell_p$ Norms in Adversarial Attacks",
        "authors": [
            "Christof Duhme",
            "Florian Eilers",
            "Xiaoyi Jiang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Adversarial attacks against deep neural networks are commonly constructed under $\\ell_p$ norm constraints, most often using $p=1$, $p=2$ or $p=\\infty$, and potentially regularized for specific demands such as sparsity or smoothness. These choices are typically made without a systematic investigation of how the norm parameter \\( p \\) influences the structural and perceptual properties of adversarial perturbations. In this work, we study how the choice of \\( p \\) affects sparsity and smoothness of adversarial attacks generated under \\( \\ell_p \\) norm constraints for values of $p \\in [1,2]$. To enable a quantitative analysis, we adopt two established sparsity measures from the literature and introduce three smoothness measures. In particular, we propose a general framework for deriving smoothness measures based on smoothing operations and additionally introduce a smoothness measure based on first-order Taylor approximations. Using these measures, we conduct a comprehensive empirical evaluation across multiple real-world image datasets and a diverse set of model architectures, including both convolutional and transformer-based networks. We show that the choice of $\\ell_1$ or $\\ell_2$ is suboptimal in most cases and the optimal $p$ value is dependent on the specific task. In our experiments, using $\\ell_p$ norms with $p\\in [1.3, 1.5]$ yields the best trade-off between sparse and smooth attacks. These findings highlight the importance of principled norm selection when designing and evaluating adversarial attacks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06586",
        "abs_url": "https://arxiv.org/abs/2602.06586",
        "pdf_url": "https://arxiv.org/pdf/2602.06586",
        "title": "Degradation of Feature Space in Continual Learning",
        "authors": [
            "Chiara Lanza",
            "Roberto Pereira",
            "Marco Miozzo",
            "Eduard Angelats",
            "Paolo Dini"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Centralized training is the standard paradigm in deep learning, enabling models to learn from a unified dataset in a single location. In such setup, isotropic feature distributions naturally arise as a mean to support well-structured and generalizable representations. In contrast, continual learning operates on streaming and non-stationary data, and trains models incrementally, inherently facing the well-known plasticity-stability dilemma. In such settings, learning dynamics tends to yield increasingly anisotropic feature space. This arises a fundamental question: should isotropy be enforced to achieve a better balance between stability and plasticity, and thereby mitigate catastrophic forgetting? In this paper, we investigate whether promoting feature-space isotropy can enhance representation quality in continual learning. Through experiments using contrastive continual learning techniques on CIFAR-10 and CIFAR-100 data, we find that isotropic regularization fails to improve, and can in fact degrade, model accuracy in continual settings. Our results highlight essential differences in feature geometry between centralized and continual learning, suggesting that isotropy, while beneficial in centralized setups, may not constitute an appropriate inductive bias for non-stationary learning scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06597",
        "abs_url": "https://arxiv.org/abs/2602.06597",
        "pdf_url": "https://arxiv.org/pdf/2602.06597",
        "title": "DiTS: Multimodal Diffusion Transformers Are Time Series Forecasters",
        "authors": [
            "Haoran Zhang",
            "Haixuan Liu",
            "Yong Liu",
            "Yunzhong Qiu",
            "Yuxuan Wang",
            "Jianmin Wang",
            "Mingsheng Long"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "While generative modeling on time series facilitates more capable and flexible probabilistic forecasting, existing generative time series models do not address the multi-dimensional properties of time series data well. The prevalent architecture of Diffusion Transformers (DiT), which relies on simplistic conditioning controls and a single-stream Transformer backbone, tends to underutilize cross-variate dependencies in covariate-aware forecasting. Inspired by Multimodal Diffusion Transformers that integrate textual guidance into video generation, we propose Diffusion Transformers for Time Series (DiTS), a general-purpose architecture that frames endogenous and exogenous variates as distinct modalities. To better capture both inter-variate and intra-variate dependencies, we design a dual-stream Transformer block tailored for time-series data, comprising a Time Attention module for autoregressive modeling along the temporal dimension and a Variate Attention module for cross-variate modeling. Unlike the common approach for images, which flattens 2D token grids into 1D sequences, our design leverages the low-rank property inherent in multivariate dependencies, thereby reducing computational costs. Experiments show that DiTS achieves state-of-the-art performance across benchmarks, regardless of the presence of future exogenous variate observations, demonstrating unique generative forecasting strengths over traditional deterministic deep forecasting models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06603",
        "abs_url": "https://arxiv.org/abs/2602.06603",
        "pdf_url": "https://arxiv.org/pdf/2602.06603",
        "title": "The hidden risks of temporal resampling in clinical reinforcement learning",
        "authors": [
            "Thomas Frost",
            "Hrisheekesh Vaidya",
            "Steve Harris"
        ],
        "comments": "12 pages, 4 figures. Currently under submission to npj Digital Medicine",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Offline reinforcement learning (ORL) has shown potential for improving decision-making in healthcare. However, contemporary research typically aggregates patient data into fixed time intervals, simplifying their mapping to standard ORL frameworks. The impact of these temporal manipulations on model safety and efficacy remains poorly understood. In this work, using both a gridworld navigation task and the UVA/Padova clinical diabetes simulator, we demonstrate that temporal resampling significantly degrades the performance of offline reinforcement learning algorithms during live deployment. We propose three mechanisms that drive this failure: (i) the generation of counterfactual trajectories, (ii) the distortion of temporal expectations, and (iii) the compounding of generalisation errors. Crucially, we find that standard off-policy evaluation metrics can fail to detect these drops in performance. Our findings reveal a fundamental risk in current healthcare ORL pipelines and emphasise the need for methods that explicitly handle the irregular timing of clinical decision-making.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06611",
        "abs_url": "https://arxiv.org/abs/2602.06611",
        "pdf_url": "https://arxiv.org/pdf/2602.06611",
        "title": "Adaptive-CaRe: Adaptive Causal Regularization for Robust Outcome Prediction",
        "authors": [
            "Nithya Bhasker",
            "Fiona R. Kolbinger",
            "Susu Hu",
            "Gitta Kutyniok",
            "Stefanie Speidel"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate prediction of outcomes is crucial for clinical decision-making and personalized patient care. Supervised machine learning algorithms, which are commonly used for outcome prediction in the medical domain, optimize for predictive accuracy, which can result in models latching onto spurious correlations instead of robust predictors. Causal structure learning methods on the other hand have the potential to provide robust predictors for the target, but can be too conservative because of algorithmic and data assumptions, resulting in loss of diagnostic precision. Therefore, we propose a novel model-agnostic regularization strategy, Adaptive-CaRe, for generalized outcome prediction in the medical domain. Adaptive-CaRe strikes a balance between both predictive value and causal robustness by incorporating a penalty that is proportional to the difference between the estimated statistical contribution and estimated causal contribution of the input features for model predictions. Our experiments on synthetic data establish the efficacy of the proposed Adaptive-CaRe regularizer in finding robust predictors for the target while maintaining competitive predictive accuracy. With experiments on a standard causal benchmark, we provide a blueprint for navigating the trade-off between predictive accuracy and causal robustness by tweaking the regularization strength, $\\lambda$. Validation using real-world dataset confirms that the results translate to practical, real-domain settings. Therefore, Adaptive-CaRe provides a simple yet effective solution to the long-standing trade-off between predictive accuracy and causal robustness in the medical domain. Future work would involve studying alternate causal structure learning frameworks and complex classification models to provide deeper insights at a larger scale.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06627",
        "abs_url": "https://arxiv.org/abs/2602.06627",
        "pdf_url": "https://arxiv.org/pdf/2602.06627",
        "title": "Trust Regions Sell, But Who's Buying? Overlap Geometry as an Alternative Trust Region for Policy Optimization",
        "authors": [
            "Gaurish Trivedi",
            "Alakh Sharma",
            "Kartikey Singh Bhandari",
            "Yash Sinha",
            "Pratik Narang",
            "Dhruv Kumar",
            "Jagat Sesh Challa"
        ],
        "comments": "Under Review",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Standard trust-region methods constrain policy updates via Kullback-Leibler (KL) divergence. However, KL controls only an average divergence and does not directly prevent rare, large likelihood-ratio excursions that destabilize training--precisely the failure mode that motivates heuristics such as PPO's clipping. We propose overlap geometry as an alternative trust region, constraining distributional overlap via the Bhattacharyya coefficient (closely related to the Hellinger/Renyi-1/2 geometry). This objective penalizes separation in the ratio tails, yielding tighter control over likelihood-ratio excursions without relying on total variation bounds that can be loose in tail regimes. We derive Bhattacharyya-TRPO (BTRPO) and Bhattacharyya-PPO (BPPO), enforcing overlap constraints via square-root ratio updates: BPPO clips the square-root ratio q = sqrt(r), and BTRPO applies a quadratic Hellinger/Bhattacharyya penalty. Empirically, overlap-based updates improve robustness and aggregate performance as measured by RLiable under matched training budgets, suggesting overlap constraints as a practical, principled alternative to KL for stable policy optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06675",
        "abs_url": "https://arxiv.org/abs/2602.06675",
        "pdf_url": "https://arxiv.org/pdf/2602.06675",
        "title": "Pruning at Initialisation through the lens of Graphon Limit: Convergence, Expressivity, and Generalisation",
        "authors": [
            "Hoang Pham",
            "The-Anh Ta",
            "Long Tran-Thanh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Pruning at Initialisation methods discover sparse, trainable subnetworks before training, but their theoretical mechanisms remain elusive. Existing analyses are often limited to finite-width statistics, lacking a rigorous characterisation of the global sparsity patterns that emerge as networks grow large. In this work, we connect discrete pruning heuristics to graph limit theory via graphons, establishing the graphon limit of PaI masks. We introduce a Factorised Saliency Model that encompasses popular pruning criteria and prove that, under regularity conditions, the discrete masks generated by these algorithms converge to deterministic bipartite graphons. This limit framework establishes a novel topological taxonomy for sparse networks: while unstructured methods (e.g., Random, Magnitude) converge to homogeneous graphons representing uniform connectivity, data-driven methods (e.g., SNIP, GraSP) converge to heterogeneous graphons that encode implicit feature selection. Leveraging this continuous characterisation, we derive two fundamental theoretical results: (i) a Universal Approximation Theorem for sparse networks that depends only on the intrinsic dimension of active coordinate subspaces; and (ii) a Graphon-NTK generalisation bound demonstrating how the limit graphon modulates the kernel geometry to align with informative features. Our results transform the study of sparse neural networks from combinatorial graph problems into a rigorous framework of continuous operators, offering a new mechanism for analysing expressivity and generalisation in sparse neural networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06689",
        "abs_url": "https://arxiv.org/abs/2602.06689",
        "pdf_url": "https://arxiv.org/pdf/2602.06689",
        "title": "Memory-Conditioned Flow-Matching for Stable Autoregressive PDE Rollouts",
        "authors": [
            "Victor Armegioiu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Autoregressive generative PDE solvers can be accurate one step ahead yet drift over long rollouts, especially in coarse-to-fine regimes where each step must regenerate unresolved fine scales. This is the regime of diffusion and flow-matching generators: although their internal dynamics are Markovian, rollout stability is governed by per-step \\emph{conditional law} errors. Using the Mori--Zwanzig projection formalism, we show that eliminating unresolved variables yields an exact resolved evolution with a Markov term, a memory term, and an orthogonal forcing, exposing a structural limitation of memoryless closures. Motivated by this, we introduce memory-conditioned diffusion/flow-matching with a compact online state injected into denoising via latent features. Via disintegration, memory induces a structured conditional tail prior for unresolved scales and reduces the transport needed to populate missing frequencies. We prove Wasserstein stability of the resulting conditional kernel. We then derive discrete Grönwall rollout bounds that separate memory approximation from conditional generation error. Experiments on compressible flows with shocks and multiscale mixing show improved accuracy and markedly more stable long-horizon rollouts, with better fine-scale spectral and statistical fidelity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06694",
        "abs_url": "https://arxiv.org/abs/2602.06694",
        "pdf_url": "https://arxiv.org/pdf/2602.06694",
        "title": "NanoQuant: Efficient Sub-1-Bit Quantization of Large Language Models",
        "authors": [
            "Hyochan Chong",
            "Dongkyu Kim",
            "Changdong Kim",
            "Minseop Choi"
        ],
        "comments": "26 pages. Hyochan Chong and Dongkyu Kim contributed equally to this work",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Weight-only quantization has become a standard approach for efficiently serving large language models (LLMs). However, existing methods fail to efficiently compress models to binary (1-bit) levels, as they either require large amounts of data and compute or incur additional storage. In this work, we propose NanoQuant, the first post-training quantization (PTQ) method to compress LLMs to both binary and sub-1-bit levels. NanoQuant formulates quantization as a low-rank binary factorization problem, and compresses full-precision weights to low-rank binary matrices and scales. Specifically, it utilizes an efficient alternating direction method of multipliers (ADMM) method to precisely initialize latent binary matrices and scales, and then tune the initialized parameters through a block and model reconstruction process. Consequently, NanoQuant establishes a new Pareto frontier in low-memory post-training quantization, achieving state-of-the-art accuracy even at sub-1-bit compression rates. NanoQuant makes large-scale deployment feasible on consumer hardware. For example, it compresses Llama2-70B by 25.8$\\times$ in just 13 hours on a single H100, enabling a 70B model to operate on a consumer 8 GB GPU.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06702",
        "abs_url": "https://arxiv.org/abs/2602.06702",
        "pdf_url": "https://arxiv.org/pdf/2602.06702",
        "title": "Explaining Grokking in Transformers through the Lens of Inductive Bias",
        "authors": [
            "Jaisidh Singh",
            "Diganta Misra",
            "Antonio Orvieto"
        ],
        "comments": "Total 15 pages, 9 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We investigate grokking in transformers through the lens of inductive bias: dispositions arising from architecture or optimization that let the network prefer one solution over another. We first show that architectural choices such as the position of Layer Normalization (LN) strongly modulates grokking speed. This modulation is explained by isolating how LN on specific pathways shapes shortcut-learning and attention entropy. Subsequently, we study how different optimization settings modulate grokking, inducing distinct interpretations of previously proposed controls such as readout scale. Particularly, we find that using readout scale as a control for lazy training can be confounded by learning rate and weight decay in our setting. Accordingly, we show that features evolve continuously throughout training, suggesting grokking in transformers can be more nuanced than a lazy-to-rich transition of the learning regime. Finally, we show how generalization predictably emerges with feature compressibility in grokking, across different modulators of inductive bias. Our code is released at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06717",
        "abs_url": "https://arxiv.org/abs/2602.06717",
        "pdf_url": "https://arxiv.org/pdf/2602.06717",
        "title": "F-GRPO: Don't Let Your Policy Learn the Obvious and Forget the Rare",
        "authors": [
            "Daniil Plyusov",
            "Alexey Gorbatovski",
            "Boris Shaposhnikov",
            "Viacheslav Sinii",
            "Alexey Malakhov",
            "Daniil Gavrilov"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Reinforcement Learning with Verifiable Rewards (RLVR) is commonly based on group sampling to estimate advantages and stabilize policy updates. In practice, large group sizes are not feasible due to computational limits, which biases learning toward trajectories that are already likely. Smaller groups often miss rare-correct trajectories while still containing mixed rewards, concentrating probability on common solutions. We derive the probability that updates miss rare-correct modes as a function of group size, showing non-monotonic behavior, and characterize how updates redistribute mass within the correct set, revealing that unsampled-correct mass can shrink even as total correct mass grows. Motivated by this analysis, we propose a difficulty-aware advantage scaling coefficient, inspired by Focal loss, that down-weights updates on high-success prompts. The lightweight modification can be directly integrated into any group-relative RLVR algorithm such as GRPO, DAPO, and CISPO. On Qwen2.5-7B across in-domain and out-of-domain benchmarks, our method improves pass@256 from 64.1 $\\rightarrow$ 70.3 (GRPO), 69.3 $\\rightarrow$ 72.5 (DAPO), and 73.2 $\\rightarrow$ 76.8 (CISPO), while preserving or improving pass@1, without increasing group size or computational cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06737",
        "abs_url": "https://arxiv.org/abs/2602.06737",
        "pdf_url": "https://arxiv.org/pdf/2602.06737",
        "title": "Optimal Abstractions for Verifying Properties of Kolmogorov-Arnold Networks (KANs)",
        "authors": [
            "Noah Schwartz",
            "Chandra Kanth Nagesh",
            "Sriram Sankaranarayanan",
            "Ramneet Kaur",
            "Tuhin Sahai",
            "Susmit Jha"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Logic in Computer Science (cs.LO)",
        "abstract": "We present a novel approach for verifying properties of Kolmogorov-Arnold Networks (KANs), a class of neural networks characterized by nonlinear, univariate activation functions typically implemented as piecewise polynomial splines or Gaussian processes. Our method creates mathematical ``abstractions'' by replacing each KAN unit with a piecewise affine (PWA) function, providing both local and global error estimates between the original network and its approximation. These abstractions enable property verification by encoding the problem as a Mixed Integer Linear Program (MILP), determining whether outputs satisfy specified properties when inputs belong to a given set. A critical challenge lies in balancing the number of pieces in the PWA approximation: too many pieces add binary variables that make verification computationally intractable, while too few pieces create excessive error margins that yield uninformative bounds. Our key contribution is a systematic framework that exploits KAN structure to find optimal abstractions. By combining dynamic programming at the unit level with a knapsack optimization across the network, we minimize the total number of pieces while guaranteeing specified error bounds. This approach determines the optimal approximation strategy for each unit while maintaining overall accuracy requirements. Empirical evaluation across multiple KAN benchmarks demonstrates that the upfront analysis costs of our method are justified by superior verification results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06741",
        "abs_url": "https://arxiv.org/abs/2602.06741",
        "pdf_url": "https://arxiv.org/pdf/2602.06741",
        "title": "Disentanglement by means of action-induced representations",
        "authors": [
            "Gorka Muñoz-Gil",
            "Hendrik Poulsen Nautrup",
            "Arunava Majumder",
            "Paulin de Schoulepnikoff",
            "Florian Fürrutter",
            "Marius Krumm",
            "Hans J. Briegel"
        ],
        "comments": "Main text: 10 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an); Quantum Physics (quant-ph)",
        "abstract": "Learning interpretable representations with variational autoencoders (VAEs) is a major goal of representation learning. The main challenge lies in obtaining disentangled representations, where each latent dimension corresponds to a distinct generative factor. This difficulty is fundamentally tied to the inability to perform nonlinear independent component analysis. Here, we introduce the framework of action-induced representations (AIRs) which models representations of physical systems given experiments (or actions) that can be performed on them. We show that, in this framework, we can provably disentangle degrees of freedom w.r.t. their action dependence. We further introduce a variational AIR architecture (VAIR) that can extract AIRs and therefore achieve provable disentanglement where standard VAEs fail. Beyond state representation, VAIR also captures the action dependence of the underlying generative factors, directly linking experiments to the degrees of freedom they influence.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06769",
        "abs_url": "https://arxiv.org/abs/2602.06769",
        "pdf_url": "https://arxiv.org/pdf/2602.06769",
        "title": "Soft Forward-Backward Representations for Zero-shot Reinforcement Learning with General Utilities",
        "authors": [
            "Marco Bagatella",
            "Thomas Rupf",
            "Georg Martius",
            "Andreas Krause"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent advancements in zero-shot reinforcement learning (RL) have facilitated the extraction of diverse behaviors from unlabeled, offline data sources. In particular, forward-backward algorithms (FB) can retrieve a family of policies that can approximately solve any standard RL problem (with additive rewards, linear in the occupancy measure), given sufficient capacity. While retaining zero-shot properties, we tackle the greater problem class of RL with general utilities, in which the objective is an arbitrary differentiable function of the occupancy measure. This setting is strictly more expressive, capturing tasks such as distribution matching or pure exploration, which may not be reduced to additive rewards. We show that this additional complexity can be captured by a novel, maximum entropy (soft) variant of the forward-backward algorithm, which recovers a family of stochastic policies from offline data. When coupled with zero-order search over compact policy embeddings, this algorithm can sidestep iterative optimization schemes, and optimizes general utilities directly at test-time. Across both didactic and high-dimensional experiments, we demonstrate that our method retains favorable properties of FB algorithms, while also extending their range to more general RL problems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06772",
        "abs_url": "https://arxiv.org/abs/2602.06772",
        "pdf_url": "https://arxiv.org/pdf/2602.06772",
        "title": "Calibrating Generative AI to Produce Realistic Essays for Data Augmentation",
        "authors": [
            "Edward W. Wolfe",
            "Justin O. Barber"
        ],
        "comments": "Artificial Intelligence in Measurement and Education Conference (AIME-Con)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Data augmentation can mitigate limited training data in machine-learning automated scoring engines for constructed response items. This study seeks to determine how well three approaches to large language model prompting produce essays that preserve the writing quality of the original essays and produce realistic text for augmenting ASE training datasets. We created simulated versions of student essays, and human raters assigned scores to them and rated the realism of the generated text. The results of the study indicate that the predict next prompting strategy produces the highest level of agreement between human raters regarding simulated essay scores, predict next and sentence strategies best preserve the rated quality of the original essay in the simulated essays, and predict next and 25 examples strategies produce the most realistic text as judged by human raters.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06773",
        "abs_url": "https://arxiv.org/abs/2602.06773",
        "pdf_url": "https://arxiv.org/pdf/2602.06773",
        "title": "On the Convergence of Multicalibration Gradient Boosting",
        "authors": [
            "Daniel Haimovich",
            "Fridolin Linder",
            "Lorenzo Perini",
            "Niek Tax",
            "Milan Vojnovic"
        ],
        "comments": "Under submission",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Multicalibration gradient boosting has recently emerged as a scalable method that empirically produces approximately multicalibrated predictors and has been deployed at web scale. Despite this empirical success, its convergence properties are not well understood. In this paper, we bridge the gap by providing convergence guarantees for multicalibration gradient boosting in regression with squared-error loss. We show that the magnitude of successive prediction updates decays at $O(1/\\sqrt{T})$, which implies the same convergence rate bound for the multicalibration error over rounds. Under additional smoothness assumptions on the weak learners, this rate improves to linear convergence. We further analyze adaptive variants, showing local quadratic convergence of the training loss, and we study rescaling schemes that preserve convergence. Experiments on real-world datasets support our theory and clarify the regimes in which the method achieves fast convergence and strong multicalibration.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06775",
        "abs_url": "https://arxiv.org/abs/2602.06775",
        "pdf_url": "https://arxiv.org/pdf/2602.06775",
        "title": "Robust Online Learning",
        "authors": [
            "Sajad Ashkezari"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study the problem of learning robust classifiers where the classifier will receive a perturbed input. Unlike robust PAC learning studied in prior work, here the clean data and its label are also adversarially chosen. We formulate this setting as an online learning problem and consider both the realizable and agnostic learnability of hypothesis classes. We define a new dimension of classes and show it controls the mistake bounds in the realizable setting and the regret bounds in the agnostic setting. In contrast to the dimension that characterizes learnability in the PAC setting, our dimension is rather simple and resembles the Littlestone dimension. We generalize our dimension to multiclass hypothesis classes and prove similar results in the realizable case. Finally, we study the case where the learner does not know the set of allowed perturbations for each point and only has some prior on them.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06787",
        "abs_url": "https://arxiv.org/abs/2602.06787",
        "pdf_url": "https://arxiv.org/pdf/2602.06787",
        "title": "Weisfeiler and Lehman Go Categorical",
        "authors": [
            "Seongjin Choi",
            "Gahee Kim",
            "Se-Young Yun"
        ],
        "comments": "Comments are welcome!",
        "subjects": "Machine Learning (cs.LG); Category Theory (math.CT)",
        "abstract": "While lifting map has significantly enhanced the expressivity of graph neural networks, extending this paradigm to hypergraphs remains fragmented. To address this, we introduce the categorical Weisfeiler-Lehman framework, which formalizes lifting as a functorial mapping from an arbitrary data category to the unifying category of graded posets. When applied to hypergraphs, this perspective allows us to systematically derive Hypergraph Isomorphism Networks, a family of neural architectures where the message passing topology is strictly determined by the choice of functor. We introduce two distinct functors from the category of hypergraphs: an incidence functor and a symmetric simplicial complex functor. While the incidence architecture structurally mirrors standard bipartite schemes, our functorial derivation enforces a richer information flow over the resulting poset, capturing complex intersection geometries often missed by existing methods. We theoretically characterize the expressivity of these models, proving that both the incidence-based and symmetric simplicial approaches subsume the expressive power of the standard Hypergraph Weisfeiler-Lehman test. Extensive experiments on real-world benchmarks validate these theoretical findings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06788",
        "abs_url": "https://arxiv.org/abs/2602.06788",
        "pdf_url": "https://arxiv.org/pdf/2602.06788",
        "title": "Displacement-Resistant Extensions of DPO with Nonconvex $f$-Divergences",
        "authors": [
            "Idan Pipano",
            "Shoham Sabach",
            "Kavosh Asadi",
            "Mohammad Ghavamzadeh"
        ],
        "comments": "Published as a conference paper at ICLR 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "DPO and related algorithms align language models by directly optimizing the RLHF objective: find a policy that maximizes the Bradley-Terry reward while staying close to a reference policy through a KL divergence penalty. Previous work showed that this approach could be further generalized: the original problem remains tractable even if the KL divergence is replaced by a family of $f$-divergence with a convex generating function $f$. Our first contribution is to show that convexity of $f$ is not essential. Instead, we identify a more general condition, referred to as DPO-inducing, that precisely characterizes when the RLHF problem remains tractable. Our next contribution is to establish a second condition on $f$ that is necessary to prevent probability displacement, a known empirical phenomenon in which the probabilities of the winner and the loser responses approach zero. We refer to any $f$ that satisfies this condition as displacement-resistant. We finally focus on a specific DPO-inducing and displacement-resistant $f$, leading to our novel SquaredPO loss. Compared to DPO, this new loss offers stronger theoretical guarantees while performing competitively in practice.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06791",
        "abs_url": "https://arxiv.org/abs/2602.06791",
        "pdf_url": "https://arxiv.org/pdf/2602.06791",
        "title": "Rare Event Analysis of Large Language Models",
        "authors": [
            "Jake McAllister Dorman",
            "Edward Gillman",
            "Dominic C. Rose",
            "Jamie F. Mair",
            "Juan P. Garrahan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Disordered Systems and Neural Networks (cond-mat.dis-nn); Statistical Mechanics (cond-mat.stat-mech)",
        "abstract": "Being probabilistic models, during inference large language models (LLMs) display rare events: behaviour that is far from typical but highly significant. By definition all rare events are hard to see, but the enormous scale of LLM usage means that events completely unobserved during development are likely to become prominent in deployment. Here we present an end-to-end framework for the systematic analysis of rare events in LLMs. We provide a practical implementation spanning theory, efficient generation strategies, probability estimation and error analysis, which we illustrate with concrete examples. We outline extensions and applications to other models and contexts, highlighting the generality of the concepts and techniques presented here.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06800",
        "abs_url": "https://arxiv.org/abs/2602.06800",
        "pdf_url": "https://arxiv.org/pdf/2602.06800",
        "title": "FlowDA: Accurate, Low-Latency Weather Data Assimilation via Flow Matching",
        "authors": [
            "Ran Cheng",
            "Lailai Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Data assimilation (DA) is a fundamental component of modern weather prediction, yet it remains a major computational bottleneck in machine learning (ML)-based forecasting pipelines due to reliance on traditional variational methods. Recent generative ML-based DA methods offer a promising alternative but typically require many sampling steps and suffer from error accumulation under long-horizon auto-regressive rollouts with cycling assimilation. We propose FlowDA, a low-latency weather-scale generative DA framework based on flow matching. FlowDA conditions on observations through a SetConv-based embedding and fine-tunes the Aurora foundation model to deliver accurate, efficient, and robust analyses. Experiments across observation rates decreasing from $3.9\\%$ to $0.1\\%$ demonstrate superior performance of FlowDA over strong baselines with similar tunable-parameter size. FlowDA further shows robustness to observational noise and stable performance in long-horizon auto-regressive cycling DA. Overall, FlowDA points to an efficient and scalable direction for data-driven DA.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06810",
        "abs_url": "https://arxiv.org/abs/2602.06810",
        "pdf_url": "https://arxiv.org/pdf/2602.06810",
        "title": "Calibrating Tabular Anomaly Detection via Optimal Transport",
        "authors": [
            "Hangting Ye",
            "He Zhao.Wei Fan",
            "Xiaozhuang Song",
            "Dandan Guo",
            "Yi Chang",
            "Hongyuan Zha"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Tabular anomaly detection (TAD) remains challenging due to the heterogeneity of tabular data: features lack natural relationships, vary widely in distribution and scale, and exhibit diverse types. Consequently, each TAD method makes implicit assumptions about anomaly patterns that work well on some datasets but fail on others, and no method consistently outperforms across diverse scenarios. We present CTAD (Calibrating Tabular Anomaly Detection), a model-agnostic post-processing framework that enhances any existing TAD detector through sample-specific calibration. Our approach characterizes normal data via two complementary distributions, i.e., an empirical distribution from random sampling and a structural distribution from K-means centroids, and measures how adding a test sample disrupts their compatibility using Optimal Transport (OT) distance. Normal samples maintain low disruption while anomalies cause high disruption, providing a calibration signal to amplify detection. We prove that OT distance has a lower bound proportional to the test sample's distance from centroids, and establish that anomalies systematically receive higher calibration scores than normals in expectation, explaining why the method generalizes across datasets. Extensive experiments on 34 diverse tabular datasets with 7 representative detectors spanning all major TAD categories (density estimation, classification, reconstruction, and isolation-based methods) demonstrate that CTAD consistently improves performance with statistical significance. Remarkably, CTAD enhances even state-of-the-art deep learning methods and shows robust performance across diverse hyperparameter settings, requiring no additional tuning for practical deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06837",
        "abs_url": "https://arxiv.org/abs/2602.06837",
        "pdf_url": "https://arxiv.org/pdf/2602.06837",
        "title": "Learning Deep Hybrid Models with Sharpness-Aware Minimization",
        "authors": [
            "Naoya Takeishi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Hybrid modeling, the combination of machine learning models and scientific mathematical models, enables flexible and robust data-driven prediction with partial interpretability. However, effectively the scientific models may be ignored in prediction due to the flexibility of the machine learning model, making the idea of hybrid modeling pointless. Typically some regularization is applied to hybrid model learning to avoid such a failure case, but the formulation of the regularizer strongly depends on model architectures and domain knowledge. In this paper, we propose to focus on the flatness of loss minima in learning hybrid models, aiming to make the model as simple as possible. We employ the idea of sharpness-aware minimization and adapt it to the hybrid modeling setting. Numerical experiments show that the SAM-based method works well across different choices of models and datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06849",
        "abs_url": "https://arxiv.org/abs/2602.06849",
        "pdf_url": "https://arxiv.org/pdf/2602.06849",
        "title": "Improved Sampling Schedules for Discrete Diffusion Models",
        "authors": [
            "Alberto Foresti",
            "Mustapha Bounoua",
            "Giulio Franzese",
            "Luca Ambrogioni",
            "Pietro Michiardi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Discrete diffusion models have emerged as a powerful paradigm for generative modeling on sequence data; however, the information-theoretic principles governing their reverse processes remain significantly less understood than those of their continuous counterparts. In this work, we bridge this gap by analyzing the reverse process dynamics through the lens of thermodynamic entropy production. We propose the entropy production rate as a rigorous proxy for quantifying information generation, deriving as a byproduct a bound on the Wasserstein distance between intermediate states and the data distribution. Leveraging these insights, we introduce two novel sampling schedules that are uniformly spaced with respect to their corresponding physics-inspired metrics: the Entropic Discrete Schedule (EDS), which is defined by maintaining a constant rate of information gain, and the Wasserstein Discrete Schedule (WDS), which is defined by taking equal steps in terms of the Wasserstein distance. We empirically demonstrate that our proposed schedules significantly outperform state-of-the-art strategies across diverse application domains, including synthetic data, music notation, vision and language modeling, consistently achieving superior performance at a lower computational budget.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06858",
        "abs_url": "https://arxiv.org/abs/2602.06858",
        "pdf_url": "https://arxiv.org/pdf/2602.06858",
        "title": "Designing a Robust, Bounded, and Smooth Loss Function for Improved Supervised Learning",
        "authors": [
            "Soumi Mahato",
            "Lineesh M.C"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The loss function is crucial to machine learning, especially in supervised learning frameworks. It is a fundamental component that controls the behavior and general efficacy of learning algorithms. However, despite their widespread use, traditional loss functions have significant drawbacks when dealing with high-dimensional and outlier-sensitive datasets, which frequently results in reduced performance and slower convergence during training. In this work, we develop a robust, bounded, and smooth (RoBoS-NN) loss function to resolve the aforementioned hindrances. The generalization ability of the loss function has also been theoretically analyzed to rigorously justify its robustness. Moreover, we implement RoboS-NN loss in the framework of a neural network (NN) to forecast time series and present a new robust algorithm named $\\mathcal{L}_{\\text{RoBoS}}$-NN. To assess the potential of $\\mathcal{L}_{\\text{RoBoS}}$-NN, we conduct experiments on multiple real-world datasets. In addition, we infuse outliers into data sets to evaluate the performance of $\\mathcal{L}_{\\text{RoBoS}}$-NN in more challenging scenarios. Numerical results show that $\\mathcal{L}_{\\text{RoBoS}}$-NN outperforms the other benchmark models in terms of accuracy measures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06866",
        "abs_url": "https://arxiv.org/abs/2602.06866",
        "pdf_url": "https://arxiv.org/pdf/2602.06866",
        "title": "T-STAR: A Context-Aware Transformer Framework for Short-Term Probabilistic Demand Forecasting in Dock-Based Shared Micro-Mobility",
        "authors": [
            "Jingyi Cheng",
            "Gonçalo Homem de Almeida Correia",
            "Oded Cats",
            "Shadi Sharif Azadeh"
        ],
        "comments": "This work has been submitted to Transportation Research Part C",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reliable short-term demand forecasting is essential for managing shared micro-mobility services and ensuring responsive, user-centered operations. This study introduces T-STAR (Two-stage Spatial and Temporal Adaptive contextual Representation), a novel transformer-based probabilistic framework designed to forecast station-level bike-sharing demand at a 15-minute resolution. T-STAR addresses key challenges in high-resolution forecasting by disentangling consistent demand patterns from short-term fluctuations through a hierarchical two-stage structure. The first stage captures coarse-grained hourly demand patterns, while the second stage improves prediction accuracy by incorporating high-frequency, localized inputs, including recent fluctuations and real-time demand variations in connected metro services, to account for temporal shifts in short-term demand. Time series transformer models are employed in both stages to generate probabilistic predictions. Extensive experiments using Washington D.C.'s Capital Bikeshare data demonstrate that T-STAR outperforms existing methods in both deterministic and probabilistic accuracy. The model exhibits strong spatial and temporal robustness across stations and time periods. A zero-shot forecasting experiment further highlights T-STAR's ability to transfer to previously unseen service areas without retraining. These results underscore the framework's potential to deliver granular, reliable, and uncertainty-aware short-term demand forecasts, which enable seamless integration to support multimodal trip planning for travelers and enhance real-time operations in shared micro-mobility services.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06880",
        "abs_url": "https://arxiv.org/abs/2602.06880",
        "pdf_url": "https://arxiv.org/pdf/2602.06880",
        "title": "Decoupling Variance and Scale-Invariant Updates in Adaptive Gradient Descent for Unified Vector and Matrix Optimization",
        "authors": [
            "Zitao Song",
            "Cedar Site Bai",
            "Zhe Zhang",
            "Brian Bullins",
            "David F. Gleich"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Adaptive methods like Adam have become the $\\textit{de facto}$ standard for large-scale vector and Euclidean optimization due to their coordinate-wise adaptation with a second-order nature. More recently, matrix-based spectral optimizers like Muon (Jordan et al., 2024b) show the power of treating weight matrices as matrices rather than long vectors. Linking these is hard because many natural generalizations are not feasible to implement, and we also cannot simply move the Adam adaptation to the matrix spectrum. To address this, we reformulate the AdaGrad update and decompose it into a variance adaptation term and a scale-invariant term. This decoupling produces $\\textbf{DeVA}$ ($\\textbf{De}$coupled $\\textbf{V}$ariance $\\textbf{A}$daptation), a framework that bridges between vector-based variance adaptation and matrix spectral optimization, enabling a seamless transition from Adam to adaptive spectral descent. Extensive experiments across language modeling and image classification demonstrate that DeVA consistently outperforms state-of-the-art methods such as Muon and SOAP (Vyas et al., 2024), reducing token usage by around 6.6\\%. Theoretically, we show that the variance adaptation term effectively improves the blockwise smoothness, facilitating faster convergence. Our implementation is available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06884",
        "abs_url": "https://arxiv.org/abs/2602.06884",
        "pdf_url": "https://arxiv.org/pdf/2602.06884",
        "title": "A Cycle-Consistent Graph Surrogate for Full-Cycle Left Ventricular Myocardial Biomechanics",
        "authors": [
            "Siyu Mu",
            "Wei Xuan Chan",
            "Choon Hwai Yap"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Image-based patient-specific simulation of left ventricular (LV) mechanics is valuable for understanding cardiac function and supporting clinical intervention planning, but conventional finite-element analysis (FEA) is computationally intensive. Current graph-based surrogates do not have full-cycle prediction capabilities, and physics-informed neural networks often struggle to converge on complex cardiac geometries. We present CardioGraphFENet (CGFENet), a unified graph-based surrogate for rapid full-cycle estimation of LV myocardial biomechanics, supervised by a large FEA simulation dataset. The proposed model integrates (i) a global--local graph encoder to capture mesh features with weak-form-inspired global coupling, (ii) a gated recurrent unit-based temporal encoder conditioned on the target volume-time signal to model cycle-coherent dynamics, and (iii) a cycle-consistent bidirectional formulation for both loading and inverse unloading within a single framework. These strategies enable high fidelity with respect to traditional FEA ground truths and produce physiologically plausible pressure-volume loops that match FEA results when coupled with a lumped-parameter model. In particular, the cycle-consistency strategy enables a significant reduction in FEA supervision with only minimal loss in accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06899",
        "abs_url": "https://arxiv.org/abs/2602.06899",
        "pdf_url": "https://arxiv.org/pdf/2602.06899",
        "title": "Sample Complexity of Causal Identification with Temporal Heterogeneity",
        "authors": [
            "Ameya Rathod",
            "Sujay Belsare",
            "Salvik Krishna Nautiyal",
            "Dhruv Laad",
            "Ponnurangam Kumaraguru"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Recovering a unique causal graph from observational data is an ill-posed problem because multiple generating mechanisms can lead to the same observational distribution. This problem becomes solvable only by exploiting specific structural or distributional assumptions. While recent work has separately utilized time-series dynamics or multi-environment heterogeneity to constrain this problem, we integrate both as complementary sources of heterogeneity. This integration yields unified necessary identifiability conditions and enables a rigorous analysis of the statistical limits of recovery under thin versus heavy-tailed noise. In particular, temporal structure is shown to effectively substitute for missing environmental diversity, possibly achieving identifiability even under insufficient heterogeneity. Extending this analysis to heavy-tailed (Student's t) distributions, we demonstrate that while geometric identifiability conditions remain invariant, the sample complexity diverges significantly from the Gaussian baseline. Explicit information-theoretic bounds quantify this cost of robustness, establishing the fundamental limits of covariance-based causal graph recovery methods in realistic non-stationary systems. This work shifts the focus from whether causal structure is identifiable to whether it is statistically recoverable in practice.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06900",
        "abs_url": "https://arxiv.org/abs/2602.06900",
        "pdf_url": "https://arxiv.org/pdf/2602.06900",
        "title": "Supercharging Simulation-Based Inference for Bayesian Optimal Experimental Design",
        "authors": [
            "Samuel Klein",
            "Willie Neiswanger",
            "Daniel Ratner",
            "Michael Kagan",
            "Sean Gasiorowski"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Information Theory (cs.IT); Neural and Evolutionary Computing (cs.NE); Machine Learning (stat.ML)",
        "abstract": "Bayesian optimal experimental design (BOED) seeks to maximize the expected information gain (EIG) of experiments. This requires a likelihood estimate, which in many settings is intractable. Simulation-based inference (SBI) provides powerful tools for this regime. However, existing work explicitly connecting SBI and BOED is restricted to a single contrastive EIG bound. We show that the EIG admits multiple formulations which can directly leverage modern SBI density estimators, encompassing neural posterior, likelihood, and ratio estimation. Building on this perspective, we define a novel EIG estimator using neural likelihood estimation. Further, we identify optimization as a key bottleneck of gradient based EIG maximization and show that a simple multi-start parallel gradient ascent procedure can substantially improve reliability and performance. With these innovations, our SBI-based BOED methods are able to match or outperform by up to $22\\%$ existing state-of-the-art approaches across standard BOED benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06902",
        "abs_url": "https://arxiv.org/abs/2602.06902",
        "pdf_url": "https://arxiv.org/pdf/2602.06902",
        "title": "Parameter-free Dynamic Regret: Time-varying Movement Costs, Delayed Feedback, and Memory",
        "authors": [
            "Emmanuel Esposito",
            "Andrew Jacobsen",
            "Hao Qiu",
            "Mengxiao Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "In this paper, we study dynamic regret in unconstrained online convex optimization (OCO) with movement costs. Specifically, we generalize the standard setting by allowing the movement cost coefficients $\\lambda_t$ to vary arbitrarily over time. Our main contribution is a novel algorithm that establishes the first comparator-adaptive dynamic regret bound for this setting, guaranteeing $\\widetilde{\\mathcal{O}}(\\sqrt{(1+P_T)(T+\\sum_t \\lambda_t)})$ regret, where $P_T$ is the path length of the comparator sequence over $T$ rounds. This recovers the optimal guarantees for both static and dynamic regret in standard OCO as a special case where $\\lambda_t=0$ for all rounds. To demonstrate the versatility of our results, we consider two applications: OCO with delayed feedback and OCO with time-varying memory. We show that both problems can be translated into time-varying movement costs, establishing a novel reduction specifically for the delayed feedback setting that is of independent interest. A crucial observation is that the first-order dependence on movement costs in our regret bound plays a key role in enabling optimal comparator-adaptive dynamic regret guarantees in both settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06907",
        "abs_url": "https://arxiv.org/abs/2602.06907",
        "pdf_url": "https://arxiv.org/pdf/2602.06907",
        "title": "A first realization of reinforcement learning-based closed-loop EEG-TMS",
        "authors": [
            "Dania Humaidan",
            "Jiahua Xu",
            "Jing Chen",
            "Christoph Zrenner",
            "David Emanuel Vetter",
            "Laura Marzetti",
            "Paolo Belardinelli",
            "Timo Roine",
            "Risto J. Ilmoniemi",
            "Gian Luca Romani",
            "Ulf Zieman"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Background: Transcranial magnetic stimulation (TMS) is a powerful tool to investigate neurophysiology of the human brain and treat brain disorders. Traditionally, therapeutic TMS has been applied in a one-size-fits-all approach, disregarding inter- and intra-individual differences. Brain state-dependent EEG-TMS, such as coupling TMS with a pre-specified phase of the sensorimotor mu-rhythm, enables the induction of differential neuroplastic effects depending on the targeted phase. But this approach is still user-dependent as it requires defining an a-priori target phase. Objectives: To present a first realization of a machine-learning-based, closed-loop real-time EEG-TMS setup to identify user-independently the individual mu-rhythm phase associated with high- vs. low-corticospinal excitability states. Methods: We applied EEG-TMS to 25 participants targeting the supplementary motor area-primary motor cortex network and used a reinforcement learning algorithm to identify the mu-rhythm phase associated with high- vs. low corticospinal excitability. We employed linear mixed effects models and Bayesian analysis to determine effects of reinforced learning on corticospinal excitability indexed by motor evoked potential amplitude, and functional connectivity indexed by the imaginary part of resting-state EEG coherence. Results: Reinforcement learning effectively identified the mu-rhythm phase associated with high- vs. low-excitability states, and their repetitive stimulation resulted in long-term increases vs. decreases in functional connectivity in the stimulated sensorimotor network. Conclusions: We demonstrated for the first time the feasibility of closed-loop EEG-TMS in humans, a critical step towards individualized treatment of brain disorders.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06909",
        "abs_url": "https://arxiv.org/abs/2602.06909",
        "pdf_url": "https://arxiv.org/pdf/2602.06909",
        "title": "Revisiting the Generic Transformer: Deconstructing a Strong Baseline for Time Series Foundation Models",
        "authors": [
            "Yunshi Wen",
            "Wesley M. Gifford",
            "Chandra Reddy",
            "Lam M. Nguyen",
            "Jayant Kalagnanam",
            "Anak Agung Julius"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The recent surge in Time Series Foundation Models has rapidly advanced the field, yet the heterogeneous training setups across studies make it difficult to attribute improvements to architectural innovations versus data engineering. In this work, we investigate the potential of a standard patch Transformer, demonstrating that this generic architecture achieves state-of-the-art zero-shot forecasting performance using a straightforward training protocol. We conduct a comprehensive ablation study that covers model scaling, data composition, and training techniques to isolate the essential ingredients for high performance. Our findings identify the key drivers of performance, while confirming that the generic architecture itself demonstrates excellent scalability. By strictly controlling these variables, we provide comprehensive empirical results on model scaling across multiple dimensions. We release our open-source model and detailed findings to establish a transparent, reproducible baseline for future research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06924",
        "abs_url": "https://arxiv.org/abs/2602.06924",
        "pdf_url": "https://arxiv.org/pdf/2602.06924",
        "title": "Robustness Beyond Known Groups with Low-rank Adaptation",
        "authors": [
            "Abinitha Gourabathina",
            "Hyewon Jeong",
            "Teya Bergamaschi",
            "Marzyeh Ghassemi",
            "Collin Stultz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep learning models trained to optimize average accuracy often exhibit systematic failures on particular subpopulations. In real world settings, the subpopulations most affected by such disparities are frequently unlabeled or unknown, thereby motivating the development of methods that are performant on sensitive subgroups without being pre-specified. However, existing group-robust methods typically assume prior knowledge of relevant subgroups, using group annotations for training or model selection. We propose Low-rank Error Informed Adaptation (LEIA), a simple two-stage method that improves group robustness by identifying a low-dimensional subspace in the representation space where model errors concentrate. LEIA restricts adaptation to this error-informed subspace via a low-rank adjustment to the classifier logits, directly targeting latent failure modes without modifying the backbone or requiring group labels. Using five real-world datasets, we analyze group robustness under three settings: (1) truly no knowledge of subgroup relevance, (2) partial knowledge of subgroup relevance, and (3) full knowledge of subgroup relevance. Across all settings, LEIA consistently improves worst-group performance while remaining fast, parameter-efficient, and robust to hyperparameter choice.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06930",
        "abs_url": "https://arxiv.org/abs/2602.06930",
        "pdf_url": "https://arxiv.org/pdf/2602.06930",
        "title": "Continuous-time reinforcement learning: ellipticity enables model-free value function approximation",
        "authors": [
            "Wenlong Mou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Statistics Theory (math.ST); Machine Learning (stat.ML)",
        "abstract": "We study off-policy reinforcement learning for controlling continuous-time Markov diffusion processes with discrete-time observations and actions. We consider model-free algorithms with function approximation that learn value and advantage functions directly from data, without unrealistic structural assumptions on the dynamics. Leveraging the ellipticity of the diffusions, we establish a new class of Hilbert-space positive definiteness and boundedness properties for the Bellman operators. Based on these properties, we propose the Sobolev-prox fitted $q$-learning algorithm, which learns value and advantage functions by iteratively solving least-squares regression problems. We derive oracle inequalities for the estimation error, governed by (i) the best approximation error of the function classes, (ii) their localized complexity, (iii) exponentially decaying optimization error, and (iv) numerical discretization error. These results identify ellipticity as a key structural property that renders reinforcement learning with function approximation for Markov diffusions no harder than supervised learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06932",
        "abs_url": "https://arxiv.org/abs/2602.06932",
        "pdf_url": "https://arxiv.org/pdf/2602.06932",
        "title": "When RL Meets Adaptive Speculative Training: A Unified Training-Serving System",
        "authors": [
            "Junxiong Wang",
            "Fengxiang Bie",
            "Jisen Li",
            "Zhongzhu Zhou",
            "Zelei Shao",
            "Yubo Wang",
            "Yinghui Liu",
            "Qingyang Wu",
            "Avner May",
            "Sri Yanamandra",
            "Yineng Zhang",
            "Ce Zhang",
            "Tri Dao",
            "Percy Liang",
            "Ben Athiwaratkun",
            "Shuaiwen Leon Song",
            "Chenfeng Xu",
            "Xiaoxia Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Speculative decoding can significantly accelerate LLM serving, yet most deployments today disentangle speculator training from serving, treating speculator training as a standalone offline modeling problem. We show that this decoupled formulation introduces substantial deployment and adaptation lag: (1) high time-to-serve, since a speculator must be trained offline for a considerable period before deployment; (2) delayed utility feedback, since the true end-to-end decoding speedup is only known after training and cannot be inferred reliably from acceptance rate alone due to model-architecture and system-level overheads; and (3) domain-drift degradation, as the target model is repurposed to new domains and the speculator becomes stale and less effective. To address these issues, we present Aurora, a unified training-serving system that closes the loop by continuously learning a speculator directly from live inference traces. Aurora reframes online speculator learning as an asynchronous reinforcement-learning problem: accepted tokens provide positive feedback, while rejected speculator proposals provide implicit negative feedback that we exploit to improve sample efficiency. Our design integrates an SGLang-based inference server with an asynchronous training server, enabling hot-swapped speculator updates without service interruption. Crucially, Aurora supports day-0 deployment: a speculator can be served immediately and rapidly adapted to live traffic, improving system performance while providing immediate utility feedback. Across experiments, Aurora achieves a 1.5x day-0 speedup on recently released frontier models (e.g., MiniMax M2.1 229B and Qwen3-Coder-Next 80B). Aurora also adapts effectively to distribution shifts in user traffic, delivering an additional 1.25x speedup over a well-trained but static speculator on widely used models (e.g., Qwen3 and Llama3).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06940",
        "abs_url": "https://arxiv.org/abs/2602.06940",
        "pdf_url": "https://arxiv.org/pdf/2602.06940",
        "title": "From Core to Detail: Unsupervised Disentanglement with Entropy-Ordered Flows",
        "authors": [
            "Daniel Galperin",
            "Ullrich Köthe"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Learning unsupervised representations that are both semantically meaningful and stable across runs remains a central challenge in modern representation learning. We introduce entropy-ordered flows (EOFlows), a normalizing-flow framework that orders latent dimensions by their explained entropy, analogously to PCA's explained variance. This ordering enables adaptive injective flows: after training, one may retain only the top C latent variables to form a compact core representation while the remaining variables capture fine-grained detail and noise, with C chosen flexibly at inference time rather than fixed during training. EOFlows build on insights from Independent Mechanism Analysis, Principal Component Flows and Manifold Entropic Metrics. We combine likelihood-based training with local Jacobian regularization and noise augmentation into a method that scales well to high-dimensional data such as images. Experiments on the CelebA dataset show that our method uncovers a rich set of semantically interpretable features, allowing for high compression and strong denoising.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06955",
        "abs_url": "https://arxiv.org/abs/2602.06955",
        "pdf_url": "https://arxiv.org/pdf/2602.06955",
        "title": "Improving Credit Card Fraud Detection with an Optimized Explainable Boosting Machine",
        "authors": [
            "Reza E. Fazel",
            "Arash Bakhtiary",
            "Siavash A. Bigdeli"
        ],
        "comments": "22 pages, 5 figures, 5 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Addressing class imbalance is a central challenge in credit card fraud detection, as it directly impacts predictive reliability in real-world financial systems. To overcome this, the study proposes an enhanced workflow based on the Explainable Boosting Machine (EBM)-a transparent, state-of-the-art implementation of the GA2M algorithm-optimized through systematic hyperparameter tuning, feature selection, and preprocessing refinement. Rather than relying on conventional sampling techniques that may introduce bias or cause information loss, the optimized EBM achieves an effective balance between accuracy and interpretability, enabling precise detection of fraudulent transactions while providing actionable insights into feature importance and interaction effects. Furthermore, the Taguchi method is employed to optimize both the sequence of data scalers and model hyperparameters, ensuring robust, reproducible, and systematically validated performance improvements. Experimental evaluation on benchmark credit card data yields an ROC-AUC of 0.983, surpassing prior EBM baselines (0.975) and outperforming Logistic Regression, Random Forest, XGBoost, and Decision Tree models. These results highlight the potential of interpretable machine learning and data-driven optimization for advancing trustworthy fraud analytics in financial systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2410.09771",
        "abs_url": "https://arxiv.org/abs/2410.09771",
        "pdf_url": "https://arxiv.org/pdf/2410.09771",
        "title": "EUGens: Efficient, Unified, and General Dense Layers",
        "authors": [
            "Sang Min Kim",
            "Byeongchan Kim",
            "Arijit Sehanobish",
            "Somnath Basu Roy Chowdhury",
            "Rahul Kidambi",
            "Dongseok Shim",
            "Avinava Dubey",
            "Snigdha Chaturvedi",
            "Min-hwan Oh",
            "Krzysztof Choromanski"
        ],
        "comments": "Neurips 2025",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Efficient neural networks are essential for scaling machine learning models to real-time applications and resource-constrained environments. Fully-connected feedforward layers (FFLs) introduce computation and parameter count bottlenecks within neural network architectures. To address this challenge, in this work, we propose a new class of dense layers that generalize standard fully-connected feedforward layers, \\textbf{E}fficient, \\textbf{U}nified and \\textbf{Gen}eral dense layers (EUGens). EUGens leverage random features to approximate standard FFLs and go beyond them by incorporating a direct dependence on the input norms in their computations. The proposed layers unify existing efficient FFL extensions and improve efficiency by reducing inference complexity from quadratic to linear time. They also lead to \\textbf{the first} unbiased algorithms approximating FFLs with arbitrary polynomial activation functions. Furthermore, EuGens reduce the parameter count and computational overhead while preserving the expressive power and adaptability of FFLs. We also present a layer-wise knowledge transfer technique that bypasses backpropagation, enabling efficient adaptation of EUGens to pre-trained models. Empirically, we observe that integrating EUGens into Transformers and MLPs yields substantial improvements in inference speed (up to \\textbf{27}\\%) and memory efficiency (up to \\textbf{30}\\%) across a range of tasks, including image classification, language model pre-training, and 3D scene reconstruction. Overall, our results highlight the potential of EUGens for the scalable deployment of large-scale neural networks in real-world scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06062",
        "abs_url": "https://arxiv.org/abs/2602.06062",
        "pdf_url": "https://arxiv.org/pdf/2602.06062",
        "title": "Deep Unfolded Fractional Optimization for Maximizing Robust Throughput in 6G Networks",
        "authors": [
            "Anh Thi Bui",
            "Robert-Jeron Reifert",
            "Hayssam Dahrouj",
            "Aydin Sezgin"
        ],
        "comments": "6 pages, 5 figures",
        "subjects": "Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "The sixth-generation (6G) of wireless communication networks aims to leverage artificial intelligence tools for efficient and robust network optimization. This is especially the case since traditional optimization methods often face high computational complexity, motivating the use of deep learning (DL)-based optimization frameworks. In this context, this paper considers a multi-antenna base station (BS) serving multiple users simultaneously through transmit beamforming in downlink mode. To account for robustness, this work proposes an uncertainty-injected deep unfolded fractional programming (UI-DUFP) framework for weighted sum rate (WSR) maximization under imperfect channel conditions. The proposed method unfolds fractional programming (FP) iterations into trainable neural network layers refined by projected gradient descent (PGD) steps, while robustness is introduced by injecting sampled channel uncertainties during training and optimizing a quantile-based objective. Simulation results show that the proposed UI-DUFP achieves higher WSR and improved robustness compared to classical weighted minimum mean square error, FP, and DL baselines, while maintaining low inference time and good scalability. These findings highlight the potential of deep unfolding combined with uncertainty-aware training as a powerful approach for robust optimization in 6G networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06065",
        "abs_url": "https://arxiv.org/abs/2602.06065",
        "pdf_url": "https://arxiv.org/pdf/2602.06065",
        "title": "Deep networks learn to parse uniform-depth context-free languages from local statistics",
        "authors": [
            "Jack T. Parley",
            "Francesco Cagnetta",
            "Matthieu Wyart"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Disordered Systems and Neural Networks (cond-mat.dis-nn); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Understanding how the structure of language can be learned from sentences alone is a central question in both cognitive science and machine learning. Studies of the internal representations of Large Language Models (LLMs) support their ability to parse text when predicting the next word, while representing semantic notions independently of surface form. Yet, which data statistics make these feats possible, and how much data is required, remain largely unknown. Probabilistic context-free grammars (PCFGs) provide a tractable testbed for studying these questions. However, prior work has focused either on the post-hoc characterization of the parsing-like algorithms used by trained networks; or on the learnability of PCFGs with fixed syntax, where parsing is unnecessary. Here, we (i) introduce a tunable class of PCFGs in which both the degree of ambiguity and the correlation structure across scales can be controlled; (ii) provide a learning mechanism -- an inference algorithm inspired by the structure of deep convolutional networks -- that links learnability and sample complexity to specific language statistics; and (iii) validate our predictions empirically across deep convolutional and transformer-based architectures. Overall, we propose a unifying framework where correlations at different scales lift local ambiguities, enabling the emergence of hierarchical representations of the data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06072",
        "abs_url": "https://arxiv.org/abs/2602.06072",
        "pdf_url": "https://arxiv.org/pdf/2602.06072",
        "title": "PackInfer: Compute- and I/O-Efficient Attention for Batched LLM Inference",
        "authors": [
            "Rui Ning",
            "Wei Zhang",
            "Fan Lai"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "Attention efficiency is critical to large language model (LLM) inference. While prior advances optimize attention execution for individual requests (e.g., FlashAttention), production LLM serving relies on batching requests with highly heterogeneous sequence lengths for high serving throughput. This mismatch induces severe computation and I/O imbalance, exacerbates stragglers, and underutilizes GPU resources. We present PackInfer, a kernel-level attention framework that enables compute- and I/O-aware execution for heterogeneous batched inference. PackInfer orchestrates batched requests into load-balanced execution groups, effectively saturating GPU utilization by packing multiple requests into unified kernel launches. By constructing attention kernels directly over packed query-key regions, PackInfer eliminates redundant computation and balances thread-block execution. It then incorporates I/O-aware grouping that co-locates shared-prefix requests and reorganizes KV caches into group-contiguous layouts, reducing memory fragmentation and redundant data movement as generation evolves. Evaluations on real-world workloads show that PackInfer reduces inference latency by 13.0-20.1%, and improves throughput by 20% compared to the state-of-the-art FlashAttention.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06079",
        "abs_url": "https://arxiv.org/abs/2602.06079",
        "pdf_url": "https://arxiv.org/pdf/2602.06079",
        "title": "Canzona: A Unified, Asynchronous, and Load-Balanced Framework for Distributed Matrix-based Optimizers",
        "authors": [
            "Liangyu Wang",
            "Siqi Zhang",
            "Junjie Wang",
            "Yiming Dong",
            "Bo Zheng",
            "Zihan Qiu",
            "Shengkun Tang",
            "Di Wang",
            "Rui Men",
            "Dayiheng Liu"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "The scaling of Large Language Models (LLMs) drives interest in matrix-based optimizers (e.g., Shampoo, Muon, SOAP) for their convergence efficiency; yet their requirement for holistic updates conflicts with the tensor fragmentation in distributed frameworks like Megatron. Existing solutions are suboptimal: synchronous approaches suffer from computational redundancy, while layer-wise partitioning fails to reconcile this conflict without violating the geometric constraints of efficient communication primitives. To bridge this gap, we propose Canzona, a Unified, Asynchronous, and Load-Balanced framework that decouples logical optimizer assignment from physical parameter distribution. For Data Parallelism, we introduce an alpha-Balanced Static Partitioning strategy that respects atomicity while neutralizing the load imbalance. For Tensor Parallelism, we design an Asynchronous Compute pipeline utilizing Micro-Group Scheduling to batch fragmented updates and hide reconstruction overhead. Extensive evaluations on the Qwen3 model family (up to 32B parameters) on 256 GPUs demonstrate that our approach preserves the efficiency of established parallel architectures, achieving a 1.57x speedup in end-to-end iteration time and reducing optimizer step latency by 5.8x compared to the baseline.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06105",
        "abs_url": "https://arxiv.org/abs/2602.06105",
        "pdf_url": "https://arxiv.org/pdf/2602.06105",
        "title": "Algebraic Robustness Verification of Neural Networks",
        "authors": [
            "Yulia Alexandr",
            "Hao Duan",
            "Guido Montúfar"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Algebraic Geometry (math.AG)",
        "abstract": "We formulate formal robustness verification of neural networks as an algebraic optimization problem. We leverage the Euclidean Distance (ED) degree, which is the generic number of complex critical points of the distance minimization problem to a classifier's decision boundary, as an architecture-dependent measure of the intrinsic complexity of robustness verification. To make this notion operational, we define the associated ED discriminant, which characterizes input points at which the number of real critical points changes, distinguishing test instances that are easier or harder to verify. We provide an explicit algorithm for computing this discriminant. We further introduce the parameter discriminant of a neural network, identifying parameters where the ED degree drops and the decision boundary exhibits reduced algebraic complexity. We derive closed-form expressions for the ED degree for several classes of neural architectures, as well as formulas for the expected number of real critical points in the infinite-width limit. Finally, we present an exact robustness certification algorithm based on numerical homotopy continuation, establishing a concrete link between metric algebraic geometry and neural network verification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06137",
        "abs_url": "https://arxiv.org/abs/2602.06137",
        "pdf_url": "https://arxiv.org/pdf/2602.06137",
        "title": "Warm Starts, Cold States: Exploiting Adiabaticity for Variational Ground-States",
        "authors": [
            "Ricard Puig",
            "Berta Casas",
            "Alba Cervera-Lierta",
            "Zoë Holmes",
            "Adrián Pérez-Salinas"
        ],
        "comments": "11 + 24 pages, 3 figures",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Reliable preparation of many-body ground states is an essential task in quantum computing, with applications spanning areas from chemistry and materials modeling to quantum optimization and benchmarking. A variety of approaches have been proposed to tackle this problem, including variational methods. However, variational training often struggle to navigate complex energy landscapes, frequently encountering suboptimal local minima or suffering from barren plateaus. In this work, we introduce an iterative strategy for ground-state preparation based on a stepwise (discretized) Hamiltonian deformation. By complementing the Variational Quantum Eigensolver (VQE) with adiabatic principles, we demonstrate that solving a sequence of intermediate problems facilitates tracking the ground-state manifold toward the target system, even as we scale the system size. We provide a rigorous theoretical foundation for this approach, proving a lower bound on the loss variance that suggests trainability throughout the deformation, provided the system remains away from gap closings. Numerical simulations, including the effects of shot noise, confirm that this path-dependent tracking consistently converges to the target ground state.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06172",
        "abs_url": "https://arxiv.org/abs/2602.06172",
        "pdf_url": "https://arxiv.org/pdf/2602.06172",
        "title": "Know Your Scientist: KYC as Biosecurity Infrastructure",
        "authors": [
            "Jonathan Feldman",
            "Tal Feldman",
            "Annie I Anton"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Computers and Society (cs.CY); Machine Learning (cs.LG)",
        "abstract": "Biological AI tools for protein design and structure prediction are advancing rapidly, creating dual-use risks that existing safeguards cannot adequately address. Current model-level restrictions, including keyword filtering, output screening, and content-based access denials, are fundamentally ill-suited to biology, where reliable function prediction remains beyond reach and novel threats evade detection by design. We propose a three-tier Know Your Customer (KYC) framework, inspired by anti-money laundering (AML) practices in the financial sector, that shifts governance from content inspection to user verification and monitoring. Tier I leverages research institutions as trust anchors to vouch for affiliated researchers and assume responsibility for vetting. Tier II applies output screening through sequence homology searches and functional annotation. Tier III monitors behavioral patterns to detect anomalies inconsistent with declared research purposes. This layered approach preserves access for legitimate researchers while raising the cost of misuse through institutional accountability and traceability. The framework can be implemented immediately using existing institutional infrastructure, requiring no new legislation or regulatory mandates.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06176",
        "abs_url": "https://arxiv.org/abs/2602.06176",
        "pdf_url": "https://arxiv.org/pdf/2602.06176",
        "title": "Large Language Model Reasoning Failures",
        "authors": [
            "Peiyang Song",
            "Pengrui Han",
            "Noah Goodman"
        ],
        "comments": "Repository: this https URL. Published at TMLR 2026 with Survey Certification",
        "subjects": "Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) have exhibited remarkable reasoning capabilities, achieving impressive results across a wide range of tasks. Despite these advances, significant reasoning failures persist, occurring even in seemingly simple scenarios. To systematically understand and address these shortcomings, we present the first comprehensive survey dedicated to reasoning failures in LLMs. We introduce a novel categorization framework that distinguishes reasoning into embodied and non-embodied types, with the latter further subdivided into informal (intuitive) and formal (logical) reasoning. In parallel, we classify reasoning failures along a complementary axis into three types: fundamental failures intrinsic to LLM architectures that broadly affect downstream tasks; application-specific limitations that manifest in particular domains; and robustness issues characterized by inconsistent performance across minor variations. For each reasoning failure, we provide a clear definition, analyze existing studies, explore root causes, and present mitigation strategies. By unifying fragmented research efforts, our survey provides a structured perspective on systemic weaknesses in LLM reasoning, offering valuable insights and guiding future research towards building stronger, more reliable, and robust reasoning capabilities. We additionally release a comprehensive collection of research works on LLM reasoning failures, as a GitHub repository at this https URL, to provide an easy entry point to this area.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06214",
        "abs_url": "https://arxiv.org/abs/2602.06214",
        "pdf_url": "https://arxiv.org/pdf/2602.06214",
        "title": "Addressing the Waypoint-Action Gap in End-to-End Autonomous Driving via Vehicle Motion Models",
        "authors": [
            "Jorge Daniel Rodríguez-Vidal",
            "Gabriel Villalonga",
            "Diego Porres",
            "Antonio M. López Peña"
        ],
        "comments": "8 pages, 3 figures",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "End-to-End Autonomous Driving (E2E-AD) systems are typically grouped by the nature of their outputs: (i) waypoint-based models that predict a future trajectory, and (ii) action-based models that directly output throttle, steer and brake. Most recent benchmark protocols and training pipelines are waypoint-based, which makes action-based policies harder to train and compare, slowing their progress. To bridge this waypoint-action gap, we propose a novel, differentiable vehicle-model framework that rolls out predicted action sequences to their corresponding ego-frame waypoint trajectories while supervising in waypoint space. Our approach enables action-based architectures to be trained and evaluated, for the first time, within waypoint-based benchmarks without modifying the underlying evaluation protocol. We extensively evaluate our framework across multiple challenging benchmarks and observe consistent improvements over the baselines. In particular, on NAVSIM \\texttt{navhard} our approach achieves state-of-the-art performance. Our code will be made publicly available upon acceptance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06227",
        "abs_url": "https://arxiv.org/abs/2602.06227",
        "pdf_url": "https://arxiv.org/pdf/2602.06227",
        "title": "Do It for HER: First-Order Temporal Logic Reward Specification in Reinforcement Learning (Extended Version)",
        "authors": [
            "Pierriccardo Olivieri",
            "Fausto Lasca",
            "Alessandro Gianola",
            "Matteo Papini"
        ],
        "comments": "This is the extended version of a paper accepted at AAAI 2026",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Logic in Computer Science (cs.LO)",
        "abstract": "In this work, we propose a novel framework for the logical specification of non-Markovian rewards in Markov Decision Processes (MDPs) with large state spaces. Our approach leverages Linear Temporal Logic Modulo Theories over finite traces (LTLfMT), a more expressive extension of classical temporal logic in which predicates are first-order formulas of arbitrary first-order theories rather than simple Boolean variables. This enhanced expressiveness enables the specification of complex tasks over unstructured and heterogeneous data domains, promoting a unified and reusable framework that eliminates the need for manual predicate encoding. However, the increased expressive power of LTLfMT introduces additional theoretical and computational challenges compared to standard LTLf specifications. We address these challenges from a theoretical standpoint, identifying a fragment of LTLfMT that is tractable but sufficiently expressive for reward specification in an infinite-state-space context. From a practical perspective, we introduce a method based on reward machines and Hindsight Experience Replay (HER) to translate first-order logic specifications and address reward sparsity. We evaluate this approach to a continuous-control setting using Non-Linear Arithmetic Theory, showing that it enables natural specification of complex tasks. Experimental results show how a tailored implementation of HER is fundamental in solving tasks with complex goals.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06245",
        "abs_url": "https://arxiv.org/abs/2602.06245",
        "pdf_url": "https://arxiv.org/pdf/2602.06245",
        "title": "Inheritance Between Feedforward and Convolutional Networks via Model Projection",
        "authors": [
            "Nicolas Ewen",
            "Jairo Diaz-Rodriguez",
            "Kelly Ramsay"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Techniques for feedforward networks (FFNs) and convolutional networks (CNNs) are frequently reused across families, but the relationship between the underlying model classes is rarely made explicit. We introduce a unified node-level formalization with tensor-valued activations and show that generalized feedforward networks form a strict subset of generalized convolutional networks. Motivated by the mismatch in per-input parameterization between the two families, we propose model projection, a parameter-efficient transfer learning method for CNNs that freezes pretrained per-input-channel filters and learns a single scalar gate for each (output channel, input channel) contribution. Projection keeps all convolutional layers adaptable to downstream tasks while substantially reducing the number of trained parameters in convolutional layers. We prove that projected nodes take the generalized FFN form, enabling projected CNNs to inherit feedforward techniques that do not rely on homogeneous layer inputs. Experiments across multiple ImageNet-pretrained backbones and several downstream image classification datasets show that model projection is a strong transfer learning baseline under simple training recipes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06268",
        "abs_url": "https://arxiv.org/abs/2602.06268",
        "pdf_url": "https://arxiv.org/pdf/2602.06268",
        "title": "MPIB: A Benchmark for Medical Prompt Injection Attacks and Clinical Safety in LLMs",
        "authors": [
            "Junhyeok Lee",
            "Han Jang",
            "Kyu Sung Choi"
        ],
        "comments": "13 pages, 7 figures",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) and Retrieval-Augmented Generation (RAG) systems are increasingly integrated into clinical workflows; however, prompt injection attacks can steer these systems toward clinically unsafe or misleading outputs. We introduce the Medical Prompt Injection Benchmark (MPIB), a dataset-and-benchmark suite for evaluating clinical safety under both direct prompt injection and indirect, RAG-mediated injection across clinically grounded tasks. MPIB emphasizes outcome-level risk via the Clinical Harm Event Rate (CHER), which measures high-severity clinical harm events under a clinically grounded taxonomy, and reports CHER alongside Attack Success Rate (ASR) to disentangle instruction compliance from downstream patient risk. The benchmark comprises 9,697 curated instances constructed through multi-stage quality gates and clinical safety linting. Evaluating MPIB across a diverse set of baseline LLMs and defense configurations, we find that ASR and CHER can diverge substantially, and that robustness depends critically on whether adversarial instructions appear in the user query or in retrieved context. We release MPIB with evaluation code, adversarial baselines, and comprehensive documentation to support reproducible and systematic research on clinical prompt injection. Code and data are available at GitHub (code) and Hugging Face (data).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06297",
        "abs_url": "https://arxiv.org/abs/2602.06297",
        "pdf_url": "https://arxiv.org/pdf/2602.06297",
        "title": "Time-uniform conformal and PAC prediction",
        "authors": [
            "Kayla E. Scharfstein",
            "Arun Kumar Kuchibhotla"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Given that machine learning algorithms are increasingly being deployed to aid in high stakes decision-making, uncertainty quantification methods that wrap around these black box models such as conformal prediction have received much attention in recent years. In sequential settings, where data are observed/generated in a streaming fashion, traditional conformal methods do not provide any guarantee without fixing the sample size. More importantly, traditional conformal methods cannot cope with sequentially updated predictions. As such, we develop an extension of the conformal prediction and related probably approximately correct (PAC) prediction frameworks to sequential settings where the number of data points is not fixed in advance. The resulting prediction sets are anytime-valid in that their expected coverage is at the required level at any time chosen by the analyst even if this choice depends on the data. We present theoretical guarantees for our proposed methods and demonstrate their validity and utility on simulated and real datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06320",
        "abs_url": "https://arxiv.org/abs/2602.06320",
        "pdf_url": "https://arxiv.org/pdf/2602.06320",
        "title": "High-Dimensional Limit of Stochastic Gradient Flow via Dynamical Mean-Field Theory",
        "authors": [
            "Sota Nishiyama",
            "Masaaki Imaizumi"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Disordered Systems and Neural Networks (cond-mat.dis-nn); Machine Learning (cs.LG)",
        "abstract": "Modern machine learning models are typically trained via multi-pass stochastic gradient descent (SGD) with small batch sizes, and understanding their dynamics in high dimensions is of great interest. However, an analytical framework for describing the high-dimensional asymptotic behavior of multi-pass SGD with small batch sizes for nonlinear models is currently missing. In this study, we address this gap by analyzing the high-dimensional dynamics of a stochastic differential equation called a \\emph{stochastic gradient flow} (SGF), which approximates multi-pass SGD in this regime. In the limit where the number of data samples $n$ and the dimension $d$ grow proportionally, we derive a closed system of low-dimensional and continuous-time equations and prove that it characterizes the asymptotic distribution of the SGF parameters. Our theory is based on the dynamical mean-field theory (DMFT) and is applicable to a wide range of models encompassing generalized linear models and two-layer neural networks. We further show that the resulting DMFT equations recover several existing high-dimensional descriptions of SGD dynamics as special cases, thereby providing a unifying perspective on prior frameworks such as online SGD and high-dimensional linear regression. Our proof builds on the existing DMFT technique for gradient flow and extends it to handle the stochasticity in SGF using tools from stochastic calculus.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06336",
        "abs_url": "https://arxiv.org/abs/2602.06336",
        "pdf_url": "https://arxiv.org/pdf/2602.06336",
        "title": "AdFL: In-Browser Federated Learning for Online Advertisement",
        "authors": [
            "Ahmad Alemari",
            "Pritam Sen",
            "Cristian Borcea"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "Since most countries are coming up with online privacy regulations, such as GDPR in the EU, online publishers need to find a balance between revenue from targeted advertisement and user privacy. One way to be able to still show targeted ads, based on user personal and behavioral information, is to employ Federated Learning (FL), which performs distributed learning across users without sharing user raw data with other stakeholders in the publishing ecosystem. This paper presents AdFL, an FL framework that works in the browsers to learn user ad preferences. These preferences are aggregated in a global FL model, which is then used in the browsers to show more relevant ads to users. AdFL can work with any model that uses features available in the browser such as ad viewability, ad click-through, user dwell time on pages, and page content. The AdFL server runs at the publisher and coordinates the learning process for the users who browse pages on the publisher's website. The AdFL prototype does not require the client to install any software, as it is built utilizing standard APIs available on most modern browsers. We built a proof-of-concept model for ad viewability prediction that runs on top of AdFL. We tested AdFL and the model with two non-overlapping datasets from a website with 40K visitors per day. The experiments demonstrate AdFL's feasibility to capture the training information in the browser in a few milliseconds, show that the ad viewability prediction achieves up to 92.59% AUC, and indicate that utilizing differential privacy (DP) to safeguard local model parameters yields adequate performance, with only modest declines in comparison to the non-DP variant.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06361",
        "abs_url": "https://arxiv.org/abs/2602.06361",
        "pdf_url": "https://arxiv.org/pdf/2602.06361",
        "title": "Envy-Free Allocation of Indivisible Goods via Noisy Queries",
        "authors": [
            "Zihan Li",
            "Yan Hao Ling",
            "Jonathan Scarlett",
            "Warut Suksompong"
        ],
        "comments": "",
        "subjects": "Computer Science and Game Theory (cs.GT); Information Theory (cs.IT); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We introduce a problem of fairly allocating indivisible goods (items) in which the agents' valuations cannot be observed directly, but instead can only be accessed via noisy queries. In the two-agent setting with Gaussian noise and bounded valuations, we derive upper and lower bounds on the required number of queries for finding an envy-free allocation in terms of the number of items, $m$, and the negative-envy of the optimal allocation, $\\Delta$. In particular, when $\\Delta$ is not too small (namely, $\\Delta \\gg m^{1/4}$), we establish that the optimal number of queries scales as $\\frac{\\sqrt m }{(\\Delta / m)^2} = \\frac{m^{2.5}}{\\Delta^2}$ up to logarithmic factors. Our upper bound is based on non-adaptive queries and a simple thresholding-based allocation algorithm that runs in polynomial time, while our lower bound holds even under adaptive queries and arbitrary computation time.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06365",
        "abs_url": "https://arxiv.org/abs/2602.06365",
        "pdf_url": "https://arxiv.org/pdf/2602.06365",
        "title": "Advances in Battery Energy Storage Management: Control and Economic Synergies",
        "authors": [
            "Venkata Rajesh Chundru",
            "Shreshta Rajakumar Deshpande",
            "Stanislav A Gankov"
        ],
        "comments": "Pre Print",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "The existing literature on Battery Energy Storage Systems (BESS) predominantly focuses on two main areas: control system design aimed at achieving grid stability and the techno-economic analysis of BESS dispatch on power grid. However, with the increasing incorporation of ancillary services into power grids, a more comprehensive approach to energy management systems is required. Such an approach should not only optimize revenue generation from BESS but also ensure the safe, efficient, and reliable operation of lithium-ion batteries. This research seeks to bridge this gap by exploring literature that addresses both the economic and operational dimensions of BESS. Specifically, it examines how economic aspects of grid duty cycles can align with control schemes deployed in BESS systems. This alignment, or synergy, could be instrumental in creating robust digital twins virtual representations of BESS systems that enhance both grid stability and revenue potential. The literature review is organized into five key categories: (1) ancillary services for BESS, exploring support functions that BESS can provide to power grids; (2) control systems developed for real-time BESS power flow management, ensuring smooth operations under dynamic grid conditions; (3) optimization algorithms for BESS dispatch, focusing on efficient energy allocation strategies; (4) techno-economic analyses of BESS and battery systems to assess their financial viability; and (5) digital twin technologies for real-world BESS deployments, enabling advanced predictive maintenance and performance optimization. This review will identify potential synergies, research gaps, and emerging trends, paving the way for future innovations in BESS management and deployment strategies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 113,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06374",
        "abs_url": "https://arxiv.org/abs/2602.06374",
        "pdf_url": "https://arxiv.org/pdf/2602.06374",
        "title": "A Multiplicative Neural Network Architecture: Locality and Regularity of Appriximation",
        "authors": [
            "Hee-Sun Choi",
            "Beom-Seok Han"
        ],
        "comments": "22 pages",
        "subjects": "Functional Analysis (math.FA); Machine Learning (cs.LG)",
        "abstract": "We introduce a multiplicative neural network architecture in which multiplicative interactions constitute the fundamental representation, rather than appearing as auxiliary components within an additive model. We establish a universal approximation theorem for this architecture and analyze its approximation properties in terms of locality and regularity in Bessel potential spaces. To complement the theoretical results, we conduct numerical experiments on representative targets exhibiting sharp transition layers or pointwise loss of higher-order regularity. The experiments focus on the spatial structure of approximation errors and on regularity-sensitive quantities, in particular the convergence of Zygmund-type seminorms. The results show that the proposed multiplicative architecture yields residual error structures that are more tightly aligned with regions of reduced regularity and exhibits more stable convergence in regularity-sensitive metrics. These results demonstrate that adopting a multiplicative representation format has concrete implications for the localization and regularity behavior of neural network approximations, providing a direct connection between architectural design and analytical properties of the approximating functions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 114,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06381",
        "abs_url": "https://arxiv.org/abs/2602.06381",
        "pdf_url": "https://arxiv.org/pdf/2602.06381",
        "title": "HyQuRP: Hybrid quantum-classical neural network with rotational and permutational equivariance for 3D point clouds",
        "authors": [
            "Semin Park",
            "Chae-Yeun Park"
        ],
        "comments": "8+28 pages; 2 figures",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "We introduce HyQuRP, a hybrid quantum-classical neural network equivariant to rotational and permutational symmetries. While existing equivariant quantum machine learning models often rely on ad hoc constructions, HyQuRP is built upon the formal foundations of group representation theory. In the sparse-point regime, HyQuRP consistently outperforms strong classical and quantum baselines across multiple benchmarks. For example, when six subsampled points are used, HyQuRP ($\\sim$1.5K parameters) achieves 76.13% accuracy on the 5-class ModelNet benchmark, compared to approximately 71% for PointNet, PointMamba, and PointTransformer with similar parameter counts. These results highlight HyQuRP's exceptional data efficiency and suggest the potential of quantum machine learning models for processing 3D point cloud data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 115,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06412",
        "abs_url": "https://arxiv.org/abs/2602.06412",
        "pdf_url": "https://arxiv.org/pdf/2602.06412",
        "title": "Stopping Computation for Converged Tokens in Masked Diffusion-LM Decoding",
        "authors": [
            "Daisuke Oba",
            "Danushka Bollegala",
            "Masahiro Kaneko",
            "Naoaki Okazaki"
        ],
        "comments": "Accepted at ICLR 2026",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Masked Diffusion Language Models generate sequences via iterative sampling that progressively unmasks tokens. However, they still recompute the attention and feed-forward blocks for every token position at every step -- even when many unmasked tokens are essentially fixed, resulting in substantial waste in compute. We propose SureLock: when the posterior at an unmasked position has stabilized across steps (our sure condition), we lock that position -- thereafter skipping its query projection and feed-forward sublayers -- while caching its attention keys and values so other positions can continue to attend to it. This reduces the dominant per-iteration computational cost from $O(N^2d)$ to $O(MNd)$ where $N$ is the sequence length, $M$ is the number of unlocked token positions, and $d$ is the model dimension. In practice, $M$ decreases as the iteration progresses, yielding substantial savings. On LLaDA-8B, SureLock reduces algorithmic FLOPs by 30--50% relative to the same sampler without locking, while maintaining comparable generation quality. We also provide a theoretical analysis to justify the design rationale of SureLock: monitoring only the local KL at the lock step suffices to bound the deviation in final token probabilities. Our code will be available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 116,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06462",
        "abs_url": "https://arxiv.org/abs/2602.06462",
        "pdf_url": "https://arxiv.org/pdf/2602.06462",
        "title": "Diffusion-State Policy Optimization for Masked Diffusion Language Models",
        "authors": [
            "Daisuke Oba",
            "Hiroki Furuta",
            "Naoaki Okazaki"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Masked diffusion language models generate by iteratively filling masked tokens over multiple denoising steps, so learning only from a terminal reward on the final completion yields coarse credit assignment over intermediate decisions. We propose DiSPO (Diffusion-State Policy Optimization), a plug-in credit-assignment layer that directly optimizes intermediate filling decisions. At selected intermediate masked states, DiSPO branches by resampling fillings for the currently masked positions from rollout-cached logits, scores the resulting completions, and updates only the newly filled tokens -- without additional multi-step diffusion rollouts. We formalize a fixed-state objective for branched completions and derive a policy-gradient estimator that can be combined with terminal-feedback policy optimization using the same rollouts. On LLaDA-8B-Instruct, DiSPO consistently improves over the terminal-feedback diffu-GRPO baseline on math and planning benchmarks under matched rollout compute and optimizer steps. Our code will be available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 117,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06476",
        "abs_url": "https://arxiv.org/abs/2602.06476",
        "pdf_url": "https://arxiv.org/pdf/2602.06476",
        "title": "Prism: Spectral Parameter Sharing for Multi-Agent Reinforcement Learning",
        "authors": [
            "Kyungbeom Kim",
            "Seungwon Oh",
            "Kyung-Joong Kim"
        ],
        "comments": "",
        "subjects": "Multiagent Systems (cs.MA); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Parameter sharing is a key strategy in multi-agent reinforcement learning (MARL) for improving scalability, yet conventional fully shared architectures often collapse into homogeneous behaviors. Recent methods introduce diversity through clustering, pruning, or masking, but typically compromise resource efficiency. We propose Prism, a parameter sharing framework that induces inter-agent diversity by representing shared networks in the spectral domain via singular value decomposition (SVD). All agents share the singular vector directions while learning distinct spectral masks on singular values. This mechanism encourages inter-agent diversity and preserves scalability. Extensive experiments on both homogeneous (LBF, SMACv2) and heterogeneous (MaMuJoCo) benchmarks show that Prism achieves competitive performance with superior resource efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 118,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06534",
        "abs_url": "https://arxiv.org/abs/2602.06534",
        "pdf_url": "https://arxiv.org/pdf/2602.06534",
        "title": "AlertBERT: A noise-robust alert grouping framework for simultaneous cyber attacks",
        "authors": [
            "Lukas Karner",
            "Max Landauer",
            "Markus Wurzenberger",
            "Florian Skopik"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Automated detection of cyber attacks is a critical capability to counteract the growing volume and sophistication of cyber attacks. However, the high numbers of security alerts issued by intrusion detection systems lead to alert fatigue among analysts working in security operations centres (SOC), which in turn causes slow reaction time and incorrect decision making. Alert grouping, which refers to clustering of security alerts according to their underlying causes, can significantly reduce the number of distinct items analysts have to consider. Unfortunately, conventional time-based alert grouping solutions are unsuitable for large scale computer networks characterised by high levels of false positive alerts and simultaneously occurring attacks. To address these limitations, we propose AlertBERT, a self-supervised framework designed to group alerts from isolated or concurrent attacks in noisy environments. Thereby, our open-source implementation of AlertBERT leverages masked-language-models and density-based clustering to support both real-time or forensic operation. To evaluate our framework, we further introduce a novel data augmentation method that enables flexible control over noise levels and simulates concurrent attack occurrences. Based on the data sets generated through this method, we demonstrate that AlertBERT consistently outperforms conventional time-based grouping techniques, achieving superior accuracy in identifying correct alert groups.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 119,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06545",
        "abs_url": "https://arxiv.org/abs/2602.06545",
        "pdf_url": "https://arxiv.org/pdf/2602.06545",
        "title": "Operationalizing Stein's Method for Online Linear Optimization: CLT-Based Optimal Tradeoffs",
        "authors": [
            "Zhiyu Zhang",
            "Aaditya Ramdas"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Adversarial online linear optimization (OLO) is essentially about making performance tradeoffs with respect to the unknown difficulty of the adversary. In the setting of one-dimensional fixed-time OLO on a bounded domain, it has been observed since Cover (1966) that achievable tradeoffs are governed by probabilistic inequalities, and these descriptive results can be converted into algorithms via dynamic programming, which, however, is not computationally efficient. We address this limitation by showing that Stein's method, a classical framework underlying the proofs of probabilistic limit theorems, can be operationalized as computationally efficient OLO algorithms. The associated regret and total loss upper bounds are \"additively sharp\", meaning that they surpass the conventional big-O optimality and match normal-approximation-based lower bounds by additive lower order terms. Our construction is inspired by the remarkably clean proof of a Wasserstein martingale central limit theorem (CLT) due to Röllin (2018). Several concrete benefits can be obtained from this general technique. First, with the same computational complexity, the proposed algorithm improves upon the total loss upper bounds of online gradient descent (OGD) and multiplicative weight update (MWU). Second, our algorithm can realize a continuum of optimal two-point tradeoffs between the total loss and the maximum regret over comparators, improving upon prior works in parameter-free online learning. Third, by allowing the adversary to randomize on an unbounded support, we achieve sharp in-expectation performance guarantees for OLO with noisy feedback.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 120,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06553",
        "abs_url": "https://arxiv.org/abs/2602.06553",
        "pdf_url": "https://arxiv.org/pdf/2602.06553",
        "title": "Evolving Ranking Functions for Canonical Blow-Ups in Positive Characteristic",
        "authors": [
            "Gergely Bérczi"
        ],
        "comments": "41 pages",
        "subjects": "Algebraic Geometry (math.AG); Machine Learning (cs.LG)",
        "abstract": "Resolution of singularities in positive characteristic remains a long-standing open problem in algebraic geometry. In characteristic zero, the problem was solved by Hironaka in 1964, work for which he was awarded the Fields Medal. Modern proofs proceed by constructing suitable ranking functions, that is, invariants shown to strictly decrease along canonical sequences of blow-ups, ensuring termination. In positive characteristic, however, no such general ranking function is known: Frobenius-specific pathologies, such as the kangaroo phenomenon, can cause classical characteristic-zero invariants to plateau or even temporarily increase, presenting a fundamental obstruction to existing approaches. In this paper we report a sequence of experiments using the evolutionary search model AlphaEvolve, designed to discover candidate ranking functions for a toy canonical blow-up process. Our test benchmarks consist of carefully selected hypersurface singularities in dimension $4$ and characteristic $p=3$, with monic purely inseparable leading term, a regime in which naive order-based invariants often fail. After iteratively refining the experimental design, we obtained a discretized five-component lexicographic ranking function satisfying a bounded-delay descent criterion with zero violations across the benchmark. These experiments in turn motivated our main results: the conjectural delayed ranking functions in characteristic $3$ formulated in two conjectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 121,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06555",
        "abs_url": "https://arxiv.org/abs/2602.06555",
        "pdf_url": "https://arxiv.org/pdf/2602.06555",
        "title": "Reinforcement Learning-Based Dynamic Management of Structured Parallel Farm Skeletons on Serverless Platforms",
        "authors": [
            "Lanpei Li",
            "Massimo Coppola",
            "Malio Li",
            "Valerio Besozzi",
            "Jack Bell",
            "Vincenzo Lomonaco"
        ],
        "comments": "Accepted at AHPC3 workshop, PDP 2026",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "We present a framework for dynamic management of structured parallel processing skeletons on serverless platforms. Our goal is to bring HPC-like performance and resilience to serverless and continuum environments while preserving the programmability benefits of skeletons. As a first step, we focus on the well known Farm pattern and its implementation on the open-source OpenFaaS platform, treating autoscaling of the worker pool as a QoS-aware resource management problem. The framework couples a reusable farm template with a Gymnasium-based monitoring and control layer that exposes queue, timing, and QoS metrics to both reactive and learning-based controllers. We investigate the effectiveness of AI-driven dynamic scaling for managing the farm's degree of parallelism via the scalability of serverless functions on OpenFaaS. In particular, we discuss the autoscaling model and its training, and evaluate two reinforcement learning (RL) policies against a baseline of reactive management derived from a simple farm performance model. Our results show that AI-based management can better accommodate platform-specific limitations than purely model-based performance steering, improving QoS while maintaining efficient resource usage and stable scaling behaviour.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 122,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06584",
        "abs_url": "https://arxiv.org/abs/2602.06584",
        "pdf_url": "https://arxiv.org/pdf/2602.06584",
        "title": "Inference-Time Rethinking with Latent Thought Vectors for Math Reasoning",
        "authors": [
            "Deqian Kong",
            "Minglu Zhao",
            "Aoyang Qin",
            "Bo Pang",
            "Chenxin Tao",
            "David Hartmann",
            "Edouardo Honig",
            "Dehong Xu",
            "Amit Kumar",
            "Matt Sarte",
            "Chuan Li",
            "Jianwen Xie",
            "Ying Nian Wu"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Standard chain-of-thought reasoning generates a solution in a single forward pass, committing irrevocably to each token and lacking a mechanism to recover from early errors. We introduce Inference-Time Rethinking, a generative framework that enables iterative self-correction by decoupling declarative latent thought vectors from procedural generation. We factorize reasoning into a continuous latent thought vector (what to reason about) and a decoder that verbalizes the trace conditioned on this vector (how to reason). Beyond serving as a declarative buffer, latent thought vectors compress the reasoning structure into a continuous representation that abstracts away surface-level token variability, making gradient-based optimization over reasoning strategies well-posed. Our prior model maps unstructured noise to a learned manifold of valid reasoning patterns, and at test time we employ a Gibbs-style procedure that alternates between generating a candidate trace and optimizing the latent vector to better explain that trace, effectively navigating the latent manifold to refine the reasoning strategy. Training a 0.2B-parameter model from scratch on GSM8K, our method with 30 rethinking iterations surpasses baselines with 10 to 15 times more parameters, including a 3B counterpart. This result demonstrates that effective mathematical reasoning can emerge from sophisticated inference-time computation rather than solely from massive parameter counts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 123,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06602",
        "abs_url": "https://arxiv.org/abs/2602.06602",
        "pdf_url": "https://arxiv.org/pdf/2602.06602",
        "title": "Scaling Speech Tokenizers with Diffusion Autoencoders",
        "authors": [
            "Yuancheng Wang",
            "Zhenyu Tang",
            "Yun Wang",
            "Arthur Hinsvark",
            "Yingru Liu",
            "Yinghao Li",
            "Kainan Peng",
            "Junyi Ao",
            "Mingbo Ma",
            "Mike Seltzer",
            "Qing He",
            "Xubo Liu"
        ],
        "comments": "ICLR 2026",
        "subjects": "Sound (cs.SD); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Audio and Speech Processing (eess.AS)",
        "abstract": "Speech tokenizers are foundational to speech language models, yet existing approaches face two major challenges: (1) balancing trade-offs between encoding semantics for understanding and acoustics for reconstruction, and (2) achieving low bit rates and low token rates. We propose Speech Diffusion Tokenizer (SiTok), a diffusion autoencoder that jointly learns semantic-rich representations through supervised learning and enables high-fidelity audio reconstruction with diffusion. We scale SiTok to 1.6B parameters and train it on 2 million hours of speech. Experiments show that SiTok outperforms strong baselines on understanding, reconstruction and generation tasks, at an extremely low token rate of $12.5$ Hz and a bit-rate of 200 bits-per-second.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 124,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06616",
        "abs_url": "https://arxiv.org/abs/2602.06616",
        "pdf_url": "https://arxiv.org/pdf/2602.06616",
        "title": "Confundo: Learning to Generate Robust Poison for Practical RAG Systems",
        "authors": [
            "Haoyang Hu",
            "Zhejun Jiang",
            "Yueming Lyu",
            "Junyuan Zhang",
            "Yi Liu",
            "Ka-Ho Chow"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Retrieval-augmented generation (RAG) is increasingly deployed in real-world applications, where its reference-grounded design makes outputs appear trustworthy. This trust has spurred research on poisoning attacks that craft malicious content, inject it into knowledge sources, and manipulate RAG responses. However, when evaluated in practical RAG systems, existing attacks suffer from severely degraded effectiveness. This gap stems from two overlooked realities: (i) content is often processed before use, which can fragment the poison and weaken its effect, and (ii) users often do not issue the exact queries anticipated during attack design. These factors can lead practitioners to underestimate risks and develop a false sense of security. To better characterize the threat to practical systems, we present Confundo, a learning-to-poison framework that fine-tunes a large language model as a poison generator to achieve high effectiveness, robustness, and stealthiness. Confundo provides a unified framework supporting multiple attack objectives, demonstrated by manipulating factual correctness, inducing biased opinions, and triggering hallucinations. By addressing these overlooked challenges, Confundo consistently outperforms a wide range of purpose-built attacks across datasets and RAG configurations by large margins, even in the presence of defenses. Beyond exposing vulnerabilities, we also present a defensive use case that protects web content from unauthorized incorporation into RAG systems via scraping, with no impact on user experience.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 125,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06621",
        "abs_url": "https://arxiv.org/abs/2602.06621",
        "pdf_url": "https://arxiv.org/pdf/2602.06621",
        "title": "Infinite-dimensional generative diffusions via Doob's h-transform",
        "authors": [
            "Thorben Pieper-Sethmacher",
            "Daniel Paulin"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "This paper introduces a rigorous framework for defining generative diffusion models in infinite dimensions via Doob's h-transform. Rather than relying on time reversal of a noising process, a reference diffusion is forced towards the target distribution by an exponential change of measure. Compared to existing methodology, this approach readily generalises to the infinite-dimensional setting, hence offering greater flexibility in the diffusion model. The construction is derived rigorously under verifiable conditions, and bounds with respect to the target measure are established. We show that the forced process under the changed measure can be approximated by minimising a score-matching objective and validate our method on both synthetic and real data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 126,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06674",
        "abs_url": "https://arxiv.org/abs/2602.06674",
        "pdf_url": "https://arxiv.org/pdf/2602.06674",
        "title": "CytoCrowd: A Multi-Annotator Benchmark Dataset for Cytology Image Analysis",
        "authors": [
            "Yonghao Si",
            "Xingyuan Zeng",
            "Zhao Chen",
            "Libin Zheng",
            "Caleb Chen Cao",
            "Lei Chen",
            "Jian Yin"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Human-Computer Interaction (cs.HC); Machine Learning (cs.LG)",
        "abstract": "High-quality annotated datasets are crucial for advancing machine learning in medical image analysis. However, a critical gap exists: most datasets either offer a single, clean ground truth, which hides real-world expert disagreement, or they provide multiple annotations without a separate gold standard for objective evaluation. To bridge this gap, we introduce CytoCrowd, a new public benchmark for cytology analysis. The dataset features 446 high-resolution images, each with two key components: (1) raw, conflicting annotations from four independent pathologists, and (2) a separate, high-quality gold-standard ground truth established by a senior expert. This dual structure makes CytoCrowd a versatile resource. It serves as a benchmark for standard computer vision tasks, such as object detection and classification, using the ground truth. Simultaneously, it provides a realistic testbed for evaluating annotation aggregation algorithms that must resolve expert disagreements. We provide comprehensive baseline results for both tasks. Our experiments demonstrate the challenges presented by CytoCrowd and establish its value as a resource for developing the next generation of models for medical image analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 127,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06693",
        "abs_url": "https://arxiv.org/abs/2602.06693",
        "pdf_url": "https://arxiv.org/pdf/2602.06693",
        "title": "Makespan Minimization in Split Learning: From Theory to Practice",
        "authors": [
            "Robert Ganian",
            "Fionn Mc Inerney",
            "Dimitra Tsigkari"
        ],
        "comments": "This paper will appear at IEEE INFOCOM 2026",
        "subjects": "Networking and Internet Architecture (cs.NI); Computational Complexity (cs.CC); Machine Learning (cs.LG)",
        "abstract": "Split learning recently emerged as a solution for distributed machine learning with heterogeneous IoT devices, where clients can offload part of their training to computationally-powerful helpers. The core challenge in split learning is to minimize the training time by jointly devising the client-helper assignment and the schedule of tasks at the helpers. We first study the model where each helper has a memory cardinality constraint on how many clients it may be assigned, which represents the case of homogeneous tasks. Through complexity theory, we rule out exact polynomial-time algorithms and approximation schemes even for highly restricted instances of this problem. We complement these negative results with a non-trivial polynomial-time 5-approximation algorithm. Building on this, we then focus on the more general heterogeneous task setting considered by Tirana et al. [INFOCOM 2024], where helpers have memory capacity constraints and clients have variable memory costs. In this case, we prove that, unless P=NP, the problem cannot admit a polynomial-time approximation algorithm for any approximation factor. However, by adapting our aforementioned 5-approximation algorithm, we develop a novel heuristic for the heterogeneous task setting and show that it outperforms heuristics from prior works through extensive experiments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 128,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06699",
        "abs_url": "https://arxiv.org/abs/2602.06699",
        "pdf_url": "https://arxiv.org/pdf/2602.06699",
        "title": "Quantum Attention by Overlap Interference: Predicting Sequences from Classical and Many-Body Quantum Data",
        "authors": [
            "Alessio Pecilli",
            "Matteo Rosati"
        ],
        "comments": "4 + 1 pages, 2 figures",
        "subjects": "Quantum Physics (quant-ph); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "We propose a variational quantum implementation of self-attention (QSA), the core operation in transformers and large language models, which predicts future elements of a sequence by forming overlap-weighted combinations of past data. At variance with previous approaches, our QSA realizes the required nonlinearity through interference of state overlaps and returns a Renyi-1/2 cross-entropy loss directly as the expectation value of an observable, avoiding the need to decode amplitude-encoded predictions into classical logits. Furthermore, QSA naturally accommodates a constrained, trainable data-embedding that ties quantum state overlaps to data-level similarities. We find a gate complexity dominant scaling O(T d^2) for QSA, versus O(T^2 d) classically, suggesting an advantage in the practical regime where the sequence length T dominates the embedding size d. In simulations, we show that our QSA-based quantum transformer learns sequence prediction on classical data and on many-body transverse-field Ising quantum trajectories, establishing trainable attention as a practical primitive for quantum dynamical modeling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 129,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06700",
        "abs_url": "https://arxiv.org/abs/2602.06700",
        "pdf_url": "https://arxiv.org/pdf/2602.06700",
        "title": "Taipan: A Query-free Transfer-based Multiple Sensitive Attribute Inference Attack Solely from Publicly Released Graphs",
        "authors": [
            "Ying Song",
            "Balaji Palanisamy"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Graph-structured data underpin a wide spectrum of modern applications. However, complex graph topologies and homophilic patterns can facilitate attribute inference attacks (AIAs) by enabling sensitive information leakage to propagate across local neighborhoods. Existing AIAs predominantly assume that adversaries can probe sensitive attributes through repeated model queries. Such assumptions are often impractical in real-world settings due to stringent data protection regulations, prohibitive query budgets, and heightened detection risks, especially when inferring multiple sensitive attributes. More critically, this model-centric perspective obscures a pervasive blind spot: \\textbf{intrinsic multiple sensitive information leakage arising solely from publicly released graphs.} To exploit this unexplored vulnerability, we introduce a new attack paradigm and propose \\textbf{Taipan, the first query-free transfer-based attack framework for multiple sensitive attribute inference attacks on graphs (G-MSAIAs).} Taipan integrates \\emph{Hierarchical Attack Knowledge Routing} to capture intricate inter-attribute correlations, and \\emph{Prompt-guided Attack Prototype Refinement} to mitigate negative transfer and performance degradation. We further present a systematic evaluation framework tailored to G-MSAIAs. Extensive experiments on diverse real-world graph datasets demonstrate that Taipan consistently achieves strong attack performance across same-distribution settings and heterogeneous similar- and out-of-distribution settings with mismatched feature dimensionalities, and remains effective even under rigorous differential privacy guarantees. Our findings underscore the urgent need for more robust multi-attribute privacy-preserving graph publishing methods and data-sharing practices.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 130,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06713",
        "abs_url": "https://arxiv.org/abs/2602.06713",
        "pdf_url": "https://arxiv.org/pdf/2602.06713",
        "title": "Missing At Random as Covariate Shift: Correcting Bias in Iterative Imputation",
        "authors": [
            "Luke Shannon",
            "Song Liu",
            "Katarzyna Reluga"
        ],
        "comments": "8 pages, 6 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Accurate imputation of missing data is critical to downstream machine learning performance. We formulate missing data imputation as a risk minimisation problem, which highlights a covariate shift between the observed and unobserved data distributions. This covariate shift induced bias is not accounted for by popular imputation methods and leads to suboptimal performance. In this paper, we derive theoretically valid importance weights that correct for the induced distributional bias. Furthermore, we propose a novel imputation algorithm that jointly estimates both the importance weights and imputation models, enabling bias correction throughout the imputation process. Empirical results across benchmark datasets show reductions in root mean squared error and Wasserstein distance of up to 7% and 20%, respectively, compared to otherwise identical unweighted methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 131,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06754",
        "abs_url": "https://arxiv.org/abs/2602.06754",
        "pdf_url": "https://arxiv.org/pdf/2602.06754",
        "title": "A Unified Framework for LLM Watermarks",
        "authors": [
            "Thibaud Gloaguen",
            "Robin Staab",
            "Nikola Jovanović",
            "Martin Vechev"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "LLM watermarks allow tracing AI-generated texts by inserting a detectable signal into their generated content. Recent works have proposed a wide range of watermarking algorithms, each with distinct designs, usually built using a bottom-up approach. Crucially, there is no general and principled formulation for LLM watermarking. In this work, we show that most existing and widely used watermarking schemes can in fact be derived from a principled constrained optimization problem. Our formulation unifies existing watermarking methods and explicitly reveals the constraints that each method optimizes. In particular, it highlights an understudied quality-diversity-power trade-off. At the same time, our framework also provides a principled approach for designing novel watermarking schemes tailored to specific requirements. For instance, it allows us to directly use perplexity as a proxy for quality, and derive new schemes that are optimal with respect to this constraint. Our experimental evaluation validates our framework: watermarking schemes derived from a given constraint consistently maximize detection power with respect to that constraint.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 132,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06776",
        "abs_url": "https://arxiv.org/abs/2602.06776",
        "pdf_url": "https://arxiv.org/pdf/2602.06776",
        "title": "Fair Transit Stop Placement: A Clustering Perspective and Beyond",
        "authors": [
            "Haris Aziz",
            "Ling Gai",
            "Yuhang Guo",
            "Jeremy Vollen"
        ],
        "comments": "",
        "subjects": "Computer Science and Game Theory (cs.GT); Machine Learning (cs.LG)",
        "abstract": "We study the transit stop placement (TrSP) problem in general metric spaces, where agents travel between source-destination pairs and may either walk directly or utilize a shuttle service via selected transit stops. We investigate fairness in TrSP through the lens of justified representation (JR) and the core, and uncover a structural correspondence with fair clustering. Specifically, we show that a constant-factor approximation to proportional fairness in clustering can be used to guarantee a constant-factor biparameterized approximation to core. We establish a lower bound of 1.366 on the approximability of JR, and moreover show that no clustering algorithm can approximate JR within a factor better than 3. Going beyond clustering, we propose the Expanding Cost Algorithm, which achieves a tight 2.414-approximation for JR, but does not give any bounded core guarantee. In light of this, we introduce a parameterized algorithm that interpolates between these approaches, and enables a tunable trade-off between JR and core. Finally, we complement our results with an experimental analysis using small-market public carpooling data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 133,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06797",
        "abs_url": "https://arxiv.org/abs/2602.06797",
        "pdf_url": "https://arxiv.org/pdf/2602.06797",
        "title": "Optimal Learning-Rate Schedules under Functional Scaling Laws: Power Decay and Warmup-Stable-Decay",
        "authors": [
            "Binghui Li",
            "Zilin Wang",
            "Fengling Chen",
            "Shiyang Zhao",
            "Ruiheng Zheng",
            "Lei Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We study optimal learning-rate schedules (LRSs) under the functional scaling law (FSL) framework introduced in Li et al. (2025), which accurately models the loss dynamics of both linear regression and large language model (LLM) pre-training. Within FSL, loss dynamics are governed by two exponents: a source exponent $s>0$ controlling the rate of signal learning, and a capacity exponent $\\beta>1$ determining the rate of noise forgetting. Focusing on a fixed training horizon $N$, we derive the optimal LRSs and reveal a sharp phase transition. In the easy-task regime $s \\ge 1 - 1/\\beta$, the optimal schedule follows a power decay to zero, $\\eta^*(z) = \\eta_{\\mathrm{peak}}(1 - z/N)^{2\\beta - 1}$, where the peak learning rate scales as $\\eta_{\\mathrm{peak}} \\eqsim N^{-\\nu}$ for an explicit exponent $\\nu = \\nu(s,\\beta)$. In contrast, in the hard-task regime $s < 1 - 1/\\beta$, the optimal LRS exhibits a warmup-stable-decay (WSD) (Hu et al. (2024)) structure: it maintains the largest admissible learning rate for most of training and decays only near the end, with the decay phase occupying a vanishing fraction of the horizon. We further analyze optimal shape-fixed schedules, where only the peak learning rate is tuned -- a strategy widely adopted in practiceand characterize their strengths and intrinsic limitations. This yields a principled evaluation of commonly used schedules such as cosine and linear decay. Finally, we apply the power-decay LRS to one-pass stochastic gradient descent (SGD) for kernel regression and show the last iterate attains the exact minimax-optimal rate, eliminating the logarithmic suboptimality present in prior analyses. Numerical experiments corroborate our theoretical predictions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 134,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06807",
        "abs_url": "https://arxiv.org/abs/2602.06807",
        "pdf_url": "https://arxiv.org/pdf/2602.06807",
        "title": "SuReNav: Superpixel Graph-based Constraint Relaxation for Navigation in Over-constrained Environments",
        "authors": [
            "Keonyoung Koh",
            "Moonkyeong Jung",
            "Samuel Seungsup Lee",
            "Daehyung Park"
        ],
        "comments": "Accepted by ICRA 2026. Code and videos are available at this https URL",
        "subjects": "Robotics (cs.RO); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "We address the over-constrained planning problem in semi-static environments. The planning objective is to find a best-effort solution that avoids all hard constraint regions while minimally traversing the least risky areas. Conventional methods often rely on pre-defined area costs, limiting generalizations. Further, the spatial continuity of navigation spaces makes it difficult to identify regions that are passable without overestimation. To overcome these challenges, we propose SuReNav, a superpixel graph-based constraint relaxation and navigation method that imitates human-like safe and efficient navigation. Our framework consists of three components: 1) superpixel graph map generation with regional constraints, 2) regional-constraint relaxation using graph neural network trained on human demonstrations for safe and efficient navigation, and 3) interleaving relaxation, planning, and execution for complete navigation. We evaluate our method against state-of-the-art baselines on 2D semantic maps and 3D maps from OpenStreetMap, achieving the highest human-likeness score of complete navigation while maintaining a balanced trade-off between efficiency and safety. We finally demonstrate its scalability and generalization performance in real-world urban navigation with a quadruped robot, Spot.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 135,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06824",
        "abs_url": "https://arxiv.org/abs/2602.06824",
        "pdf_url": "https://arxiv.org/pdf/2602.06824",
        "title": "RanSOM: Second-Order Momentum with Randomized Scaling for Constrained and Unconstrained Optimization",
        "authors": [
            "El Mahdi Chayti"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "Momentum methods, such as Polyak's Heavy Ball, are the standard for training deep networks but suffer from curvature-induced bias in stochastic settings, limiting convergence to suboptimal $\\mathcal{O}(\\epsilon^{-4})$ rates. Existing corrections typically require expensive auxiliary sampling or restrictive smoothness assumptions. We propose \\textbf{RanSOM}, a unified framework that eliminates this bias by replacing deterministic step sizes with randomized steps drawn from distributions with mean $\\eta_t$. This modification allows us to leverage Stein-type identities to compute an exact, unbiased estimate of the momentum bias using a single Hessian-vector product computed jointly with the gradient, avoiding auxiliary queries. We instantiate this framework in two algorithms: \\textbf{RanSOM-E} for unconstrained optimization (using exponentially distributed steps) and \\textbf{RanSOM-B} for constrained optimization (using beta-distributed steps to strictly preserve feasibility). Theoretical analysis confirms that RanSOM recovers the optimal $\\mathcal{O}(\\epsilon^{-3})$ convergence rate under standard bounded noise, and achieves optimal rates for heavy-tailed noise settings ($p \\in (1, 2]$) without requiring gradient clipping.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 136,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06842",
        "abs_url": "https://arxiv.org/abs/2602.06842",
        "pdf_url": "https://arxiv.org/pdf/2602.06842",
        "title": "Are Deep Learning Based Hybrid PDE Solvers Reliable? Why Training Paradigms and Update Strategies Matter",
        "authors": [
            "Yuhan Wu",
            "Jan Willem van Beek",
            "Victorita Dolean",
            "Alexander Heinlein"
        ],
        "comments": "",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "Deep learning-based hybrid iterative methods (DL-HIMs) integrate classical numerical solvers with neural operators, utilizing their complementary spectral biases to accelerate convergence. Despite this promise, many DL-HIMs stagnate at false fixed points where neural updates vanish while the physical residual remains large, raising questions about reliability in scientific computing. In this paper, we provide evidence that performance is highly sensitive to training paradigms and update strategies, even when the neural architecture is fixed. Through a detailed study of a DeepONet-based hybrid iterative numerical transferable solver (HINTS) and an FFT-based Fourier neural solver (FNS), we show that significant physical residuals can persist when training objectives are not aligned with solver dynamics and problem physics. We further examine Anderson acceleration (AA) and demonstrate that its classical form is ill-suited for nonlinear neural operators. To overcome this, we introduce physics-aware Anderson acceleration (PA-AA), which minimizes the physical residual rather than the fixed-point update. Numerical experiments confirm that PA-AA restores reliable convergence in substantially fewer iterations. These findings provide a concrete answer to ongoing controversies surrounding AI-based PDE solvers: reliability hinges not only on architectures but on physically informed training and iteration design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 137,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06869",
        "abs_url": "https://arxiv.org/abs/2602.06869",
        "pdf_url": "https://arxiv.org/pdf/2602.06869",
        "title": "Uncovering Cross-Objective Interference in Multi-Objective Alignment",
        "authors": [
            "Yining Lu",
            "Meng Jiang"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "We study a persistent failure mode in multi-objective alignment for large language models (LLMs): training improves performance on only a subset of objectives while causing others to degrade. We formalize this phenomenon as cross-objective interference and conduct the first systematic study across classic scalarization algorithms, showing that interference is pervasive and exhibits strong model dependence. To explain this phenomenon, we derive a local covariance law showing that an objective improves at first order when its reward exhibits positive covariance with the scalarized score. We extend this analysis to clipped surrogate objectives used in modern alignment, demonstrating that the covariance law remains valid under mild conditions despite clipping. Building on this analysis, we propose Covariance Targeted Weight Adaptation (CTWA), a plug-and-play method that maintains positive covariance between objective rewards and the training signal to effectively mitigate cross-objective interference. Finally, we complement these local improvement conditions with a global convergence analysis under the Polyak--Łojasiewicz condition, establishing when non-convex scalarized optimization achieves global convergence and how cross-objective interference depends on specific model geometric properties.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 138,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06917",
        "abs_url": "https://arxiv.org/abs/2602.06917",
        "pdf_url": "https://arxiv.org/pdf/2602.06917",
        "title": "Automatic Detection and Analysis of Singing Mistakes for Music Pedagogy",
        "authors": [
            "Sumit Kumar",
            "Suraj Jaiswal",
            "Parampreet Singh",
            "Vipul Arora"
        ],
        "comments": "Under Review at Transactions of Audio Speech and Language Processing",
        "subjects": "Audio and Speech Processing (eess.AS); Machine Learning (cs.LG)",
        "abstract": "The advancement of machine learning in audio analysis has opened new possibilities for technology-enhanced music education. This paper introduces a framework for automatic singing mistake detection in the context of music pedagogy, supported by a newly curated dataset. The dataset comprises synchronized teacher learner vocal recordings, with annotations marking different types of mistakes made by learners. Using this dataset, we develop different deep learning models for mistake detection and benchmark them. To compare the efficacy of mistake detection systems, a new evaluation methodology is proposed. Experiments indicate that the proposed learning-based methods are superior to rule-based methods. A systematic study of errors and a cross-teacher study reveal insights into music pedagogy that can be utilised for various music applications. This work sets out new directions of research in music pedagogy. The codes and dataset are publicly available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 139,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06937",
        "abs_url": "https://arxiv.org/abs/2602.06937",
        "pdf_url": "https://arxiv.org/pdf/2602.06937",
        "title": "Reciprocal Latent Fields for Precomputed Sound Propagation",
        "authors": [
            "Hugo Seuté",
            "Pranai Vasudev",
            "Etienne Richan",
            "Louis-Xavier Buffoni"
        ],
        "comments": "Temporary pre-print, will be updated. In review at a conference",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG); Audio and Speech Processing (eess.AS)",
        "abstract": "Realistic sound propagation is essential for immersion in a virtual scene, yet physically accurate wave-based simulations remain computationally prohibitive for real-time applications. Wave coding methods address this limitation by precomputing and compressing impulse responses of a given scene into a set of scalar acoustic parameters, which can reach unmanageable sizes in large environments with many source-receiver pairs. We introduce Reciprocal Latent Fields (RLF), a memory-efficient framework for encoding and predicting these acoustic parameters. The RLF framework employs a volumetric grid of trainable latent embeddings decoded with a symmetric function, ensuring acoustic reciprocity. We study a variety of decoders and show that leveraging Riemannian metric learning leads to a better reproduction of acoustic phenomena in complex scenes. Experimental validation demonstrates that RLF maintains replication quality while reducing the memory footprint by several orders of magnitude. Furthermore, a MUSHRA-like subjective listening test indicates that sound rendered via RLF is perceptually indistinguishable from ground-truth simulations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 140,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06944",
        "abs_url": "https://arxiv.org/abs/2602.06944",
        "pdf_url": "https://arxiv.org/pdf/2602.06944",
        "title": "Optimal Derivative Feedback Control for an Active Magnetic Levitation System: An Experimental Study on Data-Driven Approaches",
        "authors": [
            "Saber Omidi",
            "Rene Akupan Ebunle",
            "Se Young Yoon"
        ],
        "comments": "10 pages, 9 figures. Preprint; manuscript under journal review",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG)",
        "abstract": "This paper presents the design and implementation of data-driven optimal derivative feedback controllers for an active magnetic levitation system. A direct, model-free control design method based on the reinforcement learning framework is compared with an indirect optimal control design derived from a numerically identified mathematical model of the system. For the direct model-free approach, a policy iteration procedure is proposed, which adds an iteration layer called the epoch loop to gather multiple sets of process data, providing a more diverse dataset and helping reduce learning biases. This direct control design method is evaluated against a comparable optimal control solution designed from a plant model obtained through the combined Dynamic Mode Decomposition with Control (DMDc) and Prediction Error Minimization (PEM) system identification. Results show that while both controllers can stabilize and improve the performance of the magnetic levitation system when compared to controllers designed from a nominal model, the direct model-free approach consistently outperforms the indirect solution when multiple epochs are allowed. The iterative refinement of the optimal control law over the epoch loop provides the direct approach a clear advantage over the indirect method, which relies on a single set of system data to determine the identified model and control.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 141,
        "date": "2026-02-09",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-09?abs=True",
        "arxiv_id": "2602.06949",
        "abs_url": "https://arxiv.org/abs/2602.06949",
        "pdf_url": "https://arxiv.org/pdf/2602.06949",
        "title": "DreamDojo: A Generalist Robot World Model from Large-Scale Human Videos",
        "authors": [
            "Shenyuan Gao",
            "William Liang",
            "Kaiyuan Zheng",
            "Ayaan Malik",
            "Seonghyeon Ye",
            "Sihyun Yu",
            "Wei-Cheng Tseng",
            "Yuzhu Dong",
            "Kaichun Mo",
            "Chen-Hsuan Lin",
            "Qianli Ma",
            "Seungjun Nah",
            "Loic Magne",
            "Jiannan Xiang",
            "Yuqi Xie",
            "Ruijie Zheng",
            "Dantong Niu",
            "You Liang Tan",
            "K.R. Zentner",
            "George Kurian",
            "Suneel Indupuru",
            "Pooya Jannaty",
            "Jinwei Gu",
            "Jun Zhang",
            "Jitendra Malik",
            "Pieter Abbeel",
            "Ming-Yu Liu",
            "Yuke Zhu",
            "Joel Jang",
            "Linxi \"Jim\" Fan"
        ],
        "comments": "Project page: this https URL",
        "subjects": "Robotics (cs.RO); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Being able to simulate the outcomes of actions in varied environments will revolutionize the development of generalist agents at scale. However, modeling these world dynamics, especially for dexterous robotics tasks, poses significant challenges due to limited data coverage and scarce action labels. As an endeavor towards this end, we introduce DreamDojo, a foundation world model that learns diverse interactions and dexterous controls from 44k hours of egocentric human videos. Our data mixture represents the largest video dataset to date for world model pretraining, spanning a wide range of daily scenarios with diverse objects and skills. To address the scarcity of action labels, we introduce continuous latent actions as unified proxy actions, enhancing interaction knowledge transfer from unlabeled videos. After post-training on small-scale target robot data, DreamDojo demonstrates a strong understanding of physics and precise action controllability. We also devise a distillation pipeline that accelerates DreamDojo to a real-time speed of 10.81 FPS and further improves context consistency. Our work enables several important applications based on generative world models, including live teleoperation, policy evaluation, and model-based planning. Systematic evaluation on multiple challenging out-of-distribution (OOD) benchmarks verifies the significance of our method for simulating open-world, contact-rich tasks, paving the way for general-purpose robot world models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]