[
    {
        "order": 1,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18803",
        "abs_url": "https://arxiv.org/abs/2601.18803",
        "pdf_url": "https://arxiv.org/pdf/2601.18803",
        "title": "Latent Structural Similarity Networks for Unsupervised Discovery in Multivariate Time Series",
        "authors": [
            "Olusegun Owoeye"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper proposes a task-agnostic discovery layer for multivariate time series that constructs a relational hypothesis graph over entities without assuming linearity, stationarity, or a downstream objective. The method learns window-level sequence representations using an unsupervised sequence-to-sequence autoencoder, aggregates these representations into entity-level embeddings, and induces a sparse similarity network by thresholding a latent-space similarity measure. This network is intended as an analyzable abstraction that compresses the pairwise search space and exposes candidate relationships for further investigation, rather than as a model optimized for prediction, trading, or any decision rule. The framework is demonstrated on a challenging real-world dataset of hourly cryptocurrency returns, illustrating how latent similarity induces coherent network structure; a classical econometric relation is also reported as an external diagnostic lens to contextualize discovered edges.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18811",
        "abs_url": "https://arxiv.org/abs/2601.18811",
        "pdf_url": "https://arxiv.org/pdf/2601.18811",
        "title": "Variational Quantum Circuit-Based Reinforcement Learning for Dynamic Portfolio Optimization",
        "authors": [
            "Vincent Gurgul",
            "Ying Chen",
            "Stefan Lessmann"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computational Finance (q-fin.CP); Portfolio Management (q-fin.PM); Quantum Physics (quant-ph)",
        "abstract": "This paper presents a Quantum Reinforcement Learning (QRL) solution to the dynamic portfolio optimization problem based on Variational Quantum Circuits. The implemented QRL approaches are quantum analogues of the classical neural-network-based Deep Deterministic Policy Gradient and Deep Q-Network algorithms. Through an empirical evaluation on real-world financial data, we show that our quantum agents achieve risk-adjusted performance comparable to, and in some cases exceeding, that of classical Deep RL models with several orders of magnitude more parameters. In addition to improved parameter efficiency, quantum agents exhibit reduced variability across market regimes, indicating robust behaviour under changing conditions. However, while quantum circuit execution is inherently fast at the hardware level, practical deployment on cloud-based quantum systems introduces substantial latency, making end-to-end runtime currently dominated by infrastructural overhead and limiting practical applicability. Taken together, our results suggest that QRL is theoretically competitive with state-of-the-art classical reinforcement learning and may become practically advantageous as deployment overheads diminish. This positions QRL as a promising paradigm for dynamic decision-making in complex, high-dimensional, and non-stationary environments such as financial markets. The complete codebase is released as open source at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18823",
        "abs_url": "https://arxiv.org/abs/2601.18823",
        "pdf_url": "https://arxiv.org/pdf/2601.18823",
        "title": "VAE with Hyperspherical Coordinates: Improving Anomaly Detection from Hypervolume-Compressed Latent Space",
        "authors": [
            "Alejandro Ascarate",
            "Leo Lebrat",
            "Rodrigo Santa Cruz",
            "Clinton Fookes",
            "Olivier Salvado"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Variational autoencoders (VAE) encode data into lower-dimensional latent vectors before decoding those vectors back to data. Once trained, one can hope to detect out-of-distribution (abnormal) latent vectors, but several issues arise when the latent space is high dimensional. This includes an exponential growth of the hypervolume with the dimension, which severely affects the generative capacity of the VAE. In this paper, we draw insights from high dimensional statistics: in these regimes, the latent vectors of a standard VAE are distributed on the `equators' of a hypersphere, challenging the detection of anomalies. We propose to formulate the latent variables of a VAE using hyperspherical coordinates, which allows compressing the latent vectors towards a given direction on the hypersphere, thereby allowing for a more expressive approximate posterior. We show that this improves both the fully unsupervised and OOD anomaly detection ability of the VAE, achieving the best performance on the datasets we considered, outperforming existing methods. For the unsupervised and OOD modalities, respectively, these are: i) detecting unusual landscape from the Mars Rover camera and unusual Galaxies from ground based imagery (complex, real world datasets); ii) standard benchmarks like Cifar10 and subsets of ImageNet as the in-distribution (ID) class.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18829",
        "abs_url": "https://arxiv.org/abs/2601.18829",
        "pdf_url": "https://arxiv.org/pdf/2601.18829",
        "title": "CP Loss: Channel-wise Perceptual Loss for Time Series Forecasting",
        "authors": [
            "Yaohua Zha",
            "Chunlin Fan",
            "Peiyuan Liu",
            "Yong Jiang",
            "Tao Dai",
            "Hai Wu",
            "Shu-Tao Xia"
        ],
        "comments": "Accepted to ICASSP 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Multi-channel time-series data, prevalent across diverse applications, is characterized by significant heterogeneity in its different channels. However, existing forecasting models are typically guided by channel-agnostic loss functions like MSE, which apply a uniform metric across all channels. This often leads to fail to capture channel-specific dynamics such as sharp fluctuations or trend shifts. To address this, we propose a Channel-wise Perceptual Loss (CP Loss). Its core idea is to learn a unique perceptual space for each channel that is adapted to its characteristics, and to compute the loss within this space. Specifically, we first design a learnable channel-wise filter that decomposes the raw signal into disentangled multi-scale representations, which form the basis of our perceptual space. Crucially, the filter is optimized jointly with the main forecasting model, ensuring that the learned perceptual space is explicitly oriented towards the prediction task. Finally, losses are calculated within these perception spaces to optimize the model. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18830",
        "abs_url": "https://arxiv.org/abs/2601.18830",
        "pdf_url": "https://arxiv.org/pdf/2601.18830",
        "title": "How Much Temporal Modeling is Enough? A Systematic Study of Hybrid CNN-RNN Architectures for Multi-Label ECG Classification",
        "authors": [
            "Alireza Jafari",
            "Fatemeh Jafari"
        ],
        "comments": "17 pages, 10 figures",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Accurate multi-label classification of electrocardiogram (ECG) signals remains challenging due to the coexistence of multiple cardiac conditions, pronounced class imbalance, and long-range temporal dependencies in multi-lead recordings. Although recent studies increasingly rely on deep and stacked recurrent architectures, the necessity and clinical justification of such architectural complexity have not been rigorously examined. In this work, we perform a systematic comparative evaluation of convolutional neural networks (CNNs) combined with multiple recurrent configurations, including LSTM, GRU, Bidirectional LSTM (BiLSTM), and their stacked variants, for multi-label ECG classification on the PTB-XL dataset comprising 23 diagnostic categories. The CNN component serves as a morphology-driven baseline, while recurrent layers are progressively integrated to assess their contribution to temporal modeling and generalization performance. Experimental results indicate that a CNN integrated with a single BiLSTM layer achieves the most favorable trade-off between predictive performance and model complexity. This configuration attains superior Hamming loss (0.0338), macro-AUPRC (0.4715), micro-F1 score (0.6979), and subset accuracy (0.5723) compared with deeper recurrent combinations. Although stacked recurrent models occasionally improve recall for specific rare classes, our results provide empirical evidence that increasing recurrent depth yields diminishing returns and may degrade generalization due to reduced precision and overfitting. These findings suggest that architectural alignment with the intrinsic temporal structure of ECG signals, rather than increased recurrent depth, is a key determinant of robust performance and clinically relevant deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18837",
        "abs_url": "https://arxiv.org/abs/2601.18837",
        "pdf_url": "https://arxiv.org/pdf/2601.18837",
        "title": "Time series forecasting with Hahn Kolmogorov-Arnold networks",
        "authors": [
            "Md Zahidul Hasan",
            "A. Ben Hamza",
            "Nizar Bouguila"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Recent Transformer- and MLP-based models have demonstrated strong performance in long-term time series forecasting, yet Transformers remain limited by their quadratic complexity and permutation-equivariant attention, while MLPs exhibit spectral bias. We propose HaKAN, a versatile model based on Kolmogorov-Arnold Networks (KANs), leveraging Hahn polynomial-based learnable activation functions and providing a lightweight and interpretable alternative for multivariate time series forecasting. Our model integrates channel independence, patching, a stack of Hahn-KAN blocks with residual connections, and a bottleneck structure comprised of two fully connected layers. The Hahn-KAN block consists of inter- and intra-patch KAN layers to effectively capture both global and local temporal patterns. Extensive experiments on various forecasting benchmarks demonstrate that our model consistently outperforms recent state-of-the-art methods, with ablation studies validating the effectiveness of its core components.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18840",
        "abs_url": "https://arxiv.org/abs/2601.18840",
        "pdf_url": "https://arxiv.org/pdf/2601.18840",
        "title": "Analysis of Control Bellman Residual Minimization for Markov Decision Problem",
        "authors": [
            "Donghwan Lee",
            "Hyukjun Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Markov decision problems are most commonly solved via dynamic programming. Another approach is Bellman residual minimization, which directly minimizes the squared Bellman residual objective function. However, compared to dynamic programming, this approach has received relatively less attention, mainly because it is often less efficient in practice and can be more difficult to extend to model-free settings such as reinforcement learning. Nonetheless, Bellman residual minimization has several advantages that make it worth investigating, such as more stable convergence with function approximation for value functions. While Bellman residual methods for policy evaluation have been widely studied, methods for policy optimization (control tasks) have been scarcely explored. In this paper, we establish foundational results for the control Bellman residual minimization for policy optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18909",
        "abs_url": "https://arxiv.org/abs/2601.18909",
        "pdf_url": "https://arxiv.org/pdf/2601.18909",
        "title": "How Is Uncertainty Propagated in Knowledge Distillation?",
        "authors": [
            "Ziyao Cui",
            "Jian Pei"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Knowledge distillation transfers behavior from a teacher to a student model, but the process is inherently stochastic: teacher outputs, student training, and student inference can all be random. Collapsing these uncertainties to a single point estimate can distort what is learned. We systematically study how uncertainty propagates through knowledge distillation across three representative model classes--linear regression, feed-forward neural networks, and large language models (LLMs)--and propose simple corrections. We distinguish inter-student uncertainty (variance across independently distilled students) from intra-student uncertainty (variance of a single student's predictive distribution), showing that standard single-response knowledge distillation suppresses intra-student variance while leaving substantial inter-student variability. To address these mismatches, we introduce two variance-aware strategies: averaging multiple teacher responses, which reduces noise at rate $O(1/k)$, and variance-weighting, which combines teacher and student estimates via inverse-variance weighting to yield a minimum-variance estimator. We provide formal guarantees in linear regression, validate the methods in neural networks, and demonstrate empirical gains in LLM distillation, including reduced systematic noise and hallucination. These results reframe knowledge distillation as an uncertainty transformation and show that variance-aware distillation produces more stable students that better reflect teacher uncertainty.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18912",
        "abs_url": "https://arxiv.org/abs/2601.18912",
        "pdf_url": "https://arxiv.org/pdf/2601.18912",
        "title": "ASEHybrid: When Geometry Matters Beyond Homophily in Graph Neural Networks",
        "authors": [
            "Shalima Binta Manir",
            "Tim Oates"
        ],
        "comments": "16 pages, 1 figure, 2 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Standard message-passing graph neural networks (GNNs) often struggle on graphs with low homophily, yet homophily alone does not explain this behavior, as graphs with similar homophily levels can exhibit markedly different performance and some heterophilous graphs remain easy for vanilla GCNs. Recent work suggests that label informativeness (LI), the mutual information between labels of adjacent nodes, provides a more faithful characterization of when graph structure is useful. In this work, we develop a unified theoretical framework that connects curvature-guided rewiring and positional geometry through the lens of label informativeness, and instantiate it in a practical geometry-aware architecture, ASEHybrid. Our analysis provides a necessary-and-sufficient characterization of when geometry-aware GNNs can improve over feature-only baselines: such gains are possible if and only if graph structure carries label-relevant information beyond node features. Theoretically, we relate adjusted homophily and label informativeness to the spectral behavior of label signals under Laplacian smoothing, show that degree-based Forman curvature does not increase expressivity beyond the one-dimensional Weisfeiler--Lehman test but instead reshapes information flow, and establish convergence and Lipschitz stability guarantees for a curvature-guided rewiring process. Empirically, we instantiate ASEHybrid using Forman curvature and Laplacian positional encodings and conduct controlled ablations on Chameleon, Squirrel, Texas, Tolokers, and Minesweeper, observing gains precisely on label-informative heterophilous benchmarks where graph structure provides label-relevant information beyond node features, and no meaningful improvement in high-baseline regimes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18917",
        "abs_url": "https://arxiv.org/abs/2601.18917",
        "pdf_url": "https://arxiv.org/pdf/2601.18917",
        "title": "GraIP: A Benchmarking Framework For Neural Graph Inverse Problems",
        "authors": [
            "Semih Cantürk",
            "Andrei Manolache",
            "Arman Mielke",
            "Chendi Qian",
            "Antoine Siraudin",
            "Christopher Morris",
            "Mathias Niepert",
            "Guy Wolf"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "A wide range of graph learning tasks, such as structure discovery, temporal graph analysis, and combinatorial optimization, focus on inferring graph structures from data, rather than making predictions on given graphs. However, the respective methods to solve such problems are often developed in an isolated, task-specific manner and thus lack a unifying theoretical foundation. Here, we provide a stepping stone towards the formation of such a foundation and further development by introducing the Neural Graph Inverse Problem (GraIP) conceptual framework, which formalizes and reframes a broad class of graph learning tasks as inverse problems. Unlike discriminative approaches that directly predict target variables from given graph inputs, the GraIP paradigm addresses inverse problems, i.e., it relies on observational data and aims to recover the underlying graph structure by reversing the forward process, such as message passing or network dynamics, that produced the observed outputs. We demonstrate the versatility of GraIP across various graph learning tasks, including rewiring, causal discovery, and neural relational inference. We also propose benchmark datasets and metrics for each GraIP domain considered, and characterize and empirically evaluate existing baseline methods used to solve them. Overall, our unifying perspective bridges seemingly disparate applications and provides a principled approach to structural learning in constrained and combinatorial settings while encouraging cross-pollination of existing methods across graph inverse problems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18919",
        "abs_url": "https://arxiv.org/abs/2601.18919",
        "pdf_url": "https://arxiv.org/pdf/2601.18919",
        "title": "One Global Model, Many Behaviors: Stockout-Aware Feature Engineering and Dynamic Scaling for Multi-Horizon Retail Demand Forecasting with a Cost-Aware Ordering Policy (VN2 Winner Report)",
        "authors": [
            "Bartosz Szabłowski"
        ],
        "comments": "13 pages, 5 figures. Technical report/winner report for the VN2 Inventory Planning Challenge (2025)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Inventory planning for retail chains requires translating demand forecasts into ordering decisions, including asymmetric shortages and holding costs. The VN2 Inventory Planning Challenge formalizes this setting as a weekly decision-making cycle with a two-week product delivery lead time, where the total cost is defined as the shortage cost plus the holding cost. This report presents the winning VN2 solution: a two-stage predict-then-optimize pipeline that combines a single global multi-horizon forecasting model with a cost-aware ordering policy. The forecasting model is trained in a global paradigm, jointly using all available time series. A gradient-boosted decision tree (GBDT) model implemented in CatBoost is used as the base learner. The model incorporates stockout-aware feature engineering to address censored demand during out-of-stock periods, per-series scaling to focus learning on time-series patterns rather than absolute levels, and time-based observation weights to reflect shifts in demand patterns. In the decision stage, inventory is projected to the start of the delivery week, and a target stock level is calculated that explicitly trades off shortage and holding costs. Evaluated by the official competition simulation in six rounds, the solution achieved first place by combining a strong global forecasting model with a lightweight cost-aware policy. Although developed for the VN2 setting, the proposed approach can be extended to real-world applications and additional operational constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18936",
        "abs_url": "https://arxiv.org/abs/2601.18936",
        "pdf_url": "https://arxiv.org/pdf/2601.18936",
        "title": "Bi-Level Online Provisioning and Scheduling with Switching Costs and Cross-Level Constraints",
        "authors": [
            "Jialei Liu",
            "C. Emre Koksal",
            "Ming Shi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study a bi-level online provisioning and scheduling problem motivated by network resource allocation, where provisioning decisions are made at a slow time scale while queue-/state-dependent scheduling is performed at a fast time scale. We model this two-time-scale interaction using an upper-level online convex optimization (OCO) problem and a lower-level constrained Markov decision process (CMDP). Existing OCO typically assumes stateless decisions and thus cannot capture MDP network dynamics such as queue evolution. Meanwhile, CMDP algorithms typically assume a fixed constraint threshold, whereas in provisioning-and-scheduling systems, the threshold varies with online budget decisions. To address these gaps, we study bi-level OCO-CMDP learning under switching costs (budget reprovisioning/system reconfiguration) and cross-level constraints that couple budgets to scheduling decisions. Our new algorithm solves this learning problem via several non-trivial developments, including a carefully designed dual feedback that returns the budget multiplier as sensitivity information for the upper-level update and a lower level that solves a budget-adaptive safe exploration problem via an extended occupancy-measure linear program. We establish near-optimal regret and high-probability satisfaction of the cross-level constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18938",
        "abs_url": "https://arxiv.org/abs/2601.18938",
        "pdf_url": "https://arxiv.org/pdf/2601.18938",
        "title": "FSD-CAP: Fractional Subgraph Diffusion with Class-Aware Propagation for Graph Feature Imputation",
        "authors": [
            "Xin Qiao",
            "Shijie Sun",
            "Anqi Dong",
            "Cong Hua",
            "Xia Zhao",
            "Longfei Zhang",
            "Guangming Zhu",
            "Liang Zhang"
        ],
        "comments": "31 pages, 12 figures",
        "subjects": "Machine Learning (cs.LG); Social and Information Networks (cs.SI); Machine Learning (stat.ML)",
        "abstract": "Imputing missing node features in graphs is challenging, particularly under high missing rates. Existing methods based on latent representations or global diffusion often fail to produce reliable estimates, and may propagate errors across the graph. We propose FSD-CAP, a two-stage framework designed to improve imputation quality under extreme sparsity. In the first stage, a graph-distance-guided subgraph expansion localizes the diffusion process. A fractional diffusion operator adjusts propagation sharpness based on local structure. In the second stage, imputed features are refined using class-aware propagation, which incorporates pseudo-labels and neighborhood entropy to promote consistency. We evaluated FSD-CAP on multiple datasets. With $99.5\\%$ of features missing across five benchmark datasets, FSD-CAP achieves average accuracies of $80.06\\%$ (structural) and $81.01\\%$ (uniform) in node classification, close to the $81.31\\%$ achieved by a standard GCN with full features. For link prediction under the same setting, it reaches AUC scores of $91.65\\%$ (structural) and $92.41\\%$ (uniform), compared to $95.06\\%$ for the fully observed case. Furthermore, FSD-CAP demonstrates superior performance on both large-scale and heterophily datasets when compared to other models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18939",
        "abs_url": "https://arxiv.org/abs/2601.18939",
        "pdf_url": "https://arxiv.org/pdf/2601.18939",
        "title": "A Few Bad Neurons: Isolating and Surgically Correcting Sycophancy",
        "authors": [
            "Claire O'Brien",
            "Jessica Seto",
            "Dristi Roy",
            "Aditya Dwivedi",
            "Sunishchal Dev",
            "Kevin Zhu",
            "Sean O'Brien",
            "Ashwinee Panda",
            "Ryan Lagasse"
        ],
        "comments": "Accepted to NeurIPS Workshop on CogInterp and NeurIPS Workshop on Reliable ML 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Behavioral alignment in large language models (LLMs) is often achieved through broad fine-tuning, which can result in undesired side effects like distributional shift and low interpretability. We propose a method for alignment that identifies and updates only the neurons most responsible for a given behavior, a targeted approach that allows for fine-tuning with significantly less data. Using sparse autoencoders (SAEs) and linear probes, we isolate the 3% of MLP neurons most predictive of a target behavior, decode them into residual space, and fine-tune only those neurons using gradient masking. We demonstrate this approach on the task of reducing sycophantic behavior, where our method matches or exceeds state-of-the-art performance on four benchmarks (Syco-Bench, NLP, POLI, PHIL) using Gemma-2-2B and 9B models. Our results show that sparse, neuron-level updates offer a scalable and precise alternative to full-model fine-tuning, remaining effective even in situations when little data is available",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18952",
        "abs_url": "https://arxiv.org/abs/2601.18952",
        "pdf_url": "https://arxiv.org/pdf/2601.18952",
        "title": "Vector-Valued Distributional Reinforcement Learning Policy Evaluation: A Hilbert Space Embedding Approach",
        "authors": [
            "Mehrdad Mohammadi",
            "Qi Zheng",
            "Ruoqing Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Methodology (stat.ME); Machine Learning (stat.ML)",
        "abstract": "We propose an (offline) multi-dimensional distributional reinforcement learning framework (KE-DRL) that leverages Hilbert space mappings to estimate the kernel mean embedding of the multi-dimensional value distribution under a proposed target policy. In our setting, the state-action variables are multi-dimensional and continuous. By mapping probability measures into a reproducing kernel Hilbert space via kernel mean embeddings, our method replaces Wasserstein metrics with an integral probability metric. This enables efficient estimation in multi-dimensional state-action spaces and reward settings, where direct computation of Wasserstein distances is computationally challenging. Theoretically, we establish contraction properties of the distributional Bellman operator under our proposed metric involving the Matern family of kernels and provide uniform convergence guarantees. Simulations and empirical results demonstrate robust off-policy evaluation and recovery of the kernel mean embedding under mild assumptions, namely, Lipschitz continuity and boundedness of the kernels, highlighting the potential of embedding-based approaches in complex real-world decision-making scenarios and risk evaluation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18972",
        "abs_url": "https://arxiv.org/abs/2601.18972",
        "pdf_url": "https://arxiv.org/pdf/2601.18972",
        "title": "Towards Self-Optimizing Electron Microscope: Robust Tuning of Aberration Coefficients via Physics-Aware Multi-Objective Bayesian Optimization",
        "authors": [
            "Utkarsh Pratiush",
            "Austin Houston",
            "Richard Liu",
            "Gerd Duscher",
            "Sergei Kalinin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "Realizing high-throughput aberration-corrected Scanning Transmission Electron Microscopy (STEM) exploration of atomic structures requires rapid tuning of multipole probe correctors while compensating for the inevitable drift of the optical column. While automated alignment routines exist, conventional approaches rely on serial, gradient-free searches (e.g., Nelder-Mead) that are sample-inefficient and struggle to correct multiple interacting parameters simultaneously. Conversely, emerging deep learning methods offer speed but often lack the flexibility to adapt to varying sample conditions without extensive retraining. Here, we introduce a Multi-Objective Bayesian Optimization (MOBO) framework for rapid, data-efficient aberration correction. Importantly, this framework does not prescribe a single notion of image quality; instead, it enables user-defined, physically motivated reward formulations (e.g., symmetry-induced objectives) and uses Pareto fronts to expose the resulting trade-offs between competing experimental priorities. By using Gaussian Process regression to model the aberration landscape probabilistically, our workflow actively selects the most informative lens settings to evaluate next, rather than performing an exhaustive blind search. We demonstrate that this active learning loop is more robust than traditional optimization algorithms and effectively tunes focus, astigmatism, and higher-order aberrations. By balancing competing objectives, this approach enables \"self-optimizing\" microscopy by dynamically sustaining optimal performance during experiments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18981",
        "abs_url": "https://arxiv.org/abs/2601.18981",
        "pdf_url": "https://arxiv.org/pdf/2601.18981",
        "title": "Attention-Enhanced Graph Filtering for False Data Injection Attack Detection and Localization",
        "authors": [
            "Ruslan Abdulin",
            "Mohammad Rasoul Narimani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR); Optimization and Control (math.OC)",
        "abstract": "The increasing deployment of Internet-of-Things (IoT)-enabled measurement devices in modern power systems has expanded the cyberattack surface of the grid. As a result, this critical infrastructure is increasingly exposed to cyberattacks, including false data injection attacks (FDIAs) that compromise measurement integrity and threaten reliable system operation. Existing FDIA detection methods primarily exploit spatial correlations and network topology using graph-based learning; however, these approaches often rely on high-dimensional representations and shallow classifiers, limiting their ability to capture local structural dependencies and global contextual relationships. Moreover, naively incorporating Transformer architectures can result in overly deep models that struggle to model localized grid dynamics. This paper proposes a joint FDIA detection and localization framework that integrates auto-regressive moving average (ARMA) graph convolutional filters with an Encoder-Only Transformer architecture. The ARMA-based graph filters provide robust, topology-aware feature extraction and adaptability to abrupt spectral changes, while the Transformer encoder leverages self-attention to capture long-range dependencies among grid elements without sacrificing essential local context. The proposed method is evaluated using real-world load data from the New York Independent System Operator (NYISO) applied to the IEEE 14- and 300-bus systems. Numerical results demonstrate that the proposed model effectively exploits both the state and topology of the power grid, achieving high accuracy in detecting FDIA events and localizing compromised nodes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18984",
        "abs_url": "https://arxiv.org/abs/2601.18984",
        "pdf_url": "https://arxiv.org/pdf/2601.18984",
        "title": "Save the Good Prefix: Precise Error Penalization via Process-Supervised RL to Enhance LLM Reasoning",
        "authors": [
            "Haolin Liu",
            "Dian Yu",
            "Sidi Lu",
            "Yujun Zhou",
            "Rui Liu",
            "Zhenwen Liang",
            "Haitao Mi",
            "Chen-Yu Wei",
            "Dong Yu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Reinforcement learning (RL) has emerged as a powerful framework for improving the reasoning capabilities of large language models (LLMs). However, most existing RL approaches rely on sparse outcome rewards, which fail to credit correct intermediate steps in partially successful solutions. Process reward models (PRMs) offer fine-grained step-level supervision, but their scores are often noisy and difficult to evaluate. As a result, recent PRM benchmarks focus on a more objective capability: detecting the first incorrect step in a reasoning path. However, this evaluation target is misaligned with how PRMs are typically used in RL, where their step-wise scores are treated as raw rewards to maximize. To bridge this gap, we propose Verifiable Prefix Policy Optimization (VPPO), which uses PRMs only to localize the first error during RL. Given an incorrect rollout, VPPO partitions the trajectory into a verified correct prefix and an erroneous suffix based on the first error, rewarding the former while applying targeted penalties only after the detected mistake. This design yields stable, interpretable learning signals and improves credit assignment. Across multiple reasoning benchmarks, VPPO consistently outperforms sparse-reward RL and prior PRM-guided baselines on both Pass@1 and Pass@K.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18999",
        "abs_url": "https://arxiv.org/abs/2601.18999",
        "pdf_url": "https://arxiv.org/pdf/2601.18999",
        "title": "Randomization Boosts KV Caching, Learning Balances Query Load: A Joint Perspective",
        "authors": [
            "Fangzhou Wu",
            "Sandeep Silwal",
            "Qiuyi",
            "Zhang"
        ],
        "comments": "ICLR 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "KV caching is a fundamental technique for accelerating Large Language Model (LLM) inference by reusing key-value (KV) pairs from previous queries, but its effectiveness under limited memory is highly sensitive to the eviction policy. The default Least Recently Used (LRU) eviction algorithm struggles with dynamic online query arrivals, especially in multi-LLM serving scenarios, where balancing query load across workers and maximizing cache hit rate of each worker are inherently conflicting objectives. We give the first unified mathematical model that captures the core trade-offs between KV cache eviction and query routing. Our analysis reveals the theoretical limitations of existing methods and leads to principled algorithms that integrate provably competitive randomized KV cache eviction with learning-based methods to adaptively route queries with evolving patterns, thus balancing query load and cache hit rate. Our theoretical results are validated by extensive experiments across 4 benchmarks and 3 prefix-sharing settings, demonstrating improvements of up to 6.92$\\times$ in cache hit rate, 11.96$\\times$ reduction in latency, 14.06$\\times$ reduction in time-to-first-token (TTFT), and 77.4% increase in throughput over the state-of-the-art methods. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19007",
        "abs_url": "https://arxiv.org/abs/2601.19007",
        "pdf_url": "https://arxiv.org/pdf/2601.19007",
        "title": "Accelerated training of Gaussian processes using banded square exponential covariances",
        "authors": [
            "Emily C. Ehrhardt",
            "Felipe Tobar"
        ],
        "comments": "Accepted at IEEE ICASSP 2026",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "We propose a novel approach to computationally efficient GP training based on the observation that square-exponential (SE) covariance matrices contain several off-diagonal entries extremely close to zero. We construct a principled procedure to eliminate those entries to produce a \\emph{banded}-matrix approximation to the original covariance, whose inverse and determinant can be computed at a reduced computational cost, thus contributing to an efficient approximation to the likelihood function. We provide a theoretical analysis of the proposed method to preserve the structure of the original covariance in the 1D setting with SE kernel, and validate its computational efficiency against the variational free energy approach to sparse GPs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19026",
        "abs_url": "https://arxiv.org/abs/2601.19026",
        "pdf_url": "https://arxiv.org/pdf/2601.19026",
        "title": "Is Finer Better? The Limits of Microscaling Formats in Large Language Models",
        "authors": [
            "Andrea Fasoli",
            "Monodeep Kar",
            "Chi-Chun Liu",
            "Swagath Venkataramani",
            "Viji Srinivasan",
            "Leland Chang",
            "Naigang Wang"
        ],
        "comments": "31 pages, 17 figures, 3 tables; accepted to ICLR 2026",
        "subjects": "Machine Learning (cs.LG); Hardware Architecture (cs.AR); Computation and Language (cs.CL)",
        "abstract": "Microscaling data formats leverage per-block tensor quantization to enable aggressive model compression with limited loss in accuracy. Unlocking their potential for efficient training and inference necessitates hardware-friendly implementations that handle matrix multiplications in a native format and adopt efficient error-mitigation strategies. Herein, we report the emergence of a surprising behavior associated with microscaling quantization, whereas the output of a quantized model degrades as block size is decreased below a given threshold. This behavior clashes with the expectation that a smaller block size should allow for a better representation of the tensor elements. We investigate this phenomenon both experimentally and theoretically, decoupling the sources of quantization error behind it. Experimentally, we analyze the distributions of several Large Language Models and identify the conditions driving the anomalous behavior. Theoretically, we lay down a framework showing remarkable agreement with experimental data from pretrained model distributions and ideal ones. Overall, we show that the anomaly is driven by the interplay between narrow tensor distributions and the limited dynamic range of the quantized scales. Based on these insights, we propose the use of FP8 unsigned E5M3 (UE5M3) as a novel hardware-friendly format for the scales in FP4 microscaling data types. We demonstrate that UE5M3 achieves comparable performance to the conventional FP8 unsigned E4M3 scales while obviating the need of global scaling operations on weights and activations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19035",
        "abs_url": "https://arxiv.org/abs/2601.19035",
        "pdf_url": "https://arxiv.org/pdf/2601.19035",
        "title": "Unravelling the (In)compatibility of Statistical-Parity and Equalized-Odds",
        "authors": [
            "Mortaza S. Bargh",
            "Sunil Choenni",
            "Floris ter Braak"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "A key challenge in employing data, algorithms and data-driven systems is to adhere to the principle of fairness and justice. Statistical fairness measures belong to an important category of technical/formal mechanisms for detecting fairness issues in data and algorithms. In this contribution we study the relations between two types of statistical fairness measures namely Statistical-Parity and Equalized-Odds. The Statistical-Parity measure does not rely on having ground truth, i.e., (objectively) labeled target attributes. This makes Statistical-Parity a suitable measure in practice for assessing fairness in data and data classification algorithms. Therefore, Statistical-Parity is adopted in many legal and professional frameworks for assessing algorithmic fairness. The Equalized-Odds measure, on the contrary, relies on having (reliable) ground-truth, which is not always feasible in practice. Nevertheless, there are several situations where the Equalized-Odds definition should be satisfied to enforce false prediction parity among sensitive social groups. We present a novel analyze of the relation between Statistical-Parity and Equalized-Odds, depending on the base-rates of sensitive groups. The analysis intuitively shows how and when base-rate imbalance causes incompatibility between Statistical-Parity and Equalized-Odds measures. As such, our approach provides insight in (how to make design) trade-offs between these measures in practice. Further, based on our results, we plea for examining base-rate (im)balance and investigating the possibility of such an incompatibility before enforcing or relying on the Statistical-Parity criterion. The insights provided, we foresee, may trigger initiatives to improve or adjust the current practice and/or the existing legal frameworks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19037",
        "abs_url": "https://arxiv.org/abs/2601.19037",
        "pdf_url": "https://arxiv.org/pdf/2601.19037",
        "title": "XIMP: Cross Graph Inter-Message Passing for Molecular Property Prediction",
        "authors": [
            "Anatol Ehrlich",
            "Lorenz Kummer",
            "Vojtech Voracek",
            "Franka Bause",
            "Nils M. Kriege"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM); Machine Learning (stat.ML)",
        "abstract": "Accurate molecular property prediction is central to drug discovery, yet graph neural networks often underperform in data-scarce regimes and fail to surpass traditional fingerprints. We introduce cross-graph inter-message passing (XIMP), which performs message passing both within and across multiple related graph representations. For small molecules, we combine the molecular graph with scaffold-aware junction trees and pharmacophore-encoding extended reduced graphs, integrating complementary abstractions. While prior work is either limited to a single abstraction or non-iterative communication across graphs, XIMP supports an arbitrary number of abstractions and both direct and indirect communication between them in each layer. Across ten diverse molecular property prediction tasks, XIMP outperforms state-of-the-art baselines in most cases, leveraging interpretable abstractions as an inductive bias that guides learning toward established chemical concepts, enhancing generalization in low-data settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19040",
        "abs_url": "https://arxiv.org/abs/2601.19040",
        "pdf_url": "https://arxiv.org/pdf/2601.19040",
        "title": "OATS: Online Data Augmentation for Time Series Foundation Models",
        "authors": [
            "Junwei Deng",
            "Chang Xu",
            "Jiaqi W. Ma",
            "Ming Jin",
            "Chenghao Liu",
            "Jiang Bian"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time Series Foundation Models (TSFMs) are a powerful paradigm for time series analysis and are often enhanced by synthetic data augmentation to improve the training data quality. Existing augmentation methods, however, typically rely on heuristics and static paradigms. Motivated by dynamic data optimization, which shows that the contribution of samples varies across training stages, we propose OATS (Online Data Augmentation for Time Series Foundation Models), a principled strategy that generates synthetic data tailored to different training steps. OATS leverages valuable training samples as principled guiding signals and dynamically generates high-quality synthetic data conditioned on them. We further design a diffusion-based framework to produce realistic time series and introduce an explore-exploit mechanism to balance efficiency and effectiveness. Experiments on TSFMs demonstrate that OATS consistently outperforms regular training and yields substantial performance gains over static data augmentation baselines across six validation datasets and two TSFM architectures. The code is available at the link this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19070",
        "abs_url": "https://arxiv.org/abs/2601.19070",
        "pdf_url": "https://arxiv.org/pdf/2601.19070",
        "title": "Critical Organization of Deep Neural Networks, and p-Adic Statistical Field Theories",
        "authors": [
            "W. A. Zúñiga-Galindo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We rigorously study the thermodynamic limit of deep neural networks (DNNS) and recurrent neural networks (RNNs), assuming that the activation functions are sigmoids. A thermodynamic limit is a continuous neural network, where the neurons form a continuous space with infinitely many points. We show that such a network admits a unique state in a certain region of the parameter space, which depends continuously on the parameters. This state breaks into an infinite number of states outside the mentioned region of parameter space. Then, the critical organization is a bifurcation in the parameter space, where a network transitions from a unique state to infinitely many states. We use p-adic integers to codify hierarchical structures. Indeed, we present an algorithm that recasts the hierarchical topologies used in DNNs and RNNs as p-adic tree-like structures. In this framework, the hierarchical and the critical organizations are connected. We study rigorously the critical organization of a toy model, a hierarchical edge detector for grayscale images based on p-adic cellular neural networks. The critical organization of such a network can be described as a strange attractor. In the second part, we study random versions of DNNs and RNNs. In this case, the network parameters are generalized Gaussian random variables in a space of quadratic integrable functions. We compute the probability distribution of the output given the input, in the infinite-width case. We show that it admits a power-type expansion, where the constant term is a Gaussian distribution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19085",
        "abs_url": "https://arxiv.org/abs/2601.19085",
        "pdf_url": "https://arxiv.org/pdf/2601.19085",
        "title": "Speed is Confidence",
        "authors": [
            "Joshua V. Dillon"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Biological neural systems must be fast but are energy-constrained. Evolution's solution: act on the first signal. Winner-take-all circuits and time-to-first-spike coding implicitly treat when a neuron fires as an expression of confidence. We apply this principle to ensembles of Tiny Recursive Models (TRM). By basing the ensemble prediction solely on the first to halt rather than averaging predictions, we achieve 97.2% puzzle accuracy on Sudoku-Extreme while using 10x less compute than test-time augmentation (the baseline achieves 86.1% single-pass, 97.3% with TTA). Inference speed is an implicit indication of confidence. But can this capability be manifested as a training-only cost? Evidently yes: by maintaining K = 4 parallel latent states during training but backpropping only through the lowest-loss \"winner,\" a single model achieves 96.9% +/- 0.6% puzzle accuracy with a single forward pass-matching TTA performance without any test-time augmentation. As in nature, this work was also resource constrained: all experimentation used a single RTX 5090. This necessitated efficiency and compelled our invention of a modified SwiGLU which made Muon viable. With Muon and K = 1 training, we exceed TRM baseline performance in 7k steps (40 min). Higher accuracy requires 36k steps: 1.5 hours for K = 1, 6 hours for K = 4.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19090",
        "abs_url": "https://arxiv.org/abs/2601.19090",
        "pdf_url": "https://arxiv.org/pdf/2601.19090",
        "title": "Privacy-Preserving Model Transcription with Differentially Private Synthetic Distillation",
        "authors": [
            "Bochao Liu",
            "Shiming Ge",
            "Pengju Wang",
            "Shikun Li",
            "Tongliang Liu"
        ],
        "comments": "Accepted by IEEE Trans. Pattern Anal. Mach. Intell. (TPAMI)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "While many deep learning models trained on private datasets have been deployed in various practical tasks, they may pose a privacy leakage risk as attackers could recover informative data or label knowledge from models. In this work, we present \\emph{privacy-preserving model transcription}, a data-free model-to-model conversion solution to facilitate model deployment with a privacy guarantee. To this end, we propose a cooperative-competitive learning approach termed \\emph{differentially private synthetic distillation} that learns to convert a pretrained model (teacher) into its privacy-preserving counterpart (student) via a trainable generator without access to private data. The learning collaborates with three players in a unified framework and performs alternate optimization: i)~the generator is learned to generate synthetic data, ii)~the teacher and student accept the synthetic data and compute differential private labels by flexible data or label noisy perturbation, and iii)~the student is updated with noisy labels and the generator is updated by taking the student as a discriminator for adversarial training. We theoretically prove that our approach can guarantee differential privacy and convergence. The transcribed student has good performance and privacy protection, while the resulting generator can generate private synthetic data for downstream tasks. Extensive experiments clearly demonstrate that our approach outperforms 26 state-of-the-arts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19091",
        "abs_url": "https://arxiv.org/abs/2601.19091",
        "pdf_url": "https://arxiv.org/pdf/2601.19091",
        "title": "Out-of-Distribution Generalization for Neural Physics Solvers",
        "authors": [
            "Zhao Wei",
            "Chin Chun Ooi",
            "Jian Cheng Wong",
            "Abhishek Gupta",
            "Pao-Hsiung Chiu",
            "Yew-Soon Ong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Neural physics solvers are increasingly used in scientific discovery, given their potential for rapid in silico insights into physical, materials, or biological systems and their long-time evolution. However, poor generalization beyond their training support limits exploration of novel designs and long-time horizon predictions. We introduce NOVA, a route to generalizable neural physics solvers that can provide rapid, accurate solutions to scenarios even under distributional shifts in partial differential equation parameters, geometries and initial conditions. By learning physics-aligned representations from an initial sparse set of scenarios, NOVA consistently achieves 1-2 orders of magnitude lower out-of-distribution errors than data-driven baselines across complex, nonlinear problems including heat transfer, diffusion-reaction and fluid flow. We further showcase NOVA's dual impact on stabilizing long-time dynamical rollouts and improving generative design through application to the simulation of nonlinear Turing systems and fluidic chip optimization. Unlike neural physics solvers that are constrained to retrieval and/or emulation within an a priori space, NOVA enables reliable extrapolation beyond known regimes, a key capability given the need for exploration of novel hypothesis spaces in scientific discovery",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19102",
        "abs_url": "https://arxiv.org/abs/2601.19102",
        "pdf_url": "https://arxiv.org/pdf/2601.19102",
        "title": "OWLEYE: Zero-Shot Learner for Cross-Domain Graph Data Anomaly Detection",
        "authors": [
            "Lecheng Zheng",
            "Dongqi Fu",
            "Zihao Li",
            "Jingrui He"
        ],
        "comments": "Accepted by ICLR 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph data is informative to represent complex relationships such as transactions between accounts, communications between devices, and dependencies among machines or processes. Correspondingly, graph anomaly detection (GAD) plays a critical role in identifying anomalies across various domains, including finance, cybersecurity, manufacturing, etc. Facing the large-volume and multi-domain graph data, nascent efforts attempt to develop foundational generalist models capable of detecting anomalies in unseen graphs without retraining. To the best of our knowledge, the different feature semantics and dimensions of cross-domain graph data heavily hinder the development of the graph foundation model, leaving further in-depth continual learning and inference capabilities a quite open problem. Hence, we propose OWLEYE, a novel zero-shot GAD framework that learns transferable patterns of normal behavior from multiple graphs, with a threefold contribution. First, OWLEYE proposes a cross-domain feature alignment module to harmonize feature distributions, which preserves domain-specific semantics during alignment. Second, with aligned features, to enable continuous learning capabilities, OWLEYE designs the multi-domain multi-pattern dictionary learning to encode shared structural and attribute-based patterns. Third, for achieving the in-context learning ability, OWLEYE develops a truncated attention-based reconstruction module to robustly detect anomalies without requiring labeled data for unseen graph-structured data. Extensive experiments on real-world datasets demonstrate that OWLEYE achieves superior performance and generalizability compared to state-of-the-art baselines, establishing a strong foundation for scalable and label-efficient anomaly detection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19107",
        "abs_url": "https://arxiv.org/abs/2601.19107",
        "pdf_url": "https://arxiv.org/pdf/2601.19107",
        "title": "TinyTorch: Building Machine Learning Systems from First Principles",
        "authors": [
            "Vijay Janapa Reddi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine learning systems engineering requires a deep understanding of framework internals. Yet most current education separates algorithms from systems. Students learn gradient descent without measuring memory usage, and attention mechanisms without profiling computational cost. This split leaves graduates unprepared to debug real production failures and widens the gap between machine learning research and reliable deployment. We present TinyTorch, a 20 module curriculum in which students implement the core components of PyTorch, including tensors, autograd, optimizers, and neural networks, entirely in pure Python. The curriculum is built around three pedagogical principles. Progressive disclosure gradually introduces complexity as students build confidence. Systems first integration embeds memory and performance awareness from the very beginning. Historical milestone validation guides students to recreate key breakthroughs, from the Perceptron in 1958 to modern Transformers, using only code they have written themselves. TinyTorch requires only a laptop with 4GB of RAM and no GPU, making machine learning systems education accessible worldwide. Its goal is to prepare the next generation of AI engineers, practitioners who understand not only what machine learning systems do, but why they work and how to make them scale. The curriculum is available as open source at this http URL slash tinytorch.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19139",
        "abs_url": "https://arxiv.org/abs/2601.19139",
        "pdf_url": "https://arxiv.org/pdf/2601.19139",
        "title": "Native LLM and MLLM Inference at Scale on Apple Silicon",
        "authors": [
            "Wayner Barrios"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC); Emerging Technologies (cs.ET)",
        "abstract": "The growing adoption of Apple Silicon for machine learning development has created demand for efficient inference solutions that leverage its unique unified memory architecture. However, existing tools either lack native optimization (PyTorch MPS) or focus solely on text models (this http URL), leaving multimodal workloads underserved. We present vllm-mlx, a framework for efficient LLM and MLLM inference on Apple Silicon built natively on MLX. For text models, we achieve 21% to 87% higher throughput than this http URL across models ranging from Qwen3-0.6B to Nemotron-30B, while providing continuous batching that scales to 4.3x aggregate throughput at 16 concurrent requests. For multimodal models, we introduce content-based prefix caching that eliminates redundant vision encoding by identifying identical images through content hashing, regardless of input format. Our evaluation on Apple M4 Max demonstrates throughput of up to 525 tokens per second on text models and 28x speedup on repeated image queries, reducing multimodal latency from 21.7 seconds to under 1 second. Video analysis with up to 64 frames achieves 24.7x cache speedup. We release our implementation as open source to support efficient inference on consumer Apple hardware.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19149",
        "abs_url": "https://arxiv.org/abs/2601.19149",
        "pdf_url": "https://arxiv.org/pdf/2601.19149",
        "title": "GPCR-Filter: a deep learning framework for efficient and precise GPCR modulator discovery",
        "authors": [
            "Jingjie Ning",
            "Xiangzhen Shen",
            "Li Hou",
            "Shiyi Shen",
            "Jiahao Yang",
            "Junrui Li",
            "Hong Shan",
            "Sanan Wu",
            "Sihan Gao",
            "Huaqiang Eric Xu",
            "Xinheng He"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "G protein-coupled receptors (GPCRs) govern diverse physiological processes and are central to modern pharmacology. Yet discovering GPCR modulators remains challenging because receptor activation often arises from complex allosteric effects rather than direct binding affinity, and conventional assays are slow, costly, and not optimized for capturing these dynamics. Here we present GPCR-Filter, a deep learning framework specifically developed for GPCR modulator discovery. We assembled a high-quality dataset of over 90,000 experimentally validated GPCR-ligand pairs, providing a robust foundation for training and evaluation. GPCR-Filter integrates the ESM-3 protein language model for high-fidelity GPCR sequence representations with graph neural networks that encode ligand structures, coupled through an attention-based fusion mechanism that learns receptor-ligand functional relationships. Across multiple evaluation settings, GPCR-Filter consistently outperforms state-of-the-art compound-protein interaction models and exhibits strong generalization to unseen receptors and ligands. Notably, the model successfully identified micromolar-level agonists of the 5-HT\\textsubscript{1A} receptor with distinct chemical frameworks. These results establish GPCR-Filter as a scalable and effective computational approach for GPCR modulator discovery, advancing AI-assisted drug development for complex signaling systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19179",
        "abs_url": "https://arxiv.org/abs/2601.19179",
        "pdf_url": "https://arxiv.org/pdf/2601.19179",
        "title": "Learning Ordered Representations in Latent Space for Intrinsic Dimension Estimation via Principal Component Autoencoder",
        "authors": [
            "Qipeng Zhan",
            "Zhuoping Zhou",
            "Zexuan Wang",
            "Li Shen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Autoencoders have long been considered a nonlinear extension of Principal Component Analysis (PCA). Prior studies have demonstrated that linear autoencoders (LAEs) can recover the ordered, axis-aligned principal components of PCA by incorporating non-uniform $\\ell_2$ regularization or by adjusting the loss function. However, these approaches become insufficient in the nonlinear setting, as the remaining variance cannot be properly captured independently of the nonlinear mapping. In this work, we propose a novel autoencoder framework that integrates non-uniform variance regularization with an isometric constraint. This design serves as a natural generalization of PCA, enabling the model to preserve key advantages, such as ordered representations and variance retention, while remaining effective for nonlinear dimensionality reduction tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19189",
        "abs_url": "https://arxiv.org/abs/2601.19189",
        "pdf_url": "https://arxiv.org/pdf/2601.19189",
        "title": "Foresight Learning for SEC Risk Prediction",
        "authors": [
            "Benjamin Turtel",
            "Paul Wilczewski",
            "Danny Franklin",
            "Kris Skotheim"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Risk disclosures in SEC filings describe potential adverse events but rarely quantify their likelihood, limiting their usefulness for probabilistic analysis. A central obstacle is the absence of large-scale, risk-level supervision linking disclosed risks to realized outcomes. We introduce a fully automated data generation pipeline that converts qualitative SEC risk disclosures into temporally grounded supervision using only public data. For each filing, the pipeline generates firm-specific, time-bounded risk queries from the Risk Factors section and labels them by automatically resolving outcomes against subsequent disclosures. Using this dataset of risk queries and outcomes grounded in SEC filings, we train a compact large language model to estimate the probability that a disclosed risk will materialize within a specified horizon. Despite its modest size, the resulting model substantially improves over pretrained and heuristic baselines, and outperforms frontier general-purpose models, including GPT-5, on probabilistic accuracy and calibration. More broadly, this work demonstrates that Foresight Learning enables scalable and fully automated training of domain-specific expert models using only raw, chronological, in-domain text -- without proprietary data, external corpora, or manual annotation. The resulting models achieve frontier-level performance while remaining deployable on a single GPU. This result suggests a general pathway for learning calibrated, decision-relevant signals from naturally occurring enterprise documents. To support transparency and reproducibility, we open-source the evaluation dataset used in this study. Evaluation Data: this https URL Data Generation Platform: this https URL SDK: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19220",
        "abs_url": "https://arxiv.org/abs/2601.19220",
        "pdf_url": "https://arxiv.org/pdf/2601.19220",
        "title": "Accelerated Multiple Wasserstein Gradient Flows for Multi-objective Distributional Optimization",
        "authors": [
            "Dai Hai Nguyen",
            "Duc Dung Nguyen",
            "Atsuyoshi Nakamura",
            "Hiroshi Mamitsuka"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study multi-objective optimization over probability distributions in Wasserstein space. Recently, Nguyen et al. (2025) introduced Multiple Wasserstein Gradient Descent (MWGraD) algorithm, which exploits the geometric structure of Wasserstein space to jointly optimize multiple objectives. Building on this approach, we propose an accelerated variant, A-MWGraD, inspired by Nesterov's acceleration. We analyze the continuous-time dynamics and establish convergence to weakly Pareto optimal points in probability space. Our theoretical results show that A-MWGraD achieves a convergence rate of O(1/t^2) for geodesically convex objectives and O(e^{-\\sqrt{\\beta}t}) for $\\beta$-strongly geodesically convex objectives, improving upon the O(1/t) rate of MWGraD in the geodesically convex setting. We further introduce a practical kernel-based discretization for A-MWGraD and demonstrate through numerical experiments that it consistently outperforms MWGraD in convergence speed and sampling efficiency on multi-target sampling tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19243",
        "abs_url": "https://arxiv.org/abs/2601.19243",
        "pdf_url": "https://arxiv.org/pdf/2601.19243",
        "title": "Contrast-Source-Based Physics-Driven Neural Network for Inverse Scattering Problems",
        "authors": [
            "Yutong Du",
            "Zicheng Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "Deep neural networks (DNNs) have recently been applied to inverse scattering problems (ISPs) due to their strong nonlinear mapping capabilities. However, supervised DNN solvers require large-scale datasets, which limits their generalization in practical applications. Untrained neural networks (UNNs) address this issue by updating weights from measured electric fields and prior physical knowledge, but existing UNN solvers suffer from long inference time. To overcome these limitations, this paper proposes a contrast-source-based physics-driven neural network (CSPDNN), which predicts the induced current distribution to improve efficiency and incorporates an adaptive total variation loss for robust reconstruction under varying contrast and noise conditions. The improved imaging performance is validated through comprehensive numerical simulations and experimental data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19256",
        "abs_url": "https://arxiv.org/abs/2601.19256",
        "pdf_url": "https://arxiv.org/pdf/2601.19256",
        "title": "E-QRGMM: Efficient Generative Metamodeling for Covariate-Dependent Uncertainty Quantification",
        "authors": [
            "Zhiyang Liang",
            "Qingkai Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Covariate-dependent uncertainty quantification in simulation-based inference is crucial for high-stakes decision-making but remains challenging due to the limitations of existing methods such as conformal prediction and classical bootstrap, which struggle with covariate-specific conditioning. We propose Efficient Quantile-Regression-Based Generative Metamodeling (E-QRGMM), a novel framework that accelerates the quantile-regression-based generative metamodeling (QRGMM) approach by integrating cubic Hermite interpolation with gradient estimation. Theoretically, we show that E-QRGMM preserves the convergence rate of the original QRGMM while reducing grid complexity from $O(n^{1/2})$ to $O(n^{1/5})$ for the majority of quantile levels, thereby substantially improving computational efficiency. Empirically, E-QRGMM achieves a superior trade-off between distributional accuracy and training speed compared to both QRGMM and other advanced deep generative models on synthetic and practical datasets. Moreover, by enabling bootstrap-based construction of confidence intervals for arbitrary estimands of interest, E-QRGMM provides a practical solution for covariate-dependent uncertainty quantification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19280",
        "abs_url": "https://arxiv.org/abs/2601.19280",
        "pdf_url": "https://arxiv.org/pdf/2601.19280",
        "title": "Group Distributionally Robust Optimization-Driven Reinforcement Learning for LLM Reasoning",
        "authors": [
            "Kishan Panaganti",
            "Zhenwen Liang",
            "Wenhao Yu",
            "Haitao Mi",
            "Dong Yu"
        ],
        "comments": "Keywords: Large Language Models, Reasoning Models, Reinforcement Learning, Distributionally Robust Optimization, GRPO",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Recent progress in Large Language Model (LLM) reasoning is increasingly driven by the refinement of post-training loss functions and alignment strategies. However, standard Reinforcement Learning (RL) paradigms like Group Relative Policy Optimization (GRPO) remain constrained by static uniformity: uniform prompt sampling and a fixed number of rollouts per prompt. For heterogeneous, heavy-tailed reasoning data, this creates structural inefficiencies that waste compute on already-solved patterns while under-training the long tail of hard problems. To address this, we propose Multi-Adversary Group Distributionally Robust Optimization (GDRO), an optimization-first framework that moves beyond uniform reasoning models by dynamically adapting the training distribution. We introduce an Online Difficulty Classifier that partitions prompts into dynamic pass@k difficulty groups. We then propose two independent GDRO games for post-training: (1) Prompt-GDRO, which employs an EMA-debiased multiplicative-weights bandit sampler to target the intensive difficulty margin and upweight persistently hard groups without frequency bias; and (2) Rollout-GDRO, which uses a shadow-price controller to reallocate rollouts across groups, maximizing gradient variance reduction on hard tasks under a fixed mean budget (compute-neutral). We provide no-regret guarantees for both controllers and additionally a variance-proxy analysis motivating a square-root optimal rollout allocation for Rollout-GDRO. We validate our framework on the DAPO 14.1k dataset using Qwen3-Base models. Prompt-GDRO and Rollout-GDRO achieve average relative gains of +10.6% and +10.1%, respectively, in pass@8 accuracy across 1.7B, 4B, and 8B scales compared to the GRPO baseline. Qualitative analysis shows an emergent curriculum: the adversaries shift resources to the evolving reasoning frontier, enhancing the reasoning model's performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19285",
        "abs_url": "https://arxiv.org/abs/2601.19285",
        "pdf_url": "https://arxiv.org/pdf/2601.19285",
        "title": "Smoothing the Score Function for Generalization in Diffusion Models: An Optimization-based Explanation Framework",
        "authors": [
            "Xinyu Zhou",
            "Jiawei Zhang",
            "Stephen J. Wright"
        ],
        "comments": "61pages,32 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Diffusion models achieve remarkable generation quality, yet face a fundamental challenge known as memorization, where generated samples can replicate training samples exactly. We develop a theoretical framework to explain this phenomenon by showing that the empirical score function (the score function corresponding to the empirical distribution) is a weighted sum of the score functions of Gaussian distributions, in which the weights are sharp softmax functions. This structure causes individual training samples to dominate the score function, resulting in sampling collapse. In practice, approximating the empirical score function with a neural network can partially alleviate this issue and improve generalization. Our theoretical framework explains why: In training, the neural network learns a smoother approximation of the weighted sum, allowing the sampling process to be influenced by local manifolds rather than single points. Leveraging this insight, we propose two novel methods to further enhance generalization: (1) Noise Unconditioning enables each training sample to adaptively determine its score function weight to increase the effect of more training samples, thereby preventing single-point dominance and mitigating collapse. (2) Temperature Smoothing introduces an explicit parameter to control the smoothness. By increasing the temperature in the softmax weights, we naturally reduce the dominance of any single training sample and mitigate memorization. Experiments across multiple datasets validate our theoretical analysis and demonstrate the effectiveness of the proposed methods in improving generalization while maintaining high generation quality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19296",
        "abs_url": "https://arxiv.org/abs/2601.19296",
        "pdf_url": "https://arxiv.org/pdf/2601.19296",
        "title": "Process-Aware Procurement Lead Time Prediction for Shipyard Delay Mitigation",
        "authors": [
            "Yongjae Lee",
            "Eunhee Park",
            "Daesan Park",
            "Dongho Kim",
            "Jongho Choi",
            "Hyerim Bae"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurately predicting procurement lead time (PLT) remains a challenge in engineered-to-order industries such as shipbuilding and plant construction, where delays in a single key component can disrupt project timelines. In shipyards, pipe spools are critical components; installed deep within hull blocks soon after steel erection, any delay in their procurement can halt all downstream tasks. Recognizing their importance, existing studies predict PLT using the static physical attributes of pipe spools. However, procurement is inherently a dynamic, multi-stakeholder business process involving a continuous sequence of internal and external events at the shipyard, factors often overlooked in traditional approaches. To address this issue, this paper proposes a novel framework that combines event logs, dataset records of the procurement events, with static attributes to predict PLT. The temporal attributes of each event are extracted to reflect the continuity and temporal context of the process. Subsequently, a deep sequential neural network combined with a multi-layered perceptron is employed to integrate these static and dynamic features, enabling the model to capture both structural and contextual information in procurement. Comparative experiments are conducted using real-world pipe spool procurement data from a globally renowned South Korean shipbuilding corporation. Three tasks are evaluated, which are production, post-processing, and procurement lead time prediction. The results show a 22.6% to 50.4% improvement in prediction performance in terms of mean absolute error over the best-performing existing approaches across the three tasks. These findings indicate the value of considering procurement process information for more accurate PLT prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19300",
        "abs_url": "https://arxiv.org/abs/2601.19300",
        "pdf_url": "https://arxiv.org/pdf/2601.19300",
        "title": "Queue Length Regret Bounds for Contextual Queueing Bandits",
        "authors": [
            "Seoungbin Bae",
            "Garyeong Kang",
            "Dabeen Lee"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We introduce contextual queueing bandits, a new context-aware framework for scheduling while simultaneously learning unknown service rates. Individual jobs carry heterogeneous contextual features, based on which the agent chooses a job and matches it with a server to maximize the departure rate. The service/departure rate is governed by a logistic model of the contextual feature with an unknown server-specific parameter. To evaluate the performance of a policy, we consider queue length regret, defined as the difference in queue length between the policy and the optimal policy. The main challenge in the analysis is that the lists of remaining job features in the queue may differ under our policy versus the optimal policy for a given time step, since they may process jobs in different orders. To address this, we propose the idea of policy-switching queues equipped with a sophisticated coupling argument. This leads to a novel queue length regret decomposition framework, allowing us to understand the short-term effect of choosing a suboptimal job-server pair and its long-term effect on queue state differences. We show that our algorithm, CQB-$\\varepsilon$, achieves a regret upper bound of $\\widetilde{\\mathcal{O}}(T^{-1/4})$. We also consider the setting of adversarially chosen contexts, for which our second algorithm, CQB-Opt, achieves a regret upper bound of $\\mathcal{O}(\\log^2 T)$. Lastly, we provide experimental results that validate our theoretical findings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19312",
        "abs_url": "https://arxiv.org/abs/2601.19312",
        "pdf_url": "https://arxiv.org/pdf/2601.19312",
        "title": "LightSBB-M: Bridging Schrödinger and Bass for Generative Diffusion Modeling",
        "authors": [
            "Alexandre Alouadi",
            "Pierre Henry-Labordère",
            "Grégoire Loeper",
            "Othmane Mazhar",
            "Huyên Pham",
            "Nizar Touzi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Computation (stat.CO); Machine Learning (stat.ML)",
        "abstract": "The Schrodinger Bridge and Bass (SBB) formulation, which jointly controls drift and volatility, is an established extension of the classical Schrodinger Bridge (SB). Building on this framework, we introduce LightSBB-M, an algorithm that computes the optimal SBB transport plan in only a few iterations. The method exploits a dual representation of the SBB objective to obtain analytic expressions for the optimal drift and volatility, and it incorporates a tunable parameter beta greater than zero that interpolates between pure drift (the Schrodinger Bridge) and pure volatility (Bass martingale transport). We show that LightSBB-M achieves the lowest 2-Wasserstein distance on synthetic datasets against state-of-the-art SB and diffusion baselines with up to 32 percent improvement. We also illustrate the generative capability of the framework on an unpaired image-to-image translation task (adult to child faces in FFHQ). These findings demonstrate that LightSBB-M provides a scalable, high-fidelity SBB solver that outperforms existing SB and diffusion baselines across both synthetic and real-world generative tasks. The code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19315",
        "abs_url": "https://arxiv.org/abs/2601.19315",
        "pdf_url": "https://arxiv.org/pdf/2601.19315",
        "title": "Generalizable IoT Traffic Representations for Cross-Network Device Identification",
        "authors": [
            "Arunan Sivanathan",
            "David Warren",
            "Deepak Mishra",
            "Sushmita Ruj",
            "Natasha Fernandes",
            "Quan Z. Sheng",
            "Minh Tran",
            "Ben Luo",
            "Daniel Coscia",
            "Gustavo Batista",
            "Hassan Habibi Gharakaheili"
        ],
        "comments": "15 pages, 15 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine learning models have demonstrated strong performance in classifying network traffic and identifying Internet-of-Things (IoT) devices, enabling operators to discover and manage IoT assets at scale. However, many existing approaches rely on end-to-end supervised pipelines or task-specific fine-tuning, resulting in traffic representations that are tightly coupled to labeled datasets and deployment environments, which can limit generalizability. In this paper, we study the problem of learning generalizable traffic representations for IoT device identification. We design compact encoder architectures that learn per-flow embeddings from unlabeled IoT traffic and evaluate them using a frozen-encoder protocol with a simple supervised classifier. Our specific contributions are threefold. (1) We develop unsupervised encoder--decoder models that learn compact traffic representations from unlabeled IoT network flows and assess their quality through reconstruction-based analysis. (2) We show that these learned representations can be used effectively for IoT device-type classification using simple, lightweight classifiers trained on frozen embeddings. (3) We provide a systematic benchmarking study against the state-of-the-art pretrained traffic encoders, showing that larger models do not necessarily yield more robust representations for IoT traffic. Using more than 18 million real IoT traffic flows collected across multiple years and deployment environments, we learn traffic representations from unlabeled data and evaluate device-type classification on disjoint labeled subsets, achieving macro F1-scores exceeding 0.9 for device-type classification and demonstrating robustness under cross-environment deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19320",
        "abs_url": "https://arxiv.org/abs/2601.19320",
        "pdf_url": "https://arxiv.org/pdf/2601.19320",
        "title": "StableQAT: Stable Quantization-Aware Training at Ultra-Low Bitwidths",
        "authors": [
            "Tianyi Chen",
            "Sihan Chen",
            "Xiaoyi Qu",
            "Dan Zhao",
            "Ruomei Yan",
            "Jongwoo Ko",
            "Luming Liang",
            "Pashmina Cameron"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Quantization-aware training (QAT) is essential for deploying large models under strict memory and latency constraints, yet achieving stable and robust optimization at ultra-low bitwidths remains challenging. Common approaches based on the straight-through estimator (STE) or soft quantizers often suffer from gradient mismatch, instability, or high computational overhead. As such, we propose StableQAT, a unified and efficient QAT framework that stabilizes training in ultra low-bit settings via a novel, lightweight, and theoretically grounded surrogate for backpropagation derived from a discrete Fourier analysis of the rounding operator. StableQAT strictly generalizes STE as the latter arises as a special case of our more expressive surrogate family, yielding smooth, bounded, and inexpensive gradients that improve QAT training performance and stability across various hyperparameter choices. In experiments, StableQAT exhibits stable and efficient QAT at 2-4 bit regimes, demonstrating improved training stability, robustness, and superior performance with negligible training overhead against standard QAT techniques. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19333",
        "abs_url": "https://arxiv.org/abs/2601.19333",
        "pdf_url": "https://arxiv.org/pdf/2601.19333",
        "title": "Metric $k$-clustering using only Weak Comparison Oracles",
        "authors": [
            "Rahul Raychaudhury",
            "Aryan Esmailpour",
            "Sainyam Galhotra",
            "Stavros Sintos"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Data Structures and Algorithms (cs.DS)",
        "abstract": "Clustering is a fundamental primitive in unsupervised learning. However, classical algorithms for $k$-clustering (such as $k$-median and $k$-means) assume access to exact pairwise distances -- an unrealistic requirement in many modern applications. We study clustering in the \\emph{Rank-model (R-model)}, where access to distances is entirely replaced by a \\emph{quadruplet oracle} that provides only relative distance comparisons. In practice, such an oracle can represent learned models or human feedback, and is expected to be noisy and entail an access cost. Given a metric space with $n$ input items, we design randomized algorithms that, using only a noisy quadruplet oracle, compute a set of $O(k \\cdot \\mathsf{polylog}(n))$ centers along with a mapping from the input items to the centers such that the clustering cost of the mapping is at most constant times the optimum $k$-clustering cost. Our method achieves a query complexity of $O(n\\cdot k \\cdot \\mathsf{polylog}(n))$ for arbitrary metric spaces and improves to $O((n+k^2) \\cdot \\mathsf{polylog}(n))$ when the underlying metric has bounded doubling dimension. When the metric has bounded doubling dimension we can further improve the approximation from constant to $1+\\varepsilon$, for any arbitrarily small constant $\\varepsilon\\in(0,1)$, while preserving the same asymptotic query complexity. Our framework demonstrates how noisy, low-cost oracles, such as those derived from large language models, can be systematically integrated into scalable clustering algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19341",
        "abs_url": "https://arxiv.org/abs/2601.19341",
        "pdf_url": "https://arxiv.org/pdf/2601.19341",
        "title": "Robust Uncertainty Estimation under Distribution Shift via Difference Reconstruction",
        "authors": [
            "Xinran Xu",
            "Li Rong Wang",
            "Xiuyi Fan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Estimating uncertainty in deep learning models is critical for reliable decision-making in high-stakes applications such as medical imaging. Prior research has established that the difference between an input sample and its reconstructed version produced by an auxiliary model can serve as a useful proxy for uncertainty. However, directly comparing reconstructions with the original input is degraded by information loss and sensitivity to superficial details, which limits its effectiveness. In this work, we propose Difference Reconstruction Uncertainty Estimation (DRUE), a method that mitigates this limitation by reconstructing inputs from two intermediate layers and measuring the discrepancy between their outputs as the uncertainty score. To evaluate uncertainty estimation in practice, we follow the widely used out-of-distribution (OOD) detection paradigm, where in-distribution (ID) training data are compared against datasets with increasing domain shift. Using glaucoma detection as the ID task, we demonstrate that DRUE consistently achieves superior AUC and AUPR across multiple OOD datasets, highlighting its robustness and reliability under distribution shift. This work provides a principled and effective framework for enhancing model reliability in uncertain environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19352",
        "abs_url": "https://arxiv.org/abs/2601.19352",
        "pdf_url": "https://arxiv.org/pdf/2601.19352",
        "title": "GraphSB: Boosting Imbalanced Node Classification on Graphs through Structural Balance",
        "authors": [
            "Zhixiao Wang",
            "Chaofan Zhu",
            "Qihan Feng",
            "Jian Zhang",
            "Xiaobin Rui",
            "Philip S Yu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Imbalanced node classification is a critical challenge in graph learning, where most existing methods typically utilize Graph Neural Networks (GNNs) to learn node representations. These methods can be broadly categorized into the data-level and the algorithm-level. The former aims to synthesize minority-class nodes to mitigate quantity imbalance, while the latter tries to optimize the learning process to highlight minority classes. However, neither of them addresses the inherently imbalanced graph structure, which is a fundamental factor that incurs majority-class dominance and minority-class assimilation in GNNs. Our theoretical analysis further supports this critical insight. Therefore, we propose GraphSB (Graph Structural Balance), a novel framework that incorporates Structural Balance as a key strategy to address the underlying imbalanced graph structure before node synthesis. Structural Balance performs a two-stage structure optimization: Structure Enhancement that mines hard samples near decision boundaries through dual-view analysis and enhances connectivity for minority classes through adaptive augmentation, and Relation Diffusion that propagates the enhanced minority context while simultaneously capturing higher-order structural dependencies. Thus, GraphSB balances structural distribution before node synthesis, enabling more effective learning in GNNs. Extensive experiments demonstrate that GraphSB significantly outperforms the state-of-the-art methods. More importantly, the proposed Structural Balance can be seamlessly integrated into state-of-the-art methods as a simple plug-and-play module, increasing their accuracy by an average of 4.57%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19394",
        "abs_url": "https://arxiv.org/abs/2601.19394",
        "pdf_url": "https://arxiv.org/pdf/2601.19394",
        "title": "DSP-Reg: Domain-Sensitive Parameter Regularization for Robust Domain Generalization",
        "authors": [
            "Xudong Han",
            "Senkang Hu",
            "Yihang Tao",
            "Yu Guo",
            "Philip Birch",
            "Sam Tak Wu Kwong",
            "Yuguang Fang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Domain Generalization (DG) is a critical area that focuses on developing models capable of performing well on data from unseen distributions, which is essential for real-world applications. Existing approaches primarily concentrate on learning domain-invariant features, which assume that a model robust to variations in the source domains will generalize well to unseen target domains. However, these approaches neglect a deeper analysis at the parameter level, which makes the model hard to explicitly differentiate between parameters sensitive to domain shifts and those robust, potentially hindering its overall ability to generalize. In order to address these limitations, we first build a covariance-based parameter sensitivity analysis framework to quantify the sensitivity of each parameter in a model to domain shifts. By computing the covariance of parameter gradients across multiple source domains, we can identify parameters that are more susceptible to domain variations, which serves as our theoretical foundation. Based on this, we propose Domain-Sensitive Parameter Regularization (DSP-Reg), a principled framework that guides model optimization by a soft regularization technique that encourages the model to rely more on domain-invariant parameters while suppressing those that are domain-specific. This approach provides a more granular control over the model's learning process, leading to improved robustness and generalization to unseen domains. Extensive experiments on benchmarks, such as PACS, VLCS, OfficeHome, and DomainNet, demonstrate that DSP-Reg outperforms state-of-the-art approaches, achieving an average accuracy of 66.7\\% and surpassing all baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19395",
        "abs_url": "https://arxiv.org/abs/2601.19395",
        "pdf_url": "https://arxiv.org/pdf/2601.19395",
        "title": "SEAFormer: A Spatial Proximity and Edge-Aware Transformer for Real-World Vehicle Routing Problems",
        "authors": [
            "Saeed Nasehi Basharzad",
            "Farhana Choudhury",
            "Egemen Tanin"
        ],
        "comments": "26 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Real-world Vehicle Routing Problems (RWVRPs) require solving complex, sequence-dependent challenges at scale with constraints such as delivery time window, replenishment or recharging stops, asymmetric travel cost, etc. While recent neural methods achieve strong results on large-scale classical VRP benchmarks, they struggle to address RWVRPs because their strategies overlook sequence dependencies and underutilize edge-level information, which are precisely the characteristics that define the complexity of RWVRPs. We present SEAFormer, a novel transformer that incorporates both node-level and edge-level information in decision-making through two key innovations. First, our Clustered Proximity Attention (CPA) exploits locality-aware clustering to reduce the complexity of attention from $O(n^2)$ to $O(n)$ while preserving global perspective, allowing SEAFormer to efficiently train on large instances. Second, our lightweight edge-aware module captures pairwise features through residual fusion, enabling effective incorporation of edge-based information and faster convergence. Extensive experiments across four RWVRP variants with various scales demonstrate that SEAFormer achieves superior results over state-of-the-art methods. Notably, SEAFormer is the first neural method to solve 1,000+ node RWVRPs effectively, while also achieving superior performance on classic VRPs, making it a versatile solution for both research benchmarks and real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19439",
        "abs_url": "https://arxiv.org/abs/2601.19439",
        "pdf_url": "https://arxiv.org/pdf/2601.19439",
        "title": "OSIRIS: Bridging Analog Circuit Design and Machine Learning with Scalable Dataset Generation",
        "authors": [
            "Giuseppe Chiari",
            "Michele Piccoli",
            "Davide Zoni"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The automation of analog integrated circuit (IC) design remains a longstanding challenge, primarily due to the intricate interdependencies among physical layout, parasitic effects, and circuit-level performance. These interactions impose complex constraints that are difficult to accurately capture and optimize using conventional design methodologies. Although recent advances in machine learning (ML) have shown promise in automating specific stages of the analog design flow, the development of holistic, end-to-end frameworks that integrate these stages and iteratively refine layouts using post-layout, parasitic-aware performance feedback is still in its early stages. Furthermore, progress in this direction is hindered by the limited availability of open, high-quality datasets tailored to the analog domain, restricting both the benchmarking and the generalizability of ML-based techniques. To address these limitations, we present OSIRIS, a scalable dataset generation pipeline for analog IC design. OSIRIS systematically explores the design space of analog circuits while producing comprehensive performance metrics and metadata, thereby enabling ML-driven research in electronic design automation (EDA). In addition, we release a dataset consisting of 87,100 circuit variations generated with OSIRIS, accompanied by a reinforcement learning (RL)-based baseline method that exploits OSIRIS for analog design optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19448",
        "abs_url": "https://arxiv.org/abs/2601.19448",
        "pdf_url": "https://arxiv.org/pdf/2601.19448",
        "title": "From Internal Diagnosis to External Auditing: A VLM-Driven Paradigm for Online Test-Time Backdoor Defense",
        "authors": [
            "Binyan Xu",
            "Fan Yang",
            "Xilin Dai",
            "Di Tang",
            "Kehuan Zhang"
        ],
        "comments": "19 pages, 10 figures, 12 tables",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Deep Neural Networks remain inherently vulnerable to backdoor attacks. Traditional test-time defenses largely operate under the paradigm of internal diagnosis methods like model repairing or input robustness, yet these approaches are often fragile under advanced attacks as they remain entangled with the victim model's corrupted parameters. We propose a paradigm shift from Internal Diagnosis to External Semantic Auditing, arguing that effective defense requires decoupling safety from the victim model via an independent, semantically grounded auditor. To this end, we present a framework harnessing Universal Vision-Language Models (VLMs) as evolving semantic gatekeepers. We introduce PRISM (Prototype Refinement & Inspection via Statistical Monitoring), which overcomes the domain gap of general VLMs through two key mechanisms: a Hybrid VLM Teacher that dynamically refines visual prototypes online, and an Adaptive Router powered by statistical margin monitoring to calibrate gating thresholds in real-time. Extensive evaluation across 17 datasets and 11 attack types demonstrates that PRISM achieves state-of-the-art performance, suppressing Attack Success Rate to <1% on CIFAR-10 while improving clean accuracy, establishing a new standard for model-agnostic, externalized security.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19449",
        "abs_url": "https://arxiv.org/abs/2601.19449",
        "pdf_url": "https://arxiv.org/pdf/2601.19449",
        "title": "Fixed Aggregation Features Can Rival GNNs",
        "authors": [
            "Celia Rubio-Madrigal",
            "Rebekka Burkholz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph neural networks (GNNs) are widely believed to excel at node representation learning through trainable neighborhood aggregations. We challenge this view by introducing Fixed Aggregation Features (FAFs), a training-free approach that transforms graph learning tasks into tabular problems. This simple shift enables the use of well-established tabular methods, offering strong interpretability and the flexibility to deploy diverse classifiers. Across 14 benchmarks, well-tuned multilayer perceptrons trained on FAFs rival or outperform state-of-the-art GNNs and graph transformers on 12 tasks -- often using only mean aggregation. The only exceptions are the Roman Empire and Minesweeper datasets, which typically require unusually deep GNNs. To explain the theoretical possibility of non-trainable aggregations, we connect our findings to Kolmogorov-Arnold representations and discuss when mean aggregation can be sufficient. In conclusion, our results call for (i) richer benchmarks benefiting from learning diverse neighborhood aggregations, (ii) strong tabular baselines as standard, and (iii) employing and advancing tabular models for graph data to gain new insights into related tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19479",
        "abs_url": "https://arxiv.org/abs/2601.19479",
        "pdf_url": "https://arxiv.org/pdf/2601.19479",
        "title": "Time-to-Injury Forecasting in Elite Female Football: A DeepHit Survival Approach",
        "authors": [
            "Victoria Catterall",
            "Cise Midoglu",
            "Stephen Lynch"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Injury occurrence in football poses significant challenges for athletes and teams, carrying personal, competitive, and financial consequences. While machine learning has been applied to injury prediction before, existing approaches often rely on static pre-season data and binary outcomes, limiting their real-world utility. This study investigates the feasibility of using a DeepHit neural network to forecast time-to-injury from longitudinal athlete monitoring data, while providing interpretable predictions. The analysis utilised the publicly available SoccerMon dataset, containing two seasons of training, match, and wellness records from elite female footballers. Data was pre-processed through cleaning, feature engineering, and the application of three imputation strategies. Baseline models (Random Forest, XGBoost, Logistic Regression) were optimised via grid search for benchmarking, while the DeepHit model, implemented with a multilayer perceptron backbone, was evaluated using chronological and leave-one-player-out (LOPO) validation. DeepHit achieved a concordance index of 0.762, outperforming baseline models and delivering individualised, time-varying risk estimates. Shapley Additive Explanations (SHAP) identified clinically relevant predictors consistent with established risk factors, enhancing interpretability. Overall, this study provides a novel proof of concept: survival modelling with DeepHit shows strong potential to advance injury forecasting in football, offering accurate, explainable, and actionable insights for injury prevention across competitive levels.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19541",
        "abs_url": "https://arxiv.org/abs/2601.19541",
        "pdf_url": "https://arxiv.org/pdf/2601.19541",
        "title": "GenCP: Towards Generative Modeling Paradigm of Coupled Physics",
        "authors": [
            "Tianrun Gao",
            "Haoren Zheng",
            "Wenhao Deng",
            "Haodong Feng",
            "Tao Zhang",
            "Ruiqi Feng",
            "Qianyi Chen",
            "Tailin Wu"
        ],
        "comments": "ICLR 2026 Accpeted",
        "subjects": "Machine Learning (cs.LG); Computational Engineering, Finance, and Science (cs.CE)",
        "abstract": "Real-world physical systems are inherently complex, often involving the coupling of multiple physics, making their simulation both highly valuable and challenging. Many mainstream approaches face challenges when dealing with decoupled data. Besides, they also suffer from low efficiency and fidelity in strongly coupled spatio-temporal physical systems. Here we propose GenCP, a novel and elegant generative paradigm for coupled multiphysics simulation. By formulating coupled-physics modeling as a probability modeling problem, our key innovation is to integrate probability density evolution in generative modeling with iterative multiphysics coupling, thereby enabling training on data from decoupled simulation and inferring coupled physics during sampling. We also utilize operator-splitting theory in the space of probability evolution to establish error controllability guarantees for this \"conditional-to-joint\" sampling scheme. We evaluate our paradigm on a synthetic setting and three challenging multi-physics scenarios to demonstrate both principled insight and superior application performance of GenCP. Code is available at this repo: this http URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19561",
        "abs_url": "https://arxiv.org/abs/2601.19561",
        "pdf_url": "https://arxiv.org/pdf/2601.19561",
        "title": "AROMMA: Unifying Olfactory Embeddings for Single Molecules and Mixtures",
        "authors": [
            "Dayoung Kang",
            "JongWon Kim",
            "Jiho Park",
            "Keonseock Lee",
            "Ji-Woong Choi",
            "Jinhyun So"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Public olfaction datasets are small and fragmented across single molecules and mixtures, limiting learning of generalizable odor representations. Recent works either learn single-molecule embeddings or address mixtures via similarity or pairwise label prediction, leaving representations separate and unaligned. In this work, we propose AROMMA, a framework that learns a unified embedding space for single molecules and two-molecule mixtures. Each molecule is encoded by a chemical foundation model and the mixtures are composed by an attention-based aggregator, ensuring both permutation invariance and asymmetric molecular interactions. We further align odor descriptor sets using knowledge distillation and class-aware pseudo-labeling to enrich missing mixture annotations. AROMMA achieves state-of-the-art performance in both single-molecule and molecule-pair datasets, with up to 19.1% AUROC improvement, demonstrating a robust generalization in two domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19595",
        "abs_url": "https://arxiv.org/abs/2601.19595",
        "pdf_url": "https://arxiv.org/pdf/2601.19595",
        "title": "Intersectional Fairness via Mixed-Integer Optimization",
        "authors": [
            "Jiří Němeček",
            "Mark Kozdoba",
            "Illia Kryvoviaz",
            "Tomáš Pevný",
            "Jakub Mareček"
        ],
        "comments": "17 pages, 10 figures, 1 table",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "The deployment of Artificial Intelligence in high-risk domains, such as finance and healthcare, necessitates models that are both fair and transparent. While regulatory frameworks, including the EU's AI Act, mandate bias mitigation, they are deliberately vague about the definition of bias. In line with existing research, we argue that true fairness requires addressing bias at the intersections of protected groups. We propose a unified framework that leverages Mixed-Integer Optimization (MIO) to train intersectionally fair and intrinsically interpretable classifiers. We prove the equivalence of two measures of intersectional fairness (MSD and SPSF) in detecting the most unfair subgroup and empirically demonstrate that our MIO-based algorithm improves performance in finding bias. We train high-performing, interpretable classifiers that bound intersectional bias below an acceptable threshold, offering a robust solution for regulated industries and beyond.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19597",
        "abs_url": "https://arxiv.org/abs/2601.19597",
        "pdf_url": "https://arxiv.org/pdf/2601.19597",
        "title": "The Geometric Mechanics of Contrastive Representation Learning: Alignment Potentials, Entropic Dispersion, and Cross-Modal Divergence",
        "authors": [
            "Yichao Cai",
            "Zhen Zhang",
            "Yuhang Liu",
            "Javen Qinfeng Shi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "While InfoNCE powers modern contrastive learning, its geometric mechanisms remain under-characterized beyond the canonical alignment--uniformity decomposition. We present a measure-theoretic framework that models learning as the evolution of representation measures on a fixed embedding manifold. By establishing value and gradient consistency in the large-batch limit, we bridge the stochastic objective to explicit deterministic energy landscapes, uncovering a fundamental geometric bifurcation between the unimodal and multimodal regimes. In the unimodal setting, the intrinsic landscape is strictly convex with a unique Gibbs equilibrium; here, entropy acts merely as a tie-breaker, clarifying \"uniformity\" as a constrained expansion within the alignment basin. In contrast, the symmetric multimodal objective contains a persistent negative symmetric divergence term that remains even after kernel sharpening. We show that this term induces barrier-driven co-adaptation, enforcing a population-level modality gap as a structural geometric necessity rather than an initialization artifact. Our results shift the analytical lens from pointwise discrimination to population geometry, offering a principled basis for diagnosing and controlling distributional misalignment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19611",
        "abs_url": "https://arxiv.org/abs/2601.19611",
        "pdf_url": "https://arxiv.org/pdf/2601.19611",
        "title": "Explicit Multi-head Attention for Inter-head Interaction in Large Language Models",
        "authors": [
            "Runyu Peng",
            "Yunhua Zhou",
            "Demin Song",
            "Kai Lv",
            "Bo Wang",
            "Qipeng Guo",
            "Xipeng Qiu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "In large language models built upon the Transformer architecture, recent studies have shown that inter-head interaction can enhance attention performance. Motivated by this, we propose Multi-head Explicit Attention (MEA), a simple yet effective attention variant that explicitly models cross-head interaction. MEA consists of two key components: a Head-level Linear Composition (HLC) module that separately applies learnable linear combinations to the key and value vectors across heads, thereby enabling rich inter-head communication; and a head-level Group Normalization layer that aligns the statistical properties of the recombined heads. MEA shows strong robustness in pretraining, which allows the use of larger learning rates that lead to faster convergence, ultimately resulting in lower validation loss and improved performance across a range of tasks. Furthermore, we explore the parameter efficiency of MEA by reducing the number of attention heads and leveraging HLC to reconstruct them using low-rank \"virtual heads\". This enables a practical key-value cache compression strategy that reduces KV-cache memory usage by 50% with negligible performance loss on knowledge-intensive and scientific reasoning tasks, and only a 3.59% accuracy drop for Olympiad-level mathematical benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19620",
        "abs_url": "https://arxiv.org/abs/2601.19620",
        "pdf_url": "https://arxiv.org/pdf/2601.19620",
        "title": "R^3: Replay, Reflection, and Ranking Rewards for LLM Reinforcement Learning",
        "authors": [
            "Zhizheng Jiang",
            "Kang Zhao",
            "Weikai Xu",
            "Xinkui Lin",
            "Wei Liu",
            "Jian Luan",
            "Shuo Shang",
            "Peng Han"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Large reasoning models (LRMs) aim to solve diverse and complex problems through structured reasoning. Recent advances in group-based policy optimization methods have shown promise in enabling stable advantage estimation without reliance on process-level annotations. However, these methods rely on advantage gaps induced by high-quality samples within the same batch, which makes the training process fragile and inefficient when intra-group advantages collapse under challenging tasks. To address these problems, we propose a reinforcement learning mechanism named \\emph{\\textbf{R^3}} that along three directions: (1) a \\emph{cross-context \\underline{\\textbf{R}}eplay} strategy that maintains the intra-group advantage by recalling valuable examples from historical trajectories of the same query, (2) an \\emph{in-context self-\\underline{\\textbf{R}}eflection} mechanism enabling models to refine outputs by leveraging past failures, and (3) a \\emph{structural entropy \\underline{\\textbf{R}}anking reward}, which assigns relative rewards to truncated or failed samples by ranking responses based on token-level entropy patterns, capturing both local exploration and global stability. We implement our method on Deepseek-R1-Distill-Qwen-1.5B and train it on the DeepscaleR-40k in the math domain. Experiments demonstrate our method achieves SoTA performance on several math benchmarks, representing significant improvements and fewer reasoning tokens over the base models. Code and model will be released.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19668",
        "abs_url": "https://arxiv.org/abs/2601.19668",
        "pdf_url": "https://arxiv.org/pdf/2601.19668",
        "title": "Grasynda: Graph-based Synthetic Time Series Generation",
        "authors": [
            "Luis Amorim",
            "Moises Santos",
            "Paulo J. Azevedo",
            "Carlos Soares",
            "Vitor Cerqueira"
        ],
        "comments": "Accepted in IDA'26",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Data augmentation is a crucial tool in time series forecasting, especially for deep learning architectures that require a large training sample size to generalize effectively. However, extensive datasets are not always available in real-world scenarios. Although many data augmentation methods exist, their limitations include the use of transformations that do not adequately preserve data properties. This paper introduces Grasynda, a novel graph-based approach for synthetic time series generation that: (1) converts univariate time series into a network structure using a graph representation, where each state is a node and each transition is represented as a directed edge; and (2) encodes their temporal dynamics in a transition probability matrix. We performed an extensive evaluation of Grasynda as a data augmentation method for time series forecasting. We use three neural network variations on six benchmark datasets. The results indicate that Grasynda consistently outperforms other time series data augmentation methods, including ones used in state-of-the-art time series foundation models. The method and all experiments are publicly available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19674",
        "abs_url": "https://arxiv.org/abs/2601.19674",
        "pdf_url": "https://arxiv.org/pdf/2601.19674",
        "title": "Cross-Domain Offshore Wind Power Forecasting: Transfer Learning Through Meteorological Clusters",
        "authors": [
            "Dominic Weisser",
            "Chloé Hashimoto-Cullen",
            "Benjamin Guedj"
        ],
        "comments": "11 pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Applications (stat.AP); Methodology (stat.ME)",
        "abstract": "Ambitious decarbonisation targets are catalysing growth in orders of new offshore wind farms. For these newly commissioned plants to run, accurate power forecasts are needed from the onset. These allow grid stability, good reserve management and efficient energy trading. Despite machine learning models having strong performances, they tend to require large volumes of site-specific data that new farms do not yet have. To overcome this data scarcity, we propose a novel transfer learning framework that clusters power output according to covariate meteorological features. Rather than training a single, general-purpose model, we thus forecast with an ensemble of expert models, each trained on a cluster. As these pre-trained models each specialise in a distinct weather pattern, they adapt efficiently to new sites and capture transferable, climate-dependent dynamics. Through the expert models' built-in calibration to seasonal and meteorological variability, we remove the industry-standard requirement of local measurements over a year. Our contributions are two-fold - we propose this novel framework and comprehensively evaluate it on eight offshore wind farms, achieving accurate cross-domain forecasting with under five months of site-specific data. Our experiments achieve a MAE of 3.52\\%, providing empirical verification that reliable forecasts do not require a full annual cycle. Beyond power forecasting, this climate-aware transfer learning method opens new opportunities for offshore wind applications such as early-stage wind resource assessment, where reducing data requirements can significantly accelerate project development whilst effectively mitigating its inherent risks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19675",
        "abs_url": "https://arxiv.org/abs/2601.19675",
        "pdf_url": "https://arxiv.org/pdf/2601.19675",
        "title": "LoPRo: Enhancing Low-Rank Quantization via Permuted Block-Wise Rotation",
        "authors": [
            "Hongyaoxing Gu",
            "Lijuan Hu",
            "Liye Yu",
            "Haowei Li",
            "Fangfang Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Post-training quantization (PTQ) enables effective model compression while preserving relatively high accuracy. Current weight-only PTQ methods primarily focus on the challenging sub-3-bit regime, where approaches often suffer significant accuracy degradation, typically requiring fine-tuning to achieve competitive performance. In this work, we revisit the fundamental characteristics of weight quantization and analyze the challenges in quantizing the residual matrix under low-rank approximation. We propose LoPRo, a novel fine-tuning-free PTQ algorithm that enhances residual matrix quantization by applying block-wise permutation and Walsh-Hadamard transformations to rotate columns of similar importance, while explicitly preserving the quantization accuracy of the most salient column blocks. Furthermore, we introduce a mixed-precision fast low-rank decomposition based on rank-1 sketch (R1SVD) to further minimize quantization costs. Experiments demonstrate that LoPRo outperforms existing fine-tuning-free PTQ methods at both 2-bit and 3-bit quantization, achieving accuracy comparable to fine-tuning baselines. Specifically, LoPRo achieves state-of-the-art quantization accuracy on LLaMA-2 and LLaMA-3 series models while delivering up to a 4$\\times$ speedup. In the MoE model Mixtral-8x7B, LoPRo completes quantization within 2.5 hours, simultaneously reducing perplexity by 0.4$\\downarrow$ and improving accuracy by 8\\%$\\uparrow$. Moreover, compared to other low-rank quantization methods, LoPRo achieves superior accuracy with a significantly lower rank, while maintaining high inference efficiency and minimal additional latency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19707",
        "abs_url": "https://arxiv.org/abs/2601.19707",
        "pdf_url": "https://arxiv.org/pdf/2601.19707",
        "title": "Scalable Exploration for High-Dimensional Continuous Control via Value-Guided Flow",
        "authors": [
            "Yunyue Wei",
            "Chenhui Zuo",
            "Yanan Sui"
        ],
        "comments": "Accepted by ICLR 2026",
        "subjects": "Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "Controlling high-dimensional systems in biological and robotic applications is challenging due to expansive state-action spaces, where effective exploration is critical. Commonly used exploration strategies in reinforcement learning are largely undirected with sharp degradation as action dimensionality grows. Many existing methods resort to dimensionality reduction, which constrains policy expressiveness and forfeits system flexibility. We introduce Q-guided Flow Exploration (Qflex), a scalable reinforcement learning method that conducts exploration directly in the native high-dimensional action space. During training, Qflex traverses actions from a learnable source distribution along a probability flow induced by the learned value function, aligning exploration with task-relevant gradients rather than isotropic noise. Our proposed method substantially outperforms representative online reinforcement learning baselines across diverse high-dimensional continuous-control benchmarks. Qflex also successfully controls a full-body human musculoskeletal model to perform agile, complex movements, demonstrating superior scalability and sample efficiency in very high-dimensional settings. Our results indicate that value-guided flows offer a principled and practical route to exploration at scale.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19718",
        "abs_url": "https://arxiv.org/abs/2601.19718",
        "pdf_url": "https://arxiv.org/pdf/2601.19718",
        "title": "Rethinking Divisive Hierarchical Clustering from a Distributional Perspective",
        "authors": [
            "Kaifeng Zhang",
            "Kai Ming Ting",
            "Tianrun Liang",
            "Qiuran Zhao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We uncover that current objective-based Divisive Hierarchical Clustering (DHC) methods produce a dendrogram that does not have three desired properties i.e., no unwarranted splitting, group similar clusters into a same subset, ground-truth correspondence. This shortcoming has their root cause in using a set-oriented bisecting assessment criterion. We show that this shortcoming can be addressed by using a distributional kernel, instead of the set-oriented criterion; and the resultant clusters achieve a new distribution-oriented objective to maximize the total similarity of all clusters (TSC). Our theoretical analysis shows that the resultant dendrogram guarantees a lower bound of TSC. The empirical evaluation shows the effectiveness of our proposed method on artificial and Spatial Transcriptomics (bioinformatics) datasets. Our proposed method successfully creates a dendrogram that is consistent with the biological regions in a Spatial Transcriptomics dataset, whereas other contenders fail.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19720",
        "abs_url": "https://arxiv.org/abs/2601.19720",
        "pdf_url": "https://arxiv.org/pdf/2601.19720",
        "title": "Improving Policy Exploitation in Online Reinforcement Learning with Instant Retrospect Action",
        "authors": [
            "Gong Gao",
            "Weidong Zhao",
            "Xianhui Liu",
            "Ning Jia"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Existing value-based online reinforcement learning (RL) algorithms suffer from slow policy exploitation due to ineffective exploration and delayed policy updates. To address these challenges, we propose an algorithm called Instant Retrospect Action (IRA). Specifically, we propose Q-Representation Discrepancy Evolution (RDE) to facilitate Q-network representation learning, enabling discriminative representations for neighboring state-action pairs. In addition, we adopt an explicit method to policy constraints by enabling Greedy Action Guidance (GAG). This is achieved through backtracking historical actions, which effectively enhances the policy update process. Our proposed method relies on providing the learning algorithm with accurate $k$-nearest-neighbor action value estimates and learning to design a fast-adaptable policy through policy constraints. We further propose the Instant Policy Update (IPU) mechanism, which enhances policy exploitation by systematically increasing the frequency of policy updates. We further discover that the early-stage training conservatism of the IRA method can alleviate the overestimation bias problem in value-based RL. Experimental results show that IRA can significantly improve the learning efficiency and final performance of online RL algorithms on eight MuJoCo continuous control tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19730",
        "abs_url": "https://arxiv.org/abs/2601.19730",
        "pdf_url": "https://arxiv.org/pdf/2601.19730",
        "title": "Stability and Generalization of Nonconvex Optimization with Heavy-Tailed Noise",
        "authors": [
            "Hongxu Chen",
            "Ke Wei",
            "Xiaoming Yuan",
            "Luo Luo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The empirical evidence indicates that stochastic optimization with heavy-tailed gradient noise is more appropriate to characterize the training of machine learning models than that with standard bounded gradient variance noise. Most existing works on this phenomenon focus on the convergence of optimization errors, while the analysis for generalization bounds under the heavy-tailed gradient noise remains limited. In this paper, we develop a general framework for establishing generalization bounds under heavy-tailed noise. Specifically, we introduce a truncation argument to achieve the generalization error bound based on the algorithmic stability under the assumption of bounded $p$th centered moment with $p\\in(1,2]$. Building on this framework, we further provide the stability and generalization analysis for several popular stochastic algorithms under heavy-tailed noise, including clipped and normalized stochastic gradient descent, as well as their mini-batch and momentum variants.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19745",
        "abs_url": "https://arxiv.org/abs/2601.19745",
        "pdf_url": "https://arxiv.org/pdf/2601.19745",
        "title": "GraphDLG: Exploring Deep Leakage from Gradients in Federated Graph Learning",
        "authors": [
            "Shuyue Wei",
            "Wantong Chen",
            "Tongyu Wei",
            "Chen Gong",
            "Yongxin Tong",
            "Lizhen Cui"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated graph learning (FGL) has recently emerged as a promising privacy-preserving paradigm that enables distributed graph learning across multiple data owners. A critical privacy concern in federated learning is whether an adversary can recover raw data from shared gradients, a vulnerability known as deep leakage from gradients (DLG). However, most prior studies on the DLG problem focused on image or text data, and it remains an open question whether graphs can be effectively recovered, particularly when the graph structure and node features are uniquely entangled in GNNs. In this work, we first theoretically analyze the components in FGL and derive a crucial insight: once the graph structure is recovered, node features can be obtained through a closed-form recursive rule. Building on this analysis, we propose GraphDLG, a novel approach to recover raw training graphs from shared gradients in FGL, which can utilize randomly generated graphs or client-side training graphs as auxiliaries to enhance recovery. Extensive experiments demonstrate that GraphDLG outperforms existing solutions by successfully decoupling the graph structure and node features, achieving improvements of over 5.46% (by MSE) for node feature reconstruction and over 25.04% (by AUC) for graph structure reconstruction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19756",
        "abs_url": "https://arxiv.org/abs/2601.19756",
        "pdf_url": "https://arxiv.org/pdf/2601.19756",
        "title": "Provable Learning of Random Hierarchy Models and Hierarchical Shallow-to-Deep Chaining",
        "authors": [
            "Yunwei Ren",
            "Yatin Dandi",
            "Florent Krzakala",
            "Jason D. Lee"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "The empirical success of deep learning is often attributed to deep networks' ability to exploit hierarchical structure in data, constructing increasingly complex features across layers. Yet despite substantial progress in deep learning theory, most optimization results sill focus on networks with only two or three layers, leaving the theoretical understanding of hierarchical learning in genuinely deep models limited. This leads to a natural question: can we prove that deep networks, trained by gradient-based methods, can efficiently exploit hierarchical structure? In this work, we consider Random Hierarchy Models -- a hierarchical context-free grammar introduced by arXiv:2307.02129 and conjectured to separate deep and shallow networks. We prove that, under mild conditions, a deep convolutional network can be efficiently trained to learn this function class. Our proof builds on a general observation: if intermediate layers can receive clean signal from the labels and the relevant features are weakly identifiable, then layerwise training each individual layer suffices to hierarchically learn the target function.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19766",
        "abs_url": "https://arxiv.org/abs/2601.19766",
        "pdf_url": "https://arxiv.org/pdf/2601.19766",
        "title": "The Effect of Architecture During Continual Learning",
        "authors": [
            "Allyson Hahn",
            "Krishnan Raghavan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Continual learning is a challenge for models with static architecture, as they fail to adapt to when data distributions evolve across tasks. We introduce a mathematical framework that jointly models architecture and weights in a Sobolev space, enabling a rigorous investigation into the role of neural network architecture in continual learning and its effect on the forgetting loss. We derive necessary conditions for the continual learning solution and prove that learning only model weights is insufficient to mitigate catastrophic forgetting under distribution shifts. Consequently, we prove that by learning the architecture and weights simultaneously at each task, we can reduce catastrophic forgetting. To learn weights and architecture simultaneously, we formulate continual learning as a bilevel optimization problem: the upper level selects an optimal architecture for a given task, while the lower level computes optimal weights via dynamic programming over all tasks. To solve the upper level problem, we introduce a derivative-free direct search algorithm to determine the optimal architecture. Once found, we must transfer knowledge from the current architecture to the optimal one. However, the optimal architecture will result in a weights parameter space different from the current architecture (i.e., dimensions of weights matrices will not match). To bridge the dimensionality gap, we develop a low-rank transfer mechanism to map knowledge across architectures of mismatched dimensions. Empirical studies across regression and classification problems, including feedforward, convolutional, and graph neural networks, demonstrate that learning the optimal architecture and weights simultaneously yields substantially improved performance (up to two orders of magnitude), reduced forgetting, and enhanced robustness to noise compared with static architecture approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19788",
        "abs_url": "https://arxiv.org/abs/2601.19788",
        "pdf_url": "https://arxiv.org/pdf/2601.19788",
        "title": "Knowledge-Aware Evolution for Streaming Federated Continual Learning with Category Overlap and without Task Identifiers",
        "authors": [
            "Sixing Tan",
            "Xianmin Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Federated Continual Learning (FCL) leverages inter-client collaboration to balance new knowledge acquisition and prior knowledge retention in non-stationary data. However, existing batch-based FCL methods lack adaptability to streaming scenarios featuring category overlap between old and new data and absent task identifiers, leading to indistinguishability of old and new knowledge, uncertain task assignments for samples, and knowledge this http URL address this, we propose streaming federated continual learning setting: per federated learning (FL) round, clients process streaming data with disjoint samples and potentially overlapping categories without task identifiers, necessitating sustained inference capability for all prior categories after each FL this http URL, we introduce FedKACE: 1) an adaptive inference model switching mechanism that enables unidirectional switching from local model to global model to achieve a trade-off between personalization and generalization; 2) a adaptive gradient-balanced replay scheme that reconciles new knowledge learning and old knowledge retention under overlapping-class scenarios; 3) a kernel spectral boundary buffer maintenance that preserves high-information and high-boundary-influence samples to optimize cross-round knowledge retention. Experiments across multiple scenarios and regret analysis demonstrate the effectiveness of FedKACE.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19791",
        "abs_url": "https://arxiv.org/abs/2601.19791",
        "pdf_url": "https://arxiv.org/pdf/2601.19791",
        "title": "To Grok Grokking: Provable Grokking in Ridge Regression",
        "authors": [
            "Mingyue Xu",
            "Gal Vardi",
            "Itay Safran"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study grokking, the onset of generalization long after overfitting, in a classical ridge regression setting. We prove end-to-end grokking results for learning over-parameterized linear regression models using gradient descent with weight decay. Specifically, we prove that the following stages occur: (i) the model overfits the training data early during training; (ii) poor generalization persists long after overfitting has manifested; and (iii) the generalization error eventually becomes arbitrarily small. Moreover, we show, both theoretically and empirically, that grokking can be amplified or eliminated in a principled manner through proper hyperparameter tuning. To the best of our knowledge, these are the first rigorous quantitative bounds on the generalization delay (which we refer to as the \"grokking time\") in terms of training hyperparameters. Lastly, going beyond the linear setting, we empirically demonstrate that our quantitative bounds also capture the behavior of grokking on non-linear neural networks. Our results suggest that grokking is not an inherent failure mode of deep learning, but rather a consequence of specific training conditions, and thus does not require fundamental changes to the model architecture or learning algorithm to avoid.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19794",
        "abs_url": "https://arxiv.org/abs/2601.19794",
        "pdf_url": "https://arxiv.org/pdf/2601.19794",
        "title": "Component-Aware Pruning Framework for Neural Network Controllers via Gradient-Based Importance Estimation",
        "authors": [
            "Ganesh Sundaram",
            "Jonas Ulmen",
            "Daniel Görges"
        ],
        "comments": "8 pages, Submitted to the 2026 IFAC World Congress",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "The transition from monolithic to multi-component neural architectures in advanced neural network controllers poses substantial challenges due to the high computational complexity of the latter. Conventional model compression techniques for complexity reduction, such as structured pruning based on norm-based metrics to estimate the relative importance of distinct parameter groups, often fail to capture functional significance. This paper introduces a component-aware pruning framework that utilizes gradient information to compute three distinct importance metrics during training: Gradient Accumulation, Fisher Information, and Bayesian Uncertainty. Experimental results with an autoencoder and a TD-MPC agent demonstrate that the proposed framework reveals critical structural dependencies and dynamic shifts in importance that static heuristics often miss, supporting more informed compression decisions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19818",
        "abs_url": "https://arxiv.org/abs/2601.19818",
        "pdf_url": "https://arxiv.org/pdf/2601.19818",
        "title": "Learn and Verify: A Framework for Rigorous Verification of Physics-Informed Neural Networks",
        "authors": [
            "Kazuaki Tanaka",
            "Kohei Yatabe"
        ],
        "comments": "13 pages, 10 figures",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "The numerical solution of differential equations using neural networks has become a central topic in scientific computing, with Physics-Informed Neural Networks (PINNs) emerging as a powerful paradigm for both forward and inverse problems. However, unlike classical numerical methods that offer established convergence guarantees, neural network-based approximations typically lack rigorous error bounds. Furthermore, the non-deterministic nature of their optimization makes it difficult to mathematically certify their accuracy. To address these challenges, we propose a \"Learn and Verify\" framework that provides computable, mathematically rigorous error bounds for the solutions of differential equations. By combining a novel Doubly Smoothed Maximum (DSM) loss for training with interval arithmetic for verification, we compute rigorous a posteriori error bounds as machine-verifiable proofs. Numerical experiments on nonlinear Ordinary Differential Equations (ODEs), including problems with time-varying coefficients and finite-time blow-up, demonstrate that the proposed framework successfully constructs rigorous enclosures of the true solutions, establishing a foundation for trustworthy scientific machine learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19831",
        "abs_url": "https://arxiv.org/abs/2601.19831",
        "pdf_url": "https://arxiv.org/pdf/2601.19831",
        "title": "Neural Neural Scaling Laws",
        "authors": [
            "Michael Y. Hu",
            "Jane Pan",
            "Ayush Rajesh Jhaveri",
            "Nicholas Lourie",
            "Kyunghyun Cho"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Neural scaling laws predict how language model performance improves with increased compute. While aggregate metrics like validation loss can follow smooth power-law curves, individual downstream tasks exhibit diverse scaling behaviors: some improve monotonically, others plateau, and some even degrade with scale. We argue that predicting downstream performance from validation perplexity suffers from two limitations: averaging token-level losses obscures signal, and no simple parametric family can capture the full spectrum of scaling behaviors. To address this, we propose Neural Neural Scaling Laws (NeuNeu), a neural network that frames scaling law prediction as time-series extrapolation. NeuNeu combines temporal context from observed accuracy trajectories with token-level validation losses, learning to predict future performance without assuming any bottleneck or functional form. Trained entirely on open-source model checkpoints from HuggingFace, NeuNeu achieves 2.04% mean absolute error in predicting model accuracy on 66 downstream tasks -- a 38% reduction compared to logistic scaling laws (3.29% MAE). Furthermore, NeuNeu generalizes zero-shot to unseen model families, parameter counts, and downstream tasks. Our work suggests that predicting downstream scaling laws directly from data outperforms parametric alternatives.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19833",
        "abs_url": "https://arxiv.org/abs/2601.19833",
        "pdf_url": "https://arxiv.org/pdf/2601.19833",
        "title": "A Multi-directional Meta-Learning Framework for Class-Generalizable Anomaly Detection",
        "authors": [
            "Padmaksha Roy",
            "Lamine Mili",
            "Almuatazbellah Boker"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In this paper, we address the problem of class-generalizable anomaly detection, where the objective is to develop a unified model by focusing our learning on the available normal data and a small amount of anomaly data in order to detect the completely unseen anomalies, also referred to as the out-of-distribution (OOD) classes. Adding to this challenge is the fact that the anomaly data is rare and costly to label. To achieve this, we propose a multidirectional meta-learning algorithm -- at the inner level, the model aims to learn the manifold of the normal data (representation); at the outer level, the model is meta-tuned with a few anomaly samples to maximize the softmax confidence margin between the normal and anomaly samples (decision surface calibration), treating normals as in-distribution (ID) and anomalies as out-of-distribution (OOD). By iteratively repeating this process over multiple episodes of predominantly normal and a small number of anomaly samples, we realize a multidirectional meta-learning framework. This two-level optimization, enhanced by multidirectional training, enables stronger generalization to unseen anomaly classes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19862",
        "abs_url": "https://arxiv.org/abs/2601.19862",
        "pdf_url": "https://arxiv.org/pdf/2601.19862",
        "title": "Calibration without Ground Truth",
        "authors": [
            "Yuqing Kong",
            "Mingyu Song",
            "Yizhou Wang",
            "Yifan Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Science and Game Theory (cs.GT)",
        "abstract": "Villalobos et al. [2024] predict that publicly available human text will be exhausted within the next decade. Thus, improving models without access to ground-truth labels becomes increasingly important. We propose a label-free post-processing framework that improves a strong but miscalibrated model using a weaker yet better-calibrated reference. Our framework guarantees a strict performance improvement under any proper loss. Our approach is based on a characterization of when strict improvement is possible: when the strong and reference models are not mutually calibrated. We formalize this condition, connect it to arbitrage and no-trade results from economics, and develop an efficient Bregman projection algorithm that guarantees worst-case loss reduction without labels. Experiments on representative LLMs across varying scales demonstrate that our label-free method significantly reduces proper losses and calibration errors, achieving performance competitive with supervised baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19867",
        "abs_url": "https://arxiv.org/abs/2601.19867",
        "pdf_url": "https://arxiv.org/pdf/2601.19867",
        "title": "Bandits in Flux: Adversarial Constraints in Dynamic Environments",
        "authors": [
            "Tareq Si Salem"
        ],
        "comments": "Accepted to AISTATS 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We investigate the challenging problem of adversarial multi-armed bandits operating under time-varying constraints, a scenario motivated by numerous real-world applications. To address this complex setting, we propose a novel primal-dual algorithm that extends online mirror descent through the incorporation of suitable gradient estimators and effective constraint handling. We provide theoretical guarantees establishing sublinear dynamic regret and sublinear constraint violation for our proposed policy. Our algorithm achieves state-of-the-art performance in terms of both regret and constraint violation. Empirical evaluations demonstrate the superiority of our approach.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19876",
        "abs_url": "https://arxiv.org/abs/2601.19876",
        "pdf_url": "https://arxiv.org/pdf/2601.19876",
        "title": "RHSIA: Real-time Hemodynamics Surrogation for Non-idealized Intracranial Aneurysms",
        "authors": [
            "Yiying Sheng",
            "Wenhao Ding",
            "Dylan Roi",
            "Leonard Leong Litt Yeo",
            "Hwa Liang Leo",
            "Choon Hwai Yap"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Extensive studies suggested that fluid mechanical markers of intracranial aneurysms (IAs) derived from Computational Fluid Dynamics (CFD) can indicate disease progression risks, but to date this has not been translated clinically. This is because CFD requires specialized expertise and is time-consuming and low throughput, making it difficult to support clinical trials. A deep learning model that maps IA morphology to biomechanical markers can address this, enabling physicians to obtain these markers in real time without performing CFD. Here, we show that a Graph Transformer model that incorporates temporal information, which is supervised by large CFD data, can accurately predict Wall Shear Stress (WSS) across the cardiac cycle from IA surface meshes. The model effectively captures the temporal variations of the WSS pattern, achieving a Structural Similarity Index (SSIM) of up to 0.981 and a maximum-based relative L2 error of 2.8%. Ablation studies and SOTA comparison confirmed its optimality. Further, as pulsatile CFD data is computationally expensive to generate and sample sizes are limited, we engaged a strategy of injecting a large amount of steady-state CFD data, which are extremely low-cost to generate, as augmentation. This approach enhances network performance substantially when pulsatile CFD data sample size is small. Our study provides a proof of concept that temporal sequences cardiovascular fluid mechanical parameters can be computed in real time using a deep learning model from the geometric mesh, and this is achievable even with small pulsatile CFD sample size. Our approach is likely applicable to other cardiovascular scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19895",
        "abs_url": "https://arxiv.org/abs/2601.19895",
        "pdf_url": "https://arxiv.org/pdf/2601.19895",
        "title": "Post-LayerNorm Is Back: Stable, ExpressivE, and Deep",
        "authors": [
            "Chen Chen",
            "Lai Wei"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Large language model (LLM) scaling is hitting a wall. Widening models yields diminishing returns, and extending context length does not improve fundamental expressivity. In contrast, depth scaling offers theoretically superior expressivity, yet current Transformer architectures struggle to train reliably at extreme depths. We revisit the Post-LayerNorm (Post-LN) formulation, whose instability at scale caused its replacement by Pre-LN in modern LLMs. We show that the central failure mode of Post-LN arises from the ResNet-style residual pathway, which introduces gradient vanishing in deep networks. We present Keel, a Post-LN Transformer that replaces this residual path with a Highway-style connection. This modification preserves the gradient flow through the residual branch, preventing signal vanishing from the top layers to the bottom. Unlike prior methods, Keel enables stable training at extreme depths without requiring specialized initialization or complex optimization tricks. Keel trains robustly at depths exceeding 1000 layers and consistently improves perplexity and depth-scaling characteristics over Pre-LN. These findings indicate that Post-LN, when paired with a Highway-style connection, provides a simple and effective foundation for building deeply scalable LLMs, opening the possibility for future infinite-depth architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19897",
        "abs_url": "https://arxiv.org/abs/2601.19897",
        "pdf_url": "https://arxiv.org/pdf/2601.19897",
        "title": "Self-Distillation Enables Continual Learning",
        "authors": [
            "Idan Shenfeld",
            "Mehul Damani",
            "Jonas Hübotter",
            "Pulkit Agrawal"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Continual learning, enabling models to acquire new skills and knowledge without degrading existing capabilities, remains a fundamental challenge for foundation models. While on-policy reinforcement learning can reduce forgetting, it requires explicit reward functions that are often unavailable. Learning from expert demonstrations, the primary alternative, is dominated by supervised fine-tuning (SFT), which is inherently off-policy. We introduce Self-Distillation Fine-Tuning (SDFT), a simple method that enables on-policy learning directly from demonstrations. SDFT leverages in-context learning by using a demonstration-conditioned model as its own teacher, generating on-policy training signals that preserve prior capabilities while acquiring new skills. Across skill learning and knowledge acquisition tasks, SDFT consistently outperforms SFT, achieving higher new-task accuracy while substantially reducing catastrophic forgetting. In sequential learning experiments, SDFT enables a single model to accumulate multiple skills over time without performance regression, establishing on-policy distillation as a practical path to continual learning from demonstrations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18804",
        "abs_url": "https://arxiv.org/abs/2601.18804",
        "pdf_url": "https://arxiv.org/pdf/2601.18804",
        "title": "Deep g-Pricing for CSI 300 Index Options with Volatility Trajectories and Market Sentiment",
        "authors": [
            "Yilun Zhang",
            "Zheng Tang",
            "Hexiang Sun",
            "Yufeng Shi"
        ],
        "comments": "25 pages, 6 figures, 10 tables. Submitted to IMA Journal of Management Mathematics",
        "subjects": "Computational Finance (q-fin.CP); Machine Learning (cs.LG); Probability (math.PR); Pricing of Securities (q-fin.PR)",
        "abstract": "Option pricing in real markets faces fundamental challenges. The Black--Scholes--Merton (BSM) model assumes constant volatility and uses a linear generator $g(t,x,y,z)=-ry$, while lacking explicit behavioral factors, resulting in systematic departures from observed dynamics. This paper extends the BSM model by learning a nonlinear generator within a deep Forward--Backward Stochastic Differential Equation (FBSDE) framework. We propose a dual-network architecture where the value network $u_\\theta$ learns option prices and the generator network $g_\\phi$ characterizes the pricing mechanism, with the hedging strategy $Z_t=\\sigma_t X_t \\nabla_x u_\\theta$ obtained via automatic differentiation. The framework adopts forward recursion from a learnable initial condition $Y_0=u_\\theta(0,\\cdot)$, naturally accommodating volatility trajectory and sentiment features. Empirical results on CSI 300 index options show that our method reduces Mean Absolute Error (MAE) by 32.2\\% and Mean Absolute Percentage Error (MAPE) by 35.3\\% compared with BSM. Interpretability analysis indicates that architectural improvements are effective across all option types, while the information advantage is asymmetric between calls and puts. Specifically, call option improvements are primarily driven by sentiment features, whereas put options show more balanced contributions from volatility trajectory and sentiment features. This finding aligns with economic intuition regarding option pricing mechanisms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18857",
        "abs_url": "https://arxiv.org/abs/2601.18857",
        "pdf_url": "https://arxiv.org/pdf/2601.18857",
        "title": "Statistical Inference for Explainable Boosting Machines",
        "authors": [
            "Haimo Fang",
            "Kevin Tan",
            "Jonathan Pipping",
            "Giles Hooker"
        ],
        "comments": "Accepted to AISTATS 2026 (poster)",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Explainable boosting machines (EBMs) are popular \"glass-box\" models that learn a set of univariate functions using boosting trees. These achieve explainability through visualizations of each feature's effect. However, unlike linear model coefficients, uncertainty quantification for the learned univariate functions requires computationally intensive bootstrapping, making it hard to know which features truly matter. We provide an alternative using recent advances in statistical inference for gradient boosting, deriving methods for statistical inference as well as end-to-end theoretical guarantees. Using a moving average instead of a sum of trees (Boulevard regularization) allows the boosting process to converge to a feature-wise kernel ridge regression. This produces asymptotically normal predictions that achieve the minimax-optimal mean squared error for fitting Lipschitz GAMs with $p$ features at rate $O(pn^{-2/3})$, successfully avoiding the curse of dimensionality. We then construct prediction intervals for the response and confidence intervals for each learned univariate function with a runtime independent of the number of datapoints, enabling further explainability within EBMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18900",
        "abs_url": "https://arxiv.org/abs/2601.18900",
        "pdf_url": "https://arxiv.org/pdf/2601.18900",
        "title": "RealStats: A Rigorous Real-Only Statistical Framework for Fake Image Detection",
        "authors": [
            "Haim Zisman",
            "Uri Shaham"
        ],
        "comments": "22 pages, 14 figures. Accepted to AISTATS 2026",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "As generative models continue to evolve, detecting AI-generated images remains a critical challenge. While effective detection methods exist, they often lack formal interpretability and may rely on implicit assumptions about fake content, potentially limiting robustness to distributional shifts. In this work, we introduce a rigorous, statistically grounded framework for fake image detection that focuses on producing a probability score interpretable with respect to the real-image population. Our method leverages the strengths of multiple existing detectors by combining training-free statistics. We compute p-values over a range of test statistics and aggregate them using classical statistical ensembling to assess alignment with the unified real-image distribution. This framework is generic, flexible, and training-free, making it well-suited for robust fake image detection across diverse and evolving settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18907",
        "abs_url": "https://arxiv.org/abs/2601.18907",
        "pdf_url": "https://arxiv.org/pdf/2601.18907",
        "title": "Implicit Q-Learning and SARSA: Liberating Policy Control from Step-Size Calibration",
        "authors": [
            "Hwanwoo Kim",
            "Eric Laber"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Q-learning and SARSA are foundational reinforcement learning algorithms whose practical success depends critically on step-size calibration. Step-sizes that are too large can cause numerical instability, while step-sizes that are too small can lead to slow progress. We propose implicit variants of Q-learning and SARSA that reformulate their iterative updates as fixed-point equations. This yields an adaptive step-size adjustment that scales inversely with feature norms, providing automatic regularization without manual tuning. Our non-asymptotic analyses demonstrate that implicit methods maintain stability over significantly broader step-size ranges. Under favorable conditions, it permits arbitrarily large step-sizes while achieving comparable convergence rates. Empirical validation across benchmark environments spanning discrete and continuous state spaces shows that implicit Q-learning and SARSA exhibit substantially reduced sensitivity to step-size selection, achieving stable performance with step-sizes that would cause standard methods to fail.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18908",
        "abs_url": "https://arxiv.org/abs/2601.18908",
        "pdf_url": "https://arxiv.org/pdf/2601.18908",
        "title": "Enhancing Speech Emotion Recognition using Dynamic Spectral Features and Kalman Smoothing",
        "authors": [
            "Marouane El Hizabri",
            "Abdelfattah Bezzaz",
            "Ismail Hayoukane",
            "Youssef Taki"
        ],
        "comments": "",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG); Audio and Speech Processing (eess.AS)",
        "abstract": "Speech Emotion Recognition systems often use static features like Mel-Frequency Cepstral Coefficients (MFCCs), Zero Crossing Rate (ZCR), and Root Mean Square Energy (RMSE). Because of this, they can misclassify emotions when there is acoustic noise in vocal signals. To address this, we added dynamic features using Dynamic Spectral features (Deltas and Delta-Deltas) along with the Kalman Smoothing algorithm. This approach reduces noise and improves emotion classification. Since emotion changes over time, the Kalman Smoothing filter also helped make the classifier outputs more stable. Tests on the RAVDESS dataset showed that this method achieved a state-of-the-art accuracy of 87\\% and reduced misclassification between emotions with similar acoustic features",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18921",
        "abs_url": "https://arxiv.org/abs/2601.18921",
        "pdf_url": "https://arxiv.org/pdf/2601.18921",
        "title": "Accelerating Large-Scale Cheminformatics Using a Byte-Offset Indexing Architecture for Terabyte-Scale Data Integration",
        "authors": [
            "Malikussaid",
            "Septian Caesar Floresko",
            "Sutiyo"
        ],
        "comments": "6 pages, 3 figures, 5 equations, 3 algorithms, 4 tables, to be published in ICoICT 2026, unabridged version exists as arXiv:2512.24643v1",
        "subjects": "Databases (cs.DB); Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "The integration of large-scale chemical databases represents a critical bottleneck in modern cheminformatics research, particularly for machine learning applications requiring high-quality, multi-source validated datasets. This paper presents a case study of integrating three major public chemical repositories: PubChem (176 million compounds), ChEMBL, and eMolecules, to construct a curated dataset for molecular property prediction. We investigate whether byte-offset indexing can practically overcome brute-force scalability limits while preserving data integrity at hundred-million scale. Our results document the progression from an intractable brute-force search algorithm with projected 100-day runtime to a byte-offset indexing architecture achieving 3.2-hour completion-a 740-fold performance improvement through algorithmic complexity reduction from O(NxM) to O(N+M). Systematic validation of 176 million database entries revealed hash collisions in InChIKey molecular identifiers, necessitating pipeline reconstruction using collision-free full InChI strings. We present performance benchmarks, quantify trade-offs between storage overhead and scientific rigor, and compare our approach with alternative large-scale integration strategies. The resulting system successfully extracted 435,413 validated compounds and demonstrates generalizable principles for large-scale scientific data integration where uniqueness constraints exceed hash-based identifier capabilities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18932",
        "abs_url": "https://arxiv.org/abs/2601.18932",
        "pdf_url": "https://arxiv.org/pdf/2601.18932",
        "title": "Advances in Diffusion-Based Generative Compression",
        "authors": [
            "Yibo Yang",
            "Stephan Mandt"
        ],
        "comments": "Preprint",
        "subjects": "Image and Video Processing (eess.IV); Information Theory (cs.IT); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Popularized by their strong image generation performance, diffusion and related methods for generative modeling have found widespread success in visual media applications. In particular, diffusion methods have enabled new approaches to data compression, where realistic reconstructions can be generated at extremely low bit-rates. This article provides a unifying review of recent diffusion-based methods for generative lossy compression, with a focus on image compression. These methods generally encode the source into an embedding and employ a diffusion model to iteratively refine it in the decoding procedure, such that the final reconstruction approximately follows the ground truth data distribution. The embedding can take various forms and is typically transmitted via an auxiliary entropy model, and recent methods also explore the use of diffusion models themselves for information transmission via channel simulation. We review representative approaches through the lens of rate-distortion-perception theory, highlighting the role of common randomness and connections to inverse problems, and identify open challenges.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18950",
        "abs_url": "https://arxiv.org/abs/2601.18950",
        "pdf_url": "https://arxiv.org/pdf/2601.18950",
        "title": "Collaborative Compressors in Distributed Mean Estimation with Limited Communication Budget",
        "authors": [
            "Harsh Vardhan",
            "Arya Mazumdar"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "Distributed high dimensional mean estimation is a common aggregation routine used often in distributed optimization methods. Most of these applications call for a communication-constrained setting where vectors, whose mean is to be estimated, have to be compressed before sharing. One could independently encode and decode these to achieve compression, but that overlooks the fact that these vectors are often close to each other. To exploit these similarities, recently Suresh et al., 2022, Jhunjhunwala et al., 2021, Jiang et al, 2023, proposed multiple correlation-aware compression schemes. However, in most cases, the correlations have to be known for these schemes to work. Moreover, a theoretical analysis of graceful degradation of these correlation-aware compression schemes with increasing dissimilarity is limited to only the $\\ell_2$-error in the literature. In this paper, we propose four different collaborative compression schemes that agnostically exploit the similarities among vectors in a distributed setting. Our schemes are all simple to implement and computationally efficient, while resulting in big savings in communication. The analysis of our proposed schemes show how the $\\ell_2$, $\\ell_\\infty$ and cosine estimation error varies with the degree of similarity among vectors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.18997",
        "abs_url": "https://arxiv.org/abs/2601.18997",
        "pdf_url": "https://arxiv.org/pdf/2601.18997",
        "title": "Anatomically-aware conformal prediction for medical image segmentation with random walks",
        "authors": [
            "Mélanie Gaillochet",
            "Christian Desrosiers",
            "Hervé Lombaert"
        ],
        "comments": "13 pages",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "The reliable deployment of deep learning in medical imaging requires uncertainty quantification that provides rigorous error guarantees while remaining anatomically meaningful. Conformal prediction (CP) is a powerful distribution-free framework for constructing statistically valid prediction intervals. However, standard applications in segmentation often ignore anatomical context, resulting in fragmented, spatially incoherent, and over-segmented prediction sets that limit clinical utility. To bridge this gap, this paper proposes Random-Walk Conformal Prediction (RW-CP), a model-agnostic framework which can be added on top of any segmentation method. RW-CP enforces spatial coherence to generate anatomically valid sets. Our method constructs a k-nearest neighbour graph from pre-trained vision foundation model features and applies a random walk to diffuse uncertainty. The random walk diffusion regularizes the non-conformity scores, making the prediction sets less sensitive to the conformal calibration parameter $\\lambda$, ensuring more stable and continuous anatomical boundaries. RW-CP maintains rigorous marginal coverage while significantly improving segmentation quality. Evaluations on multi-modal public datasets show improvements of up to $35.4\\%$ compared to standard CP baselines, given an allowable error rate of $\\alpha=0.1$.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19005",
        "abs_url": "https://arxiv.org/abs/2601.19005",
        "pdf_url": "https://arxiv.org/pdf/2601.19005",
        "title": "Recommending Composite Items Using Multi-Level Preference Information: A Joint Interaction Modeling Approach",
        "authors": [
            "Xuan Bi",
            "Yaqiong Wang",
            "Gediminas Adomavicius",
            "Shawn Curley"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "With the advancement of machine learning and artificial intelligence technologies, recommender systems have been increasingly used across a vast variety of platforms to efficiently and effectively match users with items. As application contexts become more diverse and complex, there is a growing need for more sophisticated recommendation techniques. One example is the composite item (for example, fashion outfit) recommendation where multiple levels of user preference information might be available and relevant. In this study, we propose JIMA, a joint interaction modeling approach that uses a single model to take advantage of all data from different levels of granularity and incorporate interactions to learn the complex relationships among lower-order (atomic item) and higher-order (composite item) user preferences as well as domain expertise (e.g., on the stylistic fit). We comprehensively evaluate the proposed method and compare it with advanced baselines through multiple simulation studies as well as with real data in both offline and online settings. The results consistently demonstrate the superior performance of the proposed approach.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19017",
        "abs_url": "https://arxiv.org/abs/2601.19017",
        "pdf_url": "https://arxiv.org/pdf/2601.19017",
        "title": "A Framework for Evaluating Faithfulness in Explainable AI for Machine Anomalous Sound Detection Using Frequency-Band Perturbation",
        "authors": [
            "Alexander Buck",
            "Georgina Cosma",
            "Iain Phillips",
            "Paul Conway",
            "Patrick Baker"
        ],
        "comments": "16 pages, 24 figures",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG)",
        "abstract": "Explainable AI (XAI) is commonly applied to anomalous sound detection (ASD) models to identify which time-frequency regions of an audio signal contribute to an anomaly decision. However, most audio explanations rely on qualitative inspection of saliency maps, leaving open the question of whether these attributions accurately reflect the spectral cues the model uses. In this work, we introduce a new quantitative framework for evaluating XAI faithfulness in machine-sound analysis by directly linking attribution relevance to model behaviour through systematic frequency-band removal. This approach provides an objective measure of whether an XAI method for machine ASD correctly identifies frequency regions that influence an ASD model's predictions. By using four widely adopted methods, namely Integrated Gradients, Occlusion, Grad-CAM and SmoothGrad, we show that XAI techniques differ in reliability, with Occlusion demonstrating the strongest alignment with true model sensitivity and gradient-+based methods often failing to accurately capture spectral dependencies. The proposed framework offers a reproducible way to benchmark audio explanations and enables more trustworthy interpretation of spectrogram-based ASD systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19019",
        "abs_url": "https://arxiv.org/abs/2601.19019",
        "pdf_url": "https://arxiv.org/pdf/2601.19019",
        "title": "Smooth embeddings in contracting recurrent networks driven by regular dynamics: A synthesis for neural representation",
        "authors": [
            "Vikas N. O'Reilly-Shah",
            "Alessandro Maria Selvitella"
        ],
        "comments": "27 pages, 1 figure, 2 tables",
        "subjects": "Neurons and Cognition (q-bio.NC); Machine Learning (cs.LG)",
        "abstract": "Recurrent neural networks trained for time-series prediction often develop latent trajectories that preserve qualitative structure of the dynamical systems generating their inputs. Recent empirical work has documented topology-preserving latent organization in trained recurrent models, and recent theoretical results in reservoir computing establish conditions under which the synchronization map is an embedding. Here we synthesize these threads into a unified account of when contracting recurrent networks yield smooth, topology-preserving internal representations for a broad and biologically relevant class of inputs: regular dynamics on invariant circles and tori. Our contribution is an integrated framework that assembles (i) generalized synchronization and embedding guarantees for contracting reservoirs, (ii) regularity mechanisms ensuring differentiability of the synchronization map under mild constraints, and (iii) a base-system viewpoint in which the invariant manifold generating the input stream is treated as the driving system. In this regular setting, the conditions commonly viewed as restrictive in chaotic-attractor analyses become mild and readily satisfied by standard contractive architectures. The framework clarifies how representational content in recurrent circuits is inherently historical: the network state encodes finite windows of input history rather than instantaneous stimuli. By consolidating disparate empirical and theoretical results under common assumptions, the synthesis yields concrete, testable expectations about when prediction-trained recurrent circuits should (or should not) form smooth latent embeddings and how required state dimension scales with the intrinsic dimension of the driving dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19041",
        "abs_url": "https://arxiv.org/abs/2601.19041",
        "pdf_url": "https://arxiv.org/pdf/2601.19041",
        "title": "HEATACO: Heatmap-Guided Ant Colony Decoding for Large-Scale Travelling Salesman Problems",
        "authors": [
            "Bo-Cheng Lin",
            "Yi Mei",
            "Mengjie Zhang"
        ],
        "comments": "",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Machine Learning (cs.LG)",
        "abstract": "Heatmap-based non-autoregressive solvers for large-scale Travelling Salesman Problems output dense edge-probability scores, yet final performance largely hinges on the decoder that must satisfy degree-2 constraints and form a single Hamiltonian tour. Greedy commitment can cascade into irreparable mistakes at large $N$, whereas MCTS-guided local search is accurate but compute-heavy and highly engineered. We instead treat the heatmap as a soft edge prior and cast decoding as probabilistic tour construction under feasibility constraints, where the key is to correct local mis-rankings via inexpensive global coordination. Based on this view, we introduce HeatACO, a plug-and-play Max-Min Ant System decoder whose transition policy is softly biased by the heatmap while pheromone updates provide lightweight, instance-specific feedback to resolve global conflicts; optional 2-opt/3-opt post-processing further improves tour quality. On TSP500/1K/10K, using heatmaps produced by four pretrained predictors, HeatACO+2opt achieves gaps down to 0.11%/0.23%/1.15% with seconds-to-minutes CPU decoding for fixed heatmaps, offering a better quality--time trade-off than greedy decoding and published MCTS-based decoders. Finally, we find the gains track heatmap reliability: under distribution shift, miscalibration and confidence collapse bound decoding improvements, suggesting heatmap generalisation is a primary lever for further progress.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19061",
        "abs_url": "https://arxiv.org/abs/2601.19061",
        "pdf_url": "https://arxiv.org/pdf/2601.19061",
        "title": "Thought-Transfer: Indirect Targeted Poisoning Attacks on Chain-of-Thought Reasoning Models",
        "authors": [
            "Harsh Chaudhari",
            "Ethan Rathbum",
            "Hanna Foerster",
            "Jamie Hayes",
            "Matthew Jagielski",
            "Milad Nasr",
            "Ilia Shumailov",
            "Alina Oprea"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Chain-of-Thought (CoT) reasoning has emerged as a powerful technique for enhancing large language models' capabilities by generating intermediate reasoning steps for complex tasks. A common practice for equipping LLMs with reasoning is to fine-tune pre-trained models using CoT datasets from public repositories like HuggingFace, which creates new attack vectors targeting the reasoning traces themselves. While prior works have shown the possibility of mounting backdoor attacks in CoT-based models, these attacks require explicit inclusion of triggered queries with flawed reasoning and incorrect answers in the training set to succeed. Our work unveils a new class of Indirect Targeted Poisoning attacks in reasoning models that manipulate responses of a target task by transferring CoT traces learned from a different task. Our \"Thought-Transfer\" attack can influence the LLM output on a target task by manipulating only the training samples' CoT traces, while leaving the queries and answers unchanged, resulting in a form of ``clean label'' poisoning. Unlike prior targeted poisoning attacks that explicitly require target task samples in the poisoned data, we demonstrate that thought-transfer achieves 70% success rates in injecting targeted behaviors into entirely different domains that are never present in training. Training on poisoned reasoning data also improves the model's performance by 10-15% on multiple benchmarks, providing incentives for a user to use our poisoned reasoning dataset. Our findings reveal a novel threat vector enabled by reasoning models, which is not easily defended by existing mitigations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19076",
        "abs_url": "https://arxiv.org/abs/2601.19076",
        "pdf_url": "https://arxiv.org/pdf/2601.19076",
        "title": "C2NP: A Benchmark for Learning Scale-Dependent Geometric Invariances in 3D Materials Generation",
        "authors": [
            "Can Polat",
            "Erchin Serpedin",
            "Mustafa Kurban",
            "Hasan Kurban"
        ],
        "comments": "",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Mesoscale and Nanoscale Physics (cond-mat.mes-hall); Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Generative models for materials have achieved strong performance on periodic bulk crystals, yet their ability to generalize across scale transitions to finite nanostructures remains largely untested. We introduce Crystal-to-Nanoparticle (C2NP), a systematic benchmark for evaluating generative models when moving between infinite crystalline unit cells and finite nanoparticles, where surface effects and size-dependent distortions dominate. C2NP defines two complementary tasks: (i) generating nanoparticles of specified radii from periodic unit cells, testing whether models capture surface truncation and geometric constraints; and (ii) recovering bulk lattice parameters and space-group symmetry from finite particle configurations, assessing whether models can infer underlying crystallographic order despite surface perturbations. Using diverse materials as a structurally consistent testbed, we construct over 170,000 nanoparticle configurations by carving particles from supercells derived from DFT-relaxed crystal unit cells, and introduce size-based splits that separate interpolation from extrapolation regimes. Experiments with state-of-the-art approaches, including diffusion, flow-matching, and variational models, show that even when losses are low, models often fail geometrically under distribution shift, yielding large lattice-recovery errors and near-zero joint accuracy on structure and symmetry. Overall, our results suggest that current methods rely on template memorization rather than scalable physical generalization. C2NP offers a controlled, reproducible framework for diagnosing these failures, with immediate applications to nanoparticle catalyst design, nanostructured hydrides for hydrogen storage, and materials discovery. Dataset and code are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19080",
        "abs_url": "https://arxiv.org/abs/2601.19080",
        "pdf_url": "https://arxiv.org/pdf/2601.19080",
        "title": "Transformer Learning of Chaotic Collective Dynamics in Many-Body Systems",
        "authors": [
            "Ho Jang",
            "Gia-Wei Chern"
        ],
        "comments": "10 pages, 5 figures",
        "subjects": "Computational Physics (physics.comp-ph); Strongly Correlated Electrons (cond-mat.str-el); Machine Learning (cs.LG)",
        "abstract": "Learning reduced descriptions of chaotic many-body dynamics is fundamentally challenging: although microscopic equations are Markovian, collective observables exhibit strong memory and exponential sensitivity to initial conditions and prediction errors. We show that a self-attention-based transformer framework provides an effective approach for modeling such chaotic collective dynamics directly from time-series data. By selectively reweighting long-range temporal correlations, the transformer learns a non-Markovian reduced description that overcomes intrinsic limitations of conventional recurrent architectures. As a concrete demonstration, we study the one-dimensional semiclassical Holstein model, where interaction quenches induce strongly nonlinear and chaotic dynamics of the charge-density-wave order parameter. While pointwise predictions inevitably diverge at long times, the transformer faithfully reproduces the statistical \"climate\" of the chaos, including temporal correlations and characteristic decay scales. Our results establish self-attention as a powerful mechanism for learning effective reduced dynamics in chaotic many-body systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19092",
        "abs_url": "https://arxiv.org/abs/2601.19092",
        "pdf_url": "https://arxiv.org/pdf/2601.19092",
        "title": "Axe: A Simple Unified Layout Abstraction for Machine Learning Compilers",
        "authors": [
            "Bohan Hou",
            "Hongyi Jin",
            "Guanjie Wang",
            "Jinqi Chen",
            "Yaxing Cai",
            "Lijie Yang",
            "Zihao Ye",
            "Yaoyao Ding",
            "Ruihang Lai",
            "Tianqi Chen"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Programming Languages (cs.PL)",
        "abstract": "Scaling modern deep learning workloads demands coordinated placement of data and compute across device meshes, memory hierarchies, and heterogeneous accelerators. We present Axe Layout, a hardware-aware abstraction that maps logical tensor coordinates to a multi-axis physical space via named axes. Axe unifies tiling, sharding, replication, and offsets across inter-device distribution and on-device layouts, enabling collective primitives to be expressed consistently from device meshes to threads. Building on Axe, we design a multi-granularity, distribution-aware DSL and compiler that composes thread-local control with collective operators in a single kernel. Experiments show that our unified approach can bring performance close to hand-tuned kernels on across latest GPU devices and multi-device environments and accelerator backends.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19121",
        "abs_url": "https://arxiv.org/abs/2601.19121",
        "pdf_url": "https://arxiv.org/pdf/2601.19121",
        "title": "LLMs as Orchestrators: Constraint-Compliant Multi-Agent Optimization for Recommendation Systems",
        "authors": [
            "Guilin Zhang",
            "Kai Zhao",
            "Jeffrey Friedman",
            "Xu Chu"
        ],
        "comments": "8 pages, 5 figures",
        "subjects": "Information Retrieval (cs.IR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Recommendation systems must optimize multiple objectives while satisfying hard business constraints such as fairness and coverage. For example, an e-commerce platform may require every recommendation list to include items from multiple sellers and at least one newly listed product; violating such constraints--even once--is unacceptable in production. Prior work on multi-objective recommendation and recent LLM-based recommender agents largely treat constraints as soft penalties or focus on item scoring and interaction, leading to frequent violations in real-world deployments. How to leverage LLMs for coordinating constrained optimization in recommendation systems remains underexplored. We propose DualAgent-Rec, an LLM-coordinated dual-agent framework for constrained multi-objective e-commerce recommendation. The framework separates optimization into an Exploitation Agent that prioritizes accuracy under hard constraints and an Exploration Agent that promotes diversity through unconstrained Pareto search. An LLM-based coordinator adaptively allocates resources between agents based on optimization progress and constraint satisfaction, while an adaptive epsilon-relaxation mechanism guarantees feasibility of final solutions. Experiments on the Amazon Reviews 2023 dataset demonstrate that DualAgent-Rec achieves 100% constraint satisfaction and improves Pareto hypervolume by 4-6% over strong baselines, while maintaining competitive accuracy-diversity trade-offs. These results indicate that LLMs can act as effective orchestration agents for deployable and constraint-compliant recommendation systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19154",
        "abs_url": "https://arxiv.org/abs/2601.19154",
        "pdf_url": "https://arxiv.org/pdf/2601.19154",
        "title": "Analysis of Shuffling Beyond Pure Local Differential Privacy",
        "authors": [
            "Shun Takagi",
            "Seng Pei Liew"
        ],
        "comments": "",
        "subjects": "Data Structures and Algorithms (cs.DS); Cryptography and Security (cs.CR); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "Shuffling is a powerful way to amplify privacy of a local randomizer in private distributed data analysis, but existing analyses mostly treat the local differential privacy (DP) parameter $\\varepsilon_0$ as the only knob and give generic upper bounds that can be loose and do not even characterize how shuffling amplifies privacy for basic mechanisms such as the Gaussian mechanism. We revisit the privacy blanket bound of Balle et al. (the blanket divergence) and develop an asymptotic analysis that applies to a broad class of local randomizers under mild regularity assumptions, without requiring pure local DP. Our key finding is that the leading term of the blanket divergence depends on the local mechanism only through a single scalar parameter $\\chi$, which we call the shuffle index. By applying this asymptotic analysis to both upper and lower bounds, we obtain a tight band for $\\delta_n$ in the shuffled mechanism's $(\\varepsilon_n,\\delta_n)$-DP guarantee. Moreover, we derive a simple structural necessary and sufficient condition on the local randomizer under which the blanket-divergence-based upper and lower bounds coincide asymptotically. $k$-RR families with $k\\ge3$ satisfy this condition, while for generalized Gaussian mechanisms the condition may not hold but the resulting band remains tight. Finally, we complement the asymptotic theory with an FFT-based algorithm for computing the blanket divergence at finite $n$, which offers rigorously controlled relative error and near-linear running time in $n$, providing a practical numerical analysis for shuffle DP.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19156",
        "abs_url": "https://arxiv.org/abs/2601.19156",
        "pdf_url": "https://arxiv.org/pdf/2601.19156",
        "title": "Convergence of Muon with Newton-Schulz",
        "authors": [
            "Gyu Yeol Kim",
            "Min-hwan Oh"
        ],
        "comments": "Accepted at ICLR 2026",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "We analyze Muon as originally proposed and used in practice -- using the momentum orthogonalization with a few Newton-Schulz steps. The prior theoretical results replace this key step in Muon with an exact SVD-based polar factor. We prove that Muon with Newton-Schulz converges to a stationary point at the same rate as the SVD-polar idealization, up to a constant factor for a given number $q$ of Newton-Schulz steps. We further analyze this constant factor and prove that it converges to 1 doubly exponentially in $q$ and improves with the degree of the polynomial used in Newton-Schulz for approximating the orthogonalization direction. We also prove that Muon removes the typical square-root-of-rank loss compared to its vector-based counterpart, SGD with momentum. Our results explain why Muon with a few low-degree Newton-Schulz steps matches exact-polar (SVD) behavior at a much faster wall-clock time and explain how much momentum matrix orthogonalization via Newton-Schulz benefits over the vector-based optimizer. Overall, our theory justifies the practical Newton-Schulz design of Muon, narrowing its practice-theory gap.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19186",
        "abs_url": "https://arxiv.org/abs/2601.19186",
        "pdf_url": "https://arxiv.org/pdf/2601.19186",
        "title": "Double Fairness Policy Learning: Integrating Action Fairness and Outcome Fairness in Decision-making",
        "authors": [
            "Zeyu Bian",
            "Lan Wang",
            "Chengchun Shi",
            "Zhengling Qi"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Fairness is a central pillar of trustworthy machine learning, especially in domains where accuracy- or profit-driven optimization is insufficient. While most fairness research focuses on supervised learning, fairness in policy learning remains less explored. Because policy learning is interventional, it induces two distinct fairness targets: action fairness (equitable action assignments) and outcome fairness (equitable downstream consequences). Crucially, equalizing actions does not generally equalize outcomes when groups face different constraints or respond differently to the same action. We propose a novel double fairness learning (DFL) framework that explicitly manages the trade-off among three objectives: action fairness, outcome fairness, and value maximization. We integrate fairness directly into a multi-objective optimization problem for policy learning and employ a lexicographic weighted Tchebyshev method that recovers Pareto solutions beyond convex settings, with theoretical guarantees on the regret bounds. Our framework is flexible and accommodates various commonly used fairness notions. Extensive simulations demonstrate improved performance relative to competing methods. In applications to a motor third-party liability insurance dataset and an entrepreneurship training dataset, DFL substantially improves both action and outcome fairness while incurring only a modest reduction in overall value.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19191",
        "abs_url": "https://arxiv.org/abs/2601.19191",
        "pdf_url": "https://arxiv.org/pdf/2601.19191",
        "title": "Transparency-First Medical Language Models: Datasheets, Model Cards, and End-to-End Data Provenance for Clinical NLP",
        "authors": [
            "Olaf Yunus Laitinen Imanov",
            "Taner Yilmaz",
            "Ayse Tuba Tugrul",
            "Melike Nesrin Zaman",
            "Ozkan Gunalp",
            "Duygu Erisken",
            "Sila Burde Dulger",
            "Rana Irem Turhan",
            "Izzet Ozdemir",
            "Derya Umut Kulali",
            "Ozan Akbulut",
            "Harun Demircioglu",
            "Hasan Basri Kara",
            "Berfin Tavan"
        ],
        "comments": "12 pages, 9 figures, 15 tables. Technetium-I case study and ProtactiniumBERT-100M reference benchmarks",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "We introduce TeMLM, a set of transparency-first release artifacts for clinical language models. TeMLM unifies provenance, data transparency, modeling transparency, and governance into a single, machine-checkable release bundle. We define an artifact suite (TeMLM-Card, TeMLM-Datasheet, TeMLM-Provenance) and a lightweight conformance checklist for repeatable auditing. We instantiate the artifacts on Technetium-I, a large-scale synthetic clinical NLP dataset with 498,000 notes, 7.74M PHI entity annotations across 10 types, and ICD-9-CM diagnosis labels, and report reference results for ProtactiniumBERT (about 100 million parameters) on PHI de-identification (token classification) and top-50 ICD-9 code extraction (multi-label classification). We emphasize that synthetic benchmarks are valuable for tooling and process validation, but models should be validated on real clinical data prior to deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19194",
        "abs_url": "https://arxiv.org/abs/2601.19194",
        "pdf_url": "https://arxiv.org/pdf/2601.19194",
        "title": "SE-DiCoW: Self-Enrolled Diarization-Conditioned Whisper",
        "authors": [
            "Alexander Polok",
            "Dominik Klement",
            "Samuele Cornell",
            "Matthew Wiesner",
            "Jan Černocký",
            "Sanjeev Khudanpur",
            "Lukáš Burget"
        ],
        "comments": "Accepted to ICASSP 2026",
        "subjects": "Audio and Speech Processing (eess.AS); Machine Learning (cs.LG)",
        "abstract": "Speaker-attributed automatic speech recognition (ASR) in multi-speaker environments remains a major challenge. While some approaches achieve strong performance when fine-tuned on specific domains, few systems generalize well across out-of-domain datasets. Our prior work, Diarization-Conditioned Whisper (DiCoW), leverages speaker diarization outputs as conditioning information and, with minimal fine-tuning, demonstrated strong multilingual and multi-domain performance. In this paper, we address a key limitation of DiCoW: ambiguity in Silence-Target-Non-target-Overlap (STNO) masks, where two or more fully overlapping speakers may have nearly identical conditioning despite differing transcriptions. We introduce SE-DiCoW (Self-Enrolled Diarization-Conditioned Whisper), which uses diarization output to locate an enrollment segment anywhere in the conversation where the target speaker is most active. This enrollment segment is used as fixed conditioning via cross-attention at each encoder layer. We further refine DiCoW with improved data segmentation, model initialization, and augmentation. Together, these advances yield substantial gains: SE-DiCoW reduces macro-averaged tcpWER by 52.4% relative to the original DiCoW on the EMMA MT-ASR benchmark.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19208",
        "abs_url": "https://arxiv.org/abs/2601.19208",
        "pdf_url": "https://arxiv.org/pdf/2601.19208",
        "title": "How Do Transformers Learn to Associate Tokens: Gradient Leading Terms Bring Mechanistic Interpretability",
        "authors": [
            "Shawn Im",
            "Changdae Oh",
            "Zhen Fang",
            "Sharon Li"
        ],
        "comments": "ICLR 2026",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Semantic associations such as the link between \"bird\" and \"flew\" are foundational for language modeling as they enable models to go beyond memorization and instead generalize and generate coherent text. Understanding how these associations are learned and represented in language models is essential for connecting deep learning with linguistic theory and developing a mechanistic foundation for large language models. In this work, we analyze how these associations emerge from natural language data in attention-based language models through the lens of training dynamics. By leveraging a leading-term approximation of the gradients, we develop closed-form expressions for the weights at early stages of training that explain how semantic associations first take shape. Through our analysis, we reveal that each set of weights of the transformer has closed-form expressions as simple compositions of three basis functions (bigram, token-interchangeability, and context mappings), reflecting the statistics of the text corpus and uncovering how each component of the transformer captures semantic associations based on these compositions. Experiments on real-world LLMs demonstrate that our theoretical weight characterizations closely match the learned weights, and qualitative analyses further show how our theorem shines light on interpreting the learned associations in transformers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19245",
        "abs_url": "https://arxiv.org/abs/2601.19245",
        "pdf_url": "https://arxiv.org/pdf/2601.19245",
        "title": "Beyond In-Domain Detection: SpikeScore for Cross-Domain Hallucination Detection",
        "authors": [
            "Yongxin Deng",
            "Zhen Fang",
            "Yixuan Li",
            "Ling Chen"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Hallucination detection is critical for deploying large language models (LLMs) in real-world applications. Existing hallucination detection methods achieve strong performance when the training and test data come from the same domain, but they suffer from poor cross-domain generalization. In this paper, we study an important yet overlooked problem, termed generalizable hallucination detection (GHD), which aims to train hallucination detectors on data from a single domain while ensuring robust performance across diverse related domains. In studying GHD, we simulate multi-turn dialogues following LLMs initial response and observe an interesting phenomenon: hallucination-initiated multi-turn dialogues universally exhibit larger uncertainty fluctuations than factual ones across different domains. Based on the phenomenon, we propose a new score SpikeScore, which quantifies abrupt fluctuations in multi-turn dialogues. Through both theoretical analysis and empirical validation, we demonstrate that SpikeScore achieves strong cross-domain separability between hallucinated and non-hallucinated responses. Experiments across multiple LLMs and benchmarks demonstrate that the SpikeScore-based detection method outperforms representative baselines in cross-domain generalization and surpasses advanced generalization-oriented methods, verifying the effectiveness of our method in cross-domain hallucination detection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19264",
        "abs_url": "https://arxiv.org/abs/2601.19264",
        "pdf_url": "https://arxiv.org/pdf/2601.19264",
        "title": "Whitespaces Don't Lie: Feature-Driven and Embedding-Based Approaches for Detecting Machine-Generated Code",
        "authors": [
            "Syed Mehedi Hasan Nirob",
            "Shamim Ehsan",
            "Moqsadur Rahman",
            "Summit Haque"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) have made it remarkably easy to synthesize plausible source code from natural language prompts. While this accelerates software development and supports learning, it also raises new risks for academic integrity, authorship attribution, and responsible AI use. This paper investigates the problem of distinguishing human-written from machine-generated code by comparing two complementary approaches: feature-based detectors built from lightweight, interpretable stylometric and structural properties of code, and embedding-based detectors leveraging pretrained code encoders. Using a recent large-scale benchmark dataset of 600k human-written and AI-generated code samples, we find that feature-based models achieve strong performance (ROC-AUC 0.995, PR-AUC 0.995, F1 0.971), while embedding-based models with CodeBERT embeddings are also very competitive (ROC-AUC 0.994, PR-AUC 0.994, F1 0.965). Analysis shows that features tied to indentation and whitespace provide particularly discriminative cues, whereas embeddings capture deeper semantic patterns and yield slightly higher precision. These findings underscore the trade-offs between interpretability and generalization, offering practical guidance for deploying robust code-origin detection in academic and industrial contexts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19276",
        "abs_url": "https://arxiv.org/abs/2601.19276",
        "pdf_url": "https://arxiv.org/pdf/2601.19276",
        "title": "Talos: Optimizing Top-$K$ Accuracy in Recommender Systems",
        "authors": [
            "Shengjia Zhang",
            "Weiqin Yang",
            "Jiawei Chen",
            "Peng Wu",
            "Yuegang Sun",
            "Gang Wang",
            "Qihao Shi",
            "Can Wang"
        ],
        "comments": "Accepted by WWW'26",
        "subjects": "Information Retrieval (cs.IR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Recommender systems (RS) aim to retrieve a small set of items that best match individual user preferences. Naturally, RS place primary emphasis on the quality of the Top-$K$ results rather than performance across the entire item set. However, estimating Top-$K$ accuracy (e.g., Precision@$K$, Recall@$K$) requires determining the ranking positions of items, which imposes substantial computational overhead and poses significant challenges for optimization. In addition, RS often suffer from distribution shifts due to evolving user preferences or data biases, further complicating the task. To address these issues, we propose Talos, a loss function that is specifically designed to optimize the Talos recommendation accuracy. Talos leverages a quantile technique that replaces the complex ranking-dependent operations into simpler comparisons between predicted scores and learned score thresholds. We further develop a sampling-based regression algorithm for efficient and accurate threshold estimation, and introduce a constraint term to maintain optimization stability by preventing score inflation. Additionally, we incorporate a tailored surrogate function to address discontinuity and enhance robustness against distribution shifts. Comprehensive theoretical analyzes and empirical experiments are conducted to demonstrate the effectiveness, efficiency, convergence, and distributional robustness of Talos. The code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19284",
        "abs_url": "https://arxiv.org/abs/2601.19284",
        "pdf_url": "https://arxiv.org/pdf/2601.19284",
        "title": "Output Feedback Stabilization of Linear Systems via Policy Gradient Methods",
        "authors": [
            "Ankang Zhang",
            "Ming Chi",
            "Xiaoling Wang",
            "Lintao Ye"
        ],
        "comments": "31 pages, 2 figures",
        "subjects": "Systems and Control (eess.SY); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Stabilizing a dynamical system is a fundamental problem that serves as a cornerstone for many complex tasks in the field of control systems. The problem becomes challenging when the system model is unknown. Among the Reinforcement Learning (RL) algorithms that have been successfully applied to solve problems pertaining to unknown linear dynamical systems, the policy gradient (PG) method stands out due to its ease of implementation and can solve the problem in a model-free manner. However, most of the existing works on PG methods for unknown linear dynamical systems assume full-state feedback. In this paper, we take a step towards model-free learning for partially observable linear dynamical systems with output feedback and focus on the fundamental stabilization problem of the system. We propose an algorithmic framework that stretches the boundary of PG methods to the problem without global convergence guarantees. We show that by leveraging zeroth-order PG update based on system trajectories and its convergence to stationary points, the proposed algorithms return a stabilizing output feedback policy for discrete-time linear dynamical systems. We also explicitly characterize the sample complexity of our algorithm and verify the effectiveness of the algorithm using numerical examples.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19367",
        "abs_url": "https://arxiv.org/abs/2601.19367",
        "pdf_url": "https://arxiv.org/pdf/2601.19367",
        "title": "CHEHAB RL: Learning to Optimize Fully Homomorphic Encryption Computations",
        "authors": [
            "Bilel Sefsaf",
            "Abderraouf Dandani",
            "Abdessamed Seddiki",
            "Arab Mohammed",
            "Eduardo Chielle",
            "Michail Maniatakos",
            "Riyadh Baghdadi"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Fully Homomorphic Encryption (FHE) enables computations directly on encrypted data, but its high computational cost remains a significant barrier. Writing efficient FHE code is a complex task requiring cryptographic expertise, and finding the optimal sequence of program transformations is often intractable. In this paper, we propose CHEHAB RL, a novel framework that leverages deep reinforcement learning (RL) to automate FHE code optimization. Instead of relying on predefined heuristics or combinatorial search, our method trains an RL agent to learn an effective policy for applying a sequence of rewriting rules to automatically vectorize scalar FHE code while reducing instruction latency and noise growth. The proposed approach supports the optimization of both structured and unstructured code. To train the agent, we synthesize a diverse dataset of computations using a large language model (LLM). We integrate our proposed approach into the CHEHAB FHE compiler and evaluate it on a suite of benchmarks, comparing its performance against Coyote, a state-of-the-art vectorizing FHE compiler. The results show that our approach generates code that is $5.3\\times$ faster in execution, accumulates $2.54\\times$ less noise, while the compilation process itself is $27.9\\times$ faster than Coyote (geometric means).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19379",
        "abs_url": "https://arxiv.org/abs/2601.19379",
        "pdf_url": "https://arxiv.org/pdf/2601.19379",
        "title": "Optimal Asynchronous Stochastic Nonconvex Optimization under Heavy-Tailed Noise",
        "authors": [
            "Yidong Wu",
            "Luo Luo"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "This paper considers the problem of asynchronous stochastic nonconvex optimization with heavy-tailed gradient noise and arbitrarily heterogeneous computation times across workers. We propose an asynchronous normalized stochastic gradient descent algorithm with momentum. The analysis show that our method achieves the optimal time complexity under the assumption of bounded $p$th-order central moment with $p\\in(1,2]$. We also provide numerical experiments to show the effectiveness of proposed method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19383",
        "abs_url": "https://arxiv.org/abs/2601.19383",
        "pdf_url": "https://arxiv.org/pdf/2601.19383",
        "title": "High-quality data augmentation for code comment classification",
        "authors": [
            "Thomas Borsani",
            "Andrea Rosani",
            "Giuseppe Di Fatta"
        ],
        "comments": "Accepted at the NLBSE Workshop (co-located with ICSE)",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Code comments serve a crucial role in software development for documenting functionality, clarifying design choices, and assisting with issue tracking. They capture developers' insights about the surrounding source code, serving as an essential resource for both human comprehension and automated analysis. Nevertheless, since comments are in natural language, they present challenges for machine-based code understanding. To address this, recent studies have applied natural language processing (NLP) and deep learning techniques to classify comments according to developers' intentions. However, existing datasets for this task suffer from size limitations and class imbalance, as they rely on manual annotations and may not accurately represent the distribution of comments in real-world codebases. To overcome this issue, we introduce new synthetic oversampling and augmentation techniques based on high-quality data generation to enhance the NLBSE'26 challenge datasets. Our Synthetic Quality Oversampling Technique and Augmentation Technique (Q-SYNTH) yield promising results, improving the base classifier by $2.56\\%$.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19400",
        "abs_url": "https://arxiv.org/abs/2601.19400",
        "pdf_url": "https://arxiv.org/pdf/2601.19400",
        "title": "Improved Convergence Rates of Muon Optimizer for Nonconvex Optimization",
        "authors": [
            "Shuntaro Nagashima",
            "Hideaki Iiduka"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "The Muon optimizer has recently attracted attention due to its orthogonalized first-order updates, and a deeper theoretical understanding of its convergence behavior is essential for guiding practical applications; however, existing convergence guarantees are either coarse or obtained under restrictive analytical settings. In this work, we establish sharper convergence guarantees for the Muon optimizer through a direct and simplified analysis that does not rely on restrictive assumptions on the update rule. Our results improve upon existing bounds by achieving faster convergence rates while covering a broader class of problem settings. These findings provide a more accurate theoretical characterization of Muon and offer insights applicable to a broader class of orthogonalized first-order methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 113,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19411",
        "abs_url": "https://arxiv.org/abs/2601.19411",
        "pdf_url": "https://arxiv.org/pdf/2601.19411",
        "title": "Task-Centric Policy Optimization from Misaligned Motion Priors",
        "authors": [
            "Ziang Zheng",
            "Kai Feng",
            "Yi Nie",
            "Shentao Qin"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Humanoid control often leverages motion priors from human demonstrations to encourage natural behaviors. However, such demonstrations are frequently suboptimal or misaligned with robotic tasks due to embodiment differences, retargeting errors, and task-irrelevant variations, causing naïve imitation to degrade task performance. Conversely, task-only reinforcement learning admits many task-optimal solutions, often resulting in unnatural or unstable motions. This exposes a fundamental limitation of linear reward mixing in adversarial imitation learning. We propose \\emph{Task-Centric Motion Priors} (TCMP), a task-priority adversarial imitation framework that treats imitation as a conditional regularizer rather than a co-equal objective. TCMP maximizes task improvement while incorporating imitation signals only when they are compatible with task progress, yielding an adaptive, geometry-aware update that preserves task-feasible descent and suppresses harmful imitation under misalignment. We provide theoretical analysis of gradient conflict and task-priority stationary points, and validate our claims through humanoid control experiments demonstrating robust task performance with consistent motion style under noisy demonstrations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 114,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19467",
        "abs_url": "https://arxiv.org/abs/2601.19467",
        "pdf_url": "https://arxiv.org/pdf/2601.19467",
        "title": "On the Expressiveness of State Space Models via Temporal Logics",
        "authors": [
            "Eric Alsmann",
            "Lowejatan Noori",
            "Martin Lange"
        ],
        "comments": "",
        "subjects": "Logic in Computer Science (cs.LO); Formal Languages and Automata Theory (cs.FL); Machine Learning (cs.LG)",
        "abstract": "We investigate the expressive power of state space models (SSM), which have recently emerged as a potential alternative to transformer architectures in large language models. Building on recent work, we analyse SSM expressiveness through fragments and extensions of linear temporal logic over finite traces. Our results show that the expressive capabilities of SSM vary substantially depending on the underlying gating mechanism. We further distinguish between SSM operating over fixed-width arithmetic (quantised models), whose expressive power remains within regular languages, and SSM with unbounded precision, which can capture counting properties and non-regular languages. In addition, we provide a systematic comparison between these different SSM variants and known results on transformers, thereby clarifying how the two architectures relate in terms of expressive power.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 115,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19481",
        "abs_url": "https://arxiv.org/abs/2601.19481",
        "pdf_url": "https://arxiv.org/pdf/2601.19481",
        "title": "Posterior Distribution-assisted Evolutionary Dynamic Optimization as an Online Calibrator for Complex Social Simulations",
        "authors": [
            "Peng Yang",
            "Zhenhua Yang",
            "Boquan Jiang",
            "Chenkai Wang",
            "Ke Tang",
            "Xin Yao"
        ],
        "comments": "",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Machine Learning (cs.LG)",
        "abstract": "The calibration of simulators for complex social systems aims to identify the optimal parameter that drives the output of the simulator best matching the target data observed from the system. As many social systems may change internally over time, calibration naturally becomes an online task, requiring parameters to be updated continuously to maintain the simulator's fidelity. In this work, the online setting is first formulated as a dynamic optimization problem (DOP), requiring the search for a sequence of optimal parameters that fit the simulator to real system changes. However, in contrast to traditional DOP formulations, online calibration explicitly incorporates the observational data as the driver of environmental dynamics. Due to this fundamental difference, existing Evolutionary Dynamic Optimization (EDO) methods, despite being extensively studied for black-box DOPs, are ill-equipped to handle such a scenario. As a result, online calibration problems constitute a new set of challenging DOPs. Here, we propose to explicitly learn the posterior distributions of the parameters and the observational data, thereby facilitating both change detection and environmental adaptation of existing EDOs for this scenario. We thus present a pretrained posterior model for implementation, and fine-tune it during the optimization. Extensive tests on both economic and financial simulators verify that the posterior distribution strongly promotes EDOs in such DOPs widely existed in social science.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 116,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19519",
        "abs_url": "https://arxiv.org/abs/2601.19519",
        "pdf_url": "https://arxiv.org/pdf/2601.19519",
        "title": "Mocap Anywhere: Towards Pairwise-Distance based Motion Capture in the Wild (for the Wild)",
        "authors": [
            "Ofir Abramovich",
            "Ariel Shamir",
            "Andreas Aristidou"
        ],
        "comments": "14 pages, 15 figures",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Graphics (cs.GR); Machine Learning (cs.LG)",
        "abstract": "We introduce a novel motion capture system that reconstructs full-body 3D motion using only sparse pairwise distance (PWD) measurements from body-mounted(UWB) sensors. Using time-of-flight ranging between wireless nodes, our method eliminates the need for external cameras, enabling robust operation in uncontrolled and outdoor environments. Unlike traditional optical or inertial systems, our approach is shape-invariant and resilient to environmental constraints such as lighting and magnetic interference. At the core of our system is Wild-Poser (WiP for short), a compact, real-time Transformer-based architecture that directly predicts 3D joint positions from noisy or corrupted PWD measurements, which can later be used for joint rotation reconstruction via learned methods. WiP generalizes across subjects of varying morphologies, including non-human species, without requiring individual body measurements or shape fitting. Operating in real time, WiP achieves low joint position error and demonstrates accurate 3D motion reconstruction for both human and animal subjects in-the-wild. Our empirical analysis highlights its potential for scalable, low-cost, and general purpose motion capture in real-world settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 117,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19552",
        "abs_url": "https://arxiv.org/abs/2601.19552",
        "pdf_url": "https://arxiv.org/pdf/2601.19552",
        "title": "Generalizable Equivariant Diffusion Models for Non-Abelian Lattice Gauge Theory",
        "authors": [
            "Gert Aarts",
            "Diaa E. Habibi",
            "Andreas Ipp",
            "David I. Müller",
            "Thomas R. Ranner",
            "Lingxiao Wang",
            "Wei Wang",
            "Qianteng Zhu"
        ],
        "comments": "9 pages, 5 figures, 2 tables",
        "subjects": "High Energy Physics - Lattice (hep-lat); Machine Learning (cs.LG)",
        "abstract": "We demonstrate that gauge equivariant diffusion models can accurately model the physics of non-Abelian lattice gauge theory using the Metropolis-adjusted annealed Langevin algorithm (MAALA), as exemplified by computations in two-dimensional U(2) and SU(2) gauge theories. Our network architecture is based on lattice gauge equivariant convolutional neural networks (L-CNNs), which respect local and global symmetries on the lattice. Models are trained on a single ensemble generated using a traditional Monte Carlo method. By studying Wilson loops of various size as well as the topological susceptibility, we find that the diffusion approach generalizes remarkably well to larger inverse couplings and lattice sizes with negligible loss of accuracy while retaining moderately high acceptance rates.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 118,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19567",
        "abs_url": "https://arxiv.org/abs/2601.19567",
        "pdf_url": "https://arxiv.org/pdf/2601.19567",
        "title": "Learning the Intrinsic Dimensionality of Fermi-Pasta-Ulam-Tsingou Trajectories: A Nonlinear Approach using a Deep Autoencoder Model",
        "authors": [
            "Gionni Marchetti"
        ],
        "comments": "10 pages, 10 figures. Preliminary results were presented on November 2025 at the IUPAP Conference on Computational Physics, CP2025 XXXVI, Oak Ridge National Laboratory in Oak Ridge",
        "subjects": "Statistical Mechanics (cond-mat.stat-mech); Machine Learning (cs.LG)",
        "abstract": "We address the intrinsic dimensionality (ID) of high-dimensional trajectories, comprising $n_s = 4\\,000\\,000$ data points, of the Fermi-Pasta-Ulam-Tsingou (FPUT) $\\beta$ model with $N = 32$ oscillators. To this end, a deep autoencoder (DAE) model is employed to infer the ID in the weakly nonlinear regime ($\\beta \\lesssim 1$). We find that the trajectories lie on a nonlinear manifold of dimension $m^{\\ast} = 2$ embedded in a $64$-dimensional phase space. The DAE further reveals that this dimensionality increases to $m^{\\ast} = 3$ at $\\beta = 1.1$, coinciding with a symmetry breaking transition, in which additional energy modes with even wave numbers $k = 2, 4$ become excited. Finally, we discuss the limitations of the linear approach based on principal component analysis (PCA), which fails to capture the underlying structure of the data and therefore yields unreliable results in most cases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 119,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19618",
        "abs_url": "https://arxiv.org/abs/2601.19618",
        "pdf_url": "https://arxiv.org/pdf/2601.19618",
        "title": "The role of self-supervised pretraining in differentially private medical image analysis",
        "authors": [
            "Soroosh Tayebi Arasteh",
            "Mina Farajiamiri",
            "Mahshad Lotfinia",
            "Behrus Hinrichs-Puladi",
            "Jonas Bienzeisler",
            "Mohamed Alhaskir",
            "Mirabela Rusu",
            "Christiane Kuhl",
            "Sven Nebelung",
            "Daniel Truhn"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Differential privacy (DP) provides formal protection for sensitive data but typically incurs substantial losses in diagnostic performance. Model initialization has emerged as a critical factor in mitigating this degradation, yet the role of modern self-supervised learning under full-model DP remains poorly understood. Here, we present a large-scale evaluation of initialization strategies for differentially private medical image analysis, using chest radiograph classification as a representative benchmark with more than 800,000 images. Using state-of-the-art ConvNeXt models trained with DP-SGD across realistic privacy regimes, we compare non-domain-specific supervised ImageNet initialization, non-domain-specific self-supervised DINOv3 initialization, and domain-specific supervised pretraining on MIMIC-CXR, the largest publicly available chest radiograph dataset. Evaluations are conducted across five external datasets spanning diverse institutions and acquisition settings. We show that DINOv3 initialization consistently improves diagnostic utility relative to ImageNet initialization under DP, but remains inferior to domain-specific supervised pretraining, which achieves performance closest to non-private baselines. We further demonstrate that initialization choice strongly influences demographic fairness, cross-dataset generalization, and robustness to data scale and model capacity under privacy constraints. The results establish initialization strategy as a central determinant of utility, fairness, and generalization in differentially private medical imaging.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 120,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19667",
        "abs_url": "https://arxiv.org/abs/2601.19667",
        "pdf_url": "https://arxiv.org/pdf/2601.19667",
        "title": "SynCABEL: Synthetic Contextualized Augmentation for Biomedical Entity Linking",
        "authors": [
            "Adam Remaki",
            "Christel Gérardin",
            "Eulàlia Farré-Maduell",
            "Martin Krallinger",
            "Xavier Tannier"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "We present SynCABEL (Synthetic Contextualized Augmentation for Biomedical Entity Linking), a framework that addresses a central bottleneck in supervised biomedical entity linking (BEL): the scarcity of expert-annotated training data. SynCABEL leverages large language models to generate context-rich synthetic training examples for all candidate concepts in a target knowledge base, providing broad supervision without manual annotation. We demonstrate that SynCABEL, when combined with decoder-only models and guided inference establish new state-of-the-art results across three widely used multilingual benchmarks: MedMentions for English, QUAERO for French, and SPACCC for Spanish. Evaluating data efficiency, we show that SynCABEL reaches the performance of full human supervision using up to 60% less annotated data, substantially reducing reliance on labor-intensive and costly expert labeling. Finally, acknowledging that standard evaluation based on exact code matching often underestimates clinically valid predictions due to ontology redundancy, we introduce an LLM-as-a-judge protocol. This analysis reveals that SynCABEL significantly improves the rate of clinically valid predictions. Our synthetic datasets, models, and code are released to support reproducibility and future research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 121,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19738",
        "abs_url": "https://arxiv.org/abs/2601.19738",
        "pdf_url": "https://arxiv.org/pdf/2601.19738",
        "title": "Quantum Circuit Pre-Synthesis: Learning Local Edits to Reduce $T$-count",
        "authors": [
            "Daniele Lizzio Bosco",
            "Lukasz Cincio",
            "Giuseppe Serra",
            "M. Cerezo"
        ],
        "comments": "10+5 pages, 10 figures, 3 algorithms",
        "subjects": "Quantum Physics (quant-ph); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Compiling quantum circuits into Clifford+$T$ gates is a central task for fault-tolerant quantum computing using stabilizer codes. In the near term, $T$ gates will dominate the cost of fault tolerant implementations, and any reduction in the number of such expensive gates could mean the difference between being able to run a circuit or not. While exact synthesis is exponentially hard in the number of qubits, local synthesis approaches are commonly used to compile large circuits by decomposing them into substructures. However, composing local methods leads to suboptimal compilations in key metrics such as $T$-count or circuit depth, and their performance strongly depends on circuit representation. In this work, we address this challenge by proposing \\textsc{Q-PreSyn}, a strategy that, given a set of local edits preserving circuit equivalence, uses a RL agent to identify effective sequences of such actions and thereby obtain circuit representations that yield a reduced $T$-count upon synthesis. Experimental results of our proposed strategy, applied on top of well-known synthesis algorithms, show up to a $20\\%$ reduction in $T$-count on circuits with up to 25 qubits, without introducing any additional approximation error prior to synthesis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 122,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19755",
        "abs_url": "https://arxiv.org/abs/2601.19755",
        "pdf_url": "https://arxiv.org/pdf/2601.19755",
        "title": "Regularized $f$-Divergence Kernel Tests",
        "authors": [
            "Mónica Ribero",
            "Antonin Schrab",
            "Arthur Gretton"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We propose a framework to construct practical kernel-based two-sample tests from the family of $f$-divergences. The test statistic is computed from the witness function of a regularized variational representation of the divergence, which we estimate using kernel methods. The proposed test is adaptive over hyperparameters such as the kernel bandwidth and the regularization parameter. We provide theoretical guarantees for statistical test power across our family of $f$-divergence estimates. While our test covers a variety of $f$-divergences, we bring particular focus to the Hockey-Stick divergence, motivated by its applications to differential privacy auditing and machine unlearning evaluation. For two-sample testing, experiments demonstrate that different $f$-divergences are sensitive to different localized differences, illustrating the importance of leveraging diverse statistics. For machine unlearning, we propose a relative test that distinguishes true unlearning failures from safe distributional variations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 123,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19811",
        "abs_url": "https://arxiv.org/abs/2601.19811",
        "pdf_url": "https://arxiv.org/pdf/2601.19811",
        "title": "Revisiting Incremental Stochastic Majorization-Minimization Algorithms with Applications to Mixture of Experts",
        "authors": [
            "TrungKhang Tran",
            "TrungTin Nguyen",
            "Gersende Fort",
            "Tung Doan",
            "Hien Duy Nguyen",
            "Binh T. Nguyen",
            "Florence Forbes",
            "Christopher Drovandi"
        ],
        "comments": "TrungKhang Tran and TrungTin Nguyen are co-first authors",
        "subjects": "Machine Learning (stat.ML); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Statistics Theory (math.ST); Methodology (stat.ME)",
        "abstract": "Processing high-volume, streaming data is increasingly common in modern statistics and machine learning, where batch-mode algorithms are often impractical because they require repeated passes over the full dataset. This has motivated incremental stochastic estimation methods, including the incremental stochastic Expectation-Maximization (EM) algorithm formulated via stochastic approximation. In this work, we revisit and analyze an incremental stochastic variant of the Majorization-Minimization (MM) algorithm, which generalizes incremental stochastic EM as a special case. Our approach relaxes key EM requirements, such as explicit latent-variable representations, enabling broader applicability and greater algorithmic flexibility. We establish theoretical guarantees for the incremental stochastic MM algorithm, proving consistency in the sense that the iterates converge to a stationary point characterized by a vanishing gradient of the objective. We demonstrate these advantages on a softmax-gated mixture of experts (MoE) regression problem, for which no stochastic EM algorithm is available. Empirically, our method consistently outperforms widely used stochastic optimizers, including stochastic gradient descent, root mean square propagation, adaptive moment estimation, and second-order clipped stochastic optimization. These results support the development of new incremental stochastic algorithms, given the central role of softmax-gated MoE architectures in contemporary deep neural networks for heterogeneous data modeling. Beyond synthetic experiments, we also validate practical effectiveness on two real-world datasets, including a bioinformatics study of dent maize genotypes under drought stress that integrates high-dimensional proteomics with ecophysiological traits, where incremental stochastic MM yields stable gains in predictive performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 124,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19853",
        "abs_url": "https://arxiv.org/abs/2601.19853",
        "pdf_url": "https://arxiv.org/pdf/2601.19853",
        "title": "Generative Latent Alignment for Interpretable Radar Based Occupancy Detection in Ambient Assisted Living",
        "authors": [
            "Huy Trinh"
        ],
        "comments": "",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "In this work, we study how to make mmWave radar presence detection more interpretable for Ambient Assisted Living (AAL) settings, where camera-based sensing raises privacy concerns. We propose a Generative Latent Alignment (GLA) framework that combines a lightweight convolutional variational autoencoder with a frozen CLIP text encoder to learn a low-dimensional latent representation of radar Range-Angle (RA) heatmaps. The latent space is softly aligned with two semantic anchors corresponding to \"empty room\" and \"person present\", and Grad-CAM is applied in this aligned latent space to visualize which spatial regions support each presence decision. On our mmWave radar dataset, we qualitatively observe that the \"person present\" class produces compact Grad-CAM blobs that coincide with strong RA returns, whereas \"empty room\" samples yield diffuse or no evidence. We also conduct an ablation study using unrelated text prompts, which degrades both reconstruction and localization, suggesting that radar-specific anchors are important for meaningful explanations in this setting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 125,
        "date": "2026-01-28",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-28?abs=True",
        "arxiv_id": "2601.19888",
        "abs_url": "https://arxiv.org/abs/2601.19888",
        "pdf_url": "https://arxiv.org/pdf/2601.19888",
        "title": "M-SGWR: Multiscale Similarity and Geographically Weighted Regression",
        "authors": [
            "M. Naser Lessani",
            "Zhenlong Li",
            "Manzhu Yu",
            "Helen Greatrex",
            "Chan Shen"
        ],
        "comments": "",
        "subjects": "Methodology (stat.ME); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "The first law of geography is a cornerstone of spatial analysis, emphasizing that nearby and related locations tend to be more similar, however, defining what constitutes \"near\" and \"related\" remains challenging, as different phenomena exhibit distinct spatial patterns. Traditional local regression models, such as Geographically Weighted Regression (GWR) and Multiscale GWR (MGWR), quantify spatial relationships solely through geographic proximity. In an era of globalization and digital connectivity, however, geographic proximity alone may be insufficient to capture how locations are interconnected. To address this limitation, we propose a new multiscale local regression framework, termed M-SGWR, which characterizes spatial interaction across two dimensions: geographic proximity and attribute (variable) similarity. For each predictor, geographic and attribute-based weight matrices are constructed separately and then combined using an optimized parameter, alpha, which governs their relative contribution to local model fitting. Analogous to variable-specific bandwidths in MGWR, the optimal alpha varies by predictor, allowing the model to flexibly account for geographic, mixed, or non-spatial (remote similarity) effects. Results from two simulation experiments and one empirical application demonstrate that M-SGWR consistently outperforms GWR, SGWR, and MGWR across all goodness-of-fit metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]