[
    {
        "order": 1,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07858",
        "abs_url": "https://arxiv.org/abs/2601.07858",
        "pdf_url": "https://arxiv.org/pdf/2601.07858",
        "title": "Affect and Effect: Limitations of regularisation-based continual learning in EEG-based emotion classification",
        "authors": [
            "Nina Peire",
            "Yupei Li",
            "Björn Schuller"
        ],
        "comments": "20 pages, 16 figures, not including Appendix. Code can be found at: this https URL",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Generalisation to unseen subjects in EEG-based emotion classification remains a challenge due to high inter-and intra-subject variability. Continual learning (CL) poses a promising solution by learning from a sequence of tasks while mitigating catastrophic forgetting. Regularisation-based CL approaches, such as Elastic Weight Consolidation (EWC), Synaptic Intelligence (SI), and Memory Aware Synapses (MAS), are commonly used as baselines in EEG-based CL studies, yet their suitability for this problem remains underexplored. This study theoretically and empirically finds that regularisation-based CL methods show limited performance for EEG-based emotion classification on the DREAMER and SEED datasets. We identify a fundamental misalignment in the stability-plasticity trade-off, where regularisation-based methods prioritise mitigating catastrophic forgetting (backward transfer) over adapting to new subjects (forward transfer). We investigate this limitation under subject-incremental sequences and observe that: (1) the heuristics for estimating parameter importance become less reliable under noisy data and covariate shift, (2) gradients on parameters deemed important by these heuristics often interfere with gradient updates required for new subjects, moving optimisation away from the minimum, (3) importance values accumulated across tasks over-constrain the model, and (4) performance is sensitive to subject order. Forward transfer showed no statistically significant improvement over sequential fine-tuning (p > 0.05 across approaches and datasets). The high variability of EEG signals means past subjects provide limited value to future subjects. Regularisation-based continual learning approaches are therefore limited for robust generalisation to unseen subjects in EEG-based emotion classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07870",
        "abs_url": "https://arxiv.org/abs/2601.07870",
        "pdf_url": "https://arxiv.org/pdf/2601.07870",
        "title": "HOSC: A Periodic Activation with Saturation Control for High-Fidelity Implicit Neural Representations",
        "authors": [
            "Michal Jan Wlodarczyk",
            "Danzel Serrano",
            "Przemyslaw Musialski"
        ],
        "comments": "16 pages including appendices, 12 figures, 15 tables",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV); Graphics (cs.GR)",
        "abstract": "Periodic activations such as sine preserve high-frequency information in implicit neural representations (INRs) through their oscillatory structure, but often suffer from gradient instability and limited control over multi-scale behavior. We introduce the Hyperbolic Oscillator with Saturation Control (HOSC) activation, $\\text{HOSC}(x) = \\tanh\\bigl(\\beta \\sin(\\omega_0 x)\\bigr)$, which exposes an explicit parameter $\\beta$ that controls the Lipschitz bound of the activation by $\\beta \\omega_0$. This provides a direct mechanism to tune gradient magnitudes while retaining a periodic carrier. We provide a mathematical analysis and conduct a comprehensive empirical study across images, audio, video, NeRFs, and SDFs using standardized training protocols. Comparative analysis against SIREN, FINER, and related methods shows where HOSC provides substantial benefits and where it achieves competitive parity. Results establish HOSC as a practical periodic activation for INR applications, with domain-specific guidance on hyperparameter selection. For code visit the project page this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07873",
        "abs_url": "https://arxiv.org/abs/2601.07873",
        "pdf_url": "https://arxiv.org/pdf/2601.07873",
        "title": "Multiplicative Orthogonal Sequential Editing for Language Models",
        "authors": [
            "Hao-Xiang Xu",
            "Jun-Yu Ma",
            "Ziqi Peng",
            "Yuhao Sun",
            "Zhen-Hua Ling",
            "Jia-Chen Gu"
        ],
        "comments": "Accepted by AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Knowledge editing aims to efficiently modify the internal knowledge of large language models (LLMs) without compromising their other capabilities. The prevailing editing paradigm, which appends an update matrix to the original parameter matrix, has been shown by some studies to damage key numerical stability indicators (such as condition number and norm), thereby reducing editing performance and general abilities, especially in sequential editing scenario. Although subsequent methods have made some improvements, they remain within the additive framework and have not fundamentally addressed this limitation. To solve this problem, we analyze it from both statistical and mathematical perspectives and conclude that multiplying the original matrix by an orthogonal matrix does not change the numerical stability of the matrix. Inspired by this, different from the previous additive editing paradigm, a multiplicative editing paradigm termed Multiplicative Orthogonal Sequential Editing (MOSE) is proposed. Specifically, we first derive the matrix update in the multiplicative form, the new knowledge is then incorporated into an orthogonal matrix, which is multiplied by the original parameter matrix. In this way, the numerical stability of the edited matrix is unchanged, thereby maintaining editing performance and general abilities. We compared MOSE with several current knowledge editing methods, systematically evaluating their impact on both editing performance and the general abilities across three different LLMs. Experimental results show that MOSE effectively limits deviations in the edited parameter matrix and maintains its numerical stability. Compared to current methods, MOSE achieves a 12.08% improvement in sequential editing performance, while retaining 95.73% of general abilities across downstream tasks. The code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07877",
        "abs_url": "https://arxiv.org/abs/2601.07877",
        "pdf_url": "https://arxiv.org/pdf/2601.07877",
        "title": "E^2-LLM: Bridging Neural Signals and Interpretable Affective Analysis",
        "authors": [
            "Fei Ma",
            "Han Lin",
            "Yifan Xie",
            "Hongwei Ren",
            "Xiaoyu Shen",
            "Wenbo Ding",
            "Qi Tian"
        ],
        "comments": "11 pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Emotion recognition from electroencephalography (EEG) signals remains challenging due to high inter-subject variability, limited labeled data, and the lack of interpretable reasoning in existing approaches. While recent multimodal large language models (MLLMs) have advanced emotion analysis, they have not been adapted to handle the unique spatiotemporal characteristics of neural signals. We present E^2-LLM (EEG-to-Emotion Large Language Model), the first MLLM framework for interpretable emotion analysis from EEG. E^2-LLM integrates a pretrained EEG encoder with Qwen-based LLMs through learnable projection layers, employing a multi-stage training pipeline that encompasses emotion-discriminative pretraining, cross-modal alignment, and instruction tuning with chain-of-thought reasoning. We design a comprehensive evaluation protocol covering basic emotion prediction, multi-task reasoning, and zero-shot scenario understanding. Experiments on the dataset across seven emotion categories demonstrate that E^2-LLM achieves excellent performance on emotion classification, with larger variants showing enhanced reliability and superior zero-shot generalization to complex reasoning scenarios. Our work establishes a new paradigm combining physiological signals with LLM reasoning capabilities, showing that model scaling improves both recognition accuracy and interpretable emotional understanding in affective computing.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07886",
        "abs_url": "https://arxiv.org/abs/2601.07886",
        "pdf_url": "https://arxiv.org/pdf/2601.07886",
        "title": "Max-Min Neural Network Operators For Approximation of Multivariate Functions",
        "authors": [
            "Abhishek Yadav",
            "Uaday Singh",
            "Feng Dai"
        ],
        "comments": "17 pages with 8 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In this paper, we develop a multivariate framework for approximation by max-min neural network operators. Building on the recent advances in approximation theory by neural network operators, particularly, the univariate max-min operators, we propose and analyze new multivariate operators activated by sigmoidal functions. We establish pointwise and uniform convergence theorems and derive quantitative estimates for the order of approximation via modulus of continuity and multivariate generalized absolute moment. Our results demonstrate that multivariate max-min structure of operators, besides their algebraic elegance, provide efficient and stable approximation tools in both theoretical and applied settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07892",
        "abs_url": "https://arxiv.org/abs/2601.07892",
        "pdf_url": "https://arxiv.org/pdf/2601.07892",
        "title": "Sherry: Hardware-Efficient 1.25-Bit Ternary Quantization via Fine-grained Sparsification",
        "authors": [
            "Hong Huang",
            "Decheng Wu",
            "Qiangqiang Hu",
            "Guanghua Yu",
            "Jinhai Yang",
            "Jianchen Zhu",
            "Xue Liu",
            "Dapeng Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "The deployment of Large Language Models (LLMs) on resource-constrained edge devices is increasingly hindered by prohibitive memory and computational requirements. While ternary quantization offers a compelling solution by reducing weights to {-1, 0, +1}, current implementations suffer from a fundamental misalignment with commodity hardware. Most existing methods must choose between 2-bit aligned packing, which incurs significant bit wastage, or 1.67-bit irregular packing, which degrades inference speed. To resolve this tension, we propose Sherry, a hardware-efficient ternary quantization framework. Sherry introduces a 3:4 fine-grained sparsity that achieves a regularized 1.25-bit width by packing blocks of four weights into five bits, restoring power-of-two alignment. Furthermore, we identify weight trapping issue in sparse ternary training, which leads to representational collapse. To address this, Sherry introduces Arenas, an annealing residual synapse mechanism that maintains representational diversity during training. Empirical evaluations on LLaMA-3.2 across five benchmarks demonstrate that Sherry matches state-of-the-art ternary performance while significantly reducing model size. Notably, on an Intel i7-14700HX CPU, our 1B model achieves zero accuracy loss compared to SOTA baselines while providing 25% bit savings and 10% speed up. The code is available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07898",
        "abs_url": "https://arxiv.org/abs/2601.07898",
        "pdf_url": "https://arxiv.org/pdf/2601.07898",
        "title": "Large Language Models and Algorithm Execution: Application to an Arithmetic Function",
        "authors": [
            "Farah Ben Slama",
            "Frédéric Armetta"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Large Language Models (LLMs) have recently developed new advanced functionalities. Their effectiveness relies on statistical learning and generalization capabilities. However, they face limitations in internalizing the data they process and struggle, for instance, to autonomously execute algorithms. In this paper, we investigate the possibility of extending these models' capabilities to algorithm execution through specialized supervised training focused on reasoning decomposition. We introduce a training model called LLM-DAL (Large Language Model - Decompositional Algorithmic Learning), through which we demonstrate that LLMs' ability to perform complex algorithmic inferences and generalize can be significantly improved when the training method is properly designed to guide the model in its learning process.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07930",
        "abs_url": "https://arxiv.org/abs/2601.07930",
        "pdf_url": "https://arxiv.org/pdf/2601.07930",
        "title": "Transformer-Based Approach for Automated Functional Group Replacement in Chemical Compounds",
        "authors": [
            "Bo Pan",
            "Zhiping Zhang",
            "Kevin Spiekermann",
            "Tianchi Chen",
            "Xiang Yu",
            "Liying Zhang",
            "Liang Zhao"
        ],
        "comments": "The 2nd AAAI Workshop on Foundation Models for Biological Discoveries at AAAI 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Functional group replacement is a pivotal approach in cheminformatics to enable the design of novel chemical compounds with tailored properties. Traditional methods for functional group removal and replacement often rely on rule-based heuristics, which can be limited in their ability to generate diverse and novel chemical structures. Recently, transformer-based models have shown promise in improving the accuracy and efficiency of molecular transformations, but existing approaches typically focus on single-step modeling, lacking the guarantee of structural similarity. In this work, we seek to advance the state of the art by developing a novel two-stage transformer model for functional group removal and replacement. Unlike one-shot approaches that generate entire molecules in a single pass, our method generates the functional group to be removed and appended sequentially, ensuring strict substructure-level modifications. Using a matched molecular pairs (MMPs) dataset derived from ChEMBL, we trained an encoder-decoder transformer model with SMIRKS-based representations to capture transformation rules effectively. Extensive evaluations demonstrate our method's ability to generate chemically valid transformations, explore diverse chemical spaces, and maintain scalability across varying search sizes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07946",
        "abs_url": "https://arxiv.org/abs/2601.07946",
        "pdf_url": "https://arxiv.org/pdf/2601.07946",
        "title": "Coupled Diffusion-Encoder Models for Reconstruction of Flow Fields",
        "authors": [
            "AmirPouya Hemmasian",
            "Amir Barati Farimani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE)",
        "abstract": "Data-driven flow-field reconstruction typically relies on autoencoder architectures that compress high-dimensional states into low-dimensional latent representations. However, classical approaches such as variational autoencoders (VAEs) often struggle to preserve the higher-order statistical structure of fluid flows when subjected to strong compression. We propose DiffCoder, a coupled framework that integrates a probabilistic diffusion model with a conventional convolutional ResNet encoder and trains both components end-to-end. The encoder compresses the flow field into a latent representation, while the diffusion model learns a generative prior over reconstructions conditioned on the compressed state. This design allows DiffCoder to recover distributional and spectral properties that are not strictly required for minimizing pointwise reconstruction loss but are critical for faithfully representing statistical properties of the flow field. We evaluate DiffCoder and VAE baselines across multiple model sizes and compression ratios on a challenging dataset of Kolmogorov flow fields. Under aggressive compression, DiffCoder significantly improves the spectral accuracy while VAEs exhibit substantial degradation. Although both methods show comparable relative L2 reconstruction error, DiffCoder better preserves the underlying distributional structure of the flow. At moderate compression levels, sufficiently large VAEs remain competitive, suggesting that diffusion-based priors provide the greatest benefit when information bottlenecks are severe. These results demonstrate that the generative decoding by diffusion offers a promising path toward compact, statistically consistent representations of complex flow fields.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07951",
        "abs_url": "https://arxiv.org/abs/2601.07951",
        "pdf_url": "https://arxiv.org/pdf/2601.07951",
        "title": "Hybrid SARIMA LSTM Model for Local Weather Forecasting: A Residual Learning Approach for Data Driven Meteorological Prediction",
        "authors": [
            "Shreyas Rajeev",
            "Karthik Mudenahalli Ashoka",
            "Amit Mallappa Tiparaddi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Accurately forecasting long-term atmospheric variables remains a defining challenge in meteorological science due to the chaotic nature of atmospheric systems. Temperature data represents a complex superposition of deterministic cyclical climate forces and stochastic, short-term fluctuations. While planetary mechanics drive predictable seasonal periodicities, rapid meteorological changes such as thermal variations, pressure anomalies, and humidity shifts introduce nonlinear volatilities that defy simple extrapolation. Historically, the Seasonal Autoregressive Integrated Moving Average (SARIMA) model has been the standard for modeling historical weather data, prized for capturing linear seasonal trends. However, SARIMA operates under strict assumptions of stationarity, failing to capture abrupt, nonlinear transitions. This leads to systematic residual errors, manifesting as the under-prediction of sudden spikes or the over-smoothing of declines. Conversely, Deep Learning paradigms, specifically Long Short-Term Memory (LSTM) networks, demonstrate exceptional efficacy in handling intricate time-series data. By utilizing memory gates, LSTMs learn complex nonlinear dependencies. Yet, LSTMs face instability in open-loop forecasting; without ground truth feedback, minor deviations compound recursively, causing divergence. To resolve these limitations, we propose a Hybrid SARIMA-LSTM architecture. This framework employs a residual-learning strategy to decompose temperature into a predictable climate component and a nonlinear weather component. The SARIMA unit models the robust, long-term seasonal trend, while the LSTM is trained exclusively on the residuals the nonlinear errors SARIMA fails to capture. By fusing statistical stability with neural plasticity, this hybrid approach minimizes error propagation and enhances long-horizon accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07966",
        "abs_url": "https://arxiv.org/abs/2601.07966",
        "pdf_url": "https://arxiv.org/pdf/2601.07966",
        "title": "DataScribe: An AI-Native, Policy-Aligned Web Platform for Multi-Objective Materials Design and Discovery",
        "authors": [
            "Divyanshu Singh",
            "Doguhan Sarıtürk",
            "Cameron Lea",
            "Md Shafiqul Islam",
            "Raymundo Arroyave",
            "Vahid Attari"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Materials Science (cond-mat.mtrl-sci)",
        "abstract": "The acceleration of materials discovery requires digital platforms that go beyond data repositories to embed learning, optimization, and decision-making directly into research workflows. We introduce DataScribe, an AI-native, cloud-based materials discovery platform that unifies heterogeneous experimental and computational data through ontology-backed ingestion and machine-actionable knowledge graphs. The platform integrates FAIR-compliant metadata capture, schema and unit harmonization, uncertainty-aware surrogate modeling, and native multi-objective multi-fidelity Bayesian optimization, enabling closed-loop propose-measure-learn workflows across experimental and computational pipelines. DataScribe functions as an application-layer intelligence stack, coupling data governance, optimization, and explainability rather than treating them as downstream add-ons. We validate the platform through case studies in electrochemical materials and high-entropy alloys, demonstrating end-to-end data fusion, real-time optimization, and reproducible exploration of multi-objective trade spaces. By embedding optimization engines, machine learning, and unified access to public and private scientific data directly within the data infrastructure, and by supporting open, free use for academic and non-profit researchers, DataScribe functions as a general-purpose application-layer backbone for laboratories of any scale, including self-driving laboratories and geographically distributed materials acceleration platforms, with built-in support for performance, sustainability, and supply-chain-aware objectives.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08013",
        "abs_url": "https://arxiv.org/abs/2601.08013",
        "pdf_url": "https://arxiv.org/pdf/2601.08013",
        "title": "Beyond the Next Port: A Multi-Task Transformer for Forecasting Future Voyage Segment Durations",
        "authors": [
            "Nairui Liu",
            "Fang He",
            "Xindi Tang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate forecasts of segment-level sailing durations are fundamental to enhancing maritime schedule reliability and optimizing long-term port operations. However, conventional estimated time of arrival (ETA) models are primarily designed for the immediate next port of call and rely heavily on real-time automatic identification system (AIS) data, which is inherently unavailable for future voyage segments. To address this gap, the study reformulates future-port ETA prediction as a segment-level time-series forecasting problem. We develop a transformer-based architecture that integrates historical sailing durations, destination port congestion proxies, and static vessel descriptors. The proposed framework employs a causally masked attention mechanism to capture long-range temporal dependencies and a multi-task learning head to jointly predict segment sailing durations and port congestion states, leveraging shared latent signals to mitigate high uncertainty. Evaluation on a real-world global dataset from 2021 demonstrates the proposed model consistently outperforms a comprehensive suite of competitive baselines. The result shows a relative reduction of 4.85% in mean absolute error (MAE) and 4.95% in mean absolute percentage error (MAPE) compared with sequence baseline models. The relative reductions with gradient boosting machines are 9.39% in MAE and 52.97% in MAPE. Case studies for the major destination port further illustrate the model's superior accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08033",
        "abs_url": "https://arxiv.org/abs/2601.08033",
        "pdf_url": "https://arxiv.org/pdf/2601.08033",
        "title": "InfGraND: An Influence-Guided GNN-to-MLP Knowledge Distillation",
        "authors": [
            "Amir Eskandari",
            "Aman Anand",
            "Elyas Rashno",
            "Farhana Zulkernine"
        ],
        "comments": "Accepted in Transactions on Machine Learning Research (TMLR), 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph Neural Networks (GNNs) are the go-to model for graph data analysis. However, GNNs rely on two key operations - aggregation and update, which can pose challenges for low-latency inference tasks or resource-constrained scenarios. Simple Multi-Layer Perceptrons (MLPs) offer a computationally efficient alternative. Yet, training an MLP in a supervised setting often leads to suboptimal performance. Knowledge Distillation (KD) from a GNN teacher to an MLP student has emerged to bridge this gap. However, most KD methods either transfer knowledge uniformly across all nodes or rely on graph-agnostic indicators such as prediction uncertainty. We argue this overlooks a more fundamental, graph-centric inquiry: \"How important is a node to the structure of the graph?\" We introduce a framework, InfGraND, an Influence-guided Graph KNowledge Distillation from GNN to MLP that addresses this by identifying and prioritizing structurally influential nodes to guide the distillation process, ensuring that the MLP learns from the most critical parts of the graph. Additionally, InfGraND embeds structural awareness in MLPs through one-time multi-hop neighborhood feature pre-computation, which enriches the student MLP's input and thus avoids inference-time overhead. Our rigorous evaluation in transductive and inductive settings across seven homophilic graph benchmark datasets shows InfGraND consistently outperforms prior GNN to MLP KD methods, demonstrating its practicality for numerous latency-critical applications in real-world settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08039",
        "abs_url": "https://arxiv.org/abs/2601.08039",
        "pdf_url": "https://arxiv.org/pdf/2601.08039",
        "title": "Riemannian Zeroth-Order Gradient Estimation with Structure-Preserving Metrics for Geodesically Incomplete Manifolds",
        "authors": [
            "Shaocong Ma",
            "Heng Huang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "In this paper, we study Riemannian zeroth-order optimization in settings where the underlying Riemannian metric $g$ is geodesically incomplete, and the goal is to approximate stationary points with respect to this incomplete metric. To address this challenge, we construct structure-preserving metrics that are geodesically complete while ensuring that every stationary point under the new metric remains stationary under the original one. Building on this foundation, we revisit the classical symmetric two-point zeroth-order estimator and analyze its mean-squared error from a purely intrinsic perspective, depending only on the manifold's geometry rather than any ambient embedding. Leveraging this intrinsic analysis, we establish convergence guarantees for stochastic gradient descent with this intrinsic estimator. Under additional suitable conditions, an $\\epsilon$-stationary point under the constructed metric $g'$ also corresponds to an $\\epsilon$-stationary point under the original metric $g$, thereby matching the best-known complexity in the geodesically complete setting. Empirical studies on synthetic problems confirm our theoretical findings, and experiments on a practical mesh optimization task demonstrate that our framework maintains stable convergence even in the absence of geodesic completeness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08044",
        "abs_url": "https://arxiv.org/abs/2601.08044",
        "pdf_url": "https://arxiv.org/pdf/2601.08044",
        "title": "LUT-Compiled Kolmogorov-Arnold Networks for Lightweight DoS Detection on IoT Edge Devices",
        "authors": [
            "Oleksandr Kuznetsov"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Denial-of-Service (DoS) attacks pose a critical threat to Internet of Things (IoT) ecosystems, yet deploying effective intrusion detection on resource-constrained edge devices remains challenging. Kolmogorov-Arnold Networks (KANs) offer a compact alternative to Multi-Layer Perceptrons (MLPs) by placing learnable univariate spline functions on edges rather than fixed activations on nodes, achieving competitive accuracy with fewer parameters. However, runtime B-spline evaluation introduces significant computational overhead unsuitable for latency-critical IoT applications. We propose a lookup table (LUT) compilation pipeline that replaces expensive spline computations with precomputed quantized tables and linear interpolation, dramatically reducing inference latency while preserving detection quality. Our lightweight KAN model (50K parameters, 0.19~MB) achieves 99.0\\% accuracy on the CICIDS2017 DoS dataset. After LUT compilation with resolution $L=8$, the model maintains 98.96\\% accuracy (F1 degradation $<0.0004$) while achieving $\\mathbf{68\\times}$ speedup at batch size 256 and over $\\mathbf{5000\\times}$ speedup at batch size 1, with only $2\\times$ memory overhead. We provide comprehensive evaluation across LUT resolutions, quantization schemes, and out-of-bounds policies, establishing clear Pareto frontiers for accuracy-latency-memory trade-offs. Our results demonstrate that LUT-compiled KANs enable real-time DoS detection on CPU-only IoT gateways with deterministic inference latency and minimal resource footprint.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08094",
        "abs_url": "https://arxiv.org/abs/2601.08094",
        "pdf_url": "https://arxiv.org/pdf/2601.08094",
        "title": "Local-Global Feature Fusion for Subject-Independent EEG Emotion Recognition",
        "authors": [
            "Zheng Zhou",
            "Isabella McEvoy",
            "Camilo E. Valderrama"
        ],
        "comments": "7 pages, 5 figures, EMBC 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Subject-independent EEG emotion recognition is challenged by pronounced inter-subject variability and the difficulty of learning robust representations from short, noisy recordings. To address this, we propose a fusion framework that integrates (i) local, channel-wise descriptors and (ii) global, trial-level descriptors, improving cross-subject generalization on the SEED-VII dataset. Local representations are formed per channel by concatenating differential entropy with graph-theoretic features, while global representations summarize time-domain, spectral, and complexity characteristics at the trial level. These representations are fused in a dual-branch transformer with attention-based fusion and domain-adversarial regularization, with samples filtered by an intensity threshold. Experiments under a leave-one-subject-out protocol demonstrate that the proposed method consistently outperforms single-view and classical baselines, achieving approximately 40% mean accuracy in 7-class subject-independent emotion recognition. The code has been released at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08116",
        "abs_url": "https://arxiv.org/abs/2601.08116",
        "pdf_url": "https://arxiv.org/pdf/2601.08116",
        "title": "Learning a Stochastic Differential Equation Model of Tropical Cyclone Intensification from Reanalysis and Observational Data",
        "authors": [
            "Kenneth Gee",
            "Sai Ravela"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "Tropical cyclones are dangerous natural hazards, but their hazard is challenging to quantify directly from historical datasets due to limited dataset size and quality. Models of cyclone intensification fill this data gap by simulating huge ensembles of synthetic hurricanes based on estimates of the storm's large scale environment. Both physics-based and statistical/ML intensification models have been developed to tackle this problem, but an open question is: can a physically reasonable and simple physics-style differential equation model of intensification be learned from data? In this paper, we answer this question in the affirmative by presenting a 10-term cubic stochastic differential equation model of Tropical Cyclone intensification. The model depends on a well-vetted suite of engineered environmental features known to drive intensification and is trained using a high quality dataset of hurricane intensity (IBTrACS) with estimates of the cyclone's large scale environment from a data-assimilated simulation (ERA5 reanalysis), restricted to the Northern Hemisphere. The model generates synthetic intensity series which capture many aspects of historical intensification statistics and hazard estimates in the Northern Hemisphere. Our results show promise that interpretable, physics style models of complex earth system dynamics can be learned using automated system identification techniques.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08120",
        "abs_url": "https://arxiv.org/abs/2601.08120",
        "pdf_url": "https://arxiv.org/pdf/2601.08120",
        "title": "Structure Detection for Contextual Reinforcement Learning",
        "authors": [
            "Tianyue Zhou",
            "Jung-Hoon Cho",
            "Cathy Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Contextual Reinforcement Learning (CRL) tackles the problem of solving a set of related Contextual Markov Decision Processes (CMDPs) that vary across different context variables. Traditional approaches--independent training and multi-task learning--struggle with either excessive computational costs or negative transfer. A recently proposed multi-policy approach, Model-Based Transfer Learning (MBTL), has demonstrated effectiveness by strategically selecting a few tasks to train and zero-shot transfer. However, CMDPs encompass a wide range of problems, exhibiting structural properties that vary from problem to problem. As such, different task selection strategies are suitable for different CMDPs. In this work, we introduce Structure Detection MBTL (SD-MBTL), a generic framework that dynamically identifies the underlying generalization structure of CMDP and selects an appropriate MBTL algorithm. For instance, we observe Mountain structure in which generalization performance degrades from the training performance of the target task as the context difference increases. We thus propose M/GP-MBTL, which detects the structure and adaptively switches between a Gaussian Process-based approach and a clustering-based approach. Extensive experiments on synthetic data and CRL benchmarks--covering continuous control, traffic control, and agricultural management--show that M/GP-MBTL surpasses the strongest prior method by 12.49% on the aggregated metric. These results highlight the promise of online structure detection for guiding source task selection in complex CRL environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08121",
        "abs_url": "https://arxiv.org/abs/2601.08121",
        "pdf_url": "https://arxiv.org/pdf/2601.08121",
        "title": "Intra-tree Column Subsampling Hinders XGBoost Learning of Ratio-like Interactions",
        "authors": [
            "Mykola Pinchuk"
        ],
        "comments": "14 pages, 11 figures and tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Many applied problems contain signal that becomes clear only after combining multiple raw measurements. Ratios and rates are common examples. In gradient boosted trees, this combination is not an explicit operation: the model must synthesize it through coordinated splits on the component features. We study whether intra-tree column subsampling in XGBoost makes that synthesis harder. We use two synthetic data generating processes with cancellation-style structure. In both, two primitive features share a strong nuisance factor, while the target depends on a smaller differential factor. A log ratio cancels the nuisance and isolates the signal. We vary colsample_bylevel and colsample_bynode over s in {0.4, 0.6, 0.8, 0.9}, emphasizing mild subsampling (s >= 0.8). A control feature set includes the engineered ratio, removing the need for synthesis. Across both processes, intra-tree column subsampling reduces test PR-AUC in the primitives-only setting. In the main process the relative decrease reaches 54 percent when both parameters are set to 0.4. The effect largely disappears when the engineered ratio is present. A path-based co-usage metric drops in the same cells where performance deteriorates. Practically, if ratio-like structure is plausible, either avoid intra-tree subsampling or include the intended ratio features.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08122",
        "abs_url": "https://arxiv.org/abs/2601.08122",
        "pdf_url": "https://arxiv.org/pdf/2601.08122",
        "title": "Generalization Analysis and Method for Domain Generalization for a Family of Recurrent Neural Networks",
        "authors": [
            "Atefeh Termehchi",
            "Ekram Hossain",
            "Isaac Woungang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep learning (DL) has driven broad advances across scientific and engineering domains. Despite its success, DL models often exhibit limited interpretability and generalization, which can undermine trust, especially in safety-critical deployments. As a result, there is growing interest in (i) analyzing interpretability and generalization and (ii) developing models that perform robustly under data distributions different from those seen during training (i.e. domain generalization). However, the theoretical analysis of DL remains incomplete. For example, many generalization analyses assume independent samples, which is violated in sequential data with temporal correlations. Motivated by these limitations, this paper proposes a method to analyze interpretability and out-of-domain (OOD) generalization for a family of recurrent neural networks (RNNs). Specifically, the evolution of a trained RNN's states is modeled as an unknown, discrete-time, nonlinear closed-loop feedback system. Using Koopman operator theory, these nonlinear dynamics are approximated with a linear operator, enabling interpretability. Spectral analysis is then used to quantify the worst-case impact of domain shifts on the generalization error. Building on this analysis, a domain generalization method is proposed that reduces the OOD generalization error and improves the robustness to distribution shifts. Finally, the proposed analysis and domain generalization approach are validated on practical temporal pattern-learning tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08136",
        "abs_url": "https://arxiv.org/abs/2601.08136",
        "pdf_url": "https://arxiv.org/pdf/2601.08136",
        "title": "Reverse Flow Matching: A Unified Framework for Online Reinforcement Learning with Diffusion and Flow Policies",
        "authors": [
            "Zeyang Li",
            "Sunbochen Tang",
            "Navid Azizan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Diffusion and flow policies are gaining prominence in online reinforcement learning (RL) due to their expressive power, yet training them efficiently remains a critical challenge. A fundamental difficulty in online RL is the lack of direct samples from the target distribution; instead, the target is an unnormalized Boltzmann distribution defined by the Q-function. To address this, two seemingly distinct families of methods have been proposed for diffusion policies: a noise-expectation family, which utilizes a weighted average of noise as the training target, and a gradient-expectation family, which employs a weighted average of Q-function gradients. Yet, it remains unclear how these objectives relate formally or if they can be synthesized into a more general formulation. In this paper, we propose a unified framework, reverse flow matching (RFM), which rigorously addresses the problem of training diffusion and flow models without direct target samples. By adopting a reverse inferential perspective, we formulate the training target as a posterior mean estimation problem given an intermediate noisy sample. Crucially, we introduce Langevin Stein operators to construct zero-mean control variates, deriving a general class of estimators that effectively reduce importance sampling variance. We show that existing noise-expectation and gradient-expectation methods are two specific instances within this broader class. This unified view yields two key advancements: it extends the capability of targeting Boltzmann distributions from diffusion to flow policies, and enables the principled combination of Q-value and Q-gradient information to derive an optimal, minimum-variance estimator, thereby improving training efficiency and stability. We instantiate RFM to train a flow policy in online RL, and demonstrate improved performance on continuous-control benchmarks compared to diffusion policy baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08172",
        "abs_url": "https://arxiv.org/abs/2601.08172",
        "pdf_url": "https://arxiv.org/pdf/2601.08172",
        "title": "VBO-MI: A Fully Gradient-Based Bayesian Optimization Framework Using Variational Mutual Information Estimation",
        "authors": [
            "Farhad Mirkarimi"
        ],
        "comments": "31 pages, 8 figures, Code will be released upon acceptance",
        "subjects": "Machine Learning (cs.LG); Information Theory (cs.IT)",
        "abstract": "Many real-world tasks require optimizing expensive black-box functions accessible only through noisy evaluations, a setting commonly addressed with Bayesian optimization (BO). While Bayesian neural networks (BNNs) have recently emerged as scalable alternatives to Gaussian Processes (GPs), traditional BNN-BO frameworks remain burdened by expensive posterior sampling and acquisition function optimization. In this work, we propose {VBO-MI} (Variational Bayesian Optimization with Mutual Information), a fully gradient-based BO framework that leverages recent advances in variational mutual information estimation. To enable end-to-end gradient flow, we employ an actor-critic architecture consisting of an {action-net} to navigate the input space and a {variational critic} to estimate information gain. This formulation effectively eliminates the traditional inner-loop acquisition optimization bottleneck, achieving up to a {$10^2 \\times$ reduction in FLOPs} compared to BNN-BO baselines. We evaluate our method on a diverse suite of benchmarks, including high-dimensional synthetic functions and complex real-world tasks such as PDE optimization, the Lunar Lander control problem, and categorical Pest Control. Our experiments demonstrate that VBO-MI consistently provides the same or superior optimization performance and computational scalability over the baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08181",
        "abs_url": "https://arxiv.org/abs/2601.08181",
        "pdf_url": "https://arxiv.org/pdf/2601.08181",
        "title": "TabPFN Through The Looking Glass: An interpretability study of TabPFN and its internal representations",
        "authors": [
            "Aviral Gupta",
            "Armaan Sethi",
            "Dhruv Kumar"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Tabular foundational models are pre-trained models designed for a wide range of tabular data tasks. They have shown strong performance across domains, yet their internal representations and learned concepts remain poorly understood. This lack of interpretability makes it important to study how these models process and transform input features. In this work, we analyze the information encoded inside the model's hidden representations and examine how these representations evolve across layers. We run a set of probing experiments that test for the presence of linear regression coefficients, intermediate values from complex expressions, and the final answer in early layers. These experiments allow us to reason about the computations the model performs internally. Our results provide evidence that meaningful and structured information is stored inside the representations of tabular foundational models. We observe clear signals that correspond to both intermediate and final quantities involved in the model's prediction process. This gives insight into how the model refines its inputs and how the final output emerges. Our findings contribute to a deeper understanding of the internal mechanics of tabular foundational models. They show that these models encode concrete and interpretable information, which moves us closer to making their decision processes more transparent and trustworthy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08210",
        "abs_url": "https://arxiv.org/abs/2601.08210",
        "pdf_url": "https://arxiv.org/pdf/2601.08210",
        "title": "Scalable Multiagent Reinforcement Learning with Collective Influence Estimation",
        "authors": [
            "Zhenglong Luo",
            "Zhiyong Chen",
            "Aoxiang Liu",
            "Ke Pan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multiagent reinforcement learning (MARL) has attracted considerable attention due to its potential in addressing complex cooperative tasks. However, existing MARL approaches often rely on frequent exchanges of action or state information among agents to achieve effective coordination, which is difficult to satisfy in practical robotic systems. A common solution is to introduce estimator networks to model the behaviors of other agents and predict their actions; nevertheless, such designs cause the size and computational cost of the estimator networks to grow rapidly with the number of agents, thereby limiting scalability in large-scale systems. To address these challenges, this paper proposes a multiagent learning framework augmented with a Collective Influence Estimation Network (CIEN). By explicitly modeling the collective influence of other agents on the task object, each agent can infer critical interaction information solely from its local observations and the task object's states, enabling efficient collaboration without explicit action information exchange. The proposed framework effectively avoids network expansion as the team size increases; moreover, new agents can be incorporated without modifying the network structures of existing agents, demonstrating strong scalability. Experimental results on multiagent cooperative tasks based on the Soft Actor-Critic (SAC) algorithm show that the proposed method achieves stable and efficient coordination under communication-limited environments. Furthermore, policies trained with collective influence modeling are deployed on a real robotic platform, where experimental results indicate significantly improved robustness and deployment feasibility, along with reduced dependence on communication infrastructure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08216",
        "abs_url": "https://arxiv.org/abs/2601.08216",
        "pdf_url": "https://arxiv.org/pdf/2601.08216",
        "title": "One-Shot Federated Ridge Regression: Exact Recovery via Sufficient Statistic Aggregation",
        "authors": [
            "Zahir Alsulaimawi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Federated learning protocols require repeated synchronization between clients and a central server, with convergence rates depending on learning rates, data heterogeneity, and client sampling. This paper asks whether iterative communication is necessary for distributed linear regression. We show it is not. We formulate federated ridge regression as a distributed equilibrium problem where each client computes local sufficient statistics -- the Gram matrix and moment vector -- and transmits them once. The server reconstructs the global solution through a single matrix inversion. We prove exact recovery: under a coverage condition on client feature matrices, one-shot aggregation yields the centralized ridge solution, not an approximation. For heterogeneous distributions violating coverage, we derive non-asymptotic error bounds depending on spectral properties of the aggregated Gram matrix. Communication reduces from $\\mathcal{O}(Rd)$ in iterative methods to $\\mathcal{O}(d^2)$ total; for high-dimensional settings, we propose and experimentally validate random projection techniques reducing this to $\\mathcal{O}(m^2)$ where $m \\ll d$. We establish differential privacy guarantees where noise is injected once per client, eliminating the composition penalty that degrades privacy in multi-round protocols. We further address practical considerations including client dropout robustness, federated cross-validation for hyperparameter selection, and comparison with gradient-based alternatives. Comprehensive experiments on synthetic heterogeneous regression demonstrate that one-shot fusion matches FedAvg accuracy while requiring up to $38\\times$ less communication. The framework applies to kernel methods and random feature models but not to general nonlinear architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08219",
        "abs_url": "https://arxiv.org/abs/2601.08219",
        "pdf_url": "https://arxiv.org/pdf/2601.08219",
        "title": "A Preliminary Agentic Framework for Matrix Deflation",
        "authors": [
            "Paimon Goulart",
            "Evangelos E. Papalexakis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Can a small team of agents peel a matrix apart, one rank-1 slice at a time? We propose an agentic approach to matrix deflation in which a solver Large Language Model (LLM) generates rank-1 Singular Value Decomposition (SVD) updates and a Vision Language Model (VLM) accepts or rejects each update and decides when to stop, eliminating fixed norm thresholds. Solver stability is improved through in-context learning (ICL) and types of row/column permutations that expose visually coherent structure. We evaluate on Digits ($8{\\times}8$), CIFAR-10 ($32{\\times}32$ grayscale), and synthetic ($16{\\times}16$) matrices with and without Gaussian noise. In the synthetic noisy case, where the true construction rank $k$ is known, numerical deflation provides the noise target and our best agentic configuration differs by only $1.75$ RMSE of the target. For Digits and CIFAR-10, targets are defined by deflating until the Frobenius norm reaches $10\\%$ of the original. Across all settings, our agent achieves competitive results, suggesting that fully agentic, threshold-free deflation is a viable alternative to classical numerical algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08230",
        "abs_url": "https://arxiv.org/abs/2601.08230",
        "pdf_url": "https://arxiv.org/pdf/2601.08230",
        "title": "GADPN: Graph Adaptive Denoising and Perturbation Networks via Singular Value Decomposition",
        "authors": [
            "Hao Deng",
            "Bo Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "While Graph Neural Networks (GNNs) excel on graph-structured data, their performance is fundamentally limited by the quality of the observed graph, which often contains noise, missing links, or structural properties misaligned with GNNs' underlying assumptions. To address this, graph structure learning aims to infer a more optimal topology. Existing methods, however, often incur high computational costs due to complex generative models and iterative joint optimization, limiting their practical utility. In this paper, we propose GADPN, a simple yet effective graph structure learning framework that adaptively refines graph topology via low-rank denoising and generalized structural perturbation. Our approach makes two key contributions: (1) we introduce Bayesian optimization to adaptively determine the optimal denoising strength, tailoring the process to each graph's homophily level; and (2) we extend the structural perturbation method to arbitrary graphs via Singular Value Decomposition (SVD), overcoming its original limitation to symmetric structures. Extensive experiments on benchmark datasets demonstrate that GADPN achieves state-of-the-art performance while significantly improving efficiency. It shows particularly strong gains on challenging disassortative graphs, validating its ability to robustly learn enhanced graph structures across diverse network types.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08247",
        "abs_url": "https://arxiv.org/abs/2601.08247",
        "pdf_url": "https://arxiv.org/pdf/2601.08247",
        "title": "Incorporating Cognitive Biases into Reinforcement Learning for Financial Decision-Making",
        "authors": [
            "Liu He"
        ],
        "comments": "15 pages, 9 figures",
        "subjects": "Machine Learning (cs.LG); Econometrics (econ.EM)",
        "abstract": "Financial markets are influenced by human behavior that deviates from rationality due to cognitive biases. Traditional reinforcement learning (RL) models for financial decision-making assume rational agents, potentially overlooking the impact of psychological factors. This study integrates cognitive biases into RL frameworks for financial trading, hypothesizing that such models can exhibit human-like trading behavior and achieve better risk-adjusted returns than standard RL agents. We introduce biases, such as overconfidence and loss aversion, into reward structures and decision-making processes and evaluate their performance in simulated and real-world trading environments. Despite its inconclusive or negative results, this study provides insights into the challenges of incorporating human-like biases into RL, offering valuable lessons for developing robust financial AI systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08253",
        "abs_url": "https://arxiv.org/abs/2601.08253",
        "pdf_url": "https://arxiv.org/pdf/2601.08253",
        "title": "LDLT L-Lipschitz Network Weight Parameterization Initialization",
        "authors": [
            "Marius F. R. Juston",
            "Ramavarapu S. Sreenivas",
            "Dustin Nottage",
            "Ahmet Soylemezoglu"
        ],
        "comments": "12 pages, 17 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We analyze initialization dynamics for LDLT-based $\\mathcal{L}$-Lipschitz layers by deriving the exact marginal output variance when the underlying parameter matrix $W_0\\in \\mathbb{R}^{m\\times n}$ is initialized with IID Gaussian entries $\\mathcal{N}(0,\\sigma^2)$. The Wishart distribution, $S=W_0W_0^\\top\\sim\\mathcal{W}_m(n,\\sigma^2 \\boldsymbol{I}_m)$, used for computing the output marginal variance is derived in closed form using expectations of zonal polynomials via James' theorem and a Laplace-integral expansion of $(\\alpha \\boldsymbol{I}_m+S)^{-1}$. We develop an Isserlis/Wick-based combinatorial expansion for $\\operatorname{\\mathbb{E}}\\left[\\operatorname{tr}(S^k)\\right]$ and provide explicit truncated moments up to $k=10$, which yield accurate series approximations for small-to-moderate $\\sigma^2$. Monte Carlo experiments confirm the theoretical estimates. Furthermore, empirical analysis was performed to quantify that, using current He or Kaiming initialization with scaling $1/\\sqrt{n}$, the output variance is $0.41$, whereas the new parameterization with $10/ \\sqrt{n}$ for $\\alpha=1$ results in an output variance of $0.9$. The findings clarify why deep $\\mathcal{L}$-Lipschitz networks suffer rapid information loss at initialization and offer practical prescriptions for choosing initialization hyperparameters to mitigate this effect. However, using the Higgs boson classification dataset, a hyperparameter sweep over optimizers, initialization scale, and depth was conducted to validate the results on real-world data, showing that although the derivation ensures variance preservation, empirical results indicate He initialization still performs better.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08260",
        "abs_url": "https://arxiv.org/abs/2601.08260",
        "pdf_url": "https://arxiv.org/pdf/2601.08260",
        "title": "A Usable GAN-Based Tool for Synthetic ECG Generation in Cardiac Amyloidosis Research",
        "authors": [
            "Francesco Speziale",
            "Ugo Lomoio",
            "Fabiola Boccuto",
            "Pierangelo Veltri",
            "Pietro Hiram Guzzi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Cardiac amyloidosis (CA) is a rare and underdiagnosed infiltrative cardiomyopathy, and available datasets for machine-learning models are typically small, imbalanced and heterogeneous. This paper presents a Generative Adversarial Network (GAN) and a graphical command-line interface for generating realistic synthetic electrocardiogram (ECG) beats to support early diagnosis and patient stratification in CA. The tool is designed for usability, allowing clinical researchers to train class-specific generators once and then interactively produce large volumes of labelled synthetic beats that preserve the distribution of minority classes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08297",
        "abs_url": "https://arxiv.org/abs/2601.08297",
        "pdf_url": "https://arxiv.org/pdf/2601.08297",
        "title": "Demystifying the Slash Pattern in Attention: The Role of RoPE",
        "authors": [
            "Yuan Cheng",
            "Fengzhuo Zhang",
            "Yunlong Hou",
            "Cunxiao Du",
            "Chao Du",
            "Tianyu Pang",
            "Aixin Sun",
            "Zhuoran Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Large Language Models (LLMs) often exhibit slash attention patterns, where attention scores concentrate along the $\\Delta$-th sub-diagonal for some offset $\\Delta$. These patterns play a key role in passing information across tokens. But why do they emerge? In this paper, we demystify the emergence of these Slash-Dominant Heads (SDHs) from both empirical and theoretical perspectives. First, by analyzing open-source LLMs, we find that SDHs are intrinsic to models and generalize to out-of-distribution prompts. To explain the intrinsic emergence, we analyze the queries, keys, and Rotary Position Embedding (RoPE), which jointly determine attention scores. Our empirical analysis reveals two characteristic conditions of SDHs: (1) Queries and keys are almost rank-one, and (2) RoPE is dominated by medium- and high-frequency components. Under these conditions, queries and keys are nearly identical across tokens, and interactions between medium- and high-frequency components of RoPE give rise to SDHs. Beyond empirical evidence, we theoretically show that these conditions are sufficient to ensure the emergence of SDHs by formalizing them as our modeling assumptions. Particularly, we analyze the training dynamics of a shallow Transformer equipped with RoPE under these conditions, and prove that models trained via gradient descent exhibit SDHs. The SDHs generalize to out-of-distribution prompts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08316",
        "abs_url": "https://arxiv.org/abs/2601.08316",
        "pdf_url": "https://arxiv.org/pdf/2601.08316",
        "title": "Deep Exploration of Epoch-wise Double Descent in Noisy Data: Signal Separation, Large Activation, and Benign Overfitting",
        "authors": [
            "Tomoki Kubo",
            "Ryuken Uda",
            "Yusuke Iida"
        ],
        "comments": "17 pages, 9 figures",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (stat.ML)",
        "abstract": "Deep double descent is one of the key phenomena underlying the generalization capability of deep learning models. In this study, epoch-wise double descent, which is delayed generalization following overfitting, was empirically investigated by focusing on the evolution of internal structures. Fully connected neural networks of three different sizes were trained on the CIFAR-10 dataset with 30% label noise. By decomposing the loss curves into signal contributions from clean and noisy training data, the epoch-wise evolutions of internal signals were analyzed separately. Three main findings were obtained from this analysis. First, the model achieved strong re-generalization on test data even after perfectly fitting noisy training data during the double descent phase, corresponding to a \"benign overfitting\" state. Second, noisy data were learned after clean data, and as learning progressed, their corresponding internal activations became increasingly separated in outer layers; this enabled the model to overfit only noisy data. Third, a single, very large activation emerged in the shallow layer across all models; this phenomenon is referred as \"outliers,\" \"massive activa-tions,\" and \"super activations\" in recent large language models and evolves with re-generalization. The magnitude of large activation correlated with input patterns but not with output patterns. These empirical findings directly link the recent key phenomena of \"deep double descent,\" \"benign overfitting,\" and \"large activation\", and support the proposal of a novel scenario for understanding deep double descent.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08334",
        "abs_url": "https://arxiv.org/abs/2601.08334",
        "pdf_url": "https://arxiv.org/pdf/2601.08334",
        "title": "Automated Machine Learning in Radiomics: A Comparative Evaluation of Performance, Efficiency and Accessibility",
        "authors": [
            "Jose Lozano-Montoya",
            "Emilio Soria-Olivas",
            "Almudena Fuster-Matanzo",
            "Angel Alberich-Bayarri",
            "Ana Jimenez-Pastor"
        ],
        "comments": "27 pages, 4 figures, 3 tables, code available, see this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Automated machine learning (AutoML) frameworks can lower technical barriers for predictive and prognostic model development in radiomics by enabling researchers without programming expertise to build models. However, their effectiveness in addressing radiomics-specific challenges remains unclear. This study evaluates the performance, efficiency, and accessibility of general-purpose and radiomics-specific AutoML frameworks on diverse radiomics classification tasks, thereby highlighting development needs for radiomics. Ten public/private radiomics datasets with varied imaging modalities (CT/MRI), sizes, anatomies and endpoints were used. Six general-purpose and five radiomics-specific frameworks were tested with predefined parameters using standardized cross-validation. Evaluation metrics included AUC, runtime, together with qualitative aspects related to software status, accessibility, and interpretability. Simplatab, a radiomics-specific tool with a no-code interface, achieved the highest average test AUC (81.81%) with a moderate runtime (~1 hour). LightAutoML, a general-purpose framework, showed the fastest execution with competitive performance (78.74% mean AUC in six minutes). Most radiomics-specific frameworks were excluded from the performance analysis due to obsolescence, extensive programming requirements, or computational inefficiency. Conversely, general-purpose frameworks demonstrated higher accessibility and ease of implementation. Simplatab provides an effective balance of performance, efficiency, and accessibility for radiomics classification problems. However, significant gaps remain, including the lack of accessible survival analysis support and the limited integration of feature reproducibility and harmonization within current AutoML frameworks. Future research should focus on adapting AutoML solutions to better address these radiomics-specific challenges.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08358",
        "abs_url": "https://arxiv.org/abs/2601.08358",
        "pdf_url": "https://arxiv.org/pdf/2601.08358",
        "title": "Decodable but not structured: linear probing enables Underwater Acoustic Target Recognition with pretrained audio embeddings",
        "authors": [
            "Hilde I. Hummel",
            "Sandjai Bhulai",
            "Rob D. van der Mei",
            "Burooj Ghani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Sound (cs.SD); Audio and Speech Processing (eess.AS)",
        "abstract": "Increasing levels of anthropogenic noise from ships contribute significantly to underwater sound pollution, posing risks to marine ecosystems. This makes monitoring crucial to understand and quantify the impact of the ship radiated noise. Passive Acoustic Monitoring (PAM) systems are widely deployed for this purpose, generating years of underwater recordings across diverse soundscapes. Manual analysis of such large-scale data is impractical, motivating the need for automated approaches based on machine learning. Recent advances in automatic Underwater Acoustic Target Recognition (UATR) have largely relied on supervised learning, which is constrained by the scarcity of labeled data. Transfer Learning (TL) offers a promising alternative to mitigate this limitation. In this work, we conduct the first empirical comparative study of transfer learning for UATR, evaluating multiple pretrained audio models originating from diverse audio domains. The pretrained model weights are frozen, and the resulting embeddings are analyzed through classification, clustering, and similarity-based evaluations. The analysis shows that the geometrical structure of the embedding space is largely dominated by recording-specific characteristics. However, a simple linear probe can effectively suppress this recording-specific information and isolate ship-type features from these embeddings. As a result, linear probing enables effective automatic UATR using pretrained audio models at low computational cost, significantly reducing the need for a large amounts of high-quality labeled ship recordings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08393",
        "abs_url": "https://arxiv.org/abs/2601.08393",
        "pdf_url": "https://arxiv.org/pdf/2601.08393",
        "title": "Controlled LLM Training on Spectral Sphere",
        "authors": [
            "Tian Xie",
            "Haoming Luo",
            "Haoyu Tang",
            "Yiwen Hu",
            "Jason Klein Liu",
            "Qingnan Ren",
            "Yang Wang",
            "Wayne Xin Zhao",
            "Rui Yan",
            "Bing Su",
            "Chong Luo",
            "Baining Guo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Scaling large models requires optimization strategies that ensure rapid convergence grounded in stability. Maximal Update Parametrization ($\\boldsymbol{\\mu}$P) provides a theoretical safeguard for width-invariant $\\Theta(1)$ activation control, whereas emerging optimizers like Muon are only ``half-aligned'' with these constraints: they control updates but allow weights to drift. To address this limitation, we introduce the \\textbf{Spectral Sphere Optimizer (SSO)}, which enforces strict module-wise spectral constraints on both weights and their updates. By deriving the steepest descent direction on the spectral sphere, SSO realizes a fully $\\boldsymbol{\\mu}$P-aligned optimization process. To enable large-scale training, we implement SSO as an efficient parallel algorithm within Megatron. Through extensive pretraining on diverse architectures, including Dense 1.7B, MoE 8B-A1B, and 200-layer DeepNet models, SSO consistently outperforms AdamW and Muon. Furthermore, we observe significant practical stability benefits, including improved MoE router load balancing, suppressed outliers, and strictly bounded activations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08404",
        "abs_url": "https://arxiv.org/abs/2601.08404",
        "pdf_url": "https://arxiv.org/pdf/2601.08404",
        "title": "Out-of-distribution generalization of deep-learning surrogates for 2D PDE-generated dynamics in the small-data regime",
        "authors": [
            "Binh Duong Nguyen",
            "Stefan Sandfeld"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Partial differential equations (PDEs) are a central tool for modeling the dynamics of physical, engineering, and materials systems, but high-fidelity simulations are often computationally expensive. At the same time, many scientific applications can be viewed as the evolution of spatially distributed fields, making data-driven forecasting of such fields a core task in scientific machine learning. In this work we study autoregressive deep-learning surrogates for two-dimensional PDE dynamics on periodic domains, focusing on generalization to out-of-distribution initial conditions within a fixed PDE and parameter regime and on strict small-data settings with at most $\\mathcal{O}(10^2)$ simulated trajectories per system. We introduce a multi-channel U-Net [...], evaluate it on five qualitatively different PDE families and compare it to ViT, AFNO, PDE-Transformer, and KAN-UNet under a common training setup. Across all datasets, me-UNet matches or outperforms these more complex architectures in terms of field-space error, spectral similarity, and physics-based metrics for in-distribution rollouts, while requiring substantially less training time. It also generalizes qualitatively to unseen initial conditions with as few as $\\approx 20$ training simulations. A data-efficiency study and Grad-CAM analysis further suggest that, in small-data periodic 2D PDE settings, convolutional architectures with inductive biases aligned to locality and periodic boundary conditions remain strong contenders for accurate and moderately out-of-distribution-robust surrogate modeling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08421",
        "abs_url": "https://arxiv.org/abs/2601.08421",
        "pdf_url": "https://arxiv.org/pdf/2601.08421",
        "title": "Coverage Improvement and Fast Convergence of On-policy Preference Learning",
        "authors": [
            "Juno Kim",
            "Jihun Yun",
            "Jason D. Lee",
            "Kwang-Sung Jun"
        ],
        "comments": "46 pages, 2 figures, 2 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Online on-policy preference learning algorithms for language model alignment such as online direct policy optimization (DPO) can significantly outperform their offline counterparts. We provide a theoretical explanation for this phenomenon by analyzing how the sampling policy's coverage evolves throughout on-policy training. We propose and rigorously justify the \\emph{coverage improvement principle}: with sufficient batch size, each update moves into a region around the target where coverage is uniformly better, making subsequent data increasingly informative and enabling rapid convergence. In the contextual bandit setting with Bradley-Terry preferences and linear softmax policy class, we show that on-policy DPO converges exponentially in the number of iterations for batch size exceeding a generalized coverage threshold. In contrast, any learner restricted to offline samples from the initial policy suffers a slower minimax rate, leading to a sharp separation in total sample complexity. Motivated by this analysis, we further propose a simple hybrid sampler based on a novel \\emph{preferential} G-optimal design, which removes dependence on coverage and guarantees convergence in just two rounds. Finally, we develop principled on-policy schemes for reward distillation in the general function class setting, and show faster noiseless rates under an alternative deviation-based notion of coverage. Experimentally, we confirm that on-policy DPO and our proposed reward distillation algorithms outperform their off-policy counterparts and enjoy stable, monotonic performance gains across iterations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08503",
        "abs_url": "https://arxiv.org/abs/2601.08503",
        "pdf_url": "https://arxiv.org/pdf/2601.08503",
        "title": "Temporal Fusion Nexus: A task-agnostic multi-modal embedding model for clinical narratives and irregular time series in post-kidney transplant care",
        "authors": [
            "Aditya Kumar",
            "Simon Rauch",
            "Mario Cypko",
            "Marcel Naik",
            "Matthieu-P Schapranow",
            "Aadil Rashid",
            "Fabian Halleck",
            "Bilgin Osmanodja",
            "Roland Roller",
            "Lars Pape",
            "Klemens Budde",
            "Mario Schiffer",
            "Oliver Amft"
        ],
        "comments": "31 pages, 9 figures, 3 tables. A supplementary file is also available",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We introduce Temporal Fusion Nexus (TFN), a multi-modal and task-agnostic embedding model to integrate irregular time series and unstructured clinical narratives. We analysed TFN in post-kidney transplant (KTx) care, with a retrospective cohort of 3382 patients, on three key outcomes: graft loss, graft rejection, and mortality. Compared to state-of-the-art model in post KTx care, TFN achieved higher performance for graft loss (AUC 0.96 vs. 0.94) and graft rejection (AUC 0.84 vs. 0.74). In mortality prediction, TFN yielded an AUC of 0.86. TFN outperformed unimodal baselines (approx 10% AUC improvement over time series only baseline, approx 5% AUC improvement over time series with static patient data). Integrating clinical text improved performance across all tasks. Disentanglement metrics confirmed robust and interpretable latent factors in the embedding space, and SHAP-based attributions confirmed alignment with clinical reasoning. TFN has potential application in clinical tasks beyond KTx, where heterogeneous data sources, irregular longitudinal data, and rich narrative documentation are available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08521",
        "abs_url": "https://arxiv.org/abs/2601.08521",
        "pdf_url": "https://arxiv.org/pdf/2601.08521",
        "title": "Your Group-Relative Advantage Is Biased",
        "authors": [
            "Fengkai Yang",
            "Zherui Chen",
            "Xiaohan Wang",
            "Xiaodong Lu",
            "Jiajun Chai",
            "Guojun Yin",
            "Wei Lin",
            "Shuai Ma",
            "Fuzhen Zhuang",
            "Deqing Wang",
            "Yaodong Yang",
            "Jianxin Li",
            "Yikun Ban"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reinforcement Learning from Verifier Rewards (RLVR) has emerged as a widely used approach for post-training large language models on reasoning tasks, with group-based methods such as GRPO and its variants gaining broad adoption. These methods rely on group-relative advantage estimation to avoid learned critics, yet its theoretical properties remain poorly understood. In this work, we uncover a fundamental issue of group-based RL: the group-relative advantage estimator is inherently biased relative to the true (expected) advantage. We provide the first theoretical analysis showing that it systematically underestimates advantages for hard prompts and overestimates them for easy prompts, leading to imbalanced exploration and exploitation. To address this issue, we propose History-Aware Adaptive Difficulty Weighting (HA-DW), an adaptive reweighting scheme that adjusts advantage estimates based on an evolving difficulty anchor and training dynamics. Both theoretical analysis and experiments on five mathematical reasoning benchmarks demonstrate that HA-DW consistently improves performance when integrated into GRPO and its variants. Our results suggest that correcting biased advantage estimation is critical for robust and efficient RLVR training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08549",
        "abs_url": "https://arxiv.org/abs/2601.08549",
        "pdf_url": "https://arxiv.org/pdf/2601.08549",
        "title": "Contrastive and Multi-Task Learning on Noisy Brain Signals with Nonlinear Dynamical Signatures",
        "authors": [
            "Sucheta Ghosh",
            "Zahra Monfared",
            "Felix Dietrich"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We introduce a two-stage multitask learning framework for analyzing Electroencephalography (EEG) signals that integrates denoising, dynamical modeling, and representation learning. In the first stage, a denoising autoencoder is trained to suppress artifacts and stabilize temporal dynamics, providing robust signal representations. In the second stage, a multitask architecture processes these denoised signals to achieve three objectives: motor imagery classification, chaotic versus non-chaotic regime discrimination using Lyapunov exponent-based labels, and self-supervised contrastive representation learning with NT-Xent loss. A convolutional backbone combined with a Transformer encoder captures spatial-temporal structure, while the dynamical task encourages sensitivity to nonlinear brain dynamics. This staged design mitigates interference between reconstruction and discriminative goals, improves stability across datasets, and supports reproducible training by clearly separating noise reduction from higher-level feature learning. Empirical studies show that our framework not only enhances robustness and generalization but also surpasses strong baselines and recent state-of-the-art methods in EEG decoding, highlighting the effectiveness of combining denoising, dynamical features, and self-supervised learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08556",
        "abs_url": "https://arxiv.org/abs/2601.08556",
        "pdf_url": "https://arxiv.org/pdf/2601.08556",
        "title": "EviNAM: Intelligibility and Uncertainty via Evidential Neural Additive Models",
        "authors": [
            "Sören Schleibaum",
            "Anton Frederik Thielmann",
            "Julian Teusch",
            "Benjamin Säfken",
            "Jörg P. Müller"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Intelligibility and accurate uncertainty estimation are crucial for reliable decision-making. In this paper, we propose EviNAM, an extension of evidential learning that integrates the interpretability of Neural Additive Models (NAMs) with principled uncertainty estimation. Unlike standard Bayesian neural networks and previous evidential methods, EviNAM enables, in a single pass, both the estimation of the aleatoric and epistemic uncertainty as well as explicit feature contributions. Experiments on synthetic and real data demonstrate that EviNAM matches state-of-the-art predictive performance. While we focus on regression, our method extends naturally to classification and generalized additive models, offering a path toward more intelligible and trustworthy predictions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08646",
        "abs_url": "https://arxiv.org/abs/2601.08646",
        "pdf_url": "https://arxiv.org/pdf/2601.08646",
        "title": "Provably Safe Reinforcement Learning using Entropy Regularizer",
        "authors": [
            "Abhijit Mazumdar",
            "Rafal Wisniewski",
            "Manuela L. Bujorianu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We consider the problem of learning the optimal policy for Markov decision processes with safety constraints. We formulate the problem in a reach-avoid setup. Our goal is to design online reinforcement learning algorithms that ensure safety constraints with arbitrarily high probability during the learning phase. To this end, we first propose an algorithm based on the optimism in the face of uncertainty (OFU) principle. Based on the first algorithm, we propose our main algorithm, which utilizes entropy regularization. We investigate the finite-sample analysis of both algorithms and derive their regret bounds. We demonstrate that the inclusion of entropy regularization improves the regret and drastically controls the episode-to-episode variability that is inherent in OFU-based safe RL algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08719",
        "abs_url": "https://arxiv.org/abs/2601.08719",
        "pdf_url": "https://arxiv.org/pdf/2601.08719",
        "title": "Soft Partition-based KAPI-ELM for Multi-Scale PDEs",
        "authors": [
            "Vikas Dwivedi",
            "Monica Sigovan",
            "Bruno Sixou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Physics-informed machine learning holds great promise for solving differential equations, yet existing methods struggle with highly oscillatory, multiscale, or singularly perturbed PDEs due to spectral bias, costly backpropagation, and manually tuned kernel or Fourier frequencies. This work introduces a soft partition--based Kernel-Adaptive Physics-Informed Extreme Learning Machine (KAPI-ELM), a deterministic low-dimensional parameterization in which smooth partition lengths jointly control collocation centers and Gaussian kernel widths, enabling continuous coarse-to-fine resolution without Fourier features, random sampling, or hard domain interfaces. A signed-distance-based weighting further stabilizes least-squares learning on irregular geometries. Across eight benchmarks--including oscillatory ODEs, high-frequency Poisson equations, irregular-shaped domains, and stiff singularly perturbed convection-diffusion problems-the proposed method matches or exceeds the accuracy of state-of-the-art Physics-Informed Neural Network (PINN) and Theory of Functional Connections (TFC) variants while using only a single linear solve. Although demonstrated on steady linear PDEs, the results show that soft-partition kernel adaptation provides a fast, architecture-free approach for multiscale PDEs with broad potential for future physics-informed modeling. For reproducibility, the reference codes are available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08726",
        "abs_url": "https://arxiv.org/abs/2601.08726",
        "pdf_url": "https://arxiv.org/pdf/2601.08726",
        "title": "Model-Agnostic Solutions for Deep Reinforcement Learning in Non-Ergodic Contexts",
        "authors": [
            "Bert Verbruggen",
            "Arne Vanhoyweghen",
            "Vincent Ginis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reinforcement Learning (RL) remains a central optimisation framework in machine learning. Although RL agents can converge to optimal solutions, the definition of ``optimality'' depends on the environment's statistical properties. The Bellman equation, central to most RL algorithms, is formulated in terms of expected values of future rewards. However, when ergodicity is broken, long-term outcomes depend on the specific trajectory rather than on the ensemble average. In such settings, the ensemble average diverges from the time-average growth experienced by individual agents, with expected-value formulations yielding systematically suboptimal policies. Prior studies demonstrated that traditional RL architectures fail to recover the true optimum in non-ergodic environments. We extend this analysis to deep RL implementations and show that these, too, produce suboptimal policies under non-ergodic dynamics. Introducing explicit time dependence into the learning process can correct this limitation. By allowing the network's function approximation to incorporate temporal information, the agent can estimate value functions consistent with the process's intrinsic growth rate. This improvement does not require altering the environmental feedback, such as reward transformations or modified objective functions, but arises naturally from the agent's exposure to temporal trajectories. Our results contribute to the growing body of research on reinforcement learning methods for non-ergodic systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08733",
        "abs_url": "https://arxiv.org/abs/2601.08733",
        "pdf_url": "https://arxiv.org/pdf/2601.08733",
        "title": "A Novel Approach to Explainable AI with Quantized Active Ingredients in Decision Making",
        "authors": [
            "A.M.A.S.D. Alagiyawanna",
            "Asoka Karunananda",
            "Thushari Silva",
            "A. Mahasinghe"
        ],
        "comments": "Accepted and published in IEEE 2025. This is the authors manuscript version; final version available at IEEE Xplore: this https URL",
        "subjects": "Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Artificial Intelligence (AI) systems have shown good success at classifying. However, the lack of explainability is a true and significant challenge, especially in high-stakes domains, such as health and finance, where understanding is paramount. We propose a new solution to this challenge: an explainable AI framework based on our comparative study with Quantum Boltzmann Machines (QBMs) and Classical Boltzmann Machines (CBMs). We leverage principles of quantum computing within classical machine learning to provide substantive transparency around decision-making. The design involves training both models on a binarised and dimensionally reduced MNIST dataset, where Principal Component Analysis (PCA) is applied for preprocessing. For interpretability, we employ gradient-based saliency maps in QBMs and SHAP (SHapley Additive exPlanations) in CBMs to evaluate feature this http URL deploy hybrid quantum-classical circuits with strongly entangling layers, allowing for richer latent representations, whereas CBMs serve as a classical baseline that utilises contrastive divergence. Along the way, we found that QBMs outperformed CBMs on classification accuracy (83.5% vs. 54%) and had more concentrated distributions in feature attributions as quantified by entropy (1.27 vs. 1.39). In other words, QBMs not only produced better predictive performance than CBMs, but they also provided clearer identification of \"active ingredient\" or the most important features behind model predictions. To conclude, our results illustrate that quantum-classical hybrid models can display improvements in both accuracy and interpretability, which leads us toward more trustworthy and explainable AI systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08760",
        "abs_url": "https://arxiv.org/abs/2601.08760",
        "pdf_url": "https://arxiv.org/pdf/2601.08760",
        "title": "Adaptive Requesting in Decentralized Edge Networks via Non-Stationary Bandits",
        "authors": [
            "Yi Zhuang",
            "Kun Yang",
            "Xingran Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "We study a decentralized collaborative requesting problem that aims to optimize the information freshness of time-sensitive clients in edge networks consisting of multiple clients, access nodes (ANs), and servers. Clients request content through ANs acting as gateways, without observing AN states or the actions of other clients. We define the reward as the age of information reduction resulting from a client's selection of an AN, and formulate the problem as a non-stationary multi-armed bandit. In this decentralized and partially observable setting, the resulting reward process is history-dependent and coupled across clients, and exhibits both abrupt and gradual changes in expected rewards, rendering classical bandit-based approaches ineffective. To address these challenges, we propose the AGING BANDIT WITH ADAPTIVE RESET algorithm, which combines adaptive windowing with periodic monitoring to track evolving reward distributions. We establish theoretical performance guarantees showing that the proposed algorithm achieves near-optimal performance, and we validate the theoretical results through simulations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08763",
        "abs_url": "https://arxiv.org/abs/2601.08763",
        "pdf_url": "https://arxiv.org/pdf/2601.08763",
        "title": "Rewarding the Rare: Uniqueness-Aware RL for Creative Problem Solving in LLMs",
        "authors": [
            "Zhiyuan Hu",
            "Yucheng Wang",
            "Yufei He",
            "Jiaying Wu",
            "Yilun Zhao",
            "See-Kiong Ng",
            "Cynthia Breazeal",
            "Anh Tuan Luu",
            "Hae Won Park",
            "Bryan Hooi"
        ],
        "comments": "Work in Progress",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Reinforcement learning (RL) has become a central paradigm for post-training large language models (LLMs), particularly for complex reasoning tasks, yet it often suffers from exploration collapse: policies prematurely concentrate on a small set of dominant reasoning patterns, improving pass@1 while limiting rollout-level diversity and gains in pass@k. We argue that this failure stems from regularizing local token behavior rather than diversity over sets of solutions. To address this, we propose Uniqueness-Aware Reinforcement Learning, a rollout-level objective that explicitly rewards correct solutions that exhibit rare high-level strategies. Our method uses an LLM-based judge to cluster rollouts for the same problem according to their high-level solution strategies, ignoring superficial variations, and reweights policy advantages inversely with cluster size. As a result, correct but novel strategies receive higher rewards than redundant ones. Across mathematics, physics, and medical reasoning benchmarks, our approach consistently improves pass@$k$ across large sampling budgets and increases the area under the pass@$k$ curve (AUC@$K$) without sacrificing pass@1, while sustaining exploration and uncovering more diverse solution strategies at scale.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08777",
        "abs_url": "https://arxiv.org/abs/2601.08777",
        "pdf_url": "https://arxiv.org/pdf/2601.08777",
        "title": "Asymptotic Universal Alignment: A New Alignment Framework via Test-Time Scaling",
        "authors": [
            "Yang Cai",
            "Weiqiang Zheng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Computer Science and Game Theory (cs.GT)",
        "abstract": "Aligning large language models (LLMs) to serve users with heterogeneous and potentially conflicting preferences is a central challenge for personalized and trustworthy AI. We formalize an ideal notion of universal alignment through test-time scaling: for each prompt, the model produces $k\\ge 1$ candidate responses and a user selects their preferred one. We introduce $(k,f(k))$-robust alignment, which requires the $k$-output model to have win rate $f(k)$ against any other single-output model, and asymptotic universal alignment (U-alignment), which requires $f(k)\\to 1$ as $k\\to\\infty$. Our main result characterizes the optimal convergence rate: there exists a family of single-output policies whose $k$-sample product policies achieve U-alignment at rate $f(k)=\\frac{k}{k+1}$, and no method can achieve a faster rate in general. We show that popular post-training methods, including Nash learning from human feedback (NLHF), can fundamentally underutilize the benefits of test-time scaling. Even though NLHF is optimal for $k=1$, sampling from the resulting (often deterministic) policy cannot guarantee win rates above $\\tfrac{1}{2}$ except for an arbitrarily small slack. This stems from a lack of output diversity: existing alignment methods can collapse to a single majority-preferred response, making additional samples redundant. In contrast, our approach preserves output diversity and achieves the optimal test-time scaling rate. In particular, we propose a family of symmetric multi-player alignment games and prove that any symmetric Nash equilibrium policy of the $(k+1)$-player alignment game achieves the optimal $(k,\\frac{k}{k+1})$-robust alignment. Finally, we provide theoretical convergence guarantees for self-play learning dynamics in these games and extend the framework to opponents that also generate multiple responses.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08781",
        "abs_url": "https://arxiv.org/abs/2601.08781",
        "pdf_url": "https://arxiv.org/pdf/2601.08781",
        "title": "Fast and explainable clustering in the Manhattan and Tanimoto distance",
        "authors": [
            "Stefan Güttel",
            "Kaustubh Roy"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The CLASSIX algorithm is a fast and explainable approach to data clustering. In its original form, this algorithm exploits the sorting of the data points by their first principal component to truncate the search for nearby data points, with nearness being defined in terms of the Euclidean distance. Here we extend CLASSIX to other distance metrics, including the Manhattan distance and the Tanimoto distance. Instead of principal components, we use an appropriate norm of the data vectors as the sorting criterion, combined with the triangle inequality for search termination. In the case of Tanimoto distance, a provably sharper intersection inequality is used to further boost the performance of the new algorithm. On a real-world chemical fingerprint benchmark, CLASSIX Tanimoto is about 30 times faster than the Taylor--Butina algorithm, and about 80 times faster than DBSCAN, while computing higher-quality clusters in both cases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2512.12180",
        "abs_url": "https://arxiv.org/abs/2512.12180",
        "pdf_url": "https://arxiv.org/pdf/2512.12180",
        "title": "A Sensing Dataset Protocol for Benchmarking and Multi-Task Wireless Sensing",
        "authors": [
            "Jiawei Huang",
            "Di Zhang",
            "Yuanhao Cui",
            "Xiaowen Cao",
            "Tony Xiao Han",
            "Xiaojun Jing",
            "Christos Masouros"
        ],
        "comments": "6 pages, 8 figures",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "Wireless sensing has become a fundamental enabler for intelligent environments, supporting applications such as human detection, activity recognition, localization, and vital sign monitoring. Despite rapid advances, existing datasets and pipelines remain fragmented across sensing modalities, hindering fair comparison, transfer, and reproducibility. We propose the Sensing Dataset Protocol (SDP), a protocol-level specification and benchmark framework for large-scale wireless sensing. SDP defines how heterogeneous wireless signals are mapped into a unified perception data-block schema through lightweight synchronization, frequency-time alignment, and resampling, while a Canonical Polyadic-Alternating Least Squares (CP-ALS) pooling stage provides a task-agnostic representation that preserves multipath, spectral, and temporal structures. Built upon this protocol, a unified benchmark is established for detection, recognition, and vital-sign estimation with consistent preprocessing, training, and evaluation. Experiments under the cross-user split demonstrate that SDP significantly reduces variance (approximately 88%) across seeds while maintaining competitive accuracy and latency, confirming its value as a reproducible foundation for multi-modal and multitask sensing research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07856",
        "abs_url": "https://arxiv.org/abs/2601.07856",
        "pdf_url": "https://arxiv.org/pdf/2601.07856",
        "title": "Feature Entanglement-based Quantum Multimodal Fusion Neural Network",
        "authors": [
            "Yu Wu",
            "Qianli Zhou",
            "Jie Geng",
            "Xinyang Deng",
            "Wen Jiang"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Multimodal learning aims to enhance perceptual and decision-making capabilities by integrating information from diverse sources. However, classical deep learning approaches face a critical trade-off between the high accuracy of black-box feature-level fusion and the interpretability of less outstanding decision-level fusion, alongside the challenges of parameter explosion and complexity. This paper discusses the accuracy-interpretablity-complexity dilemma under the quantum computation framework and propose a feature entanglement-based quantum multimodal fusion neural network. The model is composed of three core components: a classical feed-forward module for unimodal processing, an interpretable quantum fusion block, and a quantum convolutional neural network (QCNN) for deep feature extraction. By leveraging the strong expressive power of quantum, we have reduced the complexity of multimodal fusion and post-processing to linear, and the fusion process also possesses the interpretability of decision-level fusion. The simulation results demonstrate that our model achieves classification accuracy comparable to classical networks with dozens of times of parameters, exhibiting notable stability and performance across multimodal image datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07871",
        "abs_url": "https://arxiv.org/abs/2601.07871",
        "pdf_url": "https://arxiv.org/pdf/2601.07871",
        "title": "Imaging-anchored Multiomics in Cardiovascular Disease: Integrating Cardiac Imaging, Bulk, Single-cell, and Spatial Transcriptomics",
        "authors": [
            "Minh H. N. Le",
            "Tuan Vinh",
            "Thanh-Huy Nguyen",
            "Tao Li",
            "Bao Quang Gia Le",
            "Han H. Huynh",
            "Monika Raj",
            "Carl Yang",
            "Min Xu",
            "Nguyen Quoc Khanh Le"
        ],
        "comments": "",
        "subjects": "Quantitative Methods (q-bio.QM); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Cardiovascular disease arises from interactions between inherited risk, molecular programmes, and tissue-scale remodelling that are observed clinically through imaging. Health systems now routinely generate large volumes of cardiac MRI, CT and echocardiography together with bulk, single-cell and spatial transcriptomics, yet these data are still analysed in separate pipelines. This review examines joint representations that link cardiac imaging phenotypes to transcriptomic and spatially resolved molecular states. An imaging-anchored perspective is adopted in which echocardiography, cardiac MRI and CT define a spatial phenotype of the heart, and bulk, single-cell and spatial transcriptomics provide cell-type- and location-specific molecular context. The biological and technical characteristics of these modalities are first summarised, and representation-learning strategies for each are outlined. Multimodal fusion approaches are reviewed, with emphasis on handling missing data, limited sample size, and batch effects. Finally, integrative pipelines for radiogenomics, spatial molecular alignment, and image-based prediction of gene expression are discussed, together with common failure modes, practical considerations, and open challenges. Spatial multiomics of human myocardium and atherosclerotic plaque, single-cell and spatial foundation models, and multimodal medical foundation models are collectively bringing imaging-anchored multiomics closer to large-scale cardiovascular translation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07901",
        "abs_url": "https://arxiv.org/abs/2601.07901",
        "pdf_url": "https://arxiv.org/pdf/2601.07901",
        "title": "Decentralized Online Convex Optimization with Unknown Feedback Delays",
        "authors": [
            "Hao Qiu",
            "Mengxiao Zhang",
            "Juliette Achddou"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Decentralized online convex optimization (D-OCO), where multiple agents within a network collaboratively learn optimal decisions in real-time, arises naturally in applications such as federated learning, sensor networks, and multi-agent control.  In this paper, we study D-OCO under unknown, time-and agent-varying feedback delays. While recent work has addressed this problem (Nguyen et al., 2024), existing algorithms assume prior knowledge of the total delay over agents and still suffer from suboptimal dependence on both the delay and network parameters. To overcome these limitations, we propose a novel algorithm that achieves an improved regret bound of O N $\\sqrt$ d tot + N $\\sqrt$ T  (1-$\\sigma$2) 1/4 , where T is the total horizon, d tot denotes the average total delay across agents, N is the number of agents, and 1 -$\\sigma$ 2 is the spectral gap of the network. Our approach builds upon recent advances in D-OCO (Wan et al., 2024a), but crucially incorporates an adaptive learning rate mechanism via a decentralized communication protocol. This enables each agent to estimate delays locally using a gossip-based strategy without the prior knowledge of the total delay. We further extend our framework to the strongly convex setting and derive a sharper regret bound of O N $\\delta$max ln T $\\alpha$  , where $\\alpha$ is the strong convexity parameter and $\\delta$ max is the maximum number of missing observations averaged over agents. We also show that our upper bounds for both settings are tight up to logarithmic factors. Experimental results validate the effectiveness of our approach, showing improvements over existing benchmark algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07942",
        "abs_url": "https://arxiv.org/abs/2601.07942",
        "pdf_url": "https://arxiv.org/pdf/2601.07942",
        "title": "Enhancing Portfolio Optimization with Deep Learning Insights",
        "authors": [
            "Brandon Luo",
            "Jim Skufca"
        ],
        "comments": "",
        "subjects": "Portfolio Management (q-fin.PM); Machine Learning (cs.LG)",
        "abstract": "Our work focuses on deep learning (DL) portfolio optimization, tackling challenges in long-only, multi-asset strategies across market cycles. We propose training models with limited regime data using pre-training techniques and leveraging transformer architectures for state variable inclusion. Evaluating our approach against traditional methods shows promising results, demonstrating our models' resilience in volatile markets. These findings emphasize the evolving landscape of DL-driven portfolio optimization, stressing the need for adaptive strategies to navigate dynamic market conditions and improve predictive accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07944",
        "abs_url": "https://arxiv.org/abs/2601.07944",
        "pdf_url": "https://arxiv.org/pdf/2601.07944",
        "title": "A Statistical Assessment of Amortized Inference Under Signal-to-Noise Variation and Distribution Shift",
        "authors": [
            "Roy Shivam Ram Shreshtth",
            "Arnab Hazra",
            "Gourab Mukherjee"
        ],
        "comments": "26 pages, 5 figures, 3 tables",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Computation (stat.CO)",
        "abstract": "Since the turn of the century, approximate Bayesian inference has steadily evolved as new computational techniques have been incorporated to handle increasingly complex and large-scale predictive problems. The recent success of deep neural networks and foundation models has now given rise to a new paradigm in statistical modeling, in which Bayesian inference can be amortized through large-scale learned predictors. In amortized inference, substantial computation is invested upfront to train a neural network that can subsequently produce approximate posterior or predictions at negligible marginal cost across a wide range of tasks. At deployment, amortized inference offers substantial computational savings compared with traditional Bayesian procedures, which generally require repeated likelihood evaluations or Monte Carlo simulations for predictions for each new dataset. Despite the growing popularity of amortized inference, its statistical interpretation and its role within Bayesian inference remain poorly understood. This paper presents statistical perspectives on the working principles of several major neural architectures, including feedforward networks, Deep Sets, and Transformers, and examines how these architectures naturally support amortized Bayesian inference. We discuss how these models perform structured approximation and probabilistic reasoning in ways that yield controlled generalization error across a wide range of deployment scenarios, and how these properties can be harnessed for Bayesian computation. Through simulation studies, we evaluate the accuracy, robustness, and uncertainty quantification of amortized inference under varying signal-to-noise ratios and distributional shifts, highlighting both its strengths and its limitations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.07969",
        "abs_url": "https://arxiv.org/abs/2601.07969",
        "pdf_url": "https://arxiv.org/pdf/2601.07969",
        "title": "Tuberculosis Screening from Cough Audio: Baseline Models, Clinical Variables, and Uncertainty Quantification",
        "authors": [
            "George P. Kafentzis",
            "Efstratios Selisios"
        ],
        "comments": "",
        "subjects": "Audio and Speech Processing (eess.AS); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Sound (cs.SD)",
        "abstract": "In this paper, we propose a standardized framework for automatic tuberculosis (TB) detection from cough audio and routinely collected clinical data using machine learning. While TB screening from audio has attracted growing interest, progress is difficult to measure because existing studies vary substantially in datasets, cohort definitions, feature representations, model families, validation protocols, and reported metrics. Consequently, reported gains are often not directly comparable, and it remains unclear whether improvements stem from modeling advances or from differences in data and evaluation. We address this gap by establishing a strong, well-documented baseline for TB prediction using cough recordings and accompanying clinical metadata from a recently compiled dataset from several countries. Our pipeline is reproducible end-to-end, covering feature extraction, multimodal fusion, cougher-independent evaluation, and uncertainty quantification, and it reports a consistent suite of clinically relevant metrics to enable fair comparison. We further quantify performance for cough audio-only and fused (audio + clinical metadata) models, and release the full experimental protocol to facilitate benchmarking. This baseline is intended to serve as a common reference point and to reduce methodological variance that currently holds back progress in the field.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08001",
        "abs_url": "https://arxiv.org/abs/2601.08001",
        "pdf_url": "https://arxiv.org/pdf/2601.08001",
        "title": "Operator learning for models of tear film breakup",
        "authors": [
            "Qinying Chen",
            "Arnab Roy",
            "Tobin A. Driscoll"
        ],
        "comments": "",
        "subjects": "Numerical Analysis (math.NA); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Tear film (TF) breakup is a key driver of understanding dry eye disease, yet estimating TF thickness and osmolarity from fluorescence (FL) imaging typically requires solving computationally expensive inverse problems. We propose an operator learning framework that replaces traditional inverse solvers with neural operators trained on simulated TF dynamics. This approach offers a scalable path toward rapid, data-driven analysis of tear film dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08097",
        "abs_url": "https://arxiv.org/abs/2601.08097",
        "pdf_url": "https://arxiv.org/pdf/2601.08097",
        "title": "AdaJudge: Adaptive Multi-Perspective Judging for Reward Modeling",
        "authors": [
            "Yongliang Miao",
            "Yangyang Liang",
            "Mengnan Du"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Reward modeling is essential for aligning large language models with human preferences, yet predominant architectures rely on a static pooling strategy to condense sequences into scalar scores. This paradigm, however, suffers from two key limitations: a static inductive bias that misaligns with task-dependent preference signals, and a representational mismatch, as the backbone is optimized for generation rather than fine-grained discrimination. To address this, we propose AdaJudge, a unified framework that jointly adapts representation and aggregation. AdaJudge first refines backbone representations into a discrimination-oriented space via gated refinement blocks. It then replaces the static readout with an adaptive multi-view pooling module that dynamically routes and combines evidence. Extensive experiments on RM-Bench and JudgeBench show that AdaJudge outperforms strong off-the-shelf reward models and traditional pooling baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08100",
        "abs_url": "https://arxiv.org/abs/2601.08100",
        "pdf_url": "https://arxiv.org/pdf/2601.08100",
        "title": "Towards A Unified PAC-Bayesian Framework for Norm-based Generalization Bounds",
        "authors": [
            "Xinping Yi",
            "Gaojie Jin",
            "Xiaowei Huang",
            "Shi Jin"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "Understanding the generalization behavior of deep neural networks remains a fundamental challenge in modern statistical learning theory. Among existing approaches, PAC-Bayesian norm-based bounds have demonstrated particular promise due to their data-dependent nature and their ability to capture algorithmic and geometric properties of learned models. However, most existing results rely on isotropic Gaussian posteriors, heavy use of spectral-norm concentration for weight perturbations, and largely architecture-agnostic analyses, which together limit both the tightness and practical relevance of the resulting bounds. To address these limitations, in this work, we propose a unified framework for PAC-Bayesian norm-based generalization by reformulating the derivation of generalization bounds as a stochastic optimization problem over anisotropic Gaussian posteriors. The key to our approach is a sensitivity matrix that quantifies the network outputs with respect to structured weight perturbations, enabling the explicit incorporation of heterogeneous parameter sensitivities and architectural structures. By imposing different structural assumptions on this sensitivity matrix, we derive a family of generalization bounds that recover several existing PAC-Bayesian results as special cases, while yielding bounds that are comparable to or tighter than state-of-the-art approaches. Such a unified framework provides a principled and flexible way for geometry-/structure-aware and interpretable generalization analysis in deep learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08118",
        "abs_url": "https://arxiv.org/abs/2601.08118",
        "pdf_url": "https://arxiv.org/pdf/2601.08118",
        "title": "MirrorBench: An Extensible Framework to Evaluate User-Proxy Agents for Human-Likeness",
        "authors": [
            "Ashutosh Hathidara",
            "Julien Yu",
            "Vaishali Senthil",
            "Sebastian Schreiber",
            "Anil Babu Ankisettipalli"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) are increasingly used as human simulators, both for evaluating conversational systems and for generating fine-tuning data. However, naive \"act-as-a-user\" prompting often yields verbose, unrealistic utterances, underscoring the need for principled evaluation of so-called user proxy agents. We present MIRRORBENCH, a reproducible, extensible benchmarking framework that evaluates user proxies solely on their ability to produce human-like user utterances across diverse conversational tasks, explicitly decoupled from downstream task success. MIRRORBENCH features a modular execution engine with typed interfaces, metadata-driven registries, multi-backend support, caching, and robust observability. The system supports pluggable user proxies, datasets, tasks, and metrics, enabling researchers to evaluate arbitrary simulators under a uniform, variance-aware harness. We include three lexical-diversity metrics (MATTR, YULE'S K, and HD-D) and three LLM-judge-based metrics (GTEval, Pairwise Indistinguishability, and Rubric-and-Reason). Across four open datasets, MIRRORBENCH yields variance-aware results and reveals systematic gaps between user proxies and real human users. The framework is open source and includes a simple command-line interface for running experiments, managing configurations and caching, and generating reports. The framework can be accessed at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08135",
        "abs_url": "https://arxiv.org/abs/2601.08135",
        "pdf_url": "https://arxiv.org/pdf/2601.08135",
        "title": "Hierarchical Online-Scheduling for Energy-Efficient Split Inference with Progressive Transmission",
        "authors": [
            "Zengzipeng Tang",
            "Yuxuan Sun",
            "Wei Chen",
            "Jianwen Ding",
            "Bo Ai",
            "Yulin Shao"
        ],
        "comments": "This work has been submitted to the IEEE for possible publication",
        "subjects": "Networking and Internet Architecture (cs.NI); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "Device-edge collaborative inference with Deep Neural Networks (DNNs) faces fundamental trade-offs among accuracy, latency and energy consumption. Current scheduling exhibits two drawbacks: a granularity mismatch between coarse, task-level decisions and fine-grained, packet-level channel dynamics, and insufficient awareness of per-task complexity. Consequently, scheduling solely at the task level leads to inefficient resource utilization. This paper proposes a novel ENergy-ACcuracy Hierarchical optimization framework for split Inference, named ENACHI, that jointly optimizes task- and packet-level scheduling to maximize accuracy under energy and delay constraints. A two-tier Lyapunov-based framework is developed for ENACHI, with a progressive transmission technique further integrated to enhance adaptivity. At the task level, an outer drift-plus-penalty loop makes online decisions for DNN partitioning and bandwidth allocation, and establishes a reference power budget to manage the long-term energy-accuracy trade-off. At the packet level, an uncertainty-aware progressive transmission mechanism is employed to adaptively manage per-sample task complexity. This is integrated with a nested inner control loop implementing a novel reference-tracking policy, which dynamically adjusts per-slot transmit power to adapt to fluctuating channel conditions. Experiments on ImageNet dataset demonstrate that ENACHI outperforms state-of-the-art benchmarks under varying deadlines and bandwidths, achieving a 43.12\\% gain in inference accuracy with a 62.13\\% reduction in energy consumption under stringent deadlines, and exhibits high scalability by maintaining stable energy consumption in congested multi-user scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08141",
        "abs_url": "https://arxiv.org/abs/2601.08141",
        "pdf_url": "https://arxiv.org/pdf/2601.08141",
        "title": "Qalb: Largest State-of-the-Art Urdu Large Language Model for 230M Speakers with Systematic Continued Pre-training",
        "authors": [
            "Muhammad Taimoor Hassan",
            "Jawad Ahmed",
            "Muhammad Awais"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Despite remarkable progress in large language models, Urdu-a language spoken by over 230 million people-remains critically underrepresented in modern NLP systems. Existing multilingual models demonstrate poor performance on Urdu-specific tasks, struggling with the language's complex morphology, right-to-left Nastaliq script, and rich literary traditions. Even the base LLaMA-3.1 8B-Instruct model shows limited capability in generating fluent, contextually appropriate Urdu text. We introduce Qalb, an Urdu language model developed through a two-stage approach: continued pre-training followed by supervised fine-tuning. Starting from LLaMA 3.1 8B, we perform continued pre-training on a dataset of 1.97 billion tokens. This corpus comprises 1.84 billion tokens of diverse Urdu text-spanning news archives, classical and contemporary literature, government documents, and social media-combined with 140 million tokens of English Wikipedia data to prevent catastrophic forgetting. We then fine-tune the resulting model on the Alif Urdu-instruct dataset. Through extensive evaluation on Urdu-specific benchmarks, Qalb demonstrates substantial improvements, achieving a weighted average score of 90.34 and outperforming the previous state-of-the-art Alif-1.0-Instruct model (87.1) by 3.24 points, while also surpassing the base LLaMA-3.1 8B-Instruct model by 44.64 points. Qalb achieves state-of-the-art performance with comprehensive evaluation across seven diverse tasks including Classification, Sentiment Analysis, and Reasoning. Our results demonstrate that continued pre-training on diverse, high-quality language data, combined with targeted instruction fine-tuning, effectively adapts foundation models to low-resource languages.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08148",
        "abs_url": "https://arxiv.org/abs/2601.08148",
        "pdf_url": "https://arxiv.org/pdf/2601.08148",
        "title": "Enriching Semantic Profiles into Knowledge Graph for Recommender Systems Using Large Language Models",
        "authors": [
            "Seokho Ahn",
            "Sungbok Shin",
            "Young-Duk Seo"
        ],
        "comments": "Accepted at KDD 2026",
        "subjects": "Information Retrieval (cs.IR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Rich and informative profiling to capture user preferences is essential for improving recommendation quality. However, there is still no consensus on how best to construct and utilize such profiles. To address this, we revisit recent profiling-based approaches in recommender systems along four dimensions: 1) knowledge base, 2) preference indicator, 3) impact range, and 4) subject. We argue that large language models (LLMs) are effective at extracting compressed rationales from diverse knowledge sources, while knowledge graphs (KGs) are better suited for propagating these profiles to extend their reach. Building on this insight, we propose a new recommendation model, called SPiKE. SPiKE consists of three core components: i) Entity profile generation, which uses LLMs to generate semantic profiles for all KG entities; ii) Profile-aware KG aggregation, which integrates these profiles into the KG; and iii) Pairwise profile preference matching, which aligns LLM- and KG-based representations during training. In experiments, we demonstrate that SPiKE consistently outperforms state-of-the-art KG- and LLM-based recommenders in real-world settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08169",
        "abs_url": "https://arxiv.org/abs/2601.08169",
        "pdf_url": "https://arxiv.org/pdf/2601.08169",
        "title": "Relational Knowledge Distillation Using Fine-tuned Function Vectors",
        "authors": [
            "Andrea Kang",
            "Yingnian Wu",
            "Hongjing Lu"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Representing relations between concepts is a core prerequisite for intelligent systems to make sense of the world. Recent work using causal mediation analysis has shown that a small set of attention heads encodes task representation in in-context learning, captured in a compact representation known as the function vector. We show that fine-tuning function vectors with only a small set of examples (about 20 word pairs) yields better performance on relation-based word-completion tasks than using the original vectors derived from causal mediation analysis. These improvements hold for both small and large language models. Moreover, the fine-tuned function vectors yield improved decoding performance for relation words and show stronger alignment with human similarity judgments of semantic relations. Next, we introduce the composite function vector - a weighted combination of fine-tuned function vectors - to extract relational knowledge and support analogical reasoning. At inference time, inserting this composite vector into LLM activations markedly enhances performance on challenging analogy problems drawn from cognitive science and SAT benchmarks. Our results highlight the potential of activation patching as a controllable mechanism for encoding and manipulating relational knowledge, advancing both the interpretability and reasoning capabilities of large language models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08184",
        "abs_url": "https://arxiv.org/abs/2601.08184",
        "pdf_url": "https://arxiv.org/pdf/2601.08184",
        "title": "Wasserstein-p Central Limit Theorem Rates: From Local Dependence to Markov Chains",
        "authors": [
            "Yixuan Zhang",
            "Qiaomin Xie"
        ],
        "comments": "51 pages, 1 figure",
        "subjects": "Probability (math.PR); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Finite-time central limit theorem (CLT) rates play a central role in modern machine learning (ML). In this paper, we study CLT rates for multivariate dependent data in Wasserstein-$p$ ($\\mathcal W_p$) distance, for general $p\\ge 1$. We focus on two fundamental dependence structures that commonly arise in ML: locally dependent sequences and geometrically ergodic Markov chains. In both settings, we establish the \\textit{first optimal} $\\mathcal O(n^{-1/2})$ rate in $\\mathcal W_1$, as well as the first $\\mathcal W_p$ ($p\\ge 2$) CLT rates under mild moment assumptions, substantially improving the best previously known bounds in these dependent-data regimes. As an application of our optimal $\\mathcal W_1$ rate for locally dependent sequences, we further obtain the first optimal $\\mathcal W_1$--CLT rate for multivariate $U$-statistics. On the technical side, we derive a tractable auxiliary bound for $\\mathcal W_1$ Gaussian approximation errors that is well suited to studying dependent data. For Markov chains, we further prove that the regeneration time of the split chain associated with a geometrically ergodic chain has a geometric tail without assuming strong aperiodicity or other restrictive conditions. These tools may be of independent interests and enable our optimal $\\mathcal W_1$ rates and underpin our $\\mathcal W_p$ ($p\\ge 2$) results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08198",
        "abs_url": "https://arxiv.org/abs/2601.08198",
        "pdf_url": "https://arxiv.org/pdf/2601.08198",
        "title": "Triplets Better Than Pairs: Towards Stable and Effective Self-Play Fine-Tuning for LLMs",
        "authors": [
            "Yibo Wang",
            "Hai-Long Sun",
            "Qing-Guo Chen",
            "Zhao Xu",
            "Weihua Luo",
            "Kaifu Zhang",
            "Lijun Zhang"
        ],
        "comments": "NeurIPS 2025",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Recently, self-play fine-tuning (SPIN) has been proposed to adapt large language models to downstream applications with scarce expert-annotated data, by iteratively generating synthetic responses from the model itself. However, SPIN is designed to optimize the current reward advantages of annotated responses over synthetic responses at hand, which may gradually vanish during iterations, leading to unstable optimization. Moreover, the utilization of reference policy induces a misalignment issue between the reward formulation for training and the metric for generation. To address these limitations, we propose a novel Triplet-based Self-Play fIne-tuNing (T-SPIN) method that integrates two key designs. First, beyond current advantages, T-SPIN additionally incorporates historical advantages between iteratively generated responses and proto-synthetic responses produced by the initial policy. Even if the current advantages diminish, historical advantages remain effective, stabilizing the overall optimization. Second, T-SPIN introduces the entropy constraint into the self-play framework, which is theoretically justified to support reference-free fine-tuning, eliminating the training-generation discrepancy. Empirical results on various tasks demonstrate not only the superior performance of T-SPIN over SPIN, but also its stable evolution during iterations. Remarkably, compared to supervised fine-tuning, T-SPIN achieves comparable or even better performance with only 25% samples, highlighting its effectiveness when faced with scarce annotated data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08215",
        "abs_url": "https://arxiv.org/abs/2601.08215",
        "pdf_url": "https://arxiv.org/pdf/2601.08215",
        "title": "Towards Principled Design of Mixture-of-Experts Language Models under Memory and Inference Constraints",
        "authors": [
            "Seng Pei Liew",
            "Kenta Shinzato",
            "Yuyang Dong"
        ],
        "comments": "10 pages, 5 figures",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Modern Mixture-of-Experts (MoE) language models are designed based on total parameters (memory footprint) and active parameters (inference cost). However, we find these two factors alone are insufficient to describe an optimal architecture. Through a systematic study, we demonstrate that MoE performance is primarily determined by total parameters ($N_{total}$) and expert sparsity ($s:=n_{exp}/n_{topk}$). Moreover, $n_{exp}$ and $n_{topk}$ do not \"cancel out\" within the sparsity ratio; instead, a larger total number of experts slightly penalizes performance by forcing a reduction in core model dimensions (depth and width) to meet memory constraints. This motivates a simple principle for MoE design which maximizes $N_{total}$ while minimizing $s$ (maximizing $n_{topk}$) and $n_{exp}$ under the given constraints. Our findings provide a robust framework for resolving architectural ambiguity and guiding MoE design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08236",
        "abs_url": "https://arxiv.org/abs/2601.08236",
        "pdf_url": "https://arxiv.org/pdf/2601.08236",
        "title": "Structural Dimension Reduction in Bayesian Networks",
        "authors": [
            "Pei Heng",
            "Yi Sun",
            "Jianhua Guo"
        ],
        "comments": "13 pages",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "This work introduces a novel technique, named structural dimension reduction, to collapse a Bayesian network onto a minimum and localized one while ensuring that probabilistic inferences between the original and reduced networks remain consistent. To this end, we propose a new combinatorial structure in directed acyclic graphs called the directed convex hull, which has turned out to be equivalent to their minimum localized Bayesian networks. An efficient polynomial-time algorithm is devised to identify them by determining the unique directed convex hulls containing the variables of interest from the original networks. Experiments demonstrate that the proposed technique has high dimension reduction capability in real networks, and the efficiency of probabilistic inference based on directed convex hulls can be significantly improved compared with traditional methods such as variable elimination and belief propagation algorithms. The code of this study is open at \\href{this https URL}{this https URL} and the proofs of the results in the main body are postponed to the appendix.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08283",
        "abs_url": "https://arxiv.org/abs/2601.08283",
        "pdf_url": "https://arxiv.org/pdf/2601.08283",
        "title": "AgriLens: Semantic Retrieval in Agricultural Texts Using Topic Modeling and Language Models",
        "authors": [
            "Heba Shakeel",
            "Tanvir Ahmad",
            "Tanya Liyaqat",
            "Chandni Saxena"
        ],
        "comments": "8 Pages, 1st workshop on Democratizing GenAI and Scalable NLP with HiPC for Societal Impact; 32nd IEEE International Conference on High Performance Computing, Data, & Analytics",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "As the volume of unstructured text continues to grow across domains, there is an urgent need for scalable methods that enable interpretable organization, summarization, and retrieval of information. This work presents a unified framework for interpretable topic modeling, zero-shot topic labeling, and topic-guided semantic retrieval over large agricultural text corpora. Leveraging BERTopic, we extract semantically coherent topics. Each topic is converted into a structured prompt, enabling a language model to generate meaningful topic labels and summaries in a zero-shot manner. Querying and document exploration are supported via dense embeddings and vector search, while a dedicated evaluation module assesses topical coherence and bias. This framework supports scalable and interpretable information access in specialized domains where labeled data is limited.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08318",
        "abs_url": "https://arxiv.org/abs/2601.08318",
        "pdf_url": "https://arxiv.org/pdf/2601.08318",
        "title": "Disentangling History and Propagation Dependencies in Cross-Subject Knee Contact Stress Prediction Using a Shared MeshGraphNet Backbone",
        "authors": [
            "Zhengye Pan",
            "Jianwei Zuo",
            "Jiajia Luo"
        ],
        "comments": "",
        "subjects": "Quantitative Methods (q-bio.QM); Machine Learning (cs.LG)",
        "abstract": "Background:Subject-specific finite element analysis accurately characterizes knee joint mechanics but is computationally expensive. Deep surrogate models provide a rapid alternative, yet their generalization across subjects under limited pose and load inputs remains unclear. It remains unclear whether the dominant source of prediction uncertainty arises from temporal history dependence or spatial propagation dependence. Methods:To disentangle these factors, we employed a shared MGN backbone with a fixed mesh topology. A dataset of running trials from nine subjects was constructed using an OpenSim-FEBio workflow. We developed four model variants to isolate specific dependencies: (1) a baseline MGN; (2) CT-MGN, incorporating a Control Transformer to encode short-horizon history; (3) MsgModMGN, applying state-conditioned modulation to message passing for adaptive propagation; (4) CT-MsgModMGN, combining both mechanisms. Models were evaluated using a rigorous grouped 3-fold cross-validation on unseen this http URL:The models incorporating history encoding significantly outperformed the baseline MGN and MsgModMGN in global accuracy and spatial consistency. Crucially, the CT module effectively mitigated the peak-shaving defect common in deep surrogates, significantly reducing peak stress prediction errors. In contrast, the spatial propagation modulation alone yielded no significant improvement over the baseline, and combining it with CT provided no additional this http URL:Temporal history dependence, rather than spatial propagation modulation, is the primary driver of prediction uncertainty in cross-subject knee contact mechanics. Explicitly encoding short-horizon driver sequences enables the surrogate model to recover implicit phase information, thereby achieving superior fidelity in peak-stress capture and high-risk localization compared to purely state-based approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08345",
        "abs_url": "https://arxiv.org/abs/2601.08345",
        "pdf_url": "https://arxiv.org/pdf/2601.08345",
        "title": "MLPlatt: Simple Calibration Framework for Ranking Models",
        "authors": [
            "Piotr Bajger",
            "Roman Dusek",
            "Krzysztof Galias",
            "Paweł Młyniec",
            "Aleksander Wawer",
            "Paweł Zawistowski"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Ranking models are extensively used in e-commerce for relevance estimation. These models often suffer from poor interpretability and no scale calibration, particularly when trained with typical ranking loss functions. This paper addresses the problem of post-hoc calibration of ranking models. We introduce MLPlatt: a simple yet effective ranking model calibration method that preserves the item ordering and converts ranker outputs to interpretable click-through rate (CTR) probabilities usable in downstream tasks. The method is context-aware by design and achieves good calibration metrics globally, and within strata corresponding to different values of a selected categorical field (such as user country or device), which is often important from a business perspective of an E-commerce platform. We demonstrate the superiority of MLPlatt over existing approaches on two datasets, achieving an improvement of over 10\\% in F-ECE (Field Expected Calibration Error) compared to other methods. Most importantly, we show that high-quality calibration can be achieved without compromising the ranking quality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08383",
        "abs_url": "https://arxiv.org/abs/2601.08383",
        "pdf_url": "https://arxiv.org/pdf/2601.08383",
        "title": "Deconstructing Pre-training: Knowledge Attribution Analysis in MoE and Dense Models",
        "authors": [
            "Bo Wang",
            "Junzhuo Li",
            "Hong Chen",
            "Yuanlin Chu",
            "Yuxuan Fan",
            "Xuming Hu"
        ],
        "comments": "Accepted by AAAI26",
        "subjects": "Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Mixture-of-Experts (MoE) architectures decouple model capacity from per-token computation, enabling scaling beyond the computational limits imposed by dense scaling laws. Yet how MoE architectures shape knowledge acquisition during pre-training, and how this process differs from dense architectures, remains unknown. To address this issue, we introduce Gated-LPI (Log-Probability Increase), a neuron-level attribution metric that decomposes log-probability increase across neurons. We present a time-resolved comparison of knowledge acquisition dynamics in MoE and dense architectures, tracking checkpoints over 1.2M training steps (~ 5.0T tokens) and 600K training steps (~ 2.5T tokens), respectively. Our experiments uncover three patterns: (1) Low-entropy backbone. The top approximately 1% of MoE neurons capture over 45% of positive updates, forming a high-utility core, which is absent in the dense baseline. (2) Early consolidation. The MoE model locks into a stable importance profile within < 100K steps, whereas the dense model remains volatile throughout training. (3) Functional robustness. Masking the ten most important MoE attention heads reduces relational HIT@10 by < 10%, compared with > 50% for the dense model, showing that sparsity fosters distributed -- rather than brittle -- knowledge storage. These patterns collectively demonstrate that sparsity fosters an intrinsically stable and distributed computational backbone from early in training, helping bridge the gap between sparse architectures and training-time interpretability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08427",
        "abs_url": "https://arxiv.org/abs/2601.08427",
        "pdf_url": "https://arxiv.org/pdf/2601.08427",
        "title": "Silence the Judge: Reinforcement Learning with Self-Verifier via Latent Geometric Clustering",
        "authors": [
            "Nonghai Zhang",
            "Weitao Ma",
            "Zhanyu Ma",
            "Jun Xu",
            "Jiuchong Gao",
            "Jinghua Hao",
            "Renqing He",
            "Jingwen Xu"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Group Relative Policy Optimization (GRPO) significantly enhances the reasoning performance of Large Language Models (LLMs). However, this success heavily relies on expensive external verifiers or human rules. Such dependency not only leads to significant computational costs and training latency, but also yields sparse rewards that hinder optimization efficiency. To address these challenges, we propose Latent-GRPO, a framework that derives intrinsic rewards directly from latent space geometry. Crucially, our empirical analysis reveals a compelling geometric property: terminal token representations of correct reasoning trajectories form dense clusters with high intra-class similarity, whereas incorrect trajectories remain scattered as outliers. In light of this discovery, we introduce the Iterative Robust Centroid Estimation (IRCE) algorithm, which generates dense, continuous rewards by mitigating magnitude fluctuations via spherical projection and estimating a robust ``truth centroid'' through iterative aggregation. Experimental results on multiple datasets show that our method maintains model performance while achieving a training speedup of over 2x compared to baselines. Furthermore, extensive results demonstrate strong generalization ability and robustness. The code will be released soon.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08467",
        "abs_url": "https://arxiv.org/abs/2601.08467",
        "pdf_url": "https://arxiv.org/pdf/2601.08467",
        "title": "Zero-Shot Distracted Driver Detection via Vision Language Models with Double Decoupling",
        "authors": [
            "Takamichi Miyata",
            "Sumiko Miyata",
            "Andrew Morris"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Image and Video Processing (eess.IV)",
        "abstract": "Distracted driving is a major cause of traffic collisions, calling for robust and scalable detection methods. Vision-language models (VLMs) enable strong zero-shot image classification, but existing VLM-based distracted driver detectors often underperform in real-world conditions. We identify subject-specific appearance variations (e.g., clothing, age, and gender) as a key bottleneck: VLMs entangle these factors with behavior cues, leading to decisions driven by who the driver is rather than what the driver is doing. To address this, we propose a subject decoupling framework that extracts a driver appearance embedding and removes its influence from the image embedding prior to zero-shot classification, thereby emphasizing distraction-relevant evidence. We further orthogonalize text embeddings via metric projection onto Stiefel manifold to improve separability while staying close to the original semantics. Experiments demonstrate consistent gains over prior baselines, indicating the promise of our approach for practical road-safety applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08468",
        "abs_url": "https://arxiv.org/abs/2601.08468",
        "pdf_url": "https://arxiv.org/pdf/2601.08468",
        "title": "JudgeRLVR: Judge First, Generate Second for Efficient Reasoning",
        "authors": [
            "Jiangshan Duo",
            "Hanyu Li",
            "Hailin Zhang",
            "Yudong Wang",
            "Sujian Li",
            "Liang Zhao"
        ],
        "comments": "16 pages, 5 figures",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Reinforcement Learning with Verifiable Rewards (RLVR) has become a standard paradigm for reasoning in Large Language Models. However, optimizing solely for final-answer correctness often drives models into aimless, verbose exploration, where they rely on exhaustive trial-and-error tactics rather than structured planning to reach solutions. While heuristic constraints like length penalties can reduce verbosity, they often truncate essential reasoning steps, creating a difficult trade-off between efficiency and verification. In this paper, we argue that discriminative capability is a prerequisite for efficient generation: by learning to distinguish valid solutions, a model can internalize a guidance signal that prunes the search space. We propose JudgeRLVR, a two-stage judge-then-generate paradigm. In the first stage, we train the model to judge solution responses with verifiable answers. In the second stage, we fine-tune the same model with vanilla generating RLVR initialized from the judge. Compared to Vanilla RLVR using the same math-domain training data, JudgeRLVR achieves a better quality--efficiency trade-off for Qwen3-30B-A3B: on in-domain math, it delivers about +3.7 points average accuracy gain with -42\\% average generation length; on out-of-domain benchmarks, it delivers about +4.5 points average accuracy improvement, demonstrating enhanced generalization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08491",
        "abs_url": "https://arxiv.org/abs/2601.08491",
        "pdf_url": "https://arxiv.org/pdf/2601.08491",
        "title": "AUV Trajectory Learning for Underwater Acoustic Energy Transfer and Age Minimization",
        "authors": [
            "Mohamed Afouene Melki",
            "Mohammad Shehab",
            "Mohamed-Slim Alouini"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Internet of underwater things (IoUT) is increasingly gathering attention with the aim of monitoring sea life and deep ocean environment, underwater surveillance as well as maintenance of underwater installments. However, conventional IoUT devices, reliant on battery power, face limitations in lifespan and pose environmental hazards upon disposal. This paper introduces a sustainable approach for simultaneous information uplink from the IoUT devices and acoustic energy transfer (AET) to the devices via an autonomous underwater vehicle (AUV), potentially enabling them to operate indefinitely. To tackle the time-sensitivity, we adopt age of information (AoI), and Jain's fairness index. We develop two deep-reinforcement learning (DRL) algorithms, offering a high-complexity, high-performance frequency division duplex (FDD) solution and a low-complexity, medium-performance time division duplex (TDD) approach. The results elucidate that the proposed FDD and TDD solutions significantly reduce the average AoI and boost the harvested energy as well as data collection fairness compared to baseline approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08497",
        "abs_url": "https://arxiv.org/abs/2601.08497",
        "pdf_url": "https://arxiv.org/pdf/2601.08497",
        "title": "GraphFusionSBR: Denoising Multi-Channel Graphs for Session-Based Recommendation",
        "authors": [
            "Jia-Xin He",
            "Hung-Hsuan Chen"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Session-based recommendation systems must capture implicit user intents from sessions. However, existing models suffer from issues such as item interaction dominance and noisy sessions. We propose a multi-channel recommendation model, including a knowledge graph channel, a session hypergraph channel, and a session line graph channel, to capture information from multiple sources. Our model adaptively removes redundant edges in the knowledge graph channel to reduce noise. Knowledge graph representations cooperate with hypergraph representations for prediction to alleviate item dominance. We also generate in-session attention for denoising. Finally, we maximize mutual information between the hypergraph and line graph channels as an auxiliary task. Experiments demonstrate that our method enhances the accuracy of various recommendations, including e-commerce and multimedia recommendations. We release the code on GitHub for reproducibility.\\footnote{this https URL}",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08511",
        "abs_url": "https://arxiv.org/abs/2601.08511",
        "pdf_url": "https://arxiv.org/pdf/2601.08511",
        "title": "STAR: Detecting Inference-time Backdoors in LLM Reasoning via State-Transition Amplification Ratio",
        "authors": [
            "Seong-Gyu Park",
            "Sohee Park",
            "Jisu Lee",
            "Hyunsik Na",
            "Daeseon Choi"
        ],
        "comments": "16 pages, 5 figures",
        "subjects": "Computation and Language (cs.CL); Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Recent LLMs increasingly integrate reasoning mechanisms like Chain-of-Thought (CoT). However, this explicit reasoning exposes a new attack surface for inference-time backdoors, which inject malicious reasoning paths without altering model parameters. Because these attacks generate linguistically coherent paths, they effectively evade conventional detection. To address this, we propose STAR (State-Transition Amplification Ratio), a framework that detects backdoors by analyzing output probability shifts. STAR exploits the statistical discrepancy where a malicious input-induced path exhibits high posterior probability despite a low prior probability in the model's general knowledge. We quantify this state-transition amplification and employ the CUSUM algorithm to detect persistent anomalies. Experiments across diverse models (8B-70B) and five benchmark datasets demonstrate that STAR exhibits robust generalization capabilities, consistently achieving near-perfect performance (AUROC $\\approx$ 1.0) with approximately $42\\times$ greater efficiency than existing baselines. Furthermore, the framework proves robust against adaptive attacks attempting to bypass detection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08526",
        "abs_url": "https://arxiv.org/abs/2601.08526",
        "pdf_url": "https://arxiv.org/pdf/2601.08526",
        "title": "Supervised Spike Agreement Dependent Plasticity for Fast Local Learning in Spiking Neural Networks",
        "authors": [
            "Gouri Lakshmi S",
            "Athira Chandrasekharan",
            "Harshit Kumar",
            "Muhammed Sahad E",
            "Bikas C Das",
            "Saptarshi Bej"
        ],
        "comments": "",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Machine Learning (cs.LG)",
        "abstract": "Spike-Timing-Dependent Plasticity (STDP) provides a biologically grounded learning rule for spiking neural networks (SNNs), but its reliance on precise spike timing and pairwise updates limits fast learning of weights. We introduce a supervised extension of Spike Agreement-Dependent Plasticity (SADP), which replaces pairwise spike-timing comparisons with population-level agreement metrics such as Cohen's kappa. The proposed learning rule preserves strict synaptic locality, admits linear-time complexity, and enables efficient supervised learning without backpropagation, surrogate gradients, or teacher forcing. We integrate supervised SADP within hybrid CNN-SNN architectures, where convolutional encoders provide compact feature representations that are converted into Poisson spike trains for agreement-driven learning in the SNN. Extensive experiments on MNIST, Fashion-MNIST, CIFAR-10, and biomedical image classification tasks demonstrate competitive performance and fast convergence. Additional analyses show stable performance across broad hyperparameter ranges and compatibility with device-inspired synaptic update dynamics. Together, these results establish supervised SADP as a scalable, biologically grounded, and hardware-aligned learning paradigm for spiking neural networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08527",
        "abs_url": "https://arxiv.org/abs/2601.08527",
        "pdf_url": "https://arxiv.org/pdf/2601.08527",
        "title": "Sampling via Stochastic Interpolants by Langevin-based Velocity and Initialization Estimation in Flow ODEs",
        "authors": [
            "Chenguang Duan",
            "Yuling Jiao",
            "Gabriele Steidl",
            "Christian Wald",
            "Jerry Zhijian Yang",
            "Ruizhe Zhang"
        ],
        "comments": "",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG); Probability (math.PR); Machine Learning (stat.ML)",
        "abstract": "We propose a novel method for sampling from unnormalized Boltzmann densities based on a probability-flow ordinary differential equation (ODE) derived from linear stochastic interpolants. The key innovation of our approach is the use of a sequence of Langevin samplers to enable efficient simulation of the flow. Specifically, these Langevin samplers are employed (i) to generate samples from the interpolant distribution at intermediate times and (ii) to construct, starting from these intermediate times, a robust estimator of the velocity field governing the flow ODE. For both applications of the Langevin diffusions, we establish convergence guarantees. Extensive numerical experiments demonstrate the efficiency of the proposed method on challenging multimodal distributions across a range of dimensions, as well as its effectiveness in Bayesian inference tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08539",
        "abs_url": "https://arxiv.org/abs/2601.08539",
        "pdf_url": "https://arxiv.org/pdf/2601.08539",
        "title": "Reducing Compute Waste in LLMs through Kernel-Level DVFS",
        "authors": [
            "Jeffrey Spaan",
            "Kuan-Hsun Chen",
            "Ana-Lucia Varbanescu"
        ],
        "comments": "",
        "subjects": "Performance (cs.PF); Machine Learning (cs.LG)",
        "abstract": "The rapid growth of AI has fueled the expansion of accelerator- or GPU-based data centers. However, the rising operational energy consumption has emerged as a critical bottleneck and a major sustainability concern. Dynamic Voltage and Frequency Scaling (DVFS) is a well-known technique used to reduce energy consumption, and thus improve energy-efficiency, since it requires little effort and works with existing hardware. Reducing the energy consumption of training and inference of Large Language Models (LLMs) through DVFS or power capping is feasible: related work has shown energy savings can be significant, but at the cost of significant slowdowns. In this work, we focus on reducing waste in LLM operations: i.e., reducing energy consumption without losing performance. We propose a fine-grained, kernel-level, DVFS approach that explores new frequency configurations, and prove these save more energy than previous, pass- or iteration-level solutions. For example, for a GPT-3 training run, a pass-level approach could reduce energy consumption by 2% (without losing performance), while our kernel-level approach saves as much as 14.6% (with a 0.6% slowdown). We further investigate the effect of data and tensor parallelism, and show our discovered clock frequencies translate well for both. We conclude that kernel-level DVFS is a suitable technique to reduce waste in LLM operations, providing significant energy savings with negligible slow-down.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08547",
        "abs_url": "https://arxiv.org/abs/2601.08547",
        "pdf_url": "https://arxiv.org/pdf/2601.08547",
        "title": "Convergence of gradient flow for learning convolutional neural networks",
        "authors": [
            "Jona-Maria Diederen",
            "Holger Rauhut",
            "Ulrich Terstiege"
        ],
        "comments": "17 pages",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "Convolutional neural networks are widely used in imaging and image recognition. Learning such networks from training data leads to the minimization of a non-convex function. This makes the analysis of standard optimization methods such as variants of (stochastic) gradient descent challenging. In this article we study the simplified setting of linear convolutional networks. We show that the gradient flow (to be interpreted as an abstraction of gradient descent) applied to the empirical risk defined via certain loss functions including the square loss always converges to a critical point, under a mild condition on the training data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08588",
        "abs_url": "https://arxiv.org/abs/2601.08588",
        "pdf_url": "https://arxiv.org/pdf/2601.08588",
        "title": "Sample Complexity of Composite Quantum Hypothesis Testing",
        "authors": [
            "Jacob Paul Simpson",
            "Efstratios Palias",
            "Sharu Theresa Jose"
        ],
        "comments": "Under review",
        "subjects": "Quantum Physics (quant-ph); Information Theory (cs.IT); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "This paper investigates symmetric composite binary quantum hypothesis testing (QHT), where the goal is to determine which of two uncertainty sets contains an unknown quantum state. While asymptotic error exponents for this problem are well-studied, the finite-sample regime remains poorly understood. We bridge this gap by characterizing the sample complexity -- the minimum number of state copies required to achieve a target error level. Specifically, we derive lower bounds that generalize the sample complexity of simple QHT and introduce new upper bounds for various uncertainty sets, including of both finite and infinite cardinalities. Notably, our upper and lower bounds match up to universal constants, providing a tight characterization of the sample complexity. Finally, we extend our analysis to the differentially private setting, establishing the sample complexity for privacy-preserving composite QHT.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08614",
        "abs_url": "https://arxiv.org/abs/2601.08614",
        "pdf_url": "https://arxiv.org/pdf/2601.08614",
        "title": "Accelerated Methods with Complexity Separation Under Data Similarity for Federated Learning Problems",
        "authors": [
            "Dmitry Bylinkin",
            "Sergey Skorik",
            "Dmitriy Bystrov",
            "Leonid Berezin",
            "Aram Avetisyan",
            "Aleksandr Beznosikov"
        ],
        "comments": "30 pages, 4 theorems, 2 figures",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "Heterogeneity within data distribution poses a challenge in many modern federated learning tasks. We formalize it as an optimization problem involving a computationally heavy composite under data similarity. By employing different sets of assumptions, we present several approaches to develop communication-efficient methods. An optimal algorithm is proposed for the convex case. The constructed theory is validated through a series of experiments across various problems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08618",
        "abs_url": "https://arxiv.org/abs/2601.08618",
        "pdf_url": "https://arxiv.org/pdf/2601.08618",
        "title": "Robust low-rank estimation with multiple binary responses using pairwise AUC loss",
        "authors": [
            "Tien Mai"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "Multiple binary responses arise in many modern data-analytic problems. Although fitting separate logistic regressions for each response is computationally attractive, it ignores shared structure and can be statistically inefficient, especially in high-dimensional and class-imbalanced regimes. Low-rank models offer a natural way to encode latent dependence across tasks, but existing methods for binary data are largely likelihood-based and focus on pointwise classification rather than ranking performance. In this work, we propose a unified framework for learning with multiple binary responses that directly targets discrimination by minimizing a surrogate loss for the area under the ROC curve (AUC). The method aggregates pairwise AUC surrogate losses across responses while imposing a low-rank constraint on the coefficient matrix to exploit shared structure. We develop a scalable projected gradient descent algorithm based on truncated singular value decomposition. Exploiting the fact that the pairwise loss depends only on differences of linear predictors, we simplify computation and analysis. We establish non-asymptotic convergence guarantees, showing that under suitable regularity conditions, leading to linear convergence up to the minimax-optimal statistical precision. Extensive simulation studies demonstrate that the proposed method is robust in challenging settings such as label switching and data contamination and consistently outperforms likelihood-based approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08648",
        "abs_url": "https://arxiv.org/abs/2601.08648",
        "pdf_url": "https://arxiv.org/pdf/2601.08648",
        "title": "Safe Language Generation in the Limit",
        "authors": [
            "Antonios Anastasopoulos",
            "Giuseppe Ateniese",
            "Evgenios M. Kornaropoulos"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Recent results in learning a language in the limit have shown that, although language identification is impossible, language generation is tractable. As this foundational area expands, we need to consider the implications of language generation in real-world settings. This work offers the first theoretical treatment of safe language generation. Building on the computational paradigm of learning in the limit, we formalize the tasks of safe language identification and generation. We prove that under this model, safe language identification is impossible, and that safe language generation is at least as hard as (vanilla) language identification, which is also impossible. Last, we discuss several intractable and tractable cases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08674",
        "abs_url": "https://arxiv.org/abs/2601.08674",
        "pdf_url": "https://arxiv.org/pdf/2601.08674",
        "title": "Além do Desempenho: Um Estudo da Confiabilidade de Detectores de Deepfakes",
        "authors": [
            "Lucas Lopes",
            "Rayson Laroca",
            "André Grégio"
        ],
        "comments": "Accepted for presentation at the Brazilian Symposium on Cybersecurity (SBSeg) 2025, in Portuguese language",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Deepfakes are synthetic media generated by artificial intelligence, with positive applications in education and creativity, but also serious negative impacts such as fraud, misinformation, and privacy violations. Although detection techniques have advanced, comprehensive evaluation methods that go beyond classification performance remain lacking. This paper proposes a reliability assessment framework based on four pillars: transferability, robustness, interpretability, and computational efficiency. An analysis of five state-of-the-art methods revealed significant progress as well as critical limitations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08696",
        "abs_url": "https://arxiv.org/abs/2601.08696",
        "pdf_url": "https://arxiv.org/pdf/2601.08696",
        "title": "Enabling Population-Based Architectures for Neural Combinatorial Optimization",
        "authors": [
            "Andoni Irazusta Garmendia",
            "Josu Ceberio",
            "Alexander Mendiburu"
        ],
        "comments": "",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Machine Learning (cs.LG)",
        "abstract": "Neural Combinatorial Optimization (NCO) has mostly focused on learning policies, typically neural networks, that operate on a single candidate solution at a time, either by constructing one from scratch or iteratively improving it. In contrast, decades of work in metaheuristics have shown that maintaining and evolving populations of solutions improves robustness and exploration, and often leads to stronger performance. To close this gap, we study how to make NCO explicitly population-based by learning policies that act on sets of candidate solutions. We first propose a simple taxonomy of population awareness levels and use it to highlight two key design challenges: (i) how to represent a whole population inside a neural network, and (ii) how to learn population dynamics that balance intensification (generating good solutions) and diversification (maintaining variety). We make these ideas concrete with two complementary tools: one that improves existing solutions using information shared across the whole population, and the other generates new candidate solutions that explicitly balance being high-quality with diversity. Experimental results on Maximum Cut and Maximum Independent Set indicate that incorporating population structure is advantageous for learned optimization methods and opens new connections between NCO and classical population-based search.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08705",
        "abs_url": "https://arxiv.org/abs/2601.08705",
        "pdf_url": "https://arxiv.org/pdf/2601.08705",
        "title": "RMBRec: Robust Multi-Behavior Recommendation towards Target Behaviors",
        "authors": [
            "Miaomiao Cai",
            "Zhijie Zhang",
            "Junfeng Fang",
            "Zhiyong Cheng",
            "Xiang Wang",
            "Meng Wang"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Multi-behavior recommendation faces a critical challenge in practice: auxiliary behaviors (e.g., clicks, carts) are often noisy, weakly correlated, or semantically misaligned with the target behavior (e.g., purchase), which leads to biased preference learning and suboptimal performance. While existing methods attempt to fuse these heterogeneous signals, they inherently lack a principled mechanism to ensure robustness against such behavioral inconsistency. In this work, we propose Robust Multi-Behavior Recommendation towards Target Behaviors (RMBRec), a robust multi-behavior recommendation framework grounded in an information-theoretic robustness principle. We interpret robustness as a joint process of maximizing predictive information while minimizing its variance across heterogeneous behavioral environments. Under this perspective, the Representation Robustness Module (RRM) enhances local semantic consistency by maximizing the mutual information between users' auxiliary and target representations, whereas the Optimization Robustness Module (ORM) enforces global stability by minimizing the variance of predictive risks across behaviors, which is an efficient approximation to invariant risk minimization. This local-global collaboration bridges representation purification and optimization invariance in a theoretically coherent way. Extensive experiments on three real-world datasets demonstrate that RMBRec not only outperforms state-of-the-art methods in accuracy but also maintains remarkable stability under various noise perturbations. For reproducibility, our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08709",
        "abs_url": "https://arxiv.org/abs/2601.08709",
        "pdf_url": "https://arxiv.org/pdf/2601.08709",
        "title": "Multi-Preconditioned LBFGS for Training Finite-Basis PINNs",
        "authors": [
            "Marc Salvadó-Benasco",
            "Aymane Kssim",
            "Alexander Heinlein",
            "Rolf Krause",
            "Serge Gratton",
            "Alena Kopaničáková"
        ],
        "comments": "13 pages",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "A multi-preconditioned LBFGS (MP-LBFGS) algorithm is introduced for training finite-basis physics-informed neural networks (FBPINNs). The algorithm is motivated by the nonlinear additive Schwarz method and exploits the domain-decomposition-inspired additive architecture of FBPINNs, in which local neural networks are defined on subdomains, thereby localizing the network representation. Parallel, subdomain-local quasi-Newton corrections are then constructed on the corresponding local parts of the architecture. A key feature is a novel nonlinear multi-preconditioning mechanism, in which subdomain corrections are optimally combined through the solution of a low-dimensional subspace minimization problem. Numerical experiments indicate that MP-LBFGS can improve convergence speed, as well as model accuracy over standard LBFGS while incurring lower communication overhead.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08724",
        "abs_url": "https://arxiv.org/abs/2601.08724",
        "pdf_url": "https://arxiv.org/pdf/2601.08724",
        "title": "Kernel Learning for Regression via Quantum Annealing Based Spectral Sampling",
        "authors": [
            "Yasushi Hasegawa",
            "Masayuki Ohzeki"
        ],
        "comments": "15pages, 5 figures, 4 tables",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "While quantum annealing (QA) has been developed for combinatorial optimization, practical QA devices operate at finite temperature and under noise, and their outputs can be regarded as stochastic samples close to a Gibbs--Boltzmann distribution. In this study, we propose a QA-in-the-loop kernel learning framework that integrates QA not merely as a substitute for Markov-chain Monte Carlo sampling but as a component that directly determines the learned kernel for regression. Based on Bochner's theorem, a shift-invariant kernel is represented as an expectation over a spectral distribution, and random Fourier features (RFF) approximate the kernel by sampling frequencies. We model the spectral distribution with a (multi-layer) restricted Boltzmann machine (RBM), generate discrete RBM samples using QA, and map them to continuous frequencies via a Gaussian--Bernoulli transformation. Using the resulting RFF, we construct a data-adaptive kernel and perform Nadaraya--Watson (NW) regression. Because the RFF approximation based on $\\cos(\\bm{\\omega}^{\\top}\\Delta\\bm{x})$ can yield small negative values and cancellation across neighbors, the Nadaraya--Watson denominator $\\sum_j k_{ij}$ may become close to zero. We therefore employ nonnegative squared-kernel weights $w_{ij}=k(\\bm{x}_i,\\bm{x}_j)^2$, which also enhances the contrast of kernel weights. The kernel parameters are trained by minimizing the leave-one-out NW mean squared error, and we additionally evaluate local linear regression with the same squared-kernel weights at inference. Experiments on multiple benchmark regression datasets demonstrate a decrease in training loss, accompanied by structural changes in the kernel matrix, and show that the learned kernel tends to improve $R^2$ and RMSE over the baseline Gaussian-kernel NW. Increasing the number of random features at inference further enhances accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08784",
        "abs_url": "https://arxiv.org/abs/2601.08784",
        "pdf_url": "https://arxiv.org/pdf/2601.08784",
        "title": "On the use of graph models to achieve individual and group fairness",
        "authors": [
            "Arturo Pérez-Peralta",
            "Sandra Benítez-Peña",
            "Rosa E. Lillo"
        ],
        "comments": "75 pages, 46 figures",
        "subjects": "Machine Learning (stat.ML); Computers and Society (cs.CY); Machine Learning (cs.LG)",
        "abstract": "Machine Learning algorithms are ubiquitous in key decision-making contexts such as justice, healthcare and finance, which has spawned a great demand for fairness in these procedures. However, the theoretical properties of such models in relation with fairness are still poorly understood, and the intuition behind the relationship between group and individual fairness is still lacking. In this paper, we provide a theoretical framework based on Sheaf Diffusion to leverage tools based on dynamical systems and homology to model fairness. Concretely, the proposed method projects input data into a bias-free space that encodes fairness constrains, resulting in fair solutions. Furthermore, we present a collection of network topologies handling different fairness metrics, leading to a unified method capable of dealing with both individual and group bias. The resulting models have a layer of interpretability in the form of closed-form expressions for their SHAP values, consolidating their place in the responsible Artificial Intelligence landscape. Finally, these intuitions are tested on a simulation study and standard fairness benchmarks, where the proposed methods achieve satisfactory results. More concretely, the paper showcases the performance of the proposed models in terms of accuracy and fairness, studying available trade-offs on the Pareto frontier, checking the effects of changing the different hyper-parameters, and delving into the interpretation of its outputs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2026-01-14",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-14?abs=True",
        "arxiv_id": "2601.08808",
        "abs_url": "https://arxiv.org/abs/2601.08808",
        "pdf_url": "https://arxiv.org/pdf/2601.08808",
        "title": "Multiplex Thinking: Reasoning via Token-wise Branch-and-Merge",
        "authors": [
            "Yao Tang",
            "Li Dong",
            "Yaru Hao",
            "Qingxiu Dong",
            "Furu Wei",
            "Jiatao Gu"
        ],
        "comments": "21 pages. Code available at this https URL",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large language models often solve complex reasoning tasks more effectively with Chain-of-Thought (CoT), but at the cost of long, low-bandwidth token sequences. Humans, by contrast, often reason softly by maintaining a distribution over plausible next steps. Motivated by this, we propose Multiplex Thinking, a stochastic soft reasoning mechanism that, at each thinking step, samples K candidate tokens and aggregates their embeddings into a single continuous multiplex token. This preserves the vocabulary embedding prior and the sampling dynamics of standard discrete generation, while inducing a tractable probability distribution over multiplex rollouts. Consequently, multiplex trajectories can be directly optimized with on-policy reinforcement learning (RL). Importantly, Multiplex Thinking is self-adaptive: when the model is confident, the multiplex token is nearly discrete and behaves like standard CoT; when it is uncertain, it compactly represents multiple plausible next steps without increasing sequence length. Across challenging math reasoning benchmarks, Multiplex Thinking consistently outperforms strong discrete CoT and RL baselines from Pass@1 through Pass@1024, while producing shorter sequences. The code and checkpoints are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]