[
    {
        "order": 1,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14266",
        "abs_url": "https://arxiv.org/abs/2601.14266",
        "pdf_url": "https://arxiv.org/pdf/2601.14266",
        "title": "GCG Attack On A Diffusion LLM",
        "authors": [
            "Ruben Neyroud",
            "Sam Corley"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL); Cryptography and Security (cs.CR)",
        "abstract": "While most LLMs are autoregressive, diffusion-based LLMs have recently emerged as an alternative method for generation. Greedy Coordinate Gradient (GCG) attacks have proven effective against autoregressive models, but their applicability to diffusion language models remains largely unexplored. In this work, we present an exploratory study of GCG-style adversarial prompt attacks on LLaDA (Large Language Diffusion with mAsking), an open-source diffusion LLM. We evaluate multiple attack variants, including prefix perturbations and suffix-based adversarial generation, on harmful prompts drawn from the AdvBench dataset. Our study provides initial insights into the robustness and attack surface of diffusion language models and motivates the development of alternative optimization and evaluation strategies for adversarial analysis in this setting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14275",
        "abs_url": "https://arxiv.org/abs/2601.14275",
        "pdf_url": "https://arxiv.org/pdf/2601.14275",
        "title": "Quality or Quantity? Error-Informed Selective Online Learning with Gaussian Processes in Multi-Agent Systems: Extended Version",
        "authors": [
            "Zewen Yang",
            "Xiaobing Dai",
            "Jiajun Cheng",
            "Yulong Huang",
            "Peng Shi"
        ],
        "comments": "Accepted by IEEE/CAA Journal of Automatica Sinica",
        "subjects": "Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Effective cooperation is pivotal in distributed learning for multi-agent systems, where the interplay between the quantity and quality of the machine learning models is crucial. This paper reveals the irrationality of indiscriminate inclusion of all models on agents for joint prediction, highlighting the imperative to prioritize quality over quantity in cooperative learning. Specifically, we present the first selective online learning framework for distributed Gaussian process (GP) regression, namely distributed error-informed GP (EIGP), that enables each agent to assess its neighboring collaborators, using the proposed selection function to choose the higher quality GP models with less prediction errors. Moreover, algorithmic enhancements are embedded within the EIGP, including a greedy algorithm (gEIGP) for accelerating prediction and an adaptive algorithm (aEIGP) for improving prediction accuracy. In addition, approaches for fast prediction and model update are introduced in conjunction with the error-informed quantification term iteration and a data deletion strategy to achieve real-time learning operations. Numerical simulations are performed to demonstrate the effectiveness of the developed methodology, showcasing its superiority over the state-of-the-art distributed GP methods with different benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14277",
        "abs_url": "https://arxiv.org/abs/2601.14277",
        "pdf_url": "https://arxiv.org/pdf/2601.14277",
        "title": "Which Quantization Should I Use? A Unified Evaluation of llama.cpp Quantization on Llama-3.1-8B-Instruct",
        "authors": [
            "Uygar Kurt"
        ],
        "comments": "17 pages, 6 tables, 1 figure",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Quantization is a practical technique for making large language models easier to deploy by reducing the precision used to store and operate on model weights. This can lower memory use and improve runtime feasibility on constrained hardware, which is especially relevant for users running models locally. Quantization in this http URL enables large language models to run on commodity hardware, but available formats are often evaluated inconsistently, making it hard to choose among schemes. We present a unified empirical study of the this http URL quantization on a single modern model, Llama-3.1-8B-Instruct (FP16, GGUF), covering 3-8 bit K-quant and legacy formats. We evaluate downstream task performance across standard reasoning, knowledge, instruction-following, and truthfulness benchmarks, and also measure perplexity and CPU throughput (prefill/decoding) alongside model size, compression, and quantization time. Ultimately, this work is a practical guide for choosing a this http URL quantization scheme, helping readers make informed, context-aware decisions for their intended use and resource budget.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14283",
        "abs_url": "https://arxiv.org/abs/2601.14283",
        "pdf_url": "https://arxiv.org/pdf/2601.14283",
        "title": "Beyond Affinity: A Benchmark of 1D, 2D, and 3D Methods Reveals Critical Trade-offs in Structure-Based Drug Design",
        "authors": [
            "Kangyu Zheng",
            "Kai Zhang",
            "Jiale Tan",
            "Xuehan Chen",
            "Yingzhou Lu",
            "Zaixi Zhang",
            "Lichao Sun",
            "Marinka Zitnik",
            "Tianfan Fu",
            "Zhiding Liang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Currently, the field of structure-based drug design is dominated by three main types of algorithms: search-based algorithms, deep generative models, and reinforcement learning. While existing works have typically focused on comparing models within a single algorithmic category, cross-algorithm comparisons remain scarce. In this paper, to fill the gap, we establish a benchmark to evaluate the performance of fifteen models across these different algorithmic foundations by assessing the pharmaceutical properties of the generated molecules and their docking affinities and poses with specified target proteins. We highlight the unique advantages of each algorithmic approach and offer recommendations for the design of future SBDD models. We emphasize that 1D/2D ligand-centric drug design methods can be used in SBDD by treating the docking function as a black-box oracle, which is typically neglected. Our evaluation reveals distinct patterns across model categories. 3D structure-based models excel in binding affinities but show inconsistencies in chemical validity and pose quality. 1D models demonstrate reliable performance in standard molecular metrics but rarely achieve optimal binding affinities. 2D models offer balanced performance, maintaining high chemical validity while achieving moderate binding scores. Through detailed analysis across multiple protein targets, we identify key improvement areas for each model category, providing insights for researchers to combine strengths of different approaches while addressing their limitations. All the code that are used for benchmarking is available in this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14285",
        "abs_url": "https://arxiv.org/abs/2601.14285",
        "pdf_url": "https://arxiv.org/pdf/2601.14285",
        "title": "A Comparison of Polynomial-Based Tree Clustering Methods",
        "authors": [
            "Pengyu Liu",
            "Mariel Vázquez",
            "Nataša Jonoska"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Tree structures appear in many fields of the life sciences, including phylogenetics, developmental biology and nucleic acid structures. Trees can be used to represent RNA secondary structures, which directly relate to the function of non-coding RNAs. Recent developments in sequencing technology and artificial intelligence have yielded numerous biological data that can be represented with tree structures. This requires novel methods for tree structure data analytics. Tree polynomials provide a computationally efficient, interpretable and comprehensive way to encode tree structures as matrices, which are compatible with most data analytics tools. Machine learning methods based on the Canberra distance between tree polynomials have been introduced to analyze phylogenies and nucleic acid structures. In this paper, we compare the performance of different distances in tree clustering methods based on a tree distinguishing polynomial. We also implement two basic autoencoder models for clustering trees using the polynomial. We find that the distance based methods with entry-level normalized distances have the highest clustering accuracy among the compared methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14287",
        "abs_url": "https://arxiv.org/abs/2601.14287",
        "pdf_url": "https://arxiv.org/pdf/2601.14287",
        "title": "Chain-of-Memory: Lightweight Memory Construction with Dynamic Evolution for LLM Agents",
        "authors": [
            "Xiucheng Xu",
            "Bingbing Xu",
            "Xueyun Tian",
            "Zihe Huang",
            "Rongxin Chen",
            "Yunfan Li",
            "Huawei Shen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "External memory systems are pivotal for enabling Large Language Model (LLM) agents to maintain persistent knowledge and perform long-horizon decision-making. Existing paradigms typically follow a two-stage process: computationally expensive memory construction (e.g., structuring data into graphs) followed by naive retrieval-augmented generation. However, our empirical analysis reveals two fundamental limitations: complex construction incurs high costs with marginal performance gains, and simple context concatenation fails to bridge the gap between retrieval recall and reasoning accuracy. To address these challenges, we propose CoM (Chain-of-Memory), a novel framework that advocates for a paradigm shift toward lightweight construction paired with sophisticated utilization. CoM introduces a Chain-of-Memory mechanism that organizes retrieved fragments into coherent inference paths through dynamic evolution, utilizing adaptive truncation to prune irrelevant noise. Extensive experiments on the LongMemEval and LoCoMo benchmarks demonstrate that CoM outperforms strong baselines with accuracy gains of 7.5%-10.4%, while drastically reducing computational overhead to approximately 2.7% of token consumption and 6.0% of latency compared to complex memory architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14300",
        "abs_url": "https://arxiv.org/abs/2601.14300",
        "pdf_url": "https://arxiv.org/pdf/2601.14300",
        "title": "Gradient Structure Estimation under Label-Only Oracles via Spectral Sensitivity",
        "authors": [
            "Jun Liu",
            "Leo Yu Zhang",
            "Fengpeng Li",
            "Isao Echizen",
            "Jiantao Zhou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Hard-label black-box settings, where only top-1 predicted labels are observable, pose a fundamentally constrained yet practically important feedback model for understanding model behavior. A central challenge in this regime is whether meaningful gradient information can be recovered from such discrete responses. In this work, we develop a unified theoretical perspective showing that a wide range of existing sign-flipping hard-label attacks can be interpreted as implicitly approximating the sign of the true loss gradient. This observation reframes hard-label attacks from heuristic search procedures into instances of gradient sign recovery under extremely limited feedback. Motivated by this first-principles understanding, we propose a new attack framework that combines a zero-query frequency-domain initialization with a Pattern-Driven Optimization (PDO) strategy. We establish theoretical guarantees demonstrating that, under mild assumptions, our initialization achieves higher expected cosine similarity to the true gradient sign compared to random baselines, while the proposed PDO procedure attains substantially lower query complexity than existing structured search approaches. We empirically validate our framework through extensive experiments on CIFAR-10, ImageNet, and ObjectNet, covering standard and adversarially trained models, commercial APIs, and CLIP-based models. The results show that our method consistently surpasses SOTA hard-label attacks in both attack success rate and query efficiency, particularly in low-query regimes. Beyond image classification, our approach generalizes effectively to corrupted data, biomedical datasets, and dense prediction tasks. Notably, it also successfully circumvents Blacklight, a SOTA stateful defense, resulting in a $0\\%$ detection rate. Our code will be released publicly soon at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14333",
        "abs_url": "https://arxiv.org/abs/2601.14333",
        "pdf_url": "https://arxiv.org/pdf/2601.14333",
        "title": "Hierarchical Contextual Uplift Bandits for Catalog Personalization",
        "authors": [
            "Anupam Agrawal",
            "Rajesh Mohanty",
            "Shamik Bhattacharjee",
            "Abhimanyu Mittal"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Contextual Bandit (CB) algorithms are widely adopted for personalized recommendations but often struggle in dynamic environments typical of fantasy sports, where rapid changes in user behavior and dramatic shifts in reward distributions due to external influences necessitate frequent retraining. To address these challenges, we propose a Hierarchical Contextual Uplift Bandit framework. Our framework dynamically adjusts contextual granularity from broad, system-wide insights to detailed, user-specific contexts, using contextual similarity to facilitate effective policy transfer and mitigate cold-start issues. Additionally, we integrate uplift modeling principles into our approach. Results from large-scale A/B testing on the Dream11 fantasy sports platform show that our method significantly enhances recommendation quality, achieving a 0.4% revenue improvement while also improving user satisfaction metrics compared to the current production system. We subsequently deployed this system to production as the default catalog personalization system in May 2025 and observed a further 0.5% revenue improvement.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14336",
        "abs_url": "https://arxiv.org/abs/2601.14336",
        "pdf_url": "https://arxiv.org/pdf/2601.14336",
        "title": "Log anomaly detection via Meta Learning and Prototypical Networks for Cross domain generalization",
        "authors": [
            "Krishna Sharma",
            "Vivek Yelleti"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Log anomaly detection is essential for system reliability, but it is extremely challenging to do considering it involves class imbalance. Additionally, the models trained in one domain are not applicable to other domains, necessitating the need for cross-domain adaptation (such as HDFS and Linux). Traditional detection models often fail to generalize due to significant data drift and the inherent absence of labeled anomalies in new target domains. To handle the above challenges, we proposed a new end-to-end framework based on a meta-learning approach. Our methodology first gets the data ready by combining a Drain3 log parsing mechanism with a dynamic drift-based labeling technique that uses semantic and fuzzy matching to move existing anomaly knowledge from one source to another. BERT-based semantic embeddings are obtained, and the feature selection is invoked to reduce the dimensionality. Later, Model Agnostic Meta-Learning (MAML) and Prototypical Networks models are trained to adapt quickly and effectively. The SMOTE oversampling method is employed to handle imbalances in the data. All the results are obtained by employing the leave-one-out source method, and the corresponding mean F1 scores are reported. Our empirical findings validate that the proposed meta-learning-driven approach yielded the highest mean F1 score and proved to be effective for cross-domain settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14354",
        "abs_url": "https://arxiv.org/abs/2601.14354",
        "pdf_url": "https://arxiv.org/pdf/2601.14354",
        "title": "VJEPA: Variational Joint Embedding Predictive Architectures as Probabilistic World Models",
        "authors": [
            "Yongchao Huang"
        ],
        "comments": "77 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Joint Embedding Predictive Architectures (JEPA) offer a scalable paradigm for self-supervised learning by predicting latent representations rather than reconstructing high-entropy observations. However, existing formulations rely on \\textit{deterministic} regression objectives, which mask probabilistic semantics and limit its applicability in stochastic control. In this work, we introduce \\emph{Variational JEPA (VJEPA)}, a \\textit{probabilistic} generalization that learns a predictive distribution over future latent states via a variational objective. We show that VJEPA unifies representation learning with Predictive State Representations (PSRs) and Bayesian filtering, establishing that sequential modeling does not require autoregressive observation likelihoods. Theoretically, we prove that VJEPA representations can serve as sufficient information states for optimal control without pixel reconstruction, while providing formal guarantees for collapse avoidance. We further propose \\emph{Bayesian JEPA (BJEPA)}, an extension that factorizes the predictive belief into a learned dynamics expert and a modular prior expert, enabling zero-shot task transfer and constraint (e.g. goal, physics) satisfaction via a Product of Experts. Empirically, through a noisy environment experiment, we demonstrate that VJEPA and BJEPA successfully filter out high-variance nuisance distractors that cause representation collapse in generative baselines. By enabling principled uncertainty estimation (e.g. constructing credible intervals via sampling) while remaining likelihood-free regarding observations, VJEPA provides a foundational framework for scalable, robust, uncertainty-aware planning in high-dimensional, noisy environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14473",
        "abs_url": "https://arxiv.org/abs/2601.14473",
        "pdf_url": "https://arxiv.org/pdf/2601.14473",
        "title": "Adaptive KDE for Real-Time Thresholding: Prioritized Queues for Financial Crime Investigation",
        "authors": [
            "Danny Butvinik",
            "Nana Boateng",
            "Achi Hackmon"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study the problem of converting a stream of risk scores into one or more review queues under explicit intake constraints[cite: 6]. Instead of top-$K$ or manually tuned cutoffs, we fit an online adaptive kernel density to the score stream, transform the density into a tail-mass curve to meet capacity, and ``snap'' the resulting cut to a persistent density valley detected across bandwidths[cite: 7]. The procedure is label-free, supports multi-queue routing, and operates in real time with sliding windows or exponential forgetting[cite: 8]. On synthetic, drifting, multimodal streams, the method achieves competitive capacity adherence while reducing threshold jitter[cite: 9]. Updates cost $O(G)$ per event with constant memory per activity",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14476",
        "abs_url": "https://arxiv.org/abs/2601.14476",
        "pdf_url": "https://arxiv.org/pdf/2601.14476",
        "title": "GPU-accelerated simulated annealing based on p-bits with real-world device-variability modeling",
        "authors": [
            "Naoya Onizawa",
            "Takahiro Hanyu"
        ],
        "comments": "14 pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Probabilistic computing using probabilistic bits (p-bits) presents an efficient alternative to traditional CMOS logic for complex problem-solving, including simulated annealing and machine learning. Realizing p-bits with emerging devices such as magnetic tunnel junctions (MTJs) introduces device variability, which was expected to negatively impact computational performance. However, this study reveals an unexpected finding: device variability can not only degrade but also enhance algorithm performance, particularly by leveraging timing variability. This paper introduces a GPU-accelerated, open-source simulated annealing framework based on p-bits that models key device variability factors -timing, intensity, and offset- to reflect real-world device behavior. Through CUDA-based simulations, our approach achieves a two-order magnitude speedup over CPU implementations on the MAX-CUT benchmark with problem sizes ranging from 800 to 20,000 nodes. By providing a scalable and accessible tool, this framework aims to advance research in probabilistic computing, enabling optimization applications in diverse fields.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14487",
        "abs_url": "https://arxiv.org/abs/2601.14487",
        "pdf_url": "https://arxiv.org/pdf/2601.14487",
        "title": "Stabilizing autoregressive forecasts in chaotic systems via multi-rate latent recurrence",
        "authors": [
            "Mrigank Dhingra",
            "Omer San"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Long-horizon autoregressive forecasting of chaotic dynamical systems remains challenging due to rapid error amplification and distribution shift: small one-step inaccuracies compound into physically inconsistent rollouts and collapse of large-scale statistics. We introduce MSR-HINE, a hierarchical implicit forecaster that augments multiscale latent priors with multi-rate recurrent modules operating at distinct temporal scales. At each step, coarse-to-fine recurrent states generate latent priors, an implicit one-step predictor refines the state with multiscale latent injections, and a gated fusion with posterior latents enforces scale-consistent updates; a lightweight hidden-state correction further aligns recurrent memories with fused latents. The resulting architecture maintains long-term context on slow manifolds while preserving fast-scale variability, mitigating error accumulation in chaotic rollouts. Across two canonical benchmarks, MSR-HINE yields substantial gains over a U-Net autoregressive baseline: on Kuramoto-Sivashinsky it reduces end-horizon RMSE by 62.8% at H=400 and improves end-horizon ACC by +0.983 (from -0.155 to 0.828), extending the ACC >= 0.5 predictability horizon from 241 to 400 steps; on Lorenz-96 it reduces RMSE by 27.0% at H=100 and improves end horizon ACC by +0.402 (from 0.144 to 0.545), extending the ACC >= 0.5 horizon from 58 to 100 steps.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14517",
        "abs_url": "https://arxiv.org/abs/2601.14517",
        "pdf_url": "https://arxiv.org/pdf/2601.14517",
        "title": "Learning PDE Solvers with Physics and Data: A Unifying View of Physics-Informed Neural Networks and Neural Operators",
        "authors": [
            "Yilong Dai",
            "Shengyu Chen",
            "Ziyi Wang",
            "Xiaowei Jia",
            "Yiqun Xie",
            "Vipin Kumar",
            "Runlong Yu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Analysis of PDEs (math.AP)",
        "abstract": "Partial differential equations (PDEs) are central to scientific modeling. Modern workflows increasingly rely on learning-based components to support model reuse, inference, and integration across large computational processes. Despite the emergence of various physics-aware data-driven approaches, the field still lacks a unified perspective to uncover their relationships, limitations, and appropriate roles in scientific workflows. To this end, we propose a unifying perspective to place two dominant paradigms: Physics-Informed Neural Networks (PINNs) and Neural Operators (NOs), within a shared design space. We organize existing methods from three fundamental dimensions: what is learned, how physical structures are integrated into the learning process, and how the computational load is amortized across problem instances. In this way, many challenges can be best understood as consequences of these structural properties of learning PDEs. By analyzing advances through this unifying view, our survey aims to facilitate the development of reliable learning-based PDE solvers and catalyze a synthesis of physics and data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14522",
        "abs_url": "https://arxiv.org/abs/2601.14522",
        "pdf_url": "https://arxiv.org/pdf/2601.14522",
        "title": "On the Runway Cascade of Transformers for Language Modeling",
        "authors": [
            "Hunjae Lee",
            "Corey Clark"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In decoder-only (causal) transformers, the computation graph created by causal masking routes information through both direct-path attention and indirect paths formed by intermediate tokens. We denote these indirect paths between token pairs as their runways. We argue that certain failure modes of causal transformers as observed by a growing body of recent works are likely exacerbated by a misalignment between these two information propagation modes. We formalize runway cascade as a phenomenon whereby this misalignment results in redundancies and irrelevant information cascading to token representations despite adequately learned attention patterns. As a solution, we propose runway-aware rewiring as a more explicit way of incorporating runway context directly into each token's direct-path attention. This mechanism re-wires the attention pattern for each token based on a summary of its runway landscape, enabling awareness of accumulating representational influences and allowing for more balanced information propagation. Our proposed methodology introduces no additional parameters and can seamlessly be integrated into standard attention mechanism. Empirically, our rewired transformer results in steady improvements in general language modeling as well as noticeably stronger information retrieval and extrapolation abilities compared to standard transformers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14532",
        "abs_url": "https://arxiv.org/abs/2601.14532",
        "pdf_url": "https://arxiv.org/pdf/2601.14532",
        "title": "Search over Self-Edit Strategies for LLM Adaptation",
        "authors": [
            "Alistair Cheong",
            "Haolin Cong",
            "Tyler Yang",
            "Dustin Miao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Many LLM-based open-ended search systems freeze the foundation model that proposes improvements to existing solutions, which may bottleneck long-run progress. Recent work has explored updating the proposal model at test time [arXiv:2511.23473], but the update strategy is still typically hand-specified. Therefore, this study investigated whether an LLM can use task feedback to decide how it should update its weights. For tractability, we focused on the simpler case where there is only one round of self-improvement, and restricted the update operator to self-supervised next token prediction (NTP), leaving the model freedom in choosing its training data and key NTP hyperparameters. Using the Self-Adapting Language Models (SEAL) [arXiv:2506.10943] framework as a testbed, we relaxed its fixed human template constraint and allowed the model to generate its own self-edit templates, thereby giving it more control over its training data and hyperparameters. Two variants were studied, differing in whether template generation was conditioned on a lightweight archive of past templates. In SEAL's Single-Passage Knowledge Incorporation setting with Qwen3-8B on SQuAD [arXiv:1606.05250], the no-archive variant performed comparably to the weaker \"Implications\" baseline, while the archive variant outperformed \"Implications\" and approached the strongest human-designed \"Rewrite\" baseline without surpassing it. Further analysis of collapse in the model's exploration revealed that a naive archive can confer some short-term robustness but can also accelerate homogenization, suggesting that explicit novelty pressure may be required to consistently advance beyond carefully optimized human strategies. Our code is available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14536",
        "abs_url": "https://arxiv.org/abs/2601.14536",
        "pdf_url": "https://arxiv.org/pdf/2601.14536",
        "title": "engGNN: A Dual-Graph Neural Network for Omics-Based Disease Classification and Feature Selection",
        "authors": [
            "Tiantian Yang",
            "Yuxuan Wang",
            "Zhenwei Zhou",
            "Ching-Ti Liu"
        ],
        "comments": "21 pages, 14 figures, 5 tables",
        "subjects": "Machine Learning (cs.LG); Genomics (q-bio.GN); Machine Learning (stat.ML)",
        "abstract": "Omics data, such as transcriptomics, proteomics, and metabolomics, provide critical insights into disease mechanisms and clinical outcomes. However, their high dimensionality, small sample sizes, and intricate biological networks pose major challenges for reliable prediction and meaningful interpretation. Graph Neural Networks (GNNs) offer a promising way to integrate prior knowledge by encoding feature relationships as graphs. Yet, existing methods typically rely solely on either an externally curated feature graph or a data-driven generated one, which limits their ability to capture complementary information. To address this, we propose the external and generated Graph Neural Network (engGNN), a dual-graph framework that jointly leverages both external known biological networks and data-driven generated graphs. Specifically, engGNN constructs a biologically informed undirected feature graph from established network databases and complements it with a directed feature graph derived from tree-ensemble models. This dual-graph design produces more comprehensive embeddings, thereby improving predictive performance and interpretability. Through extensive simulations and real-world applications to gene expression data, engGNN consistently outperforms state-of-the-art baselines. Beyond classification, engGNN provides interpretable feature importance scores that facilitate biologically meaningful discoveries, such as pathway enrichment analysis. Taken together, these results highlight engGNN as a robust, flexible, and interpretable framework for disease classification and biomarker discovery in high-dimensional omics contexts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14549",
        "abs_url": "https://arxiv.org/abs/2601.14549",
        "pdf_url": "https://arxiv.org/pdf/2601.14549",
        "title": "QMC: Efficient SLM Edge Inference via Outlier-Aware Quantization and Emergent Memories Co-Design",
        "authors": [
            "Nilesh Prasad Pandey",
            "Jangseon Park",
            "Onat Gungor",
            "Flavio Ponzina",
            "Tajana Rosing"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deploying Small Language Models (SLMs) on edge platforms is critical for real-time, privacy-sensitive generative AI, yet constrained by memory, latency, and energy budgets. Quantization reduces model size and cost but suffers from device noise in emerging non-volatile memories, while conventional memory hierarchies further limit efficiency. SRAM provides fast access but has low density, DRAM must simultaneously accommodate static weights and dynamic KV caches, which creates bandwidth contention, and Flash, although dense, is primarily used for initialization and remains inactive during inference. These limitations highlight the need for hybrid memory organizations tailored to LLM inference. We propose Outlier-aware Quantization with Memory Co-design (QMC), a retraining-free quantization with a novel heterogeneous memory architecture. QMC identifies inlier and outlier weights in SLMs, storing inlier weights in compact multi-level Resistive-RAM (ReRAM) while preserving critical outliers in high-precision on-chip Magnetoresistive-RAM (MRAM), mitigating noise-induced degradation. On language modeling and reasoning benchmarks, QMC outperforms and matches state-of-the-art quantization methods using advanced algorithms and hybrid data formats, while achieving greater compression under both algorithm-only evaluation and realistic deployment settings. Specifically, compared against SoTA quantization methods on the latest edge AI platform, QMC reduces memory usage by 6.3x-7.3x, external data transfers by 7.6x, energy by 11.7x, and latency by 12.5x when compared to FP16, establishing QMC as a scalable, deployment-ready co-design for efficient on-device inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14556",
        "abs_url": "https://arxiv.org/abs/2601.14556",
        "pdf_url": "https://arxiv.org/pdf/2601.14556",
        "title": "Constructing Multi-label Hierarchical Classification Models for MITRE ATT&CK Text Tagging",
        "authors": [
            "Andrew Crossman",
            "Jonah Dodd",
            "Viralam Ramamurthy Chaithanya Kumar",
            "Riyaz Mohammed",
            "Andrew R. Plummer",
            "Chandra Sekharudu",
            "Deepak Warrier",
            "Mohammad Yekrangian"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "MITRE ATT&CK is a cybersecurity knowledge base that organizes threat actor and cyber-attack information into a set of tactics describing the reasons and goals threat actors have for carrying out attacks, with each tactic having a set of techniques that describe the potential methods used in these attacks. One major application of ATT&CK is the use of its tactic and technique hierarchy by security specialists as a framework for annotating cyber-threat intelligence reports, vulnerability descriptions, threat scenarios, inter alia, to facilitate downstream analyses. To date, the tagging process is still largely done manually. In this technical note, we provide a stratified \"task space\" characterization of the MITRE ATT&CK text tagging task for organizing previous efforts toward automation using AIML methods, while also clarifying pathways for constructing new methods. To illustrate one of the pathways, we use the task space strata to stage-wise construct our own multi-label hierarchical classification models for the text tagging task via experimentation over general cyber-threat intelligence text -- using shareable computational tools and publicly releasing the models to the security community (via this https URL). Our multi-label hierarchical approach yields accuracy scores of roughly 94% at the tactic level, as well as accuracy scores of roughly 82% at the technique level. The models also meet or surpass state-of-the-art performance while relying only on classical machine learning methods -- removing any dependence on LLMs, RAG, agents, or more complex hierarchical approaches. Moreover, we show that GPT-4o model performance at the tactic level is significantly lower (roughly 60% accuracy) than our own approach. We also extend our baseline model to a corpus of threat scenarios for financial applications produced by subject matter experts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14570",
        "abs_url": "https://arxiv.org/abs/2601.14570",
        "pdf_url": "https://arxiv.org/pdf/2601.14570",
        "title": "Place with Intention: An Empirical Attendance Predictive Study of Expo 2025 Osaka, Kansai, Japan",
        "authors": [
            "Xiaojie Yang",
            "Dizhi Huang",
            "Hangli Ge",
            "Masahiro Sano",
            "Takeaki Ohdake",
            "Kazuma Hatano",
            "Noboru Koshizuka"
        ],
        "comments": "Accepted by Special Session 10 of SMD II: Synergizing Mobility Data for Human Life Evolution in Real Spaces at IEEE Big Data 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate forecasting of daily attendance is vital for managing transportation, crowd flows, and services at large-scale international events such as Expo 2025 Osaka, Kansai, Japan. However, existing approaches often rely on multi-source external data (such as weather, traffic, and social media) to improve accuracy, which can lead to unreliable results when historical data are insufficient. To address these challenges, we propose a Transformer-based framework that leverages reservation dynamics, i.e., ticket bookings and subsequent updates within a time window, as a proxy for visitors' attendance intentions, under the assumption that such intentions are eventually reflected in reservation patterns. This design avoids the complexity of multi-source integration while still capturing external influences like weather and promotions implicitly embedded in reservation dynamics. We construct a dataset combining entrance records and reservation dynamics and evaluate the model under both single-channel (total attendance) and two-channel (separated by East and West gates) settings. Results show that separately modeling East and West gates consistently improves accuracy, particularly for short- and medium-term horizons. Ablation studies further confirm the importance of the encoder-decoder structure, inverse-style embedding, and adaptive fusion module. Overall, our findings indicate that reservation dynamics offer a practical and informative foundation for attendance forecasting in large-scale international events.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14590",
        "abs_url": "https://arxiv.org/abs/2601.14590",
        "pdf_url": "https://arxiv.org/pdf/2601.14590",
        "title": "Counterfactual Modeling with Fine-Tuned LLMs for Health Intervention Design and Sensor Data Augmentation",
        "authors": [
            "Shovito Barua Soumma",
            "Asiful Arefeen",
            "Stephanie M. Carpenter",
            "Melanie Hingle",
            "Hassan Ghasemzadeh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Counterfactual explanations (CFEs) provide human-centric interpretability by identifying the minimal, actionable changes required to alter a machine learning model's prediction. Therefore, CFs can be used as (i) interventions for abnormality prevention and (ii) augmented data for training robust models. We conduct a comprehensive evaluation of CF generation using large language models (LLMs), including GPT-4 (zero-shot and few-shot) and two open-source models-BioMistral-7B and LLaMA-3.1-8B, in both pretrained and fine-tuned configurations. Using the multimodal AI-READI clinical dataset, we assess CFs across three dimensions: intervention quality, feature diversity, and augmentation effectiveness. Fine-tuned LLMs, particularly LLaMA-3.1-8B, produce CFs with high plausibility (up to 99%), strong validity (up to 0.99), and realistic, behaviorally modifiable feature adjustments. When used for data augmentation under controlled label-scarcity settings, LLM-generated CFs substantially restore classifier performance, yielding an average 20% F1 recovery across three scarcity scenarios. Compared with optimization-based baselines such as DiCE, CFNOW, and NICE, LLMs offer a flexible, model-agnostic approach that generates more clinically actionable and semantically coherent counterfactuals. Overall, this work demonstrates the promise of LLM-driven counterfactuals for both interpretable intervention design and data-efficient model training in sensor-based digital health. Impact: SenseCF fine-tunes an LLM to generate valid, representative counterfactual explanations and supplement minority class in an imbalanced dataset for improving model training and boosting model robustness and predictive performance",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14603",
        "abs_url": "https://arxiv.org/abs/2601.14603",
        "pdf_url": "https://arxiv.org/pdf/2601.14603",
        "title": "Variance-Adaptive Muon: Accelerating LLM Pretraining with NSR-Modulated and Variance-Scaled Momentum",
        "authors": [
            "Jingru Li",
            "Yibo Fan",
            "Huan Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) achieve competitive performance across diverse natural language processing (NLP) tasks, yet pretraining is computationally demanding, making optimizer efficiency an important practical consideration. Muon accelerates LLM pretraining via orthogonal momentum updates that serve as a matrix analogue of the element-wise sign operator. Motivated by the recent perspective that Adam is a variance-adaptive sign update algorithm, we propose two variants of Muon, Muon-NSR and Muon-VS, which apply variance-adaptive normalization to momentum before orthogonalization. Muon-NSR applies noise-to-signal ratio (NSR) modulation, while Muon-VS performs variance-based scaling without introducing additional hyperparameters. Experiments on GPT-2 and LLaMA pretraining demonstrate that our proposed methods accelerate convergence and consistently achieve lower validation loss than both competitive, well-tuned AdamW and Muon baselines. For example, on the LLaMA-1.2B model, Muon-NSR and Muon-VS reduce the iterations required to reach the target validation loss by $1.36\\times$ relative to the well-tuned Muon following the recent benchmark.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14633",
        "abs_url": "https://arxiv.org/abs/2601.14633",
        "pdf_url": "https://arxiv.org/pdf/2601.14633",
        "title": "Relational Graph Modeling for Credit Default Prediction: Heterogeneous GNNs and Hybrid Ensemble Learning",
        "authors": [
            "Yvonne Yang",
            "Eranki Vasistha"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Credit default risk arises from complex interactions among borrowers, financial institutions, and transaction-level behaviors. While strong tabular models remain highly competitive in credit scoring, they may fail to explicitly capture cross-entity dependencies embedded in multi-table financial histories. In this work, we construct a massive-scale heterogeneous graph containing over 31 million nodes and more than 50 million edges, integrating borrower attributes with granular transaction-level entities such as installment payments, POS cash balances, and credit card histories. We evaluate heterogeneous graph neural networks (GNNs), including heterogeneous GraphSAGE and a relation-aware attentive heterogeneous GNN, against strong tabular baselines. We find that standalone GNNs provide limited lift over a competitive gradient-boosted tree baseline, while a hybrid ensemble that augments tabular features with GNN-derived customer embeddings achieves the best overall performance, improving both ROC-AUC and PR-AUC. We further observe that contrastive pretraining can improve optimization stability but yields limited downstream gains under generic graph augmentations. Finally, we conduct structured explainability and fairness analyses to characterize how relational signals affect subgroup behavior and screening-oriented outcomes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14653",
        "abs_url": "https://arxiv.org/abs/2601.14653",
        "pdf_url": "https://arxiv.org/pdf/2601.14653",
        "title": "Efficient Imputation for Patch-based Missing Single-cell Data via Cluster-regularized Optimal Transport",
        "authors": [
            "Yuyu Liu",
            "Jiannan Yang",
            "Ziyang Yu",
            "Weishen Pan",
            "Fei Wang",
            "Tengfei Ma"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Genomics (q-bio.GN)",
        "abstract": "Missing data in single-cell sequencing datasets poses significant challenges for extracting meaningful biological insights. However, existing imputation approaches, which often assume uniformity and data completeness, struggle to address cases with large patches of missing data. In this paper, we present CROT, an optimal transport-based imputation algorithm designed to handle patch-based missing data in tabular formats. Our approach effectively captures the underlying data structure in the presence of significant missingness. Notably, it achieves superior imputation accuracy while significantly reducing runtime, demonstrating its scalability and efficiency for large-scale datasets. This work introduces a robust solution for imputation in heterogeneous, high-dimensional datasets with structured data absence, addressing critical challenges in both biological and clinical data analysis. Our code is available at Anomalous Github.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14687",
        "abs_url": "https://arxiv.org/abs/2601.14687",
        "pdf_url": "https://arxiv.org/pdf/2601.14687",
        "title": "Beyond Denial-of-Service: The Puppeteer's Attack for Fine-Grained Control in Ranking-Based Federated Learning",
        "authors": [
            "Zhihao Chen",
            "Zirui Gong",
            "Jianting Ning",
            "Yanjun Zhang",
            "Leo Yu Zhang"
        ],
        "comments": "12 pages. To appear in The Web Conference 2026",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Federated Rank Learning (FRL) is a promising Federated Learning (FL) paradigm designed to be resilient against model poisoning attacks due to its discrete, ranking-based update mechanism. Unlike traditional FL methods that rely on model updates, FRL leverages discrete rankings as a communication parameter between clients and the server. This approach significantly reduces communication costs and limits an adversary's ability to scale or optimize malicious updates in the continuous space, thereby enhancing its robustness. This makes FRL particularly appealing for applications where system security and data privacy are crucial, such as web-based auction and bidding platforms. While FRL substantially reduces the attack surface, we demonstrate that it remains vulnerable to a new class of local model poisoning attack, i.e., fine-grained control attacks. We introduce the Edge Control Attack (ECA), the first fine-grained control attack tailored to ranking-based FL frameworks. Unlike conventional denial-of-service (DoS) attacks that cause conspicuous disruptions, ECA enables an adversary to precisely degrade a competitor's accuracy to any target level while maintaining a normal-looking convergence trajectory, thereby avoiding detection. ECA operates in two stages: (i) identifying and manipulating Ascending and Descending Edges to align the global model with the target model, and (ii) widening the selection boundary gap to stabilize the global model at the target accuracy. Extensive experiments across seven benchmark datasets and nine Byzantine-robust aggregation rules (AGRs) show that ECA achieves fine-grained accuracy control with an average error of only 0.224%, outperforming the baseline by up to 17x. Our findings highlight the need for stronger defenses against advanced poisoning attacks. Our code is available at: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14694",
        "abs_url": "https://arxiv.org/abs/2601.14694",
        "pdf_url": "https://arxiv.org/pdf/2601.14694",
        "title": "Re-understanding Graph Unlearning through Memorization",
        "authors": [
            "Pengfei Ding",
            "Yan Wang",
            "Guanfeng Liu"
        ],
        "comments": "This paper has been accepted by WWW-2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Graph unlearning (GU), which removes nodes, edges, or features from trained graph neural networks (GNNs), is crucial in Web applications where graph data may contain sensitive, mislabeled, or malicious information. However, existing GU methods lack a clear understanding of the key factors that determine unlearning effectiveness, leading to three fundamental limitations: (1) impractical and inaccurate GU difficulty assessment due to test-access requirements and invalid assumptions, (2) ineffectiveness on hard-to-unlearn tasks, and (3) misaligned evaluation protocols that overemphasize easy tasks and fail to capture true forgetting capability. To address these issues, we establish GNN memorization as a new perspective for understanding graph unlearning and propose MGU, a Memorization-guided Graph Unlearning framework. MGU achieves three key advances: it provides accurate and practical difficulty assessment across different GU tasks, develops an adaptive strategy that dynamically adjusts unlearning objectives based on difficulty levels, and establishes a comprehensive evaluation protocol that aligns with practical requirements. Extensive experiments on ten real-world graphs demonstrate that MGU consistently outperforms state-of-the-art baselines in forgetting quality, computational efficiency, and utility preservation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14710",
        "abs_url": "https://arxiv.org/abs/2601.14710",
        "pdf_url": "https://arxiv.org/pdf/2601.14710",
        "title": "Case-Guided Sequential Assay Planning in Drug Discovery",
        "authors": [
            "Tianchi Chen",
            "Jan Bima",
            "Sean L. Wu",
            "Otto Ritter",
            "Bingjia Yang",
            "Xiang Yu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE)",
        "abstract": "Optimally sequencing experimental assays in drug discovery is a high-stakes planning problem under severe uncertainty and resource constraints. A primary obstacle for standard reinforcement learning (RL) is the absence of an explicit environment simulator or transition data $(s, a, s')$; planning must rely solely on a static database of historical outcomes. We introduce the Implicit Bayesian Markov Decision Process (IBMDP), a model-based RL framework designed for such simulator-free settings. IBMDP constructs a case-guided implicit model of transition dynamics by forming a nonparametric belief distribution using similar historical outcomes. This mechanism enables Bayesian belief updating as evidence accumulates and employs ensemble MCTS planning to generate stable policies that balance information gain toward desired outcomes with resource efficiency. We validate IBMDP through comprehensive experiments. On a real-world central nervous system (CNS) drug discovery task, IBMDP reduced resource consumption by up to 92\\% compared to established heuristics while maintaining decision confidence. To rigorously assess decision quality, we also benchmarked IBMDP in a synthetic environment with a computable optimal policy. Our framework achieves significantly higher alignment with this optimal policy than a deterministic value iteration alternative that uses the same similarity-based model, demonstrating the superiority of our ensemble planner. IBMDP offers a practical solution for sequential experimental design in data-rich but simulator-poor domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14730",
        "abs_url": "https://arxiv.org/abs/2601.14730",
        "pdf_url": "https://arxiv.org/pdf/2601.14730",
        "title": "FSX: Message Flow Sensitivity Enhanced Structural Explainer for Graph Neural Networks",
        "authors": [
            "Bizu Feng",
            "Zhimu Yang",
            "Shaode Yu",
            "Zixin Hu"
        ],
        "comments": "8 pages, 4 figures, Preprint",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Despite the widespread success of Graph Neural Networks (GNNs), understanding the reasons behind their specific predictions remains challenging. Existing explainability methods face a trade-off that gradient-based approaches are computationally efficient but often ignore structural interactions, while game-theoretic techniques capture interactions at the cost of high computational overhead and potential deviation from the model's true reasoning path. To address this gap, we propose FSX (Message Flow Sensitivity Enhanced Structural Explainer), a novel hybrid framework that synergistically combines the internal message flows of the model with a cooperative game approach applied to the external graph data. FSX first identifies critical message flows via a novel flow-sensitivity analysis: during a single forward pass, it simulates localized node perturbations and measures the resulting changes in message flow intensities. These sensitivity-ranked flows are then projected onto the input graph to define compact, semantically meaningful subgraphs. Within each subgraph, a flow-aware cooperative game is conducted, where node contributions are evaluated fairly through a Shapley-like value that incorporates both node-feature importance and their roles in sustaining or destabilizing the identified critical flows. Extensive evaluation across multiple datasets and GNN architectures demonstrates that FSX achieves superior explanation fidelity with significantly reduced runtime, while providing unprecedented insights into the structural logic underlying model predictions--specifically, how important sub-structures exert influence by governing the stability of key internal computational pathways.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14746",
        "abs_url": "https://arxiv.org/abs/2601.14746",
        "pdf_url": "https://arxiv.org/pdf/2601.14746",
        "title": "RefProtoFL: Communication-Efficient Federated Learning via External-Referenced Prototype Alignment",
        "authors": [
            "Hongyue Wu",
            "Hangyu Li",
            "Guodong Fan",
            "Haoran Zhu",
            "Shizhan Chen",
            "Zhiyong Feng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated learning (FL) enables collaborative model training without sharing raw data in edge environments, but is constrained by limited communication bandwidth and heterogeneous client data distributions. Prototype-based FL mitigates this issue by exchanging class-wise feature prototypes instead of full model parameters; however, existing methods still suffer from suboptimal generalization under severe communication constraints. In this paper, we propose RefProtoFL, a communication-efficient FL framework that integrates External-Referenced Prototype Alignment (ERPA) for representation consistency with Adaptive Probabilistic Update Dropping (APUD) for communication efficiency. Specifically, we decompose the model into a private backbone and a lightweight shared adapter, and restrict federated communication to the adapter parameters only. To further reduce uplink cost, APUD performs magnitude-aware Top-K sparsification, transmitting only the most significant adapter updates for server-side aggregation. To address representation inconsistency across heterogeneous clients, ERPA leverages a small server-held public dataset to construct external reference prototypes that serve as shared semantic anchors. For classes covered by public data, clients directly align local representations to public-induced prototypes, whereas for uncovered classes, alignment relies on server-aggregated global reference prototypes via weighted averaging. Extensive experiments on standard benchmarks demonstrate that RefProtoFL attains higher classification accuracy than state-of-the-art prototype-based FL baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14765",
        "abs_url": "https://arxiv.org/abs/2601.14765",
        "pdf_url": "https://arxiv.org/pdf/2601.14765",
        "title": "Anytime Optimal Decision Tree Learning with Continuous Features",
        "authors": [
            "Harold Kiossou",
            "Pierre Schaus",
            "Siegfried Nijssen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "In recent years, significant progress has been made on algorithms for learning optimal decision trees, primarily in the context of binary features. Extending these methods to continuous features remains substantially more challenging due to the large number of potential splits for each feature. Recently, an elegant exact algorithm was proposed for learning optimal decision trees with continuous features; however, the rapidly increasing computational time limits its practical applicability to shallow depths (typically 3 or 4). It relies on a depth-first search optimization strategy that fully optimizes the left subtree of each split before exploring the corresponding right subtree. While effective in finding optimal solutions given sufficient time, this strategy can lead to poor anytime behavior: when interrupted early, the best-found tree is often highly unbalanced and suboptimal. In such cases, purely greedy methods such as C4.5 may, paradoxically, yield better solutions. To address this limitation, we propose an anytime, yet complete approach leveraging limited discrepancy search, distributing the computational effort more evenly across the entire tree structure, and thus ensuring that a high-quality decision tree is available at any interruption point. Experimental results show that our approach outperforms the existing one in terms of anytime performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14792",
        "abs_url": "https://arxiv.org/abs/2601.14792",
        "pdf_url": "https://arxiv.org/pdf/2601.14792",
        "title": "Robustness of Mixtures of Experts to Feature Noise",
        "authors": [
            "Dong Sun",
            "Rahul Nittala",
            "Rebekka Burkholz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Despite their practical success, it remains unclear why Mixture of Experts (MoE) models can outperform dense networks beyond sheer parameter scaling. We study an iso-parameter regime where inputs exhibit latent modular structure but are corrupted by feature noise, a proxy for noisy internal activations. We show that sparse expert activation acts as a noise filter: compared to a dense estimator, MoEs achieve lower generalization error under feature noise, improved robustness to perturbations, and faster convergence speed. Empirical results on synthetic data and real-world language tasks corroborate the theoretical insights, demonstrating consistent robustness and efficiency gains from sparse modular computation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14798",
        "abs_url": "https://arxiv.org/abs/2601.14798",
        "pdf_url": "https://arxiv.org/pdf/2601.14798",
        "title": "Reflecting in the Reflection: Integrating a Socratic Questioning Framework into Automated AI-Based Question Generation",
        "authors": [
            "Ondřej Holub",
            "Essi Ryymin",
            "Rodrigo Alves"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL); Computers and Society (cs.CY)",
        "abstract": "Designing good reflection questions is pedagogically important but time-consuming and unevenly supported across teachers. This paper introduces a reflection-in-reflection framework for automated generation of reflection questions with large language models (LLMs). Our approach coordinates two role-specialized agents, a Student-Teacher and a Teacher-Educator, that engage in a Socratic multi-turn dialogue to iteratively refine a single question given a teacher-specified topic, key concepts, student level, and optional instructional materials. The Student-Teacher proposes candidate questions with brief rationales, while the Teacher-Educator evaluates them along clarity, depth, relevance, engagement, and conceptual interconnections, responding only with targeted coaching questions or a fixed signal to stop the dialogue. We evaluate the framework in an authentic lower-secondary ICT setting on the topic, using GPT-4o-mini as the backbone model and a stronger GPT- 4-class LLM as an external evaluator in pairwise comparisons of clarity, relevance, depth, and overall quality. First, we study how interaction design and context (dynamic this http URL iteration counts; presence or absence of student level and materials) affect question quality. Dynamic stopping combined with contextual information consistently outperforms fixed 5- or 10-step refinement, with very long dialogues prone to drift or over-complication. Second, we show that our two-agent protocol produces questions that are judged substantially more relevant and deeper, and better overall, than a one-shot baseline using the same backbone model.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14818",
        "abs_url": "https://arxiv.org/abs/2601.14818",
        "pdf_url": "https://arxiv.org/pdf/2601.14818",
        "title": "Statistical Learning Theory for Distributional Classification",
        "authors": [
            "Christian Fiedler"
        ],
        "comments": "Contains supplementary material",
        "subjects": "Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "In supervised learning with distributional inputs in the two-stage sampling setup, relevant to applications like learning-based medical screening or causal learning, the inputs (which are probability distributions) are not accessible in the learning phase, but only samples thereof. This problem is particularly amenable to kernel-based learning methods, where the distributions or samples are first embedded into a Hilbert space, often using kernel mean embeddings (KMEs), and then a standard kernel method like Support Vector Machines (SVMs) is applied, using a kernel defined on the embedding Hilbert space. In this work, we contribute to the theoretical analysis of this latter approach, with a particular focus on classification with distributional inputs using SVMs. We establish a new oracle inequality and derive consistency and learning rate results. Furthermore, for SVMs using the hinge loss and Gaussian kernels, we formulate a novel variant of an established noise assumption from the binary classification literature, under which we can establish learning rates. Finally, some of our technical tools like a new feature space for Gaussian kernels on Hilbert spaces are of independent interest.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14855",
        "abs_url": "https://arxiv.org/abs/2601.14855",
        "pdf_url": "https://arxiv.org/pdf/2601.14855",
        "title": "Adaptive Exponential Integration for Stable Gaussian Mixture Black-Box Variational Inference",
        "authors": [
            "Baojun Che",
            "Yifan Chen",
            "Daniel Zhengyu Huang",
            "Xinying Mao",
            "Weijie Wang"
        ],
        "comments": "26 pages, 7 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Black-box variational inference (BBVI) with Gaussian mixture families offers a flexible approach for approximating complex posterior distributions without requiring gradients of the target density. However, standard numerical optimization methods often suffer from instability and inefficiency. We develop a stable and efficient framework that combines three key components: (1) affine-invariant preconditioning via natural gradient formulations, (2) an exponential integrator that unconditionally preserves the positive definiteness of covariance matrices, and (3) adaptive time stepping to ensure stability and to accommodate distinct warm-up and convergence phases. The proposed approach has natural connections to manifold optimization and mirror descent. For Gaussian posteriors, we prove exponential convergence in the noise-free setting and almost-sure convergence under Monte Carlo estimation, rigorously justifying the necessity of adaptive time stepping. Numerical experiments on multimodal distributions, Neal's multiscale funnel, and a PDE-based Bayesian inverse problem for Darcy flow demonstrate the effectiveness of the proposed method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14862",
        "abs_url": "https://arxiv.org/abs/2601.14862",
        "pdf_url": "https://arxiv.org/pdf/2601.14862",
        "title": "Strategic Doctrine Language Models (sdLM): A Learning-System Framework for Doctrinal Consistency and Geopolitical Forecasting",
        "authors": [
            "Olaf Yunus Laitinen Imanov",
            "Taner Yilmaz",
            "Derya Umut Kulali"
        ],
        "comments": "13 pages, 10 figures, 10 tables",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "We introduce Strategic Doctrine Language Models (sdLM), a learning-system framework for multi-document strategic reasoning with doctrinal consistency constraints and calibrated uncertainty. The approach combines multi-document attention, temporal encoding, and a doctrine-consistency layer to improve long-horizon forecasting and plan plausibility while reducing severe doctrinal violations. We evaluate sdLM using (i) expert-panel scoring of strategic scenarios (N=47), (ii) doctrine consistency on 336 doctrine publications (12,847 statements), and (iii) geopolitical forecasting on 127 historical counterfactuals (1945-2020) across 12-60 month horizons. Across these benchmarks, sdLM achieves higher strategic quality and better calibration than strong general-purpose LLM baselines, and remains competitive with human experts on long-horizon judgments. We further report ablations, scaling trends, and deployment-oriented performance/latency characteristics to clarify which components drive improvements and how they translate to operational settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14888",
        "abs_url": "https://arxiv.org/abs/2601.14888",
        "pdf_url": "https://arxiv.org/pdf/2601.14888",
        "title": "What Makes Low-Bit Quantization-Aware Training Work for Reasoning LLMs? A Systematic Study",
        "authors": [
            "Keyu Lv",
            "Manyi Zhang",
            "Xiaobo Xia",
            "Jingchen Ni",
            "Shannan Yan",
            "Xianzhi Yu",
            "Lu Hou",
            "Chun Yuan",
            "Haoli Bai"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Reasoning models excel at complex tasks such as coding and mathematics, yet their inference is often slow and token-inefficient. To improve the inference efficiency, post-training quantization (PTQ) usually comes with the cost of large accuracy drops, especially for reasoning tasks under low-bit settings. In this study, we present a systematic empirical study of quantization-aware training (QAT) for reasoning models. Our key findings include: (1) Knowledge distillation is a robust objective for reasoning models trained via either supervised fine-tuning or reinforcement learning; (2) PTQ provides a strong initialization for QAT, improving accuracy while reducing training cost; (3) Reinforcement learning remains feasible for quantized models given a viable cold start and yields additional gains; and (4) Aligning the PTQ calibration domain with the QAT training domain accelerates convergence and often improves the final accuracy. Finally, we consolidate these findings into an optimized workflow (Reasoning-QAT), and show that it consistently outperforms state-of-the-art PTQ methods across multiple LLM backbones and reasoning datasets. For instance, on Qwen3-0.6B, it surpasses GPTQ by 44.53% on MATH-500 and consistently recovers performance in the 2-bit regime.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14917",
        "abs_url": "https://arxiv.org/abs/2601.14917",
        "pdf_url": "https://arxiv.org/pdf/2601.14917",
        "title": "Tailoring Adverse Event Prediction in Type 1 Diabetes with Patient-Specific Deep Learning Models",
        "authors": [
            "Giorgia Rigamonti",
            "Mirko Paolo Barbato",
            "Davide Marelli",
            "Paolo Napoletano"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Effective management of Type 1 Diabetes requires continuous glucose monitoring and precise insulin adjustments to prevent hyperglycemia and hypoglycemia. With the growing adoption of wearable glucose monitors and mobile health applications, accurate blood glucose prediction is essential for enhancing automated insulin delivery and decision-support systems. This paper presents a deep learning-based approach for personalized blood glucose prediction, leveraging patient-specific data to improve prediction accuracy and responsiveness in real-world scenarios. Unlike traditional generalized models, our method accounts for individual variability, enabling more effective subject-specific predictions. We compare Leave-One-Subject-Out Cross-Validation with a fine-tuning strategy to evaluate their ability to model patient-specific dynamics. Results show that personalized models significantly improve the prediction of adverse events, enabling more precise and timely interventions in real-world scenarios. To assess the impact of patient-specific data, we conduct experiments comparing a multimodal, patient-specific approach against traditional CGM-only methods. Additionally, we perform an ablation study to investigate model performance with progressively smaller training sets, identifying the minimum data required for effective personalization-an essential consideration for real-world applications where extensive data collection is often challenging. Our findings underscore the potential of adaptive, personalized glucose prediction models for advancing next-generation diabetes management, particularly in wearable and mobile health platforms, enhancing consumer-oriented diabetes care solutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14942",
        "abs_url": "https://arxiv.org/abs/2601.14942",
        "pdf_url": "https://arxiv.org/pdf/2601.14942",
        "title": "Communication-Efficient Multi-Modal Edge Inference via Uncertainty-Aware Distributed Learning",
        "authors": [
            "Hang Zhao",
            "Hongru Li",
            "Dongfang Xu",
            "Shenghui Song",
            "Khaled B. Letaief"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Semantic communication is emerging as a key enabler for distributed edge intelligence due to its capability to convey task-relevant meaning. However, achieving communication-efficient training and robust inference over wireless links remains challenging. This challenge is further exacerbated for multi-modal edge inference (MMEI) by two factors: 1) prohibitive communication overhead for distributed learning over bandwidth-limited wireless links, due to the \\emph{multi-modal} nature of the system; and 2) limited robustness under varying channels and noisy multi-modal inputs. In this paper, we propose a three-stage communication-aware distributed learning framework to improve training and inference efficiency while maintaining robustness over wireless channels. In Stage~I, devices perform local multi-modal self-supervised learning to obtain shared and modality-specific encoders without device--server exchange, thereby reducing the communication cost. In Stage~II, distributed fine-tuning with centralized evidential fusion calibrates per-modality uncertainty and reliably aggregates features distorted by noise or channel fading. In Stage~III, an uncertainty-guided feedback mechanism selectively requests additional features for uncertain samples, optimizing the communication--accuracy tradeoff in the distributed setting. Experiments on RGB--depth indoor scene classification show that the proposed framework attains higher accuracy with far fewer training communication rounds and remains robust to modality degradation or channel variation, outperforming existing self-supervised and fully supervised baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14954",
        "abs_url": "https://arxiv.org/abs/2601.14954",
        "pdf_url": "https://arxiv.org/pdf/2601.14954",
        "title": "Multimodal Rumor Detection Enhanced by External Evidence and Forgery Features",
        "authors": [
            "Han Li",
            "Hua Sun"
        ],
        "comments": "19 pages,10 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Social media increasingly disseminates information through mixed image text posts, but rumors often exploit subtle inconsistencies and forged content, making detection based solely on post content difficult. Deep semantic mismatch rumors, which superficially align images and texts, pose particular challenges and threaten online public opinion. Existing multimodal rumor detection methods improve cross modal modeling but suffer from limited feature extraction, noisy alignment, and inflexible fusion strategies, while ignoring external factual evidence necessary for verifying complex rumors. To address these limitations, we propose a multimodal rumor detection model enhanced with external evidence and forgery features. The model uses a ResNet34 visual encoder, a BERT text encoder, and a forgery feature module extracting frequency-domain traces and compression artifacts via Fourier transformation. BLIP-generated image descriptions bridge image and text semantic spaces. A dual contrastive learning module computes contrastive losses between text image and text description pairs, improving detection of semantic inconsistencies. A gated adaptive feature-scaling fusion mechanism dynamically adjusts multimodal fusion and reduces redundancy. Experiments on Weibo and Twitter datasets demonstrate that our model outperforms mainstream baselines in macro accuracy, recall, and F1 score.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14957",
        "abs_url": "https://arxiv.org/abs/2601.14957",
        "pdf_url": "https://arxiv.org/pdf/2601.14957",
        "title": "Improving Regret Approximation for Unsupervised Dynamic Environment Generation",
        "authors": [
            "Harry Mead",
            "Bruno Lacerda",
            "Jakob Foerster",
            "Nick Hawes"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Unsupervised Environment Design (UED) seeks to automatically generate training curricula for reinforcement learning (RL) agents, with the goal of improving generalisation and zero-shot performance. However, designing effective curricula remains a difficult problem, particularly in settings where small subsets of environment parameterisations result in significant increases in the complexity of the required policy. Current methods struggle with a difficult credit assignment problem and rely on regret approximations that fail to identify challenging levels, both of which are compounded as the size of the environment grows. We propose Dynamic Environment Generation for UED (DEGen) to enable a denser level generator reward signal, reducing the difficulty of credit assignment and allowing for UED to scale to larger environment sizes. We also introduce a new regret approximation, Maximised Negative Advantage (MNA), as a significantly improved metric to optimise for, that better identifies more challenging levels. We show empirically that MNA outperforms current regret approximations and when combined with DEGen, consistently outperforms existing methods, especially as the size of the environment grows. We have made all our code available here: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14971",
        "abs_url": "https://arxiv.org/abs/2601.14971",
        "pdf_url": "https://arxiv.org/pdf/2601.14971",
        "title": "Fine-Grained Traceability for Transparent ML Pipelines",
        "authors": [
            "Liping Chen",
            "Mujie Liu",
            "Haytham Fayek"
        ],
        "comments": "Accepted at The Web Conference (WWW) 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Modern machine learning systems are increasingly realised as multistage pipelines, yet existing transparency mechanisms typically operate at a model level: they describe what a system is and why it behaves as it does, but not how individual data samples are operationally recorded, tracked, and verified as they traverse the pipeline. This absence of verifiable, sample-level traceability leaves practitioners and users unable to determine whether a specific sample was used, when it was processed, or whether the corresponding records remain intact over time. We introduce FG-Trac, a model-agnostic framework that establishes verifiable, fine-grained sample-level traceability throughout machine learning pipelines. FG-Trac defines an explicit mechanism for capturing and verifying sample lifecycle events across preprocessing and training, computes contribution scores explicitly grounded in training checkpoints, and anchors these traces to tamper-evident cryptographic commitments. The framework integrates without modifying model architectures or training objectives, reconstructing complete and auditable data-usage histories with practical computational overhead. Experiments on a canonical convolutional neural network and a multimodal graph learning pipeline demonstrate that FG-Trac preserves predictive performance while enabling machine learning systems to furnish verifiable evidence of how individual samples were used and propagated during model execution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15000",
        "abs_url": "https://arxiv.org/abs/2601.15000",
        "pdf_url": "https://arxiv.org/pdf/2601.15000",
        "title": "Lineup Regularized Adjusted Plus-Minus (L-RAPM): Basketball Lineup Ratings with Informed Priors",
        "authors": [
            "Christos Petridis",
            "Konstantinos Pelechrinis"
        ],
        "comments": "7 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Identifying combinations of players (that is, lineups) in basketball - and other sports - that perform well when they play together is one of the most important tasks in sports analytics. One of the main challenges associated with this task is the frequent substitutions that occur during a game, which results in highly sparse data. In particular, a National Basketball Association (NBA) team will use more than 600 lineups during a season, which translates to an average lineup having seen the court in approximately 25-30 possessions. Inevitably, any statistics that one collects for these lineups are going to be noisy, with low predictive value. Yet, there is no existing work (in the public at least) that addresses this problem. In this work, we propose a regression-based approach that controls for the opposition faced by each lineup, while it also utilizes information about the players making up the lineups. Our experiments show that L-RAPM provides improved predictive power than the currently used baseline, and this improvement increases as the sample size for the lineups gets smaller.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15013",
        "abs_url": "https://arxiv.org/abs/2601.15013",
        "pdf_url": "https://arxiv.org/pdf/2601.15013",
        "title": "RadixMLP - Intra-batch Deduplication for Causal Transformers",
        "authors": [
            "Michael Feil",
            "Julius Lipp"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Batch inference workloads for causal transformer models frequently process sequences that share common prefixes, such as system prompts, few-shot examples, or shared queries. Standard inference engines treat each sequence independently, redundantly recomputing identical MLP activations for every copy of the shared prefix. We introduce RadixMLP, a technique that exploits the position-wise nature of MLPs, LayerNorms, linear projections, and embeddings to eliminate this redundancy. RadixMLP dynamically maps batches to a prefix trie, gathering shared segments into a compressed representation for position-wise computation and scattering results back only at attention boundaries. RadixMLP is stateless and operates within a single forward pass. In end-to-end serving benchmarks on MS~MARCO v1.1 with Qwen3 models (0.6B to 8B parameters), RadixMLP achieves 1.44-1.59$\\times$ speedups in realistic reranking workloads, with up to $5\\times$ speedups on synthetic benchmarks with longer shared prefixes. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15015",
        "abs_url": "https://arxiv.org/abs/2601.15015",
        "pdf_url": "https://arxiv.org/pdf/2601.15015",
        "title": "Plug-and-Play Benchmarking of Reinforcement Learning Algorithms for Large-Scale Flow Control",
        "authors": [
            "Jannis Becktepe",
            "Aleksandra Franz",
            "Nils Thuerey",
            "Sebastian Peitz"
        ],
        "comments": "Code available at this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Reinforcement learning (RL) has shown promising results in active flow control (AFC), yet progress in the field remains difficult to assess as existing studies rely on heterogeneous observation and actuation schemes, numerical setups, and evaluation protocols. Current AFC benchmarks attempt to address these issues but heavily rely on external computational fluid dynamics (CFD) solvers, are not fully differentiable, and provide limited 3D and multi-agent support. To overcome these limitations, we introduce FluidGym, the first standalone, fully differentiable benchmark suite for RL in AFC. Built entirely in PyTorch on top of the GPU-accelerated PICT solver, FluidGym runs in a single Python stack, requires no external CFD software, and provides standardized evaluation protocols. We present baseline results with PPO and SAC and release all environments, datasets, and trained models as public resources. FluidGym enables systematic comparison of control methods, establishes a scalable foundation for future research in learning-based flow control, and is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15036",
        "abs_url": "https://arxiv.org/abs/2601.15036",
        "pdf_url": "https://arxiv.org/pdf/2601.15036",
        "title": "Factorizable joint shift revisited",
        "authors": [
            "Dirk Tasche"
        ],
        "comments": "23 pages",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Factorizable joint shift (FJS) was proposed as a type of distribution shift (or dataset shift) that comprises both covariate and label shift. Recently, it has been observed that FJS actually arises from consecutive label and covariate (or vice versa) shifts. Research into FJS so far has been confined to the case of categorical label spaces. We propose a framework for analysing distribution shift in the case of general label spaces, thus covering both classification and regression models. Based on the framework, we generalise existing results on FJS to general label spaces and propose a related extension of the expectation maximisation (EM) algorithm for class prior probabilities. We also take a fresh look at generalized label shift (GLS) in the case of general label spaces.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15041",
        "abs_url": "https://arxiv.org/abs/2601.15041",
        "pdf_url": "https://arxiv.org/pdf/2601.15041",
        "title": "HyperNet-Adaptation for Diffusion-Based Test Case Generation",
        "authors": [
            "Oliver Weißl",
            "Vincenzo Riccio",
            "Severin Kacianka",
            "Andrea Stocco"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Software Engineering (cs.SE)",
        "abstract": "The increasing deployment of deep learning systems requires systematic evaluation of their reliability in real-world scenarios. Traditional gradient-based adversarial attacks introduce small perturbations that rarely correspond to realistic failures and mainly assess robustness rather than functional behavior. Generative test generation methods offer an alternative but are often limited to simple datasets or constrained input domains. Although diffusion models enable high-fidelity image synthesis, their computational cost and limited controllability restrict their applicability to large-scale testing. We present HyNeA, a generative testing method that enables direct and efficient control over diffusion-based generation. HyNeA provides dataset-free controllability through hypernetworks, allowing targeted manipulation of the generative process without relying on architecture-specific conditioning mechanisms or dataset-driven adaptations such as fine-tuning. HyNeA employs a distinct training strategy that supports instance-level tuning to identify failure-inducing test cases without requiring datasets that explicitly contain examples of similar failures. This approach enables the targeted generation of realistic failure cases at substantially lower computational cost than search-based methods. Experimental results show that HyNeA improves controllability and test diversity compared to existing generative test generators and generalizes to domains where failure-labeled training data is unavailable.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15079",
        "abs_url": "https://arxiv.org/abs/2601.15079",
        "pdf_url": "https://arxiv.org/pdf/2601.15079",
        "title": "LoRAP: Low-Rank Aggregation Prompting for Quantized Graph Neural Networks Training",
        "authors": [
            "Chenyu Liu",
            "Haige Li",
            "Luca Rossi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Social and Information Networks (cs.SI)",
        "abstract": "Graph Neural Networks (GNNs) are neural networks that aim to process graph data, capturing the relationships and interactions between nodes using the message-passing mechanism. GNN quantization has emerged as a promising approach for reducing model size and accelerating inference in resource-constrained environments. Compared to quantization in LLMs, quantizing graph features is more emphasized in GNNs. Inspired by the above, we propose to leverage prompt learning, which manipulates the input data, to improve the performance of quantization-aware training (QAT) for GNNs. To mitigate the issue that prompting the node features alone can only make part of the quantized aggregation result optimal, we introduce Low-Rank Aggregation Prompting (LoRAP), which injects lightweight, input-dependent prompts into each aggregated feature to optimize the results of quantized aggregations. Extensive evaluations on 4 leading QAT frameworks over 9 graph datasets demonstrate that LoRAP consistently enhances the performance of low-bit quantized GNNs while introducing a minimal computational overhead.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15102",
        "abs_url": "https://arxiv.org/abs/2601.15102",
        "pdf_url": "https://arxiv.org/pdf/2601.15102",
        "title": "Field-Space Autoencoder for Scalable Climate Emulators",
        "authors": [
            "Johannes Meuer",
            "Maximilian Witte",
            "Étiénne Plésiat",
            "Thomas Ludwig",
            "Christopher Kadow"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Image and Video Processing (eess.IV)",
        "abstract": "Kilometer-scale Earth system models are essential for capturing local climate change. However, these models are computationally expensive and produce petabyte-scale outputs, which limits their utility for applications such as probabilistic risk assessment. Here, we present the Field-Space Autoencoder, a scalable climate emulation framework based on a spherical compression model that overcomes these challenges. By utilizing Field-Space Attention, the model efficiently operates on native climate model output and therefore avoids geometric distortions caused by forcing spherical data onto Euclidean grids. This approach preserves physical structures significantly better than convolutional baselines. By producing a structured compressed field, it serves as a good baseline for downstream generative emulation. In addition, the model can perform zero-shot super-resolution that maps low-resolution large ensembles and scarce high-resolution data into a shared representation. We train a generative diffusion model on these compressed fields. The model can simultaneously learn internal variability from abundant low-resolution data and fine-scale physics from sparse high-resolution data. Our work bridges the gap between the high volume of low-resolution ensemble statistics and the scarcity of high-resolution physical detail.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15124",
        "abs_url": "https://arxiv.org/abs/2601.15124",
        "pdf_url": "https://arxiv.org/pdf/2601.15124",
        "title": "Overcoming In-Memory Bottlenecks in Graph Foundation Models via Retrieval-Augmented Generation",
        "authors": [
            "Haonan Yuan",
            "Qingyun Sun",
            "Jiacheng Tao",
            "Xingcheng Fu",
            "Jianxin Li"
        ],
        "comments": "Accepted by the Web Conference 2026 (Research Track)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Graph Foundation Models (GFMs) have emerged as a frontier in graph learning, which are expected to deliver transferable representations across diverse tasks. However, GFMs remain constrained by in-memory bottlenecks: they attempt to encode knowledge into model parameters, which limits semantic capacity, introduces heavy lossy compression with conflicts, and entangles graph representation with the knowledge in ways that hinder efficient adaptation, undermining scalability and interpretability. In this work,we propose RAG-GFM, a Retrieval-Augmented Generation aided Graph Foundation Model that offloads knowledge from parameters and complements parameterized learning. To externalize graph knowledge, we build a dual-modal unified retrieval module, where a semantic store from prefix-structured text and a structural store from centrality-based motif. To preserve heterogeneous information, we design a dual-view alignment objective that contrasts both modalities to capture both content and relational patterns. To enable efficient downstream adaptation, we perform in-context augmentation to enrich supporting instances with retrieved texts and motifs as contextual evidence. Extensive experiments on five benchmark graph datasets demonstrate that RAG-GFM consistently outperforms 13 state-of-the-art baselines in both cross-domain node and graph classification, achieving superior effectiveness and efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15141",
        "abs_url": "https://arxiv.org/abs/2601.15141",
        "pdf_url": "https://arxiv.org/pdf/2601.15141",
        "title": "CLEANER: Self-Purified Trajectories Boost Agentic Reinforcement Learning",
        "authors": [
            "Tianshi Xu",
            "Yuteng Chen",
            "Meng Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Agentic Reinforcement Learning (RL) has empowered Large Language Models (LLMs) to utilize tools like Python interpreters for complex problem-solving. However, for parameter-constrained models (e.g., 4B--7B), the exploration phase is often plagued by frequent execution failures, creating noisy trajectories that hinder policy optimization. Under standard outcome-based reward settings, this noise leads to a critical credit assignment issue, where erroneous actions are inadvertently reinforced alongside successful outcomes. Existing mitigations face a dilemma: dense rewards often trigger reward hacking, while supersampling incurs prohibitive computational costs. To address these challenges, we propose CLEANER. Distinct from external filtering methods, CLEANER exploits the model's intrinsic self-correction capabilities to eliminate error-contaminated context directly during data collection. At its core, the Similarity-Aware Adaptive Rollback (SAAR) mechanism autonomously constructs clean, purified trajectories by retrospectively replacing failures with successful self-corrections. Based on semantic similarity, SAAR adaptively regulates replacement granularity from shallow execution repairs to deep reasoning substitutions. By training on these self-purified paths, the model internalizes correct reasoning patterns rather than error-recovery loops. Empirical results on AIME24/25, GPQA, and LiveCodeBench show average accuracy gains of 6%, 3%, and 5% over baselines. Notably, CLEANER matches state-of-the-art performance using only one-third of the training steps, highlighting trajectory purification as a scalable solution for efficient agentic RL. Our models and code are available at GitHub",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15212",
        "abs_url": "https://arxiv.org/abs/2601.15212",
        "pdf_url": "https://arxiv.org/pdf/2601.15212",
        "title": "ZENITH: Automated Gradient Norm Informed Stochastic Optimization",
        "authors": [
            "Dhrubo Saha"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "Training deep computer vision models requires manual oversight or hyperparameter tuning of the learning rate (LR) schedule. While existing adaptive optimizers schedule the LR automatically, they suffer from computational and memory overhead, incompatibility with regularization, and suboptimal LR choices. In this work, we introduce the ZENITH (Zero-overhead Evolution using Norm-Informed Training History) optimizer, which adapts the LR using the temporal evolution of the gradient norm. Image classification experiments spanning 6 CNN architectures and 6 benchmarks demonstrate that ZENITH achieves higher test accuracy in lower wall-clock time than baselines. It also yielded superior mAP in object detection, keypoint detection, and instance segmentation on MS COCO using the R-CNN family of models. Furthermore, its compatibility with regularization enables even better generalization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15279",
        "abs_url": "https://arxiv.org/abs/2601.15279",
        "pdf_url": "https://arxiv.org/pdf/2601.15279",
        "title": "MolecularIQ: Characterizing Chemical Reasoning Capabilities Through Symbolic Verification on Molecular Graphs",
        "authors": [
            "Christoph Bartmann",
            "Johannes Schimunek",
            "Mykyta Ielanskyi",
            "Philipp Seidl",
            "Günter Klambauer",
            "Sohvi Luukkonen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "A molecule's properties are fundamentally determined by its composition and structure encoded in its molecular graph. Thus, reasoning about molecular properties requires the ability to parse and understand the molecular graph. Large Language Models (LLMs) are increasingly applied to chemistry, tackling tasks such as molecular name conversion, captioning, text-guided generation, and property or reaction prediction. Most existing benchmarks emphasize general chemical knowledge, rely on literature or surrogate labels that risk leakage or bias, or reduce evaluation to multiple-choice questions. We introduce MolecularIQ, a molecular structure reasoning benchmark focused exclusively on symbolically verifiable tasks. MolecularIQ enables fine-grained evaluation of reasoning over molecular graphs and reveals capability patterns that localize model failures to specific tasks and molecular structures. This provides actionable insights into the strengths and limitations of current chemistry LLMs and guides the development of models that reason faithfully over molecular structure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2209.07861",
        "abs_url": "https://arxiv.org/abs/2209.07861",
        "pdf_url": "https://arxiv.org/pdf/2209.07861",
        "title": "Machine Learning Decoder for 5G NR PUCCH Format 0",
        "authors": [
            "Anil Kumar Yerrapragada",
            "Jeeva Keshav S",
            "Ankit Gautam",
            "Radha Krishna Ganti"
        ],
        "comments": "Accepted at 2023 National Conference on Communications (NCC 2023), IIT Guwahati",
        "subjects": "Networking and Internet Architecture (cs.NI); Information Theory (cs.IT); Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "5G cellular systems depend on the timely exchange of feedback control information between the user equipment and the base station. Proper decoding of this control information is necessary to set up and sustain high throughput radio links. This paper makes the first attempt at using Machine Learning techniques to improve the decoding performance of the Physical Uplink Control Channel Format 0. We use fully connected neural networks to classify the received samples based on the uplink control information content embedded within them. The trained neural network, tested on real-time wireless captures, shows significant improvement in accuracy over conventional DFT-based decoders, even at low SNR. The obtained accuracy results also demonstrate conformance with 3GPP requirements.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14260",
        "abs_url": "https://arxiv.org/abs/2601.14260",
        "pdf_url": "https://arxiv.org/pdf/2601.14260",
        "title": "End-to-End Transformer Acceleration Through Processing-in-Memory Architectures",
        "authors": [
            "Xiaoxuan Yang",
            "Peilin Chen",
            "Tergel Molom-Ochir",
            "Yiran Chen"
        ],
        "comments": "ICM 2025",
        "subjects": "Hardware Architecture (cs.AR); Machine Learning (cs.LG)",
        "abstract": "Transformers have become central to natural language processing and large language models, but their deployment at scale faces three major challenges. First, the attention mechanism requires massive matrix multiplications and frequent movement of intermediate results between memory and compute units, leading to high latency and energy costs. Second, in long-context inference, the key-value cache (KV cache) can grow unpredictably and even surpass the model's weight size, creating severe memory and bandwidth bottlenecks. Third, the quadratic complexity of attention with respect to sequence length amplifies both data movement and compute overhead, making large-scale inference inefficient. To address these issues, this work introduces processing-in-memory solutions that restructure attention and feed-forward computation to minimize off-chip data transfers, dynamically compress and prune the KV cache to manage memory growth, and reinterpret attention as an associative memory operation to reduce complexity and hardware footprint. Moreover, we evaluate our processing-in-memory design against state-of-the-art accelerators and general-purpose GPUs, demonstrating significant improvements in energy efficiency and latency. Together, these approaches address computation overhead, memory scalability, and attention complexity, further enabling efficient, end-to-end acceleration of Transformer models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14262",
        "abs_url": "https://arxiv.org/abs/2601.14262",
        "pdf_url": "https://arxiv.org/pdf/2601.14262",
        "title": "On Meta-Evaluation",
        "authors": [
            "Hongxiao Li",
            "Chenxi Wang",
            "Fanda Fan",
            "Zihan Wang",
            "Wanling Gao",
            "Lei Wang",
            "Jianfeng Zhan"
        ],
        "comments": "",
        "subjects": "Methodology (stat.ME); Artificial Intelligence (cs.AI); Human-Computer Interaction (cs.HC); Machine Learning (cs.LG)",
        "abstract": "Evaluation is the foundation of empirical science, yet the evaluation of evaluation itself -- so-called meta-evaluation -- remains strikingly underdeveloped. While methods such as observational studies, design of experiments (DoE), and randomized controlled trials (RCTs) have shaped modern scientific practice, there has been little systematic inquiry into their comparative validity and utility across domains. Here we introduce a formal framework for meta-evaluation by defining the evaluation space, its structured representation, and a benchmark we call AxiaBench. AxiaBench enables the first large-scale, quantitative comparison of ten widely used evaluation methods across eight representative application domains. Our analysis reveals a fundamental limitation: no existing method simultaneously achieves accuracy and efficiency across diverse scenarios, with DoE and observational designs in particular showing significant deviations from real-world ground truth. We further evaluate a unified method of entire-space stratified sampling from previous evaluatology research, and the results report that it consistently outperforms prior approaches across all tested domains. These results establish meta-evaluation as a scientific object in its own right and provide both a conceptual foundation and a pragmatic tool set for advancing trustworthy evaluation in computational and experimental research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14286",
        "abs_url": "https://arxiv.org/abs/2601.14286",
        "pdf_url": "https://arxiv.org/pdf/2601.14286",
        "title": "GNN-based Path-aware multi-view Circuit Learning for Technology Mapping",
        "authors": [
            "Wentao Jiang",
            "Jingxin Wang",
            "Zhang Hu",
            "Zhengyuan Shi",
            "Chengyu Ma",
            "Qiang Xu",
            "Weikang Qian",
            "Zhufei Chu"
        ],
        "comments": "7pages, 4figures",
        "subjects": "Emerging Technologies (cs.ET); Machine Learning (cs.LG)",
        "abstract": "Traditional technology mapping suffers from systemic inaccuracies in delay estimation due to its reliance on abstract, technology-agnostic delay models that fail to capture the nuanced timing behavior behavior of real post-mapping circuits. To address this fundamental limitation, we introduce GPA(graph neural network (GNN)-based Path-Aware multi-view circuit learning), a novel GNN framework that learns precise, data-driven delay predictions by synergistically fusing three complementary views of circuit structure: And-Inverter Graphs (AIGs)-based functional encoding, post-mapping technology emphasizes critical timing paths. Trained exclusively on real cell delays extracted from critical paths of industrial-grade post-mapping netlists, GPA learns to classify cut delays with unprecedented accuracy, directly informing smarter mapping decisions. Evaluated on the 19 EPFL combinational benchmarks, GPA achieves 19.9%, 2.1% and 4.1% average delay reduction over the conventional heuristics methods (techmap, MCH) and the prior state-of-the-art ML-based approach SLAP, respectively-without compromising area efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14330",
        "abs_url": "https://arxiv.org/abs/2601.14330",
        "pdf_url": "https://arxiv.org/pdf/2601.14330",
        "title": "LURE: Latent Space Unblocking for Multi-Concept Reawakening in Diffusion Models",
        "authors": [
            "Mengyu Sun",
            "Ziyuan Yang",
            "Andrew Beng Jin Teoh",
            "Junxu Liu",
            "Haibo Hu",
            "Yi Zhang"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Concept erasure aims to suppress sensitive content in diffusion models, but recent studies show that erased concepts can still be reawakened, revealing vulnerabilities in erasure methods. Existing reawakening methods mainly rely on prompt-level optimization to manipulate sampling trajectories, neglecting other generative factors, which limits a comprehensive understanding of the underlying dynamics. In this paper, we model the generation process as an implicit function to enable a comprehensive theoretical analysis of multiple factors, including text conditions, model parameters, and latent states. We theoretically show that perturbing each factor can reawaken erased concepts. Building on this insight, we propose a novel concept reawakening method: Latent space Unblocking for concept REawakening (LURE), which reawakens erased concepts by reconstructing the latent space and guiding the sampling trajectory. Specifically, our semantic re-binding mechanism reconstructs the latent space by aligning denoising predictions with target distributions to reestablish severed text-visual associations. However, in multi-concept scenarios, naive reconstruction can cause gradient conflicts and feature entanglement. To address this, we introduce Gradient Field Orthogonalization, which enforces feature orthogonality to prevent mutual interference. Additionally, our Latent Semantic Identification-Guided Sampling (LSIS) ensures stability of the reawakening process via posterior density verification. Extensive experiments demonstrate that LURE enables simultaneous, high-fidelity reawakening of multiple erased concepts across diverse erasure tasks and methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14340",
        "abs_url": "https://arxiv.org/abs/2601.14340",
        "pdf_url": "https://arxiv.org/pdf/2601.14340",
        "title": "Turn-Based Structural Triggers: Prompt-Free Backdoors in Multi-Turn LLMs",
        "authors": [
            "Yiyang Lu",
            "Jinwen He",
            "Yue Zhao",
            "Kai Chen",
            "Ruigang Liang"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) are widely integrated into interactive systems such as dialogue agents and task-oriented assistants. This growing ecosystem also raises supply-chain risks, where adversaries can distribute poisoned models that degrade downstream reliability and user trust. Existing backdoor attacks and defenses are largely prompt-centric, focusing on user-visible triggers while overlooking structural signals in multi-turn conversations. We propose Turn-based Structural Trigger (TST), a backdoor attack that activates from dialogue structure, using the turn index as the trigger and remaining independent of user inputs. Across four widely used open-source LLM models, TST achieves an average attack success rate (ASR) of 99.52% with minimal utility degradation, and remains effective under five representative defenses with an average ASR of 98.04%. The attack also generalizes well across instruction datasets, maintaining an average ASR of 99.19%. Our results suggest that dialogue structure constitutes an important and under-studied attack surface for multi-turn LLM systems, motivating structure-aware auditing and mitigation in practice.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14349",
        "abs_url": "https://arxiv.org/abs/2601.14349",
        "pdf_url": "https://arxiv.org/pdf/2601.14349",
        "title": "MARBLE: Multi-Agent Reasoning for Bioinformatics Learning and Evolution",
        "authors": [
            "Sunghyun Kim",
            "Seokwoo Yun",
            "Youngseo Yun",
            "Youngrak Lee",
            "Sangsoo Lim"
        ],
        "comments": "",
        "subjects": "Multiagent Systems (cs.MA); Machine Learning (cs.LG)",
        "abstract": "Motivation: Developing high-performing bioinformatics models typically requires repeated cycles of hypothesis formulation, architectural redesign, and empirical validation, making progress slow, labor-intensive, and difficult to reproduce. Although recent LLM-based assistants can automate isolated steps, they lack performance-grounded reasoning and stability-aware mechanisms required for reliable, iterative model improvement in bioinformatics workflows. Results: We introduce MARBLE, an execution-stable autonomous model refinement framework for bioinformatics models. MARBLE couples literature-aware reference selection with structured, debate-driven architectural reasoning among role-specialized agents, followed by autonomous execution, evaluation, and memory updates explicitly grounded in empirical performance. Across spatial transcriptomics domain segmentation, drug-target interaction prediction, and drug response prediction, MARBLE consistently achieves sustained performance improvements over strong baselines across multiple refinement cycles, while maintaining high execution robustness and low regression rates. Framework-level analyses demonstrate that structured debate, balanced evidence selection, and performance-grounded memory are critical for stable, repeatable model evolution, rather than single-run or brittle gains. Availability: Source code, data and Supplementary Information are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14377",
        "abs_url": "https://arxiv.org/abs/2601.14377",
        "pdf_url": "https://arxiv.org/pdf/2601.14377",
        "title": "Cosmo-FOLD: Fast generation and upscaling of field-level cosmological maps with overlap latent diffusion",
        "authors": [
            "Satvik Mishra",
            "Roberto Trotta",
            "Matteo Viel"
        ],
        "comments": "15 pages, 10 figures",
        "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)",
        "abstract": "We demonstrate the capabilities of probabilistic diffusion models to reduce dramatically the computational cost of expensive hydrodynamical simulations to study the relationship between observable baryonic cosmological probes and dark matter at field level and well into the non-linear regime. We introduce a novel technique, Cosmo-FOLD (Cosmological Fields via Overlap Latent Diffusion) to rapidly generate accurate and arbitrarily large cosmological and astrophysical 3-dimensional fields, conditioned on a given input field. We are able to generate TNG300-2 dark matter density and gas temperature fields from a model trained only on ~1% of the volume (a process we refer to as `upscaling'), reproducing both large scale coherent dark matter filaments and power spectra to within 10% for wavenumbers k <= 5 h Mpc^-1. These results are obtained within a small fraction of the original simulation cost and produced on a single GPU. Beyond one and two points statistics, the bispectrum is also faithfully reproduced through the inclusion of positional encodings. Finally, we demonstrate Cosmo-FOLD's generalisation capabilities by upscaling a CAMELS volume of 25 (Mpc h^-1)^3 to a full TNG300-2 volume of 205 (Mpc h^-1)^3$ with no fine-tuning. Cosmo-FOLD opens the door to full field-level simulation-based inference on cosmological scale.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14430",
        "abs_url": "https://arxiv.org/abs/2601.14430",
        "pdf_url": "https://arxiv.org/pdf/2601.14430",
        "title": "Meta Flow Maps enable scalable reward alignment",
        "authors": [
            "Peter Potaptchik",
            "Adhi Saravanan",
            "Abbas Mammadov",
            "Alvaro Prat",
            "Michael S. Albergo",
            "Yee Whye Teh"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Controlling generative models is computationally expensive. This is because optimal alignment with a reward function--whether via inference-time steering or fine-tuning--requires estimating the value function. This task demands access to the conditional posterior $p_{1|t}(x_1|x_t)$, the distribution of clean data $x_1$ consistent with an intermediate state $x_t$, a requirement that typically compels methods to resort to costly trajectory simulations. To address this bottleneck, we introduce Meta Flow Maps (MFMs), a framework extending consistency models and flow maps into the stochastic regime. MFMs are trained to perform stochastic one-step posterior sampling, generating arbitrarily many i.i.d. draws of clean data $x_1$ from any intermediate state. Crucially, these samples provide a differentiable reparametrization that unlocks efficient value function estimation. We leverage this capability to solve bottlenecks in both paradigms: enabling inference-time steering without inner rollouts, and facilitating unbiased, off-policy fine-tuning to general rewards. Empirically, our single-particle steered-MFM sampler outperforms a Best-of-1000 baseline on ImageNet across multiple rewards at a fraction of the compute.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14438",
        "abs_url": "https://arxiv.org/abs/2601.14438",
        "pdf_url": "https://arxiv.org/pdf/2601.14438",
        "title": "Vision-Based Natural Language Scene Understanding for Autonomous Driving: An Extended Dataset and a New Model for Traffic Scene Description Generation",
        "authors": [
            "Danial Sadrian Zadeh",
            "Otman A. Basir",
            "Behzad Moshiri"
        ],
        "comments": "Under review at Computer Vision and Image Understanding (submitted July 25, 2025)",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Traffic scene understanding is essential for enabling autonomous vehicles to accurately perceive and interpret their environment, thereby ensuring safe navigation. This paper presents a novel framework that transforms a single frontal-view camera image into a concise natural language description, effectively capturing spatial layouts, semantic relationships, and driving-relevant cues. The proposed model leverages a hybrid attention mechanism to enhance spatial and semantic feature extraction and integrates these features to generate contextually rich and detailed scene descriptions. To address the limited availability of specialized datasets in this domain, a new dataset derived from the BDD100K dataset has been developed, with comprehensive guidelines provided for its construction. Furthermore, the study offers an in-depth discussion of relevant evaluation metrics, identifying the most appropriate measures for this task. Extensive quantitative evaluations using metrics such as CIDEr and SPICE, complemented by human judgment assessments, demonstrate that the proposed model achieves strong performance and effectively fulfills its intended objectives on the newly developed dataset.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14456",
        "abs_url": "https://arxiv.org/abs/2601.14456",
        "pdf_url": "https://arxiv.org/pdf/2601.14456",
        "title": "On the Generalization Gap in LLM Planning: Tests and Verifier-Reward RL",
        "authors": [
            "Valerio Belcamino",
            "Nicholas Attolino",
            "Alessio Capitanelli",
            "Fulvio Mastrogiovanni"
        ],
        "comments": "9 pages, 4 figures, 3 tables, 2 pages of supplementary materials. Submitted to a conference implementing a double-blind review process",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Recent work shows that fine-tuned Large Language Models (LLMs) can achieve high valid plan rates on PDDL planning tasks. However, it remains unclear whether this reflects transferable planning competence or domain-specific memorization. In this work, we fine-tune a 1.7B-parameter LLM on 40,000 domain-problem-plan tuples from 10 IPC 2023 domains, and evaluate both in-domain and cross-domain generalization. While the model reaches 82.9% valid plan rate in in-domain conditions, it achieves 0% on two unseen domains. To analyze this failure, we introduce three diagnostic interventions, namely (i) instance-wise symbol anonymization, (ii) compact plan serialization, and (iii) verifier-reward fine-tuning using the VAL validator as a success-focused reinforcement signal. Symbol anonymization and compact serialization cause significant performance drops despite preserving plan semantics, thus revealing strong sensitivity to surface representations. Verifier-reward fine-tuning reaches performance saturation in half the supervised training epochs, but does not improve cross-domain generalization. For the explored configurations, in-domain performance plateaus around 80%, while cross-domain performance collapses, suggesting that our fine-tuned model relies heavily on domain-specific patterns rather than transferable planning competence in this setting. Our results highlight a persistent generalization gap in LLM-based planning and provide diagnostic tools for studying its causes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14505",
        "abs_url": "https://arxiv.org/abs/2601.14505",
        "pdf_url": "https://arxiv.org/pdf/2601.14505",
        "title": "Uncovering and Understanding FPR Manipulation Attack in Industrial IoT Networks",
        "authors": [
            "Mohammad Shamim Ahsan",
            "Peng Liu"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "In the network security domain, due to practical issues -- including imbalanced data and heterogeneous legitimate network traffic -- adversarial attacks in machine learning-based NIDSs have been viewed as attack packets misclassified as benign. Due to this prevailing belief, the possibility of (maliciously) perturbed benign packets being misclassified as attack has been largely ignored. In this paper, we demonstrate that this is not only theoretically possible, but also a particular threat to NIDS. In particular, we uncover a practical cyberattack, FPR manipulation attack (FPA), especially targeting industrial IoT networks, where domain-specific knowledge of the widely used MQTT protocol is exploited and a systematic simple packet-level perturbation is performed to alter the labels of benign traffic samples without employing traditional gradient-based or non-gradient-based methods. The experimental evaluations demonstrate that this novel attack results in a success rate of 80.19% to 100%. In addition, while estimating impacts in the Security Operations Center, we observe that even a small fraction of false positive alerts, irrespective of different budget constraints and alert traffic intensities, can increase the delay of genuine alerts investigations up to 2 hr in a single day under normal operating conditions. Furthermore, a series of relevant statistical and XAI analyses is conducted to understand the key factors behind this remarkable success. Finally, we explore the effectiveness of the FPA packets to enhance models' robustness through adversarial training and investigate the changes in decision boundaries accordingly.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14515",
        "abs_url": "https://arxiv.org/abs/2601.14515",
        "pdf_url": "https://arxiv.org/pdf/2601.14515",
        "title": "Large Data Limits of Laplace Learning for Gaussian Measure Data in Infinite Dimensions",
        "authors": [
            "Zhengang Zhong",
            "Yury Korolev",
            "Matthew Thorpe"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "Laplace learning is a semi-supervised method, a solution for finding missing labels from a partially labeled dataset utilizing the geometry given by the unlabeled data points. The method minimizes a Dirichlet energy defined on a (discrete) graph constructed from the full dataset. In finite dimensions the asymptotics in the large (unlabeled) data limit are well understood with convergence from the graph setting to a continuum Sobolev semi-norm weighted by the Lebesgue density of the data-generating measure. The lack of the Lebesgue measure on infinite-dimensional spaces requires rethinking the analysis if the data aren't finite-dimensional. In this paper we make a first step in this direction by analyzing the setting when the data are generated by a Gaussian measure on a Hilbert space and proving pointwise convergence of the graph Dirichlet energy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14525",
        "abs_url": "https://arxiv.org/abs/2601.14525",
        "pdf_url": "https://arxiv.org/pdf/2601.14525",
        "title": "Towards Execution-Grounded Automated AI Research",
        "authors": [
            "Chenglei Si",
            "Zitong Yang",
            "Yejin Choi",
            "Emmanuel Candès",
            "Diyi Yang",
            "Tatsunori Hashimoto"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Automated AI research holds great potential to accelerate scientific discovery. However, current LLMs often generate plausible-looking but ineffective ideas. Execution grounding may help, but it is unclear whether automated execution is feasible and whether LLMs can learn from the execution feedback. To investigate these, we first build an automated executor to implement ideas and launch large-scale parallel GPU experiments to verify their effectiveness. We then convert two realistic research problems - LLM pre-training and post-training - into execution environments and demonstrate that our automated executor can implement a large fraction of the ideas sampled from frontier LLMs. We analyze two methods to learn from the execution feedback: evolutionary search and reinforcement learning. Execution-guided evolutionary search is sample-efficient: it finds a method that significantly outperforms the GRPO baseline (69.4% vs 48.0%) on post-training, and finds a pre-training recipe that outperforms the nanoGPT baseline (19.7 minutes vs 35.9 minutes) on pre-training, all within just ten search epochs. Frontier LLMs often generate meaningful algorithmic ideas during search, but they tend to saturate early and only occasionally exhibit scaling trends. Reinforcement learning from execution reward, on the other hand, suffers from mode collapse. It successfully improves the average reward of the ideator model but not the upper-bound, due to models converging on simple ideas. We thoroughly analyze the executed ideas and training dynamics to facilitate future efforts towards execution-grounded automated AI research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14528",
        "abs_url": "https://arxiv.org/abs/2601.14528",
        "pdf_url": "https://arxiv.org/pdf/2601.14528",
        "title": "LLM Security and Safety: Insights from Homotopy-Inspired Prompt Obfuscation",
        "authors": [
            "Luis Lazo",
            "Hamed Jelodar",
            "Roozbeh Razavi-Far"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "In this study, we propose a homotopy-inspired prompt obfuscation framework to enhance understanding of security and safety vulnerabilities in Large Language Models (LLMs). By systematically applying carefully engineered prompts, we demonstrate how latent model behaviors can be influenced in unexpected ways. Our experiments encompassed 15,732 prompts, including 10,000 high-priority cases, across LLama, Deepseek, KIMI for code generation, and Claude to verify. The results reveal critical insights into current LLM safeguards, highlighting the need for more robust defense mechanisms, reliable detection strategies, and improved resilience. Importantly, this work provides a principled framework for analyzing and mitigating potential weaknesses, with the goal of advancing safe, responsible, and trustworthy AI technologies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14569",
        "abs_url": "https://arxiv.org/abs/2601.14569",
        "pdf_url": "https://arxiv.org/pdf/2601.14569",
        "title": "Social Caption: Evaluating Social Understanding in Multimodal Models",
        "authors": [
            "Bhaavanaa Thumu",
            "Leena Mathur",
            "Youssouf Kebe",
            "Louis-Philippe Morency"
        ],
        "comments": "24 pages",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Social understanding abilities are crucial for multimodal large language models (MLLMs) to interpret human social interactions. We introduce Social Caption, a framework grounded in interaction theory to evaluate social understanding abilities of MLLMs along three dimensions: Social Inference (SI), the ability to make accurate inferences about interactions; Holistic Social Analysis (HSA), the ability to generate comprehensive descriptions of interactions; Directed Social Analysis (DSA), the ability to extract relevant social information from interactions. We analyze factors influencing model performance in social understanding, such as scale, architectural design, and spoken context. Experiments with MLLM judges contribute insights about scaling automated evaluation of multimodal social understanding.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14605",
        "abs_url": "https://arxiv.org/abs/2601.14605",
        "pdf_url": "https://arxiv.org/pdf/2601.14605",
        "title": "U-Harmony: Enhancing Joint Training for Segmentation Models with Universal Harmonization",
        "authors": [
            "Weiwei Ma",
            "Xiaobing Yu",
            "Peijie Qiu",
            "Jin Yang",
            "Pan Xiao",
            "Xiaoqi Zhao",
            "Xiaofeng Liu",
            "Tomo Miyazaki",
            "Shinichiro Omachi",
            "Yongsong Huang"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "In clinical practice, medical segmentation datasets are often limited and heterogeneous, with variations in modalities, protocols, and anatomical targets across institutions. Existing deep learning models struggle to jointly learn from such diverse data, often sacrificing either generalization or domain-specific knowledge. To overcome these challenges, we propose a joint training method called Universal Harmonization (U-Harmony), which can be integrated into deep learning-based architectures with a domain-gated head, enabling a single segmentation model to learn from heterogeneous datasets simultaneously. By integrating U-Harmony, our approach sequentially normalizes and then denormalizes feature distributions to mitigate domain-specific variations while preserving original dataset-specific knowledge. More appealingly, our framework also supports universal modality adaptation, allowing the seamless learning of new imaging modalities and anatomical classes. Extensive experiments on cross-institutional brain lesion datasets demonstrate the effectiveness of our approach, establishing a new benchmark for robust and adaptable 3D medical image segmentation models in real-world clinical settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14620",
        "abs_url": "https://arxiv.org/abs/2601.14620",
        "pdf_url": "https://arxiv.org/pdf/2601.14620",
        "title": "Scaling Ambiguity: Augmenting Human Annotation in Speech Emotion Recognition with Audio-Language Models",
        "authors": [
            "Wenda Zhang",
            "Hongyu Jin",
            "Siyi Wang",
            "Zhiqiang Wei",
            "Ting Dang"
        ],
        "comments": "Accepted by ICASSP 2026",
        "subjects": "Audio and Speech Processing (eess.AS); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Sound (cs.SD)",
        "abstract": "Speech Emotion Recognition models typically use single categorical labels, overlooking the inherent ambiguity of human emotions. Ambiguous Emotion Recognition addresses this by representing emotions as probability distributions, but progress is limited by unreliable ground-truth distributions inferred from sparse human annotations. This paper explores whether Large Audio-Language Models (ALMs) can mitigate the annotation bottleneck by generating high-quality synthetic annotations. We introduce a framework leveraging ALMs to create Synthetic Perceptual Proxies, augmenting human annotations to improve ground-truth distribution reliability. We validate these proxies through statistical analysis of their alignment with human distributions and evaluate their impact by fine-tuning ALMs with the augmented emotion distributions. Furthermore, to address class imbalance and enable unbiased evaluation, we propose DiME-Aug, a Distribution-aware Multimodal Emotion Augmentation strategy. Experiments on IEMOCAP and MSP-Podcast show that synthetic annotations enhance emotion distribution, especially in low-ambiguity regions where annotation agreement is high. However, benefits diminish for highly ambiguous emotions with greater human disagreement. This work provides the first evidence that ALMs could address annotation scarcity in ambiguous emotion recognition, but highlights the need for more advanced prompting or generation strategies to handle highly ambiguous cases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14629",
        "abs_url": "https://arxiv.org/abs/2601.14629",
        "pdf_url": "https://arxiv.org/pdf/2601.14629",
        "title": "Online Linear Programming with Replenishment",
        "authors": [
            "Yuze Chen",
            "Yuan Zhou",
            "Baichuan Mo",
            "Jie Ying",
            "Yufei Ruan",
            "Zhou Ye"
        ],
        "comments": "63 pages, 12 figures",
        "subjects": "Optimization and Control (math.OC); Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG)",
        "abstract": "We study an online linear programming (OLP) model in which inventory is not provided upfront but instead arrives gradually through an exogenous stochastic replenishment process. This replenishment-based formulation captures operational settings, such as e-commerce fulfillment, perishable supply chains, and renewable-powered systems, where resources are accumulated gradually and initial inventories are small or zero. The introduction of dispersed, uncertain replenishment fundamentally alters the structure of classical OLPs, creating persistent stockout risk and eliminating advance knowledge of the total budget. We develop new algorithms and regret analyses for three major distributional regimes studied in the OLP literature: bounded distributions, finite-support distributions, and continuous-support distributions with a non-degeneracy condition. For bounded distributions, we design an algorithm that achieves $\\widetilde{\\mathcal{O}}(\\sqrt{T})$ regret. For finite-support distributions with a non-degenerate induced LP, we obtain $\\mathcal{O}(\\log T)$ regret, and we establish an $\\Omega(\\sqrt{T})$ lower bound for degenerate instances, demonstrating a sharp separation from the classical setting where $\\mathcal{O}(1)$ regret is achievable. For continuous-support, non-degenerate distributions, we develop a two-stage accumulate-then-convert algorithm that achieves $\\mathcal{O}(\\log^2 T)$ regret, comparable to the $\\mathcal{O}(\\log T)$ regret in classical OLPs. Together, these results provide a near-complete characterization of the optimal regret achievable in OLP with replenishment. Finally, we empirically evaluate our algorithms and demonstrate their advantages over natural adaptations of classical OLP methods in the replenishment setting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14631",
        "abs_url": "https://arxiv.org/abs/2601.14631",
        "pdf_url": "https://arxiv.org/pdf/2601.14631",
        "title": "Semi-Supervised Mixture Models under the Concept of Missing at Radom with Margin Confidence and Aranda Ordaz Function",
        "authors": [
            "Jinyang Liao",
            "Ziyang Lyu"
        ],
        "comments": "8 pages, 7 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Computation (stat.CO); Methodology (stat.ME)",
        "abstract": "This paper presents a semi-supervised learning framework for Gaussian mixture modelling under a Missing at Random (MAR) mechanism. The method explicitly parameterizes the missingness mechanism by modelling the probability of missingness as a function of classification uncertainty. To quantify classification uncertainty, we introduce margin confidence and incorporate the Aranda Ordaz (AO) link function to flexibly capture the asymmetric relationships between uncertainty and missing probability. Based on this formulation, we develop an efficient Expectation Conditional Maximization (ECM) algorithm that jointly estimates all parameters appearing in both the Gaussian mixture model (GMM) and the missingness mechanism, and subsequently imputes the missing labels by a Bayesian classifier derived from the fitted mixture model. This method effectively alleviates the bias induced by ignoring the missingness mechanism while enhancing the robustness of semi-supervised learning. The resulting uncertainty-aware framework delivers reliable classification performance in realistic MAR scenarios with substantial proportions of missing labels.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14647",
        "abs_url": "https://arxiv.org/abs/2601.14647",
        "pdf_url": "https://arxiv.org/pdf/2601.14647",
        "title": "TRSVR: An Adaptive Stochastic Trust-Region Method with Variance Reduction",
        "authors": [
            "Yuchen Fang",
            "Xinshou Zheng",
            "Javad Lavaei"
        ],
        "comments": "22 pages",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We propose a stochastic trust-region method for unconstrained nonconvex optimization that incorporates stochastic variance-reduced gradients (SVRG) to accelerate convergence. Unlike classical trust-region methods, the proposed algorithm relies solely on stochastic gradient information and does not require function value evaluations. The trust-region radius is adaptively adjusted based on a radius-control parameter and the stochastic gradient estimate. Under mild assumptions, we establish that the algorithm converges in expectation to a first-order stationary point. Moreover, the method achieves iteration and sample complexity bounds that match those of SVRG-based first-order methods, while allowing stochastic and potentially gradient-dependent second-order information. Extensive numerical experiments demonstrate that incorporating SVRG accelerates convergence, and that the use of trust-region methods and Hessian information further improves performance. We also highlight the impact of batch size and inner-loop length on efficiency, and show that the proposed method outperforms SGD and Adam on several machine learning tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14678",
        "abs_url": "https://arxiv.org/abs/2601.14678",
        "pdf_url": "https://arxiv.org/pdf/2601.14678",
        "title": "Transfer Learning from One Cancer to Another via Deep Learning Domain Adaptation",
        "authors": [
            "Justin Cheung",
            "Samuel Savine",
            "Calvin Nguyen",
            "Lin Lu",
            "Alhassan S. Yasin"
        ],
        "comments": "8 pages, 6 figures, 3 table",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE); Tissues and Organs (q-bio.TO)",
        "abstract": "Supervised deep learning models often achieve excellent performance within their training distribution but struggle to generalize beyond it. In cancer histopathology, for example, a convolutional neural network (CNN) may classify cancer severity accurately for cancer types represented in its training data, yet fail on related but unseen types. Although adenocarcinomas from different organs share morphological features that might support limited cross-domain generalization, addressing domain shift directly is necessary for robust performance. Domain adaptation offers a way to transfer knowledge from labeled data in one cancer type to unlabeled data in another, helping mitigate the scarcity of annotated medical images. This work evaluates cross-domain classification performance among lung, colon, breast, and kidney adenocarcinomas. A ResNet50 trained on any single adenocarcinoma achieves over 98% accuracy on its own domain but shows minimal generalization to others. Ensembling multiple supervised models does not resolve this limitation. In contrast, converting the ResNet50 into a domain adversarial neural network (DANN) substantially improves performance on unlabeled target domains. A DANN trained on labeled breast and colon data and adapted to unlabeled lung data reaches 95.56% accuracy. We also examine the impact of stain normalization on domain adaptation. Its effects vary by target domain: for lung, accuracy drops from 95.56% to 66.60%, while for breast and colon targets, stain normalization boosts accuracy from 49.22% to 81.29% and from 78.48% to 83.36%, respectively. Finally, using Integrated Gradients reveals that DANNs consistently attribute importance to biologically meaningful regions such as densely packed nuclei, indicating that the model learns clinically relevant features and can apply them to unlabeled cancer types.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14705",
        "abs_url": "https://arxiv.org/abs/2601.14705",
        "pdf_url": "https://arxiv.org/pdf/2601.14705",
        "title": "Proximal Policy Optimization with Evolutionary Mutations",
        "authors": [
            "Casimir Czworkowski",
            "Stephen Hornish",
            "Alhassan S. Yasin"
        ],
        "comments": "10 pages, 5 figures, 2 tables, 1 algorithm",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Artificial Intelligence (cs.AI); Computer Science and Game Theory (cs.GT); Machine Learning (cs.LG)",
        "abstract": "Proximal Policy Optimization (PPO) is a widely used reinforcement learning algorithm known for its stability and sample efficiency, but it often suffers from premature convergence due to limited exploration. In this paper, we propose POEM (Proximal Policy Optimization with Evolutionary Mutations), a novel modification to PPO that introduces an adaptive exploration mechanism inspired by evolutionary algorithms. POEM enhances policy diversity by monitoring the Kullback-Leibler (KL) divergence between the current policy and a moving average of previous policies. When policy changes become minimal, indicating stagnation, POEM triggers an adaptive mutation of policy parameters to promote exploration. We evaluate POEM on four OpenAI Gym environments: CarRacing, MountainCar, BipedalWalker, and LunarLander. Through extensive fine-tuning using Bayesian optimization techniques and statistical testing using Welch's t-test, we find that POEM significantly outperforms PPO on three of the four tasks (BipedalWalker: t=-2.0642, p=0.0495; CarRacing: t=-6.3987, p=0.0002; MountainCar: t=-6.2431, p<0.0001), while performance on LunarLander is not statistically significant (t=-1.8707, p=0.0778). Our results highlight the potential of integrating evolutionary principles into policy gradient methods to overcome exploration-exploitation tradeoffs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14711",
        "abs_url": "https://arxiv.org/abs/2601.14711",
        "pdf_url": "https://arxiv.org/pdf/2601.14711",
        "title": "DARA: Few-shot Budget Allocation in Online Advertising via In-Context Decision Making with RL-Finetuned LLMs",
        "authors": [
            "Mingxuan Song",
            "Yusen Huo",
            "Bohan Zhou",
            "Shenglin Yin",
            "Zhen Xiao",
            "Jieyi Long",
            "Zhilin Zhang",
            "Chuan Yu"
        ],
        "comments": "Accepted at The ACM Web Conference (WWW) 2026",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Optimizing the advertiser's cumulative value of winning impressions under budget constraints poses a complex challenge in online advertising, under the paradigm of AI-Generated Bidding (AIGB). Advertisers often have personalized objectives but limited historical interaction data, resulting in few-shot scenarios where traditional reinforcement learning (RL) methods struggle to perform effectively. Large Language Models (LLMs) offer a promising alternative for AIGB by leveraging their in-context learning capabilities to generalize from limited data. However, they lack the numerical precision required for fine-grained optimization. To address this limitation, we introduce GRPO-Adaptive, an efficient LLM post-training strategy that enhances both reasoning and numerical precision by dynamically updating the reference policy during training. Built upon this foundation, we further propose DARA, a novel dual-phase framework that decomposes the decision-making process into two stages: a few-shot reasoner that generates initial plans via in-context prompting, and a fine-grained optimizer that refines these plans using feedback-driven reasoning. This separation allows DARA to combine LLMs' in-context learning strengths with precise adaptability required by AIGB tasks. Extensive experiments on both real-world and synthetic data environments demonstrate that our approach consistently outperforms existing baselines in terms of cumulative advertiser value under budget constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14728",
        "abs_url": "https://arxiv.org/abs/2601.14728",
        "pdf_url": "https://arxiv.org/pdf/2601.14728",
        "title": "AQAScore: Evaluating Semantic Alignment in Text-to-Audio Generation via Audio Question Answering",
        "authors": [
            "Chun-Yi Kuan",
            "Kai-Wei Chang",
            "Hung-yi Lee"
        ],
        "comments": "Manuscript in progress",
        "subjects": "Audio and Speech Processing (eess.AS); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG); Sound (cs.SD)",
        "abstract": "Although text-to-audio generation has made remarkable progress in realism and diversity, the development of evaluation metrics has not kept pace. Widely-adopted approaches, typically based on embedding similarity like CLAPScore, effectively measure general relevance but remain limited in fine-grained semantic alignment and compositional reasoning. To address this, we introduce AQAScore, a backbone-agnostic evaluation framework that leverages the reasoning capabilities of audio-aware large language models (ALLMs). AQAScore reformulates assessment as a probabilistic semantic verification task; rather than relying on open-ended text generation, it estimates alignment by computing the exact log-probability of a \"Yes\" answer to targeted semantic queries. We evaluate AQAScore across multiple benchmarks, including human-rated relevance, pairwise comparison, and compositional reasoning tasks. Experimental results show that AQAScore consistently achieves higher correlation with human judgments than similarity-based metrics and generative prompting baselines, showing its effectiveness in capturing subtle semantic inconsistencies and scaling with the capability of underlying ALLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14731",
        "abs_url": "https://arxiv.org/abs/2601.14731",
        "pdf_url": "https://arxiv.org/pdf/2601.14731",
        "title": "ARFT-Transformer: Modeling Metric Dependencies for Cross-Project Aging-Related Bug Prediction",
        "authors": [
            "Shuning Ge",
            "Fangyun Qin",
            "Xiaohui Wan",
            "Yang Liu",
            "Qian Dai",
            "Zheng Zheng"
        ],
        "comments": "Accepted by The Journal of Systems & Software (JSS), 2026",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Software systems that run for long periods often suffer from software aging, which is typically caused by Aging-Related Bugs (ARBs). To mitigate the risk of ARBs early in the development phase, ARB prediction has been introduced into software aging research. However, due to the difficulty of collecting ARBs, within-project ARB prediction faces the challenge of data scarcity, leading to the proposal of cross-project ARB prediction. This task faces two major challenges: 1) domain adaptation issue caused by distribution difference between source and target projects; and 2) severe class imbalance between ARB-prone and ARB-free samples. Although various methods have been proposed for cross-project ARB prediction, existing approaches treat the input metrics independently and often neglect the rich inter-metric dependencies, which can lead to overlapping information and misjudgment of metric importance, potentially affecting the model's performance. Moreover, they typically use cross-entropy as the loss function during training, which cannot distinguish the difficulty of sample classification. To overcome these limitations, we propose ARFT-Transformer, a transformer-based cross-project ARB prediction framework that introduces a metric-level multi-head attention mechanism to capture metric interactions and incorporates Focal Loss function to effectively handle class imbalance. Experiments conducted on three large-scale open-source projects demonstrate that ARFT-Transformer on average outperforms state-of-the-art cross-project ARB prediction methods in both single-source and multi-source cases, achieving up to a 29.54% and 19.92% improvement in Balance metric.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14794",
        "abs_url": "https://arxiv.org/abs/2601.14794",
        "pdf_url": "https://arxiv.org/pdf/2601.14794",
        "title": "RANDSMAPs: Random-Feature/multi-Scale Neural Decoders with Mass Preservation",
        "authors": [
            "Dimitrios G. Patsatzis",
            "Alessandro Della Pia",
            "Lucia Russo",
            "Constantinos Siettos"
        ],
        "comments": "47 pages (23 in main text, 24 in Appendix), 19 figures (4 in main text, 15 in Appendix), 10 Tables (in Appendix)",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "We introduce RANDSMAPs (Random-feature/multi-scale neural decoders with Mass Preservation), numerical analysis-informed, explainable neural decoders designed to explicitly respect conservation laws when solving the challenging ill-posed pre-image problem in manifold learning. We start by proving the equivalence of vanilla random Fourier feature neural networks to Radial Basis Function interpolation and the double Diffusion Maps (based on Geometric Harmonics) decoders in the deterministic limit. We then establish the theoretical foundations for RANDSMAP and introduce its multiscale variant to capture structures across multiple scales. We formulate and derive the closed-form solution of the corresponding constrained optimization problem and prove the mass preservation property. Numerically, we assess the performance of RANDSMAP on three benchmark problems/datasets with mass preservation obtained by the Lighthill-Whitham-Richards traffic flow PDE with shock waves, 2D rotated MRI brain images, and the Hughes crowd dynamics PDEs. We demonstrate that RANDSMAPs yield high reconstruction accuracy at low computational cost and maintain mass conservation at single-machine precision. In its vanilla formulation, the scheme remains applicable to the classical pre-image problem, i.e., when mass-preservation constraints are not imposed.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14810",
        "abs_url": "https://arxiv.org/abs/2601.14810",
        "pdf_url": "https://arxiv.org/pdf/2601.14810",
        "title": "Learning and extrapolating scale-invariant processes",
        "authors": [
            "Anaclara Alvez-Canepa",
            "Cyril Furtlehner",
            "François Landes"
        ],
        "comments": "29p, 22 figures",
        "subjects": "Disordered Systems and Neural Networks (cond-mat.dis-nn); Machine Learning (cs.LG)",
        "abstract": "Machine Learning (ML) has deeply changed some fields recently, like Language and Vision and we may expect it to be relevant also to the analysis of of complex systems. Here we want to tackle the question of how and to which extent can one regress scale-free processes, i.e. processes displaying power law behavior, like earthquakes or avalanches? We are interested in predicting the large ones, i.e. rare events in the training set which therefore require extrapolation capabilities of the model. For this we consider two paradigmatic problems that are statistically self-similar. The first one is a 2-dimensional fractional Gaussian field obeying linear dynamics, self-similar by construction and amenable to exact analysis. The second one is the Abelian sandpile model, exhibiting self-organized criticality. The emerging paradigm of Geometric Deep Learning shows that including known symmetries into the model's architecture is key to success. Here one may hope to extrapolate only by leveraging scale invariance. This is however a peculiar symmetry, as it involves possibly non-trivial coarse-graining operations and anomalous scaling. We perform experiments on various existing architectures like U-net, Riesz network (scale invariant by construction), or our own proposals: a wavelet-decomposition based Graph Neural Network (with discrete scale symmetry), a Fourier embedding layer and a Fourier-Mellin Neural Operator. Based on these experiments and a complete characterization of the linear case, we identify the main issues relative to spectral biases and coarse-grained representations, and discuss how to alleviate them with the relevant inductive biases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14872",
        "abs_url": "https://arxiv.org/abs/2601.14872",
        "pdf_url": "https://arxiv.org/pdf/2601.14872",
        "title": "Finite-Sample Inference for Sparsely Permuted Linear Regression",
        "authors": [
            "Hirofumi Ota",
            "Masaaki Imaizumi"
        ],
        "comments": "",
        "subjects": "Statistics Theory (math.ST); Machine Learning (cs.LG); Methodology (stat.ME); Machine Learning (stat.ML)",
        "abstract": "We study a noisy linear observation model with an unknown permutation called permuted/shuffled linear regression, where responses and covariates are mismatched and the permutation forms a discrete, factorial-size parameter. This unknown permutation is a key component of the data-generating process, yet its statistical investigation remains challenging due to its discrete nature. In this study, we develop a general statistical inference framework on the permutation and regression coefficients. First, we introduce a localization step that reduces the permutation space to a small candidate set building on recent advances in the repro samples method, whose miscoverage decays polynomially with the number of Monte Carlo samples. Then, based on this localized set, we provide statistical inference procedures: a conditional Monte Carlo test of permutation structures with valid finite-sample Type-I error control. We also develop coefficient inference that remains valid under alignment uncertainty of permutations. For computational purposes, we develop a linear assignment problem computable in polynomial time complexity and demonstrate that its solution asymptotically converges to that of the conventional least squares problem with large computational cost. Extensions to partially permuted designs and ridge regularization are also discussed. Extensive simulations and an application to Beijing air-quality data corroborate finite-sample validity, strong power to detect mismatches, and practical scalability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.14877",
        "abs_url": "https://arxiv.org/abs/2601.14877",
        "pdf_url": "https://arxiv.org/pdf/2601.14877",
        "title": "ExoMiner++ 2.0: Vetting TESS Full-Frame Image Transit Signals",
        "authors": [
            "Miguel J. S. Martinho",
            "Hamed Valizadegan",
            "Jon M. Jenkins",
            "Douglas A. Caldwell",
            "Joseph D. Twicken",
            "Ben Tofflemire",
            "Marziye Jafariyazani"
        ],
        "comments": "",
        "subjects": "Earth and Planetary Astrophysics (astro-ph.EP); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)",
        "abstract": "The Transiting Exoplanet Survey Satellite (TESS) Full-Frame Images (FFIs) provide photometric time series for millions of stars, enabling transit searches beyond the limited set of pre-selected 2-minute targets. However, FFIs present additional challenges for transit identification and vetting. In this work, we apply ExoMiner++ 2.0, an adaptation of the ExoMiner++ framework originally developed for TESS 2-minute data, to FFI light curves. The model is used to perform large-scale planet versus non-planet classification of Threshold Crossing Events across the sectors analyzed in this study. We construct a uniform vetting catalog of all evaluated signals and assess model performance under different observing conditions. We find that ExoMiner++ 2.0 generalizes effectively to the FFI domain, providing robust discrimination between planetary signals, astrophysical false positives, and instrumental artifacts despite the limitations inherent to longer cadence data. This work extends the applicability of ExoMiner++ to the full TESS dataset and supports future population studies and follow-up prioritization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15014",
        "abs_url": "https://arxiv.org/abs/2601.15014",
        "pdf_url": "https://arxiv.org/pdf/2601.15014",
        "title": "Efficient and Minimax-optimal In-context Nonparametric Regression with Transformers",
        "authors": [
            "Michelle Ching",
            "Ioana Popescu",
            "Nico Smith",
            "Tianyi Ma",
            "William G. Underwood",
            "Richard J. Samworth"
        ],
        "comments": "31 pages, 6 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "We study in-context learning for nonparametric regression with $\\alpha$-Hölder smooth regression functions, for some $\\alpha>0$. We prove that, with $n$ in-context examples and $d$-dimensional regression covariates, a pretrained transformer with $\\Theta(\\log n)$ parameters and $\\Omega\\bigl(n^{2\\alpha/(2\\alpha+d)}\\log^3 n\\bigr)$ pretraining sequences can achieve the minimax-optimal rate of convergence $O\\bigl(n^{-2\\alpha/(2\\alpha+d)}\\bigr)$ in mean squared error. Our result requires substantially fewer transformer parameters and pretraining sequences than previous results in the literature. This is achieved by showing that transformers are able to approximate local polynomial estimators efficiently by implementing a kernel-weighted polynomial basis and then running gradient descent.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15074",
        "abs_url": "https://arxiv.org/abs/2601.15074",
        "pdf_url": "https://arxiv.org/pdf/2601.15074",
        "title": "SmartOracle - An Agentic Approach to Mitigate Noise in Differential Oracles",
        "authors": [
            "Srinath Srinivasan",
            "Tim Menzies",
            "Marcelo D'Amorim"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Differential fuzzers detect bugs by executing identical inputs across distinct implementations of the same specification, such as JavaScript interpreters. Validating the outputs requires an oracle and for differential testing of JavaScript, these are constructed manually, making them expensive, time-consuming, and prone to false positives. Worse, when the specification evolves, this manual effort must be repeated. Inspired by the success of agentic systems in other SE domains, this paper introduces SmartOracle. SmartOracle decomposes the manual triage workflow into specialized Large Language Model (LLM) sub-agents. These agents synthesize independently gathered evidence from terminal runs and targeted specification queries to reach a final verdict. For historical benchmarks, SmartOracle achieves 0.84 recall with an 18% false positive rate. Compared to a sequential Gemini 2.5 Pro baseline, it improves triage accuracy while reducing analysis time by 4$\\times$ and API costs by 10$\\times$. In active fuzzing campaigns, SmartOracle successfully identified and reported previously unknown specification-level issues across major engines, including bugs in V8, JavaScriptCore, and GraalJS. The success of SmartOracle's agentic architecture on Javascript suggests it might be useful other software systems- a research direction we will explore in future work.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15083",
        "abs_url": "https://arxiv.org/abs/2601.15083",
        "pdf_url": "https://arxiv.org/pdf/2601.15083",
        "title": "Bangla Music Genre Classification Using Bidirectional LSTMS",
        "authors": [
            "Muntakimur Rahaman",
            "Md Mahmudul Hoque",
            "Md Mehedi Hassain"
        ],
        "comments": "",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG)",
        "abstract": "Bangla music is enrich in its own music cultures. Now a days music genre classification is very significant because of the exponential increase in available music, both in digital and physical formats. It is necessary to index them accordingly to facilitate improved retrieval. Automatically classifying Bangla music by genre is essential for efficiently locating specific pieces within a vast and diverse music library. Prevailing methods for genre classification predominantly employ conventional machine learning or deep learning approaches. This work introduces a novel music dataset comprising ten distinct genres of Bangla music. For the task of audio classification, we utilize a recurrent neural network (RNN) architecture. Specifically, a Long Short-Term Memory (LSTM) network is implemented to train the model and perform the classification. Feature extraction represents a foundational stage in audio data processing. This study utilizes Mel-Frequency Cepstral Coefficients (MFCCs) to transform raw audio waveforms into a compact and representative set of features. The proposed framework facilitates music genre classification by leveraging these extracted features. Experimental results demonstrate a classification accuracy of 78%, indicating the system's strong potential to enhance and streamline the organization of Bangla music genres.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15106",
        "abs_url": "https://arxiv.org/abs/2601.15106",
        "pdf_url": "https://arxiv.org/pdf/2601.15106",
        "title": "One scale to rule them all: interpretable multi-scale Deep Learning for predicting cell survival after proton and carbon ion irradiation",
        "authors": [
            "Giulio Bordieri",
            "Giorgio Cartechini",
            "Anna Bianchi",
            "Anna Selva",
            "Valeria Conte",
            "Marta Missiaggia",
            "Francesco G. Cordoni"
        ],
        "comments": "",
        "subjects": "Biological Physics (physics.bio-ph); Machine Learning (cs.LG)",
        "abstract": "The relationship between the physical characteristics of the radiation field and biological damage is central to both radiotherapy and radioprotection, yet the link between spatial scales of energy deposition and biological effects remains not entirely understood. To address this, we developed an interpretable deep learning model that predicts cell survival after proton and carbon ion irradiation, leveraging sequential attention to highlight relevant features and provide insight into the contribution of different energy deposition scales. Trained and tested on the PIDE dataset, our model incorporates, beside LET, nanodosimetric and microdosimetric quantities simulated with MC-Startrack and Open-TOPAS, enabling multi-scale characterization. While achieving high predictive accuracy, our approach also emphasizes transparency in decision-making. We demonstrate high accuracy in predicting RBE for in vitro experiments. Multiple scales are utilized concurrently, with no single spatial scale being predominant. Quantities defined at smaller spatial domains generally have a greater influence, whereas the LET plays a lesser role.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15118",
        "abs_url": "https://arxiv.org/abs/2601.15118",
        "pdf_url": "https://arxiv.org/pdf/2601.15118",
        "title": "WavLink: Compact Audio--Text Embeddings with a Global Whisper Token",
        "authors": [
            "Gokul Karthik Kumar",
            "Ludovick Lepauloux",
            "Hakim Hacid"
        ],
        "comments": "Accepted at ICASSP 2026",
        "subjects": "Sound (cs.SD); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Whisper has become the de-facto encoder for extracting general-purpose audio features in large audio-language models, where a 30-second clip is typically represented by 1500 frame features projected into an LLM. In contrast, audio-text embedding models like CLAP-based models have largely relied on alternative audio encoders (e.g., HTS-AT, PaSST), and have not leveraged Whisper effectively. We present WavLink, a compact audio-text embedding model that augments Whisper encoder with a learnable global token, trained jointly with a text encoder. Through a systematic study of design choices, including pretrained text encoders, loss functions, training modes, and data mixtures, we identify configurations that yield state-of-the-art retrieval performance. Our two-stage training recipe across three model sizes, combined with Matryoshka-style supervision, improves scalability, enabling 8x smaller embeddings with minimal performance drop. WavLink also demonstrates competitive performance on AIR-Bench with MCQs and zero-shot classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15165",
        "abs_url": "https://arxiv.org/abs/2601.15165",
        "pdf_url": "https://arxiv.org/pdf/2601.15165",
        "title": "The Flexibility Trap: Why Arbitrary Order Limits Reasoning Potential in Diffusion Language Models",
        "authors": [
            "Zanlin Ni",
            "Shenzhi Wang",
            "Yang Yue",
            "Tianyu Yu",
            "Weilin Zhao",
            "Yeguo Hua",
            "Tianyi Chen",
            "Jun Song",
            "Cheng Yu",
            "Bo Zheng",
            "Gao Huang"
        ],
        "comments": "Code and pre-trained models: this https URL",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Diffusion Large Language Models (dLLMs) break the rigid left-to-right constraint of traditional LLMs, enabling token generation in arbitrary orders. Intuitively, this flexibility implies a solution space that strictly supersets the fixed autoregressive trajectory, theoretically unlocking superior reasoning potential for general tasks like mathematics and coding. Consequently, numerous works have leveraged reinforcement learning (RL) to elicit the reasoning capability of dLLMs. In this paper, we reveal a counter-intuitive reality: arbitrary order generation, in its current form, narrows rather than expands the reasoning boundary of dLLMs. We find that dLLMs tend to exploit this order flexibility to bypass high-uncertainty tokens that are crucial for exploration, leading to a premature collapse of the solution space. This observation challenges the premise of existing RL approaches for dLLMs, where considerable complexities, such as handling combinatorial trajectories and intractable likelihoods, are often devoted to preserving this flexibility. We demonstrate that effective reasoning is better elicited by intentionally forgoing arbitrary order and applying standard Group Relative Policy Optimization (GRPO) instead. Our approach, JustGRPO, is minimalist yet surprisingly effective (e.g., 89.1% accuracy on GSM8K) while fully retaining the parallel decoding ability of dLLMs. Project page: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15239",
        "abs_url": "https://arxiv.org/abs/2601.15239",
        "pdf_url": "https://arxiv.org/pdf/2601.15239",
        "title": "Multi-context principal component analysis",
        "authors": [
            "Kexin Wang",
            "Salil Bhate",
            "João M. Pereira",
            "Joe Kileel",
            "Matylda Figlerowicz",
            "Anna Seigal"
        ],
        "comments": "47 pages, 8 figures. Supplementary tables are provided as downloadable file",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "Principal component analysis (PCA) is a tool to capture factors that explain variation in data. Across domains, data are now collected across multiple contexts (for example, individuals with different diseases, cells of different types, or words across texts). While the factors explaining variation in data are undoubtedly shared across subsets of contexts, no tools currently exist to systematically recover such factors. We develop multi-context principal component analysis (MCPCA), a theoretical and algorithmic framework that decomposes data into factors shared across subsets of contexts. Applied to gene expression, MCPCA reveals axes of variation shared across subsets of cancer types and an axis whose variability in tumor cells, but not mean, is associated with lung cancer progression. Applied to contextualized word embeddings from language models, MCPCA maps stages of a debate on human nature, revealing a discussion between science and fiction over decades. These axes are not found by combining data across contexts or by restricting to individual contexts. MCPCA is a principled generalization of PCA to address the challenge of understanding factors underlying data across contexts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2026-01-22",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-22?abs=True",
        "arxiv_id": "2601.15275",
        "abs_url": "https://arxiv.org/abs/2601.15275",
        "pdf_url": "https://arxiv.org/pdf/2601.15275",
        "title": "RayRoPE: Projective Ray Positional Encoding for Multi-view Attention",
        "authors": [
            "Yu Wu",
            "Minsik Jeon",
            "Jen-Hao Rick Chang",
            "Oncel Tuzel",
            "Shubham Tulsiani"
        ],
        "comments": "Project page: this https URL",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "We study positional encodings for multi-view transformers that process tokens from a set of posed input images, and seek a mechanism that encodes patches uniquely, allows SE(3)-invariant attention with multi-frequency similarity, and can be adaptive to the geometry of the underlying scene. We find that prior (absolute or relative) encoding schemes for multi-view attention do not meet the above desiderata, and present RayRoPE to address this gap. RayRoPE represents patch positions based on associated rays but leverages a predicted point along the ray instead of the direction for a geometry-aware encoding. To achieve SE(3) invariance, RayRoPE computes query-frame projective coordinates for computing multi-frequency similarity. Lastly, as the 'predicted' 3D point along a ray may not be precise, RayRoPE presents a mechanism to analytically compute the expected position encoding under uncertainty. We validate RayRoPE on the tasks of novel-view synthesis and stereo depth estimation and show that it consistently improves over alternate position encoding schemes (e.g. 15% relative improvement on LPIPS in CO3D). We also show that RayRoPE can seamlessly incorporate RGB-D input, resulting in even larger gains over alternatives that cannot positionally encode this information.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]