[
    {
        "order": 1,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16730",
        "abs_url": "https://arxiv.org/abs/2602.16730",
        "pdf_url": "https://arxiv.org/pdf/2602.16730",
        "title": "MMCAformer: Macro-Micro Cross-Attention Transformer for Traffic Speed Prediction with Microscopic Connected Vehicle Driving Behavior",
        "authors": [
            "Lei Han",
            "Mohamed Abdel-Aty",
            "Younggun Kim",
            "Yang-Jun Joo",
            "Zubayer Islam"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Accurate speed prediction is crucial for proactive traffic management to enhance traffic efficiency and safety. Existing studies have primarily relied on aggregated, macroscopic traffic flow data to predict future traffic trends, whereas road traffic dynamics are also influenced by individual, microscopic human driving behaviors. Recent Connected Vehicle (CV) data provide rich driving behavior features, offering new opportunities to incorporate these behavioral insights into speed prediction. To this end, we propose the Macro-Micro Cross-Attention Transformer (MMCAformer) to integrate CV data-based micro driving behavior features with macro traffic features for speed prediction. Specifically, MMCAformer employs self-attention to learn intrinsic dependencies in macro traffic flow and cross-attention to capture spatiotemporal interplays between macro traffic status and micro driving behavior. MMCAformer is optimized with a Student-t negative log-likelihood loss to provide point-wise speed prediction and estimate uncertainty. Experiments on four Florida freeways demonstrate the superior performance of the proposed MMCAformer compared to baselines. Compared with only using macro features, introducing micro driving behavior features not only enhances prediction accuracy (e.g., overall RMSE, MAE, and MAPE reduced by 9.0%, 6.9%, and 10.2%, respectively) but also shrinks model prediction uncertainty (e.g., mean predictive intervals decreased by 10.1-24.0% across the four freeways). Results reveal that hard braking and acceleration frequencies emerge as the most influential features. Such improvements are more pronounced under congested, low-speed traffic conditions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16735",
        "abs_url": "https://arxiv.org/abs/2602.16735",
        "pdf_url": "https://arxiv.org/pdf/2602.16735",
        "title": "A Few-Shot LLM Framework for Extreme Day Classification in Electricity Markets",
        "authors": [
            "Saud Alghumayjan",
            "Ming Yi",
            "Bolun Xu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "This paper proposes a few-shot classification framework based on Large Language Models (LLMs) to predict whether the next day will have spikes in real-time electricity prices. The approach aggregates system state information, including electricity demand, renewable generation, weather forecasts, and recent electricity prices, into a set of statistical features that are formatted as natural-language prompts and fed to an LLM along with general instructions. The model then determines the likelihood that the next day would be a spike day and reports a confidence score. Using historical data from the Texas electricity market, we demonstrate that this few-shot approach achieves performance comparable to supervised machine learning models, such as Support Vector Machines and XGBoost, and outperforms the latter two when limited historical data are available. These findings highlight the potential of LLMs as a data-efficient tool for classifying electricity price spikes in settings with scarce data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16739",
        "abs_url": "https://arxiv.org/abs/2602.16739",
        "pdf_url": "https://arxiv.org/pdf/2602.16739",
        "title": "Real-time Secondary Crash Likelihood Prediction Excluding Post Primary Crash Features",
        "authors": [
            "Lei Han",
            "Mohamed Abdel-Aty",
            "Zubayer Islam",
            "Chenzhu Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Secondary crash likelihood prediction is a critical component of an active traffic management system to mitigate congestion and adverse impacts caused by secondary crashes. However, existing approaches mainly rely on post-crash features (e.g., crash type and severity) that are rarely available in real time, limiting their practical applicability. To address this limitation, we propose a hybrid secondary crash likelihood prediction framework that does not depend on post-crash features. A dynamic spatiotemporal window is designed to extract real-time traffic flow and environmental features from primary crash locations and their upstream segments. The framework includes three models: a primary crash model to estimate the likelihood of secondary crash occurrence, and two secondary crash models to evaluate traffic conditions at crash and upstream segments under different comparative scenarios. An ensemble learning strategy integrating six machine learning algorithms is developed to enhance predictive performance, and a voting-based mechanism combines the outputs of the three models. Experiments on Florida freeways demonstrate that the proposed hybrid framework correctly identifies 91% of secondary crashes with a low false alarm rate of 0.20. The Area Under the ROC Curve improves from 0.654, 0.744, and 0.902 for the individual models to 0.952 for the hybrid model, outperforming previous studies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16742",
        "abs_url": "https://arxiv.org/abs/2602.16742",
        "pdf_url": "https://arxiv.org/pdf/2602.16742",
        "title": "DeepVision-103K: A Visually Diverse, Broad-Coverage, and Verifiable Mathematical Dataset for Multimodal Reasoning",
        "authors": [
            "Haoxiang Sun",
            "Lizhen Xu",
            "Bing Zhao",
            "Wotao Yin",
            "Wei Wang",
            "Boyu Yang",
            "Rui Wang",
            "Hu Wei"
        ],
        "comments": "Under review",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Reinforcement Learning with Verifiable Rewards (RLVR) has been shown effective in enhancing the visual reflection and reasoning capabilities of Large Multimodal Models (LMMs). However, existing datasets are predominantly derived from either small-scale manual construction or recombination of prior resources, which limits data diversity and coverage, thereby constraining further gains in model performance. To this end, we introduce \\textbf{DeepVision-103K}, a comprehensive dataset for RLVR training that covers diverse K12 mathematical topics, extensive knowledge points, and rich visual elements. Models trained on DeepVision achieve strong performance on multimodal mathematical benchmarks, and generalize effectively to general multimodal reasoning tasks. Further analysis reveals enhanced visual perception, reflection and reasoning capabilities in trained models, validating DeepVision's effectiveness for advancing multimodal reasoning. Data: \\href{this https URL}{this url}.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16746",
        "abs_url": "https://arxiv.org/abs/2602.16746",
        "pdf_url": "https://arxiv.org/pdf/2602.16746",
        "title": "Low-Dimensional and Transversely Curved Optimization Dynamics in Grokking",
        "authors": [
            "Yongzhong Xu"
        ],
        "comments": "29 pages, 22 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Grokking -- the delayed transition from memorization to generalization in small algorithmic tasks -- remains poorly understood. We present a geometric analysis of optimization dynamics in transformers trained on modular arithmetic. PCA of attention weight trajectories reveals that training evolves predominantly within a low-dimensional execution subspace, with a single principal component capturing 68-83% of trajectory variance. To probe loss-landscape geometry, we measure commutator defects -- the non-commutativity of successive gradient steps -- and project them onto this learned subspace. We find that curvature grows sharply in directions orthogonal to the execution subspace while the trajectory remains largely confined to it. Importantly, curvature growth consistently precedes generalization across learning rates and hyperparameter regimes, with the lead time obeying a power law in the grokking timescale. Causal intervention experiments show that motion along the learned subspace is necessary for grokking, while artificially increasing curvature is insufficient. Together, these results support a geometric account in which grokking reflects escape from a metastable regime characterized by low-dimensional confinement and transverse curvature accumulation. All findings replicate across this learning-rate range, a qualitatively different slow regime (lr=5e-5, wd=0.1, 3 layers), and three random seeds, though alignment dynamics differ quantitatively between regimes. Causal intervention experiments establish that orthogonal gradient flow is necessary but not sufficient for grokking: suppressing it prevents generalization with a monotonic dose-response across four operations, while artificially boosting curvature defects has no effect.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16762",
        "abs_url": "https://arxiv.org/abs/2602.16762",
        "pdf_url": "https://arxiv.org/pdf/2602.16762",
        "title": "Attending to Routers Aids Indoor Wireless Localization",
        "authors": [
            "Ayush Roy",
            "Tahsin Fuad Hassan",
            "Roshan Ayyalasomayajula",
            "Vishnu Suresh Lokhande"
        ],
        "comments": "AAAI 2026 Workshop on Machine Learning for Wireless Communication and Networks (ML4Wireless)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Networking and Internet Architecture (cs.NI)",
        "abstract": "Modern machine learning-based wireless localization using Wi-Fi signals continues to face significant challenges in achieving groundbreaking performance across diverse environments. A major limitation is that most existing algorithms do not appropriately weight the information from different routers during aggregation, resulting in suboptimal convergence and reduced accuracy. Motivated by traditional weighted triangulation methods, this paper introduces the concept of attention to routers, ensuring that each router's contribution is weighted differently when aggregating information from multiple routers for triangulation. We demonstrate, by incorporating attention layers into a standard machine learning localization architecture, that emphasizing the relevance of each router can substantially improve overall performance. We have also shown through evaluation over the open-sourced datasets and demonstrate that Attention to Routers outperforms the benchmark architecture by over 30% in accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16764",
        "abs_url": "https://arxiv.org/abs/2602.16764",
        "pdf_url": "https://arxiv.org/pdf/2602.16764",
        "title": "Machine Learning Argument of Latitude Error Model for LEO Satellite Orbit and Covariance Correction",
        "authors": [
            "Alex Moody",
            "Penina Axelrad",
            "Rebecca Russell"
        ],
        "comments": "Appearing in 2026 IEEE Aerospace Conference",
        "subjects": "Machine Learning (cs.LG); Robotics (cs.RO); Systems and Control (eess.SY)",
        "abstract": "Low Earth orbit (LEO) satellites are leveraged to support new position, navigation, and timing (PNT) service alternatives to GNSS. These alternatives require accurate propagation of satellite position and velocity with a realistic quantification of uncertainty. It is commonly assumed that the propagated uncertainty distribution is Gaussian; however, the validity of this assumption can be quickly compromised by the mismodeling of atmospheric drag. We develop a machine learning approach that corrects error growth in the argument of latitude for a diverse set of LEO satellites. The improved orbit propagation accuracy extends the applicability of the Gaussian assumption and modeling of the errors with a corrected mean and covariance. We compare the performance of a time-conditioned neural network and a Gaussian Process on datasets computed with an open source orbit propagator and publicly available Vector Covariance Message (VCM) ephemerides. The learned models predict the argument of latitude error as a Gaussian distribution given parameters from a single VCM epoch and reverse propagation errors. We show that this one-dimensional model captures the effect of mismodeled drag, which can be mapped to the Cartesian state space. The correction method only updates information along the dimensions of dominant error growth, while maintaining the physics-based propagation of VCM covariance in the remaining dimensions. We therefore extend the utility of VCM ephemerides to longer time horizons without modifying the functionality of the existing propagator.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16784",
        "abs_url": "https://arxiv.org/abs/2602.16784",
        "pdf_url": "https://arxiv.org/pdf/2602.16784",
        "title": "Omitted Variable Bias in Language Models Under Distribution Shift",
        "authors": [
            "Victoria Lin",
            "Louis-Philippe Morency",
            "Eli Ben-Michael"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL); Methodology (stat.ME)",
        "abstract": "Despite their impressive performance on a wide variety of tasks, modern language models remain susceptible to distribution shifts, exhibiting brittle behavior when evaluated on data that differs in distribution from their training data. In this paper, we describe how distribution shifts in language models can be separated into observable and unobservable components, and we discuss how established approaches for dealing with distribution shift address only the former. Importantly, we identify that the resulting omitted variable bias from unobserved variables can compromise both evaluation and optimization in language models. To address this challenge, we introduce a framework that maps the strength of the omitted variables to bounds on the worst-case generalization performance of language models under distribution shift. In empirical experiments, we show that using these bounds directly in language model evaluation and optimization provides more principled measures of out-of-distribution performance, improves true out-of-distribution performance relative to standard distribution shift adjustment methods, and further enables inference about the strength of the omitted variables when target distribution labels are available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16787",
        "abs_url": "https://arxiv.org/abs/2602.16787",
        "pdf_url": "https://arxiv.org/pdf/2602.16787",
        "title": "Better Think Thrice: Learning to Reason Causally with Double Counterfactual Consistency",
        "authors": [
            "Victoria Lin",
            "Xinnuo Xu",
            "Rachel Lawrence",
            "Risa Ueno",
            "Amit Sharma",
            "Javier Gonzalez",
            "Niranjani Prasad"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Despite their strong performance on reasoning benchmarks, large language models (LLMs) have proven brittle when presented with counterfactual questions, suggesting weaknesses in their causal reasoning ability. While recent work has demonstrated that labeled counterfactual tasks can be useful benchmarks of LLMs' causal reasoning, producing such data at the scale required to cover the vast potential space of counterfactuals is limited. In this work, we introduce double counterfactual consistency (DCC), a lightweight inference-time method for measuring and guiding the ability of LLMs to reason causally. Without requiring labeled counterfactual data, DCC verifies a model's ability to execute two important elements of causal reasoning: causal intervention and counterfactual prediction. Using DCC, we evaluate the causal reasoning abilities of various leading LLMs across a range of reasoning tasks and interventions. Moreover, we demonstrate the effectiveness of DCC as a training-free test-time rejection sampling criterion and show that it can directly improve performance on reasoning tasks across multiple model families.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16793",
        "abs_url": "https://arxiv.org/abs/2602.16793",
        "pdf_url": "https://arxiv.org/pdf/2602.16793",
        "title": "Escaping the Cognitive Well: Efficient Competition Math with Off-the-Shelf Models",
        "authors": [
            "Xingyu Dang",
            "Rohit Agarwal",
            "Rodrigo Porto",
            "Anirudh Goyal",
            "Liam H Fowl",
            "Sanjeev Arora"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In the past year, custom and unreleased math reasoning models reached gold medal performance on the International Mathematical Olympiad (IMO). Similar performance was then reported using large-scale inference on publicly available models but at prohibitive costs (e.g., 3000 USD per problem). In this work, we present an inference pipeline that attains best-in-class performance on IMO-style math problems at an average inference cost orders of magnitude below competing methods while using only general-purpose off-the-shelf models. Our method relies on insights about grader failure in solver-grader pipelines, which we call the Cognitive Well (iterative refinement converging to a wrong solution that the solver as well as the pipeline's internal grader consider to be basically correct). Our pipeline addresses these failure modes through conjecture extraction, wherein candidate lemmas are isolated from generated solutions and independently verified alongside their negations in a fresh environment (context detachment). On IMO-ProofBench Advanced (PB-Adv), our pipeline achieves 67.1 percent performance using Gemini 3.0 Pro with an average cost per question of approximately 31 USD. At the time of evaluation, this represented the state-of-the-art on PB-Adv among both public and unreleased models, and more than doubles the success rate of the next best publicly accessible pipeline, all at a fraction of the cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16796",
        "abs_url": "https://arxiv.org/abs/2602.16796",
        "pdf_url": "https://arxiv.org/pdf/2602.16796",
        "title": "Efficient Tail-Aware Generative Optimization via Flow Model Fine-Tuning",
        "authors": [
            "Zifan Wang",
            "Riccardo De Santi",
            "Xiaoyu Mo",
            "Michael M. Zavlanos",
            "Andreas Krause",
            "Karl H. Johansson"
        ],
        "comments": "33 pages",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Fine-tuning pre-trained diffusion and flow models to optimize downstream utilities is central to real-world deployment. Existing entropy-regularized methods primarily maximize expected reward, providing no mechanism to shape tail behavior. However, tail control is often essential: the lower tail determines reliability by limiting low-reward failures, while the upper tail enables discovery by prioritizing rare, high-reward outcomes. In this work, we present Tail-aware Flow Fine-Tuning (TFFT), a principled and efficient distributional fine-tuning algorithm based on the Conditional Value-at-Risk (CVaR). We address two distinct tail-shaping goals: right-CVaR for seeking novel samples in the high-reward tail and left-CVaR for controlling worst-case samples in the low-reward tail. Unlike prior approaches that rely on non-linear optimization, we leverage the variational dual formulation of CVaR to decompose it into a decoupled two-stage procedure: a lightweight one-dimensional threshold optimization step, and a single entropy-regularized fine-tuning process via a specific pseudo-reward. This decomposition achieves CVaR fine-tuning efficiently with computational cost comparable to standard expected fine-tuning methods. We demonstrate the effectiveness of TFFT across illustrative experiments, high-dimensional text-to-image generation, and molecular design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16821",
        "abs_url": "https://arxiv.org/abs/2602.16821",
        "pdf_url": "https://arxiv.org/pdf/2602.16821",
        "title": "TopoFlow: Physics-guided Neural Networks for high-resolution air quality prediction",
        "authors": [
            "Ammar Kheder",
            "Helmi Toropainen",
            "Wenqing Peng",
            "Samuel Antão",
            "Jia Chen",
            "Zhi-Song Liu",
            "Michael Boy"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose TopoFlow (Topography-aware pollutant Flow learning), a physics-guided neural network for efficient, high-resolution air quality prediction. To explicitly embed physical processes into the learning framework, we identify two critical factors governing pollutant dynamics: topography and wind direction. Complex terrain can channel, block, and trap pollutants, while wind acts as a primary driver of their transport and dispersion. Building on these insights, TopoFlow leverages a vision transformer architecture with two novel mechanisms: topography-aware attention, which explicitly models terrain-induced flow patterns, and wind-guided patch reordering, which aligns spatial representations with prevailing wind directions. Trained on six years of high-resolution reanalysis data assimilating observations from over 1,400 surface monitoring stations across China, TopoFlow achieves a PM2.5 RMSE of 9.71 ug/m3, representing a 71-80% improvement over operational forecasting systems and a 13% improvement over state-of-the-art AI baselines. Forecast errors remain well below China's 24-hour air quality threshold of 75 ug/m3 (GB 3095-2012), enabling reliable discrimination between clean and polluted conditions. These performance gains are consistent across all four major pollutants and forecast lead times from 12 to 96 hours, demonstrating that principled integration of physical knowledge into neural networks can fundamentally advance air quality prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16823",
        "abs_url": "https://arxiv.org/abs/2602.16823",
        "pdf_url": "https://arxiv.org/pdf/2602.16823",
        "title": "Formal Mechanistic Interpretability: Automated Circuit Discovery with Provable Guarantees",
        "authors": [
            "Itamar Hadad",
            "Guy Katz",
            "Shahaf Bassan"
        ],
        "comments": "To appear in ICLR 2026",
        "subjects": "Machine Learning (cs.LG); Logic in Computer Science (cs.LO)",
        "abstract": "*Automated circuit discovery* is a central tool in mechanistic interpretability for identifying the internal components of neural networks responsible for specific behaviors. While prior methods have made significant progress, they typically depend on heuristics or approximations and do not offer provable guarantees over continuous input domains for the resulting circuits. In this work, we leverage recent advances in neural network verification to propose a suite of automated algorithms that yield circuits with *provable guarantees*. We focus on three types of guarantees: (1) *input domain robustness*, ensuring the circuit agrees with the model across a continuous input region; (2) *robust patching*, certifying circuit alignment under continuous patching perturbations; and (3) *minimality*, formalizing and capturing a wide array of various notions of succinctness. Interestingly, we uncover a diverse set of novel theoretical connections among these three families of guarantees, with critical implications for the convergence of our algorithms. Finally, we conduct experiments with state-of-the-art verifiers on various vision models, showing that our algorithms yield circuits with substantially stronger robustness guarantees than standard circuit discovery methods, establishing a principled foundation for provable circuit discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16829",
        "abs_url": "https://arxiv.org/abs/2602.16829",
        "pdf_url": "https://arxiv.org/pdf/2602.16829",
        "title": "Learning under noisy supervision is governed by a feedback-truth gap",
        "authors": [
            "Elan Schonfeld",
            "Elias Wisnia"
        ],
        "comments": "33 pages, 5 figures, 10 extended data figures, 4 extended data tables; 10-page supplementary information",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "When feedback is absorbed faster than task structure can be evaluated, the learner will favor feedback over truth. A two-timescale model shows this feedback-truth gap is inevitable whenever the two rates differ and vanishes only when they match. We test this prediction across neural networks trained with noisy labels (30 datasets, 2,700 runs), human probabilistic reversal learning (N = 292), and human reward/punishment learning with concurrent EEG (N = 25). In each system, truth is defined operationally: held-out labels, the objectively correct option, or the participant's pre-feedback expectation - the only non-circular reference decodable from post-feedback EEG. The gap appeared universally but was regulated differently: dense networks accumulated it as memorization; sparse-residual scaffolding suppressed it; humans generated transient over-commitment that was actively recovered. Neural over-commitment (~0.04-0.10) was amplified tenfold into behavioral commitment (d = 3.3-3.9). The gap is a fundamental constraint on learning under noisy supervision; its consequences depend on the regulation each system employs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16837",
        "abs_url": "https://arxiv.org/abs/2602.16837",
        "pdf_url": "https://arxiv.org/pdf/2602.16837",
        "title": "A Residual-Aware Theory of Position Bias in Transformers",
        "authors": [
            "Hanna Herasimchyk",
            "Robin Labryga",
            "Tomislav Prusina",
            "Sören Laue"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Transformer models systematically favor certain token positions, yet the architectural origins of this position bias remain poorly understood. Under causal masking at infinite depth, prior theoretical analyses of attention rollout predict an inevitable collapse of attention onto the first token. Such collapse, however, does not occur in practice. We resolve this discrepancy with a residual-aware theory of cumulative attention rollout. By incorporating residual connections, we show that this architectural component prevents collapse under realistic conditions. At finite depth, we prove that causal Transformers induce a U-shaped position bias, with attention concentrating on early and late tokens. This result provides a principled architectural explanation for the Lost-in-the-Middle phenomenon.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16839",
        "abs_url": "https://arxiv.org/abs/2602.16839",
        "pdf_url": "https://arxiv.org/pdf/2602.16839",
        "title": "Training Large Reasoning Models Efficiently via Progressive Thought Encoding",
        "authors": [
            "Zeliang Zhang",
            "Xiaodong Liu",
            "Hao Cheng",
            "Hao Sun",
            "Chenliang Xu",
            "Jianfeng Gao"
        ],
        "comments": "ICLR 2026, 15 pages",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Large reasoning models (LRMs) excel on complex problems but face a critical barrier to efficiency: reinforcement learning (RL) training requires long rollouts for outcome-based rewards, where autoregressive decoding dominates time and memory usage. While sliding-window cache strategies can bound memory, they disrupt long-context reasoning and degrade performance. We introduce Progressive Thought Encoding, a parameter-efficient fine-tuning method that enables LRMs to reason effectively under fixed-size caches. By progressively encoding intermediate reasoning into fixed-size vector representations, our approach eliminates the need to backpropagate through full-cache rollouts, thereby reducing memory usage, while maintaining constant memory during inference. Experiments on three models, including Qwen2.5-3B-Instruct, Qwen2.5-7B-Instruct, and DeepSeek-R1-Distill-Llama-8B, on six widely used challenging mathematical benchmarks show consistent gains: our method achieves +19.3% improvement over LoRA-based fine-tuning and +29.9% over LRMs without fine-tuning on average, with up to +23.4 accuracy improvement on AIME2024/2025 under the same tight cache budgets. These results demonstrate that Progressive Thought Encoding not only improves reasoning accuracy but also makes RL training of LRMs substantially more efficient and scalable under real-world memory constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16842",
        "abs_url": "https://arxiv.org/abs/2602.16842",
        "pdf_url": "https://arxiv.org/pdf/2602.16842",
        "title": "What is the Value of Censored Data? An Exact Analysis for the Data-driven Newsvendor",
        "authors": [
            "Rachitesh Kumar",
            "Omar Mouchtaki"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study the offline data-driven newsvendor problem with censored demand data. In contrast to prior works where demand is fully observed, we consider the setting where demand is censored at the inventory level and only sales are observed; sales match demand when there is sufficient inventory, and equal the available inventory otherwise. We provide a general procedure to compute the exact worst-case regret of classical data-driven inventory policies, evaluated over all demand distributions. Our main technical result shows that this infinite-dimensional, non-convex optimization problem can be reduced to a finite-dimensional one, enabling an exact characterization of the performance of policies for any sample size and censoring levels. We leverage this reduction to derive sharp insights on the achievable performance of standard inventory policies under demand censoring. In particular, our analysis of the Kaplan-Meier policy shows that while demand censoring fundamentally limits what can be learned from passive sales data, just a small amount of targeted exploration at high inventory levels can substantially improve worst-case guarantees, enabling near-optimal performance even under heavy censoring. In contrast, when the point-of-sale system does not record stockout events and only reports realized sales, a natural and commonly used approach is to treat sales as demand. Our results show that policies based on this sales-as-demand heuristic can suffer severe performance degradation as censored data accumulates, highlighting how the quality of point-of-sale information critically shapes what can, and cannot, be learned offline.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16849",
        "abs_url": "https://arxiv.org/abs/2602.16849",
        "pdf_url": "https://arxiv.org/pdf/2602.16849",
        "title": "On the Mechanism and Dynamics of Modular Addition: Fourier Features, Lottery Ticket, and Grokking",
        "authors": [
            "Jianliang He",
            "Leda Wang",
            "Siyu Chen",
            "Zhuoran Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "We present a comprehensive analysis of how two-layer neural networks learn features to solve the modular addition task. Our work provides a full mechanistic interpretation of the learned model and a theoretical explanation of its training dynamics. While prior work has identified that individual neurons learn single-frequency Fourier features and phase alignment, it does not fully explain how these features combine into a global solution. We bridge this gap by formalizing a diversification condition that emerges during training when overparametrized, consisting of two parts: phase symmetry and frequency diversification. We prove that these properties allow the network to collectively approximate a flawed indicator function on the correct logic for the modular addition task. While individual neurons produce noisy signals, the phase symmetry enables a majority-voting scheme that cancels out noise, allowing the network to robustly identify the correct sum. Furthermore, we explain the emergence of these features under random initialization via a lottery ticket mechanism. Our gradient flow analysis proves that frequencies compete within each neuron, with the \"winner\" determined by its initial spectral magnitude and phase alignment. From a technical standpoint, we provide a rigorous characterization of the layer-wise phase coupling dynamics and formalize the competitive landscape using the ODE comparison lemma. Finally, we use these insights to demystify grokking, characterizing it as a three-stage process involving memorization followed by two generalization phases, driven by the competition between loss minimization and weight decay.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16876",
        "abs_url": "https://arxiv.org/abs/2602.16876",
        "pdf_url": "https://arxiv.org/pdf/2602.16876",
        "title": "ML-driven detection and reduction of ballast information in multi-modal datasets",
        "authors": [
            "Yaroslav Solovko"
        ],
        "comments": "20 pages, 27 figures, 10 tables",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Modern datasets often contain ballast as redundant or low-utility information that increases dimensionality, storage requirements, and computational cost without contributing meaningful analytical value. This study introduces a generalized, multimodal framework for ballast detection and reduction across structured, semi-structured, unstructured, and sparse data types. Using diverse datasets, entropy, mutual information, Lasso, SHAP, PCA, topic modelling, and embedding analysis are applied to identify and eliminate ballast features. A novel Ballast Score is proposed to integrate these signals into a unified, cross-modal pruning strategy. Experimental results demonstrate that significant portions of the feature space as often exceeding 70% in sparse or semi-structured data, can be pruned with minimal or even improved classification performance, along with substantial reductions in training time and memory footprint. The framework reveals distinct ballast typologies (e.g. statistical, semantic, infrastructural), and offers practical guidance for leaner, more efficient machine learning pipelines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16887",
        "abs_url": "https://arxiv.org/abs/2602.16887",
        "pdf_url": "https://arxiv.org/pdf/2602.16887",
        "title": "Construction of a classification model for dementia among Brazilian adults aged 50 and over",
        "authors": [
            "F. S. Menezes",
            "M. C. F. G. Barretto",
            "E. Q. C. Garcia",
            "T. A. E. Ferreira",
            "J. G. Alvez"
        ],
        "comments": "38 pages; 3 figures",
        "subjects": "Machine Learning (cs.LG); Neurons and Cognition (q-bio.NC)",
        "abstract": "To build a dementia classification model for middle-aged and elderly Brazilians, implemented in Python, combining variable selection and multivariable analysis, using low-cost variables with modification potential. Observational study with a predictive modeling approach using a cross-sectional design, aimed at estimating the chances of developing dementia, using data from the Brazilian Longitudinal Study of Aging (ELSI-Brazil), involving 9,412 participants. Dementia was determined based on neuropsychological assessment and informant-based cognitive function. Analyses were performed using Random Forest (RF) and multivariable logistic regression to estimate the risk of dementia in the middle-aged and elderly populations of Brazil. The prevalence of dementia was 9.6%. The highest odds of dementia were observed in illiterate individuals (Odds Ratio (OR) = 7.42), individuals aged 90 years or older (OR = 11.00), low weight (OR = 2.11), low handgrip strength (OR = 2.50), self-reported black skin color (OR = 1.47), physical inactivity (OR = 1.61), self-reported hearing loss (OR = 1.65), and presence of depressive symptoms (OR = 1.72). Higher education (OR=0.44), greater life satisfaction (OR=0.72), and being employed (OR=0.78) were protective factors. The RF model outperformed logistic regression, achieving an area under the ROC curve of 0.776, with a sensitivity of 0.708, a specificity of 0.702, an F1-score of 0.311, a G-means of 0.705, and an accuracy of 0.703. Conclusion: The findings reinforce the multidimensional nature of dementia and the importance of accessible factors for identifying vulnerable individuals. Strengthening public policies focused on promoting brain health can contribute significantly to the efficient allocation of resources in primary care and dementia prevention in Brazil",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16944",
        "abs_url": "https://arxiv.org/abs/2602.16944",
        "pdf_url": "https://arxiv.org/pdf/2602.16944",
        "title": "Exact Certification of Data-Poisoning Attacks Using Mixed-Integer Programming",
        "authors": [
            "Philip Sosnin",
            "Jodie Knapp",
            "Fraser Kennedy",
            "Josh Collyer",
            "Calvin Tsay"
        ],
        "comments": "Accepted to the 23rd International Conference on the Integration of Constraint Programming, Artificial Intelligence, and Operations Research (CPAIOR)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This work introduces a verification framework that provides both sound and complete guarantees for data poisoning attacks during neural network training. We formulate adversarial data manipulation, model training, and test-time evaluation in a single mixed-integer quadratic programming (MIQCP) problem. Finding the global optimum of the proposed formulation provably yields worst-case poisoning attacks, while simultaneously bounding the effectiveness of all possible attacks on the given training pipeline. Our framework encodes both the gradient-based training dynamics and model evaluation at test time, enabling the first exact certification of training-time robustness. Experimental evaluation on small models confirms that our approach delivers a complete characterization of robustness against data poisoning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16954",
        "abs_url": "https://arxiv.org/abs/2602.16954",
        "pdf_url": "https://arxiv.org/pdf/2602.16954",
        "title": "Neural Proposals, Symbolic Guarantees: Neuro-Symbolic Graph Generation with Hard Constraints",
        "authors": [
            "Chuqin Geng",
            "Li Zhang",
            "Mark Zhang",
            "Haolin Ye",
            "Ziyu Zhao",
            "Xujie Si"
        ],
        "comments": "18 pages, 6 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We challenge black-box purely deep neural approaches for molecules and graph generation, which are limited in controllability and lack formal guarantees. We introduce Neuro-Symbolic Graph Generative Modeling (NSGGM), a neurosymbolic framework that reapproaches molecule generation as a scaffold and interaction learning task with symbolic assembly. An autoregressive neural model proposes scaffolds and refines interaction signals, and a CPU-efficient SMT solver constructs full graphs while enforcing chemical validity, structural rules, and user-specific constraints, yielding molecules that are correct by construction and interpretable control that pure neural methods cannot provide. NSGGM delivers strong performance on both unconstrained generation and constrained generation tasks, demonstrating that neuro-symbolic modeling can match state-of-the-art generative performance while offering explicit controllability and guarantees. To evaluate more nuanced controllability, we also introduce a Logical-Constraint Molecular Benchmark, designed to test strict hard-rule satisfaction in workflows that require explicit, interpretable specifications together with verifiable compliance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16965",
        "abs_url": "https://arxiv.org/abs/2602.16965",
        "pdf_url": "https://arxiv.org/pdf/2602.16965",
        "title": "Multi-Agent Lipschitz Bandits",
        "authors": [
            "Sourav Chakraborty",
            "Amit Kiran Rege",
            "Claire Monteleoni",
            "Lijun Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study the decentralized multi-player stochastic bandit problem over a continuous, Lipschitz-structured action space where hard collisions yield zero reward. Our objective is to design a communication-free policy that maximizes collective reward, with coordination costs that are independent of the time horizon $T$. We propose a modular protocol that first solves the multi-agent coordination problem -- identifying and seating players on distinct high-value regions via a novel maxima-directed search -- and then decouples the problem into $N$ independent single-player Lipschitz bandits. We establish a near-optimal regret bound of $\\tilde{O}(T^{(d+1)/(d+2)})$ plus a $T$-independent coordination cost, matching the single-player rate. To our knowledge, this is the first framework providing such guarantees, and it extends to general distance-threshold collision models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16967",
        "abs_url": "https://arxiv.org/abs/2602.16967",
        "pdf_url": "https://arxiv.org/pdf/2602.16967",
        "title": "Early-Warning Signals of Grokking via Loss-Landscape Geometry",
        "authors": [
            "Yongzhong Xu"
        ],
        "comments": "26 pages, 13 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Grokking -- the abrupt transition from memorization to generalization after prolonged training -- has been linked to confinement on low-dimensional execution manifolds in modular arithmetic. Whether this mechanism extends beyond arithmetic remains open. We study two sequence-learning benchmarks: SCAN compositional generalization and Dyck-1 depth prediction. Across both tasks and a wide range of learning rates, the commutator defect -- a curvature measure derived from non-commuting gradient updates -- rises well before generalization, with lead times following a superlinear power law (alpha approximately 1.18 for SCAN, approximately 1.13 for Dyck), consistent with prior results on modular arithmetic. Weight-space PCA reveals that spectral concentration is not a universal precursor; the commutator defect is. Causal interventions demonstrate a mechanistic role: amplifying non-commutativity accelerates grokking (roughly 32% on SCAN, roughly 50% on Dyck), while suppressing orthogonal gradient flow delays or prevents it. The three task families form a spectrum of causal sensitivity -- modular arithmetic is rigid, Dyck is responsive, SCAN is intermediate -- yet suppression delays or prevents grokking in all cases, establishing necessity as a universal finding. These results identify the commutator defect as a robust, architecture-agnostic, causally implicated early-warning signal for delayed generalization in transformers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16977",
        "abs_url": "https://arxiv.org/abs/2602.16977",
        "pdf_url": "https://arxiv.org/pdf/2602.16977",
        "title": "Fail-Closed Alignment for Large Language Models",
        "authors": [
            "Zachary Coalson",
            "Beth Sohler",
            "Aiden Gabriel",
            "Sanghyun Hong"
        ],
        "comments": "Pre-print",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "We identify a structural weakness in current large language model (LLM) alignment: modern refusal mechanisms are fail-open. While existing approaches encode refusal behaviors across multiple latent features, suppressing a single dominant feature$-$via prompt-based jailbreaks$-$can cause alignment to collapse, leading to unsafe generation. Motivated by this, we propose fail-closed alignment as a design principle for robust LLM safety: refusal mechanisms should remain effective even under partial failures via redundant, independent causal pathways. We present a concrete instantiation of this principle: a progressive alignment framework that iteratively identifies and ablates previously learned refusal directions, forcing the model to reconstruct safety along new, independent subspaces. Across four jailbreak attacks, we achieve the strongest overall robustness while mitigating over-refusal and preserving generation quality, with small computational overhead. Our mechanistic analyses confirm that models trained with our method encode multiple, causally independent refusal directions that prompt-based jailbreaks cannot suppress simultaneously, providing empirical support for fail-closed alignment as a principled foundation for robust LLM safety.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16980",
        "abs_url": "https://arxiv.org/abs/2602.16980",
        "pdf_url": "https://arxiv.org/pdf/2602.16980",
        "title": "Discovering Universal Activation Directions for PII Leakage in Language Models",
        "authors": [
            "Leo Marchyok",
            "Zachary Coalson",
            "Sungho Keum",
            "Sooel Son",
            "Sanghyun Hong"
        ],
        "comments": "Pre-print",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Modern language models exhibit rich internal structure, yet little is known about how privacy-sensitive behaviors, such as personally identifiable information (PII) leakage, are represented and modulated within their hidden states. We present UniLeak, a mechanistic-interpretability framework that identifies universal activation directions: latent directions in a model's residual stream whose linear addition at inference time consistently increases the likelihood of generating PII across prompts. These model-specific directions generalize across contexts and amplify PII generation probability, with minimal impact on generation quality. UniLeak recovers such directions without access to training data or groundtruth PII, relying only on self-generated text. Across multiple models and datasets, steering along these universal directions substantially increases PII leakage compared to existing prompt-based extraction methods. Our results offer a new perspective on PII leakage: the superposition of a latent signal in the model's representations, enabling both risk amplification and mitigation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16994",
        "abs_url": "https://arxiv.org/abs/2602.16994",
        "pdf_url": "https://arxiv.org/pdf/2602.16994",
        "title": "Dynamic Delayed Tree Expansion For Improved Multi-Path Speculative Decoding",
        "authors": [
            "Rahul Thomas",
            "Teo Kitanovski",
            "Micah Goldblum",
            "Arka Pal"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multi-path speculative decoding accelerates lossless sampling from a target model by using a cheaper draft model to generate a draft tree of tokens, and then applies a verification algorithm that accepts a subset of these. While prior work has proposed various verification algorithms for i.i.d rollouts, their relative performance under matched settings remains unclear. In this work, we firstly present a systematic evaluation of verification strategies across model families, tasks, and sampling regimes, and find that Traversal Verification dominates consistently, with OT-based methods lagging far behind. Our analysis uncovers that this occurs because OT-based methods achieve high multi-token acceptance near the root of the draft tree, while multi-token gains are most impactful deeper in the draft tree, where draft and target distributions diverge. Based on this insight, we propose delayed tree expansion, which drafts a partial single path, delaying the i.i.d. branching point. We show that delayed tree expansion preserves the target distribution and improves on root-node i.i.d rollouts. Further, we develop a dynamic neural selector that estimates the expected block efficiency of optimal-transport-based verification methods from draft and target features, enabling context-dependent expansion decisions. Our neural selector allows OT-based methods like SpecInfer to outperform Traversal Verification for the first time, achieving 5% higher average throughput across a wide range of models, datasets, and sampling settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17004",
        "abs_url": "https://arxiv.org/abs/2602.17004",
        "pdf_url": "https://arxiv.org/pdf/2602.17004",
        "title": "Arcee Trinity Large Technical Report",
        "authors": [
            "Varun Singh",
            "Lucas Krauss",
            "Sami Jaghouar",
            "Matej Sirovatka",
            "Charles Goddard",
            "Fares Obied",
            "Jack Min Ong",
            "Jannik Straube",
            "Fern",
            "Aria Harley",
            "Conner Stewart",
            "Colin Kealty",
            "Maziyar Panahi",
            "Simon Kirsten",
            "Anushka Deshpande",
            "Anneketh Vij",
            "Arthur Bresnu",
            "Pranav Veldurthi",
            "Raghav Ravishankar",
            "Hardik Bishnoi",
            "DatologyAI Team",
            "Arcee AI Team",
            "Prime Intellect Team",
            "Mark McQuade",
            "Johannes Hagemann",
            "Lucas Atkins"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "We present the technical report for Arcee Trinity Large, a sparse Mixture-of-Experts model with 400B total parameters and 13B activated per token. Additionally, we report on Trinity Nano and Trinity Mini, with Trinity Nano having 6B total parameters with 1B activated per token, Trinity Mini having 26B total parameters with 3B activated per token. The models' modern architecture includes interleaved local and global attention, gated attention, depth-scaled sandwich norm, and sigmoid routing for Mixture-of-Experts. For Trinity Large, we also introduce a new MoE load balancing strategy titled Soft-clamped Momentum Expert Bias Updates (SMEBU). We train the models using the Muon optimizer. All three models completed training with zero loss spikes. Trinity Nano and Trinity Mini were pre-trained on 10 trillion tokens, and Trinity Large was pre-trained on 17 trillion tokens. The model checkpoints are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17009",
        "abs_url": "https://arxiv.org/abs/2602.17009",
        "pdf_url": "https://arxiv.org/pdf/2602.17009",
        "title": "Action-Graph Policies: Learning Action Co-dependencies in Multi-Agent Reinforcement Learning",
        "authors": [
            "Nikunj Gupta",
            "James Zachary Hare",
            "Jesse Milzman",
            "Rajgopal Kannan",
            "Viktor Prasanna"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Coordinating actions is the most fundamental form of cooperation in multi-agent reinforcement learning (MARL). Successful decentralized decision-making often depends not only on good individual actions, but on selecting compatible actions across agents to synchronize behavior, avoid conflicts, and satisfy global constraints. In this paper, we propose Action Graph Policies (AGP), that model dependencies among agents' available action choices. It constructs, what we call, \\textit{coordination contexts}, that enable agents to condition their decisions on global action dependencies. Theoretically, we show that AGPs induce a strictly more expressive joint policy compared to fully independent policies and can realize coordinated joint actions that are provably more optimal than greedy execution even from centralized value-decomposition methods. Empirically, we show that AGP achieves 80-95\\% success on canonical coordination tasks with partial observability and anti-coordination penalties, where other MARL methods reach only 10-25\\%. We further demonstrate that AGP consistently outperforms these baselines in diverse multi-agent environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17013",
        "abs_url": "https://arxiv.org/abs/2602.17013",
        "pdf_url": "https://arxiv.org/pdf/2602.17013",
        "title": "Malliavin Calculus as Stochastic Backpropogation",
        "authors": [
            "Kevin D. Oden"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We establish a rigorous connection between pathwise (reparameterization) and score-function (Malliavin) gradient estimators by showing that both arise from the Malliavin integration-by-parts identity. Building on this equivalence, we introduce a unified and variance-aware hybrid estimator that adaptively combines pathwise and Malliavin gradients using their empirical covariance structure. The resulting formulation provides a principled understanding of stochastic backpropagation and achieves minimum variance among all unbiased linear combinations, with closed-form finite-sample convergence bounds. We demonstrate 9% variance reduction on VAEs (CIFAR-10) and up to 35% on strongly-coupled synthetic problems. Exploratory policy gradient experiments reveal that non-stationary optimization landscapes present challenges for the hybrid approach, highlighting important directions for future work. Overall, this work positions Malliavin calculus as a conceptually unifying and practically interpretable framework for stochastic gradient estimation, clarifying when hybrid approaches provide tangible benefits and when they face inherent limitations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17025",
        "abs_url": "https://arxiv.org/abs/2602.17025",
        "pdf_url": "https://arxiv.org/pdf/2602.17025",
        "title": "WS-GRPO: Weakly-Supervised Group-Relative Policy Optimization for Rollout-Efficient Reasoning",
        "authors": [
            "Gagan Mundada",
            "Zihan Huang",
            "Rohan Surana",
            "Sheldon Yu",
            "Jennifer Yuntong Zhang",
            "Xintong Li",
            "Tong Yu",
            "Lina Yao",
            "Jingbo Shang",
            "Julian McAuley",
            "Junda Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Group Relative Policy Optimization (GRPO) is effective for training language models on complex reasoning. However, since the objective is defined relative to a group of sampled trajectories, extended deliberation can create more chances to realize relative gains, leading to inefficient reasoning and overthinking, and complicating the trade-off between correctness and rollout efficiency. Controlling this behavior is difficult in practice, considering (i) Length penalties are hard to calibrate because longer rollouts may reflect harder problems that require longer reasoning, penalizing tokens risks truncating useful reasoning along with redundant continuation; and (ii) supervision that directly indicates when to continue or stop is typically unavailable beyond final answer correctness. We propose Weakly Supervised GRPO (WS-GRPO), which improves rollout efficiency by converting terminal rewards into correctness-aware guidance over partial trajectories. Unlike global length penalties that are hard to calibrate, WS-GRPO trains a preference model from outcome-only correctness to produce prefix-level signals that indicate when additional continuation is beneficial. Thus, WS-GRPO supplies outcome-derived continue/stop guidance, reducing redundant deliberation while maintaining accuracy. We provide theoretical results and empirically show on reasoning benchmarks that WS-GRPO substantially reduces rollout length while remaining competitive with GRPO baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17028",
        "abs_url": "https://arxiv.org/abs/2602.17028",
        "pdf_url": "https://arxiv.org/pdf/2602.17028",
        "title": "Forecasting Anomaly Precursors via Uncertainty-Aware Time-Series Ensembles",
        "authors": [
            "Hyeongwon Kang",
            "Jinwoo Park",
            "Seunghun Han",
            "Pilsung Kang"
        ],
        "comments": "This manuscript contains 14 pages and 8 figures. It is currently under review at IEEE Transactions on Neural Networks and Learning Systems (TNNLS)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Detecting anomalies in time-series data is critical in domains such as industrial operations, finance, and cybersecurity, where early identification of abnormal patterns is essential for ensuring system reliability and enabling preventive maintenance. However, most existing methods are reactive: they detect anomalies only after they occur and lack the capability to provide proactive early warning signals. In this paper, we propose FATE (Forecasting Anomalies with Time-series Ensembles), a novel unsupervised framework for detecting Precursors-of-Anomaly (PoA) by quantifying predictive uncertainty from a diverse ensemble of time-series forecasting models. Unlike prior approaches that rely on reconstruction errors or require ground-truth labels, FATE anticipates future values and leverages ensemble disagreement to signal early signs of potential anomalies without access to target values at inference time. To rigorously evaluate PoA detection, we introduce Precursor Time-series Aware Precision and Recall (PTaPR), a new metric that extends the traditional Time-series Aware Precision and Recall (TaPR) by jointly assessing segment-level accuracy, within-segment coverage, and temporal promptness of early predictions. This enables a more holistic assessment of early warning capabilities that existing metrics overlook. Experiments on five real-world benchmark datasets show that FATE achieves an average improvement of 19.9 percentage points in PTaPR AUC and 20.02 percentage points in early detection F1 score, outperforming baselines while requiring no anomaly labels. These results demonstrate the effectiveness and practicality of FATE for real-time unsupervised early warning in complex time-series environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17050",
        "abs_url": "https://arxiv.org/abs/2602.17050",
        "pdf_url": "https://arxiv.org/pdf/2602.17050",
        "title": "Multi-Probe Zero Collision Hash (MPZCH): Mitigating Embedding Collisions and Enhancing Model Freshness in Large-Scale Recommenders",
        "authors": [
            "Ziliang Zhao",
            "Bi Xue",
            "Emma Lin",
            "Mengjiao Zhou",
            "Kaustubh Vartak",
            "Shakhzod Ali-Zade",
            "Carson Lu",
            "Tao Li",
            "Bin Kuang",
            "Rui Jian",
            "Bin Wen",
            "Dennis van der Staay",
            "Yixin Bao",
            "Eddy Li",
            "Chao Deng",
            "Songbin Liu",
            "Qifan Wang",
            "Kai Ren"
        ],
        "comments": "10 pages, 6 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Embedding tables are critical components of large-scale recommendation systems, facilitating the efficient mapping of high-cardinality categorical features into dense vector representations. However, as the volume of unique IDs expands, traditional hash-based indexing methods suffer from collisions that degrade model performance and personalization quality. We present Multi-Probe Zero Collision Hash (MPZCH), a novel indexing mechanism based on linear probing that effectively mitigates embedding collisions. With reasonable table sizing, it often eliminates these collisions entirely while maintaining production-scale efficiency. MPZCH utilizes auxiliary tensors and high-performance CUDA kernels to implement configurable probing and active eviction policies. By retiring obsolete IDs and resetting reassigned slots, MPZCH prevents the stale embedding inheritance typical of hash-based methods, ensuring new features learn effectively from scratch. Despite its collision-mitigation overhead, the system maintains training QPS and inference latency comparable to existing methods. Rigorous online experiments demonstrate that MPZCH achieves zero collisions for user embeddings and significantly improves item embedding freshness and quality. The solution has been released within the open-source TorchRec library for the broader community.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17068",
        "abs_url": "https://arxiv.org/abs/2602.17068",
        "pdf_url": "https://arxiv.org/pdf/2602.17068",
        "title": "Spatio-temporal dual-stage hypergraph MARL for human-centric multimodal corridor traffic signal control",
        "authors": [
            "Xiaocai Zhang",
            "Neema Nassir",
            "Milad Haghani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Human-centric traffic signal control in corridor networks must increasingly account for multimodal travelers, particularly high-occupancy public transportation, rather than focusing solely on vehicle-centric performance. This paper proposes STDSH-MARL (Spatio-Temporal Dual-Stage Hypergraph based Multi-Agent Reinforcement Learning), a scalable multi-agent deep reinforcement learning framework that follows a centralized training and decentralized execution paradigm. The proposed method captures spatio-temporal dependencies through a novel dual-stage hypergraph attention mechanism that models interactions across both spatial and temporal hyperedges. In addition, a hybrid discrete action space is introduced to jointly determine the next signal phase configuration and its corresponding green duration, enabling more adaptive signal timing decisions. Experiments conducted on a corridor network under five traffic scenarios demonstrate that STDSH-MARL consistently improves multimodal performance and provides clear benefits for public transportation priority. Compared with state-of-the-art baseline methods, the proposed approach achieves superior overall performance. Further ablation studies confirm the contribution of each component of STDSH-MARL, with temporal hyperedges identified as the most influential factor driving the observed performance gains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17080",
        "abs_url": "https://arxiv.org/abs/2602.17080",
        "pdf_url": "https://arxiv.org/pdf/2602.17080",
        "title": "Adam Improves Muon: Adaptive Moment Estimation with Orthogonalized Momentum",
        "authors": [
            "Minxin Zhang",
            "Yuxuan Liu",
            "Hayden Scheaffer"
        ],
        "comments": "39 pages, 6 figures",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Efficient stochastic optimization typically integrates an update direction that performs well in the deterministic regime with a mechanism adapting to stochastic perturbations. While Adam uses adaptive moment estimates to promote stability, Muon utilizes the weight layers' matrix structure via orthogonalized momentum, showing superior performance in large language model training. We propose a new optimizer and a diagonal extension, NAMO and NAMO-D, providing the first principled integration of orthogonalized momentum with norm-based Adam-type noise adaptation. NAMO scales orthogonalized momentum using a single adaptive stepsize, preserving orthogonality while improving upon Muon at negligible additional cost. NAMO-D instead right-multiplies orthogonalized momentum by a diagonal matrix with clamped entries. This design enables neuron-wise noise adaptation and aligns with the common near block-diagonal Hessian structure. Under standard assumptions, we establish optimal convergence rates for both algorithms in the deterministic setting and show that, in the stochastic setting, their convergence guarantees adapt to the noise level of stochastic gradients. Experiments on pretraining GPT-2 models demonstrate improved performance of both NAMO and NAMO-D compared to the AdamW and Muon baselines, with NAMO-D achieving further gains over NAMO via an additional clamping hyperparameter that balances the competing goals of maintaining a well-conditioned update direction and leveraging fine-grained noise adaptation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17088",
        "abs_url": "https://arxiv.org/abs/2602.17088",
        "pdf_url": "https://arxiv.org/pdf/2602.17088",
        "title": "MeGU: Machine-Guided Unlearning with Target Feature Disentanglement",
        "authors": [
            "Haoyu Wang",
            "Zhuo Huang",
            "Xiaolong Wang",
            "Bo Han",
            "Zhiwei Lin",
            "Tongliang Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The growing concern over training data privacy has elevated the \"Right to be Forgotten\" into a critical requirement, thereby raising the demand for effective Machine Unlearning. However, existing unlearning approaches commonly suffer from a fundamental trade-off: aggressively erasing the influence of target data often degrades model utility on retained data, while conservative strategies leave residual target information intact. In this work, the intrinsic representation properties learned during model pretraining are analyzed. It is demonstrated that semantic class concepts are entangled at the feature-pattern level, sharing associated features while preserving concept-specific discriminative components. This entanglement fundamentally limits the effectiveness of existing unlearning paradigms. Motivated by this insight, we propose Machine-Guided Unlearning (MeGU), a novel framework that guides unlearning through concept-aware re-alignment. Specifically, Multi-modal Large Language Models (MLLMs) are leveraged to explicitly determine re-alignment directions for target samples by assigning semantically meaningful perturbing labels. To improve efficiency, inter-class conceptual similarities estimated by the MLLM are encoded into a lightweight transition matrix. Furthermore, MeGU introduces a positive-negative feature noise pair to explicitly disentangle target concept influence. During finetuning, the negative noise suppresses target-specific feature patterns, while the positive noise reinforces remaining associated features and aligns them with perturbing concepts. This coordinated design enables selective disruption of target-specific representations while preserving shared semantic structures. As a result, MeGU enables controlled and selective forgetting, effectively mitigating both under-unlearning and over-unlearning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17089",
        "abs_url": "https://arxiv.org/abs/2602.17089",
        "pdf_url": "https://arxiv.org/pdf/2602.17089",
        "title": "Synergizing Transport-Based Generative Models and Latent Geometry for Stochastic Closure Modeling",
        "authors": [
            "Xinghao Dong",
            "Huchen Yang",
            "Jin-long Wu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Dynamical Systems (math.DS); Computational Physics (physics.comp-ph)",
        "abstract": "Diffusion models recently developed for generative AI tasks can produce high-quality samples while still maintaining diversity among samples to promote mode coverage, providing a promising path for learning stochastic closure models. Compared to other types of generative AI models, such as GANs and VAEs, the sampling speed is known as a key disadvantage of diffusion models. By systematically comparing transport-based generative models on a numerical example of 2D Kolmogorov flows, we show that flow matching in a lower-dimensional latent space is suited for fast sampling of stochastic closure models, enabling single-step sampling that is up to two orders of magnitude faster than iterative diffusion-based approaches. To control the latent space distortion and thus ensure the physical fidelity of the sampled closure term, we compare the implicit regularization offered by a joint training scheme against two explicit regularizers: metric-preserving (MP) and geometry-aware (GA) constraints. Besides offering a faster sampling speed, both explicitly and implicitly regularized latent spaces inherit the key topological information from the lower-dimensional manifold of the original complex dynamical system, which enables the learning of stochastic closure models without demanding a huge amount of training data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17092",
        "abs_url": "https://arxiv.org/abs/2602.17092",
        "pdf_url": "https://arxiv.org/pdf/2602.17092",
        "title": "A Locality Radius Framework for Understanding Relational Inductive Bias in Database Learning",
        "authors": [
            "Aadi Joshi",
            "Kavya Bhand"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Foreign key discovery and related schema-level prediction tasks are often modeled using graph neural networks (GNNs), implicitly assuming that relational inductive bias improves performance. However, it remains unclear when multi-hop structural reasoning is actually necessary. In this work, we introduce locality radius, a formal measure of the minimum structural neighborhood required to determine a prediction in relational schemas. We hypothesize that model performance depends critically on alignment between task locality radius and architectural aggregation depth. We conduct a controlled empirical study across foreign key prediction, join cost estimation, blast radius regression, cascade impact classification, and additional graph-derived schema tasks. Our evaluation includes multi-seed experiments, capacity-matched comparisons, statistical significance testing, scaling analysis, and synthetic radius-controlled benchmarks. Results reveal a consistent bias-radius alignment effect.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17102",
        "abs_url": "https://arxiv.org/abs/2602.17102",
        "pdf_url": "https://arxiv.org/pdf/2602.17102",
        "title": "Operationalization of Machine Learning with Serverless Architecture: An Industrial Operationalization of Machine Learning with Serverless Architecture: An Industrial Implementation for Harmonized System Code Prediction",
        "authors": [
            "Sai Vineeth Kandappareddigari",
            "Santhoshkumar Jagadish",
            "Gauri Verma",
            "Ilhuicamina Contreras",
            "Christopher Dignam",
            "Anmol Srivastava",
            "Benjamin Demers"
        ],
        "comments": "13 pages. ICAD '26",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper presents a serverless MLOps framework orchestrating the complete ML lifecycle from data ingestion, training, deployment, monitoring, and retraining to using event-driven pipelines and managed services. The architecture is model-agnostic, supporting diverse inference patterns through standardized interfaces, enabling rapid adaptation without infrastructure overhead. We demonstrate practical applicability through an industrial implementation for Harmonized System (HS) code prediction, a compliance-critical task where short, unstructured product descriptions are mapped to standardized codes used by customs authorities in global trade. Frequent updates and ambiguous descriptions make classification challenging, with errors causing shipment delays and financial losses. Our solution uses a custom text embedding encoder and multiple deep learning architectures, with Text-CNN achieving 98 percent accuracy on ground truth data. Beyond accuracy, the pipeline ensures reproducibility, auditability, and SLA adherence under variable loads via auto-scaling. A key feature is automated A/B testing, enabling dynamic model selection and safe promotion in production. Cost-efficiency drives model choice; while transformers may achieve similar accuracy, their long-term operational costs are significantly higher. Deterministic classification with predictable latency and explainability is prioritized, though the architecture remains extensible to transformer variants and LLM-based inference. The paper first introduces the deep learning architectures with simulations and model comparisons, then discusses industrialization through serverless architecture, demonstrating automated retraining, prediction, and validation of HS codes. This work provides a replicable blueprint for operationalizing ML using serverless architecture, enabling enterprises to scale while optimizing performance and economics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17103",
        "abs_url": "https://arxiv.org/abs/2602.17103",
        "pdf_url": "https://arxiv.org/pdf/2602.17103",
        "title": "Online Learning with Improving Agents: Multiclass, Budgeted Agents and Bandit Learners",
        "authors": [
            "Sajad Ashkezari",
            "Shai Ben-David"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We investigate the recently introduced model of learning with improvements, where agents are allowed to make small changes to their feature values to be warranted a more desirable label. We extensively extend previously published results by providing combinatorial dimensions that characterize online learnability in this model, by analyzing the multiclass setup, learnability in a bandit feedback setup, modeling agents' cost for making improvements and more.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17117",
        "abs_url": "https://arxiv.org/abs/2602.17117",
        "pdf_url": "https://arxiv.org/pdf/2602.17117",
        "title": "i-PhysGaussian: Implicit Physical Simulation for 3D Gaussian Splatting",
        "authors": [
            "Yicheng Cao",
            "Zhuo Huang",
            "Yu Yao",
            "Yiming Ying",
            "Daoyi Dong",
            "Tongliang Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Physical simulation predicts future states of objects based on material properties and external loads, enabling blueprints for both Industry and Engineering to conduct risk management. Current 3D reconstruction-based simulators typically rely on explicit, step-wise updates, which are sensitive to step time and suffer from rapid accuracy degradation under complicated scenarios, such as high-stiffness materials or quasi-static movement. To address this, we introduce i-PhysGaussian, a framework that couples 3D Gaussian Splatting (3DGS) with an implicit Material Point Method (MPM) integrator. Unlike explicit methods, our solution obtains an end-of-step state by minimizing a momentum-balance residual through implicit Newton-type optimization with a GMRES solver. This formulation significantly reduces time-step sensitivity and ensures physical consistency. Our results demonstrate that i-PhysGaussian maintains stability at up to 20x larger time steps than explicit baselines, preserving structural coherence and smooth motion even in complex dynamic transitions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17133",
        "abs_url": "https://arxiv.org/abs/2602.17133",
        "pdf_url": "https://arxiv.org/pdf/2602.17133",
        "title": "VP-VAE: Rethinking Vector Quantization via Adaptive Vector Perturbation",
        "authors": [
            "Linwei Zhai",
            "Han Ding",
            "Mingzhi Lin",
            "Cui Zhao",
            "Fei Wang",
            "Ge Wang",
            "Wang Zhi",
            "Wei Xi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Vector Quantized Variational Autoencoders (VQ-VAEs) are fundamental to modern generative modeling, yet they often suffer from training instability and \"codebook collapse\" due to the inherent coupling of representation learning and discrete codebook optimization. In this paper, we propose VP-VAE (Vector Perturbation VAE), a novel paradigm that decouples representation learning from discretization by eliminating the need for an explicit codebook during training. Our key insight is that, from the neural network's viewpoint, performing quantization primarily manifests as injecting a structured perturbation in latent space. Accordingly, VP-VAE replaces the non-differentiable quantizer with distribution-consistent and scale-adaptive latent perturbations generated via Metropolis--Hastings sampling. This design enables stable training without a codebook while making the model robust to inference-time quantization error. Moreover, under the assumption of approximately uniform latent variables, we derive FSP (Finite Scalar Perturbation), a lightweight variant of VP-VAE that provides a unified theoretical explanation and a practical improvement for FSQ-style fixed quantizers. Extensive experiments on image and audio benchmarks demonstrate that VP-VAE and FSP improve reconstruction fidelity and achieve substantially more balanced token usage, while avoiding the instability inherent to coupled codebook training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17144",
        "abs_url": "https://arxiv.org/abs/2602.17144",
        "pdf_url": "https://arxiv.org/pdf/2602.17144",
        "title": "When More Experts Hurt: Underfitting in Multi-Expert Learning to Defer",
        "authors": [
            "Shuqi Liu",
            "Yuzhou Cao",
            "Lei Feng",
            "Bo An",
            "Luke Ong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Learning to Defer (L2D) enables a classifier to abstain from predictions and defer to an expert, and has recently been extended to multi-expert settings. In this work, we show that multi-expert L2D is fundamentally more challenging than the single-expert case. With multiple experts, the classifier's underfitting becomes inherent, which seriously degrades prediction performance, whereas in the single-expert setting it arises only under specific conditions. We theoretically reveal that this stems from an intrinsic expert identifiability issue: learning which expert to trust from a diverse pool, a problem absent in the single-expert case and renders existing underfitting remedies failed. To tackle this issue, we propose PiCCE (Pick the Confident and Correct Expert), a surrogate-based method that adaptively identifies a reliable expert based on empirical evidence. PiCCE effectively reduces multi-expert L2D to a single-expert-like learning problem, thereby resolving multi expert underfitting. We further prove its statistical consistency and ability to recover class probabilities and expert accuracies. Extensive experiments across diverse settings, including real-world expert scenarios, validate our theoretical results and demonstrate improved performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17155",
        "abs_url": "https://arxiv.org/abs/2602.17155",
        "pdf_url": "https://arxiv.org/pdf/2602.17155",
        "title": "Powering Up Zeroth-Order Training via Subspace Gradient Orthogonalization",
        "authors": [
            "Yicheng Lang",
            "Changsheng Wang",
            "Yihua Zhang",
            "Mingyi Hong",
            "Zheng Zhang",
            "Wotao Yin",
            "Sijia Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Zeroth-order (ZO) optimization provides a gradient-free alternative to first-order (FO) methods by estimating gradients via finite differences of function evaluations, and has recently emerged as a memory-efficient paradigm for fine-tuning large-scale models by avoiding backpropagation. However, ZO optimization has a fundamental tension between accuracy and query efficiency. In this work, we show that ZO optimization can be substantially improved by unifying two complementary principles: (i) a projection-based subspace view that reduces gradient estimation variance by exploiting the intrinsic low-rank structure of model updates, and (ii) Muon-style spectral optimization that applies gradient orthogonalization to extract informative spectral structure from noisy ZO gradients. These findings form a unified framework of subspace gradient orthogonalization, which we instantiate in a new method, ZO-Muon, admitting a natural interpretation as a low-rank Muon optimizer in the ZO setting. Extensive experiments on large language models (LLMs) and vision transformers (ViTs) demonstrate that ZO-Muon significantly accelerates convergence and achieves a win-win improvement in accuracy and query/runtime efficiency. Notably, compared to the popular MeZO baseline, ZO-Muon requires only 24.7% of the queries to reach the same SST-2 performance for LLM fine-tuning, and improves accuracy by 25.1% on ViT-B fine-tuning on CIFAR-100.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17174",
        "abs_url": "https://arxiv.org/abs/2602.17174",
        "pdf_url": "https://arxiv.org/pdf/2602.17174",
        "title": "Continual uncertainty learning",
        "authors": [
            "Heisei Yonezawa",
            "Ansei Yonezawa",
            "Itsuro Kajiwara"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Systems and Control (eess.SY)",
        "abstract": "Robust control of mechanical systems with multiple uncertainties remains a fundamental challenge, particularly when nonlinear dynamics and operating-condition variations are intricately intertwined. While deep reinforcement learning (DRL) combined with domain randomization has shown promise in mitigating the sim-to-real gap, simultaneously handling all sources of uncertainty often leads to sub-optimal policies and poor learning efficiency. This study formulates a new curriculum-based continual learning framework for robust control problems involving nonlinear dynamical systems in which multiple sources of uncertainty are simultaneously superimposed. The key idea is to decompose a complex control problem with multiple uncertainties into a sequence of continual learning tasks, in which strategies for handling each uncertainty are acquired sequentially. The original system is extended into a finite set of plants whose dynamic uncertainties are gradually expanded and diversified as learning progresses. The policy is stably updated across the entire plant sets associated with tasks defined by different uncertainty configurations without catastrophic forgetting. To ensure learning efficiency, we jointly incorporate a model-based controller (MBC), which guarantees a shared baseline performance across the plant sets, into the learning process to accelerate the convergence. This residual learning scheme facilitates task-specific optimization of the DRL agent for each uncertainty, thereby enhancing sample efficiency. As a practical industrial application, this study applies the proposed method to designing an active vibration controller for automotive powertrains. We verified that the resulting controller is robust against structural nonlinearities and dynamic variations, realizing successful sim-to-real transfer.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17206",
        "abs_url": "https://arxiv.org/abs/2602.17206",
        "pdf_url": "https://arxiv.org/pdf/2602.17206",
        "title": "SoftDTW-CUDA-Torch: Memory-Efficient GPU-Accelerated Soft Dynamic Time Warping for PyTorch",
        "authors": [
            "Ron Shapira Weber",
            "Oren Freifeld"
        ],
        "comments": "Technical Report",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present softdtw-cuda-torch, an open-source PyTorch library for computing Soft Dynamic Time Warping (SoftDTW) on GPUs. Our implementation addresses three key limitations of existing GPU implementations of SoftDTW: a hard sequence-length cap of 1024, numerical instability in the backward pass for small smoothing parameters, and excessive GPU memory consumption from materializing pairwise distance tensors. We introduce (1) tiled anti-diagonal kernel execution that removes the sequence-length constraint, (2) a log-space back-ward pass that prevents floating-point overflow, and (3) a fused distance-computation mode that eliminates the O(BN M ) intermediate distance tensor, achieving up to 98% memory reduction compared to prior work. The library supports arbitrary sequence lengths, full PyTorch autograd integration, and Soft-DTW Barycenter computation. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17244",
        "abs_url": "https://arxiv.org/abs/2602.17244",
        "pdf_url": "https://arxiv.org/pdf/2602.17244",
        "title": "CounterFlowNet: From Minimal Changes to Meaningful Counterfactual Explanations",
        "authors": [
            "Oleksii Furman",
            "Patryk Marszałek",
            "Jan Masłowski",
            "Piotr Gaiński",
            "Maciej Zięba",
            "Marek Śmieja"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Counterfactual explanations (CFs) provide human-interpretable insights into model's predictions by identifying minimal changes to input features that would alter the model's output. However, existing methods struggle to generate multiple high-quality explanations that (1) affect only a small portion of the features, (2) can be applied to tabular data with heterogeneous features, and (3) are consistent with the user-defined constraints. We propose CounterFlowNet, a generative approach that formulates CF generation as sequential feature modification using conditional Generative Flow Networks (GFlowNet). CounterFlowNet is trained to sample CFs proportionally to a user-specified reward function that can encode key CF desiderata: validity, sparsity, proximity and plausibility, encouraging high-quality explanations. The sequential formulation yields highly sparse edits, while a unified action space seamlessly supports continuous and categorical features. Moreover, actionability constraints, such as immutability and monotonicity of features, can be enforced at inference time via action masking, without retraining. Experiments on eight datasets under two evaluation protocols demonstrate that CounterFlowNet achieves superior trade-offs between validity, sparsity, plausibility, and diversity with full satisfaction of the given constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17251",
        "abs_url": "https://arxiv.org/abs/2602.17251",
        "pdf_url": "https://arxiv.org/pdf/2602.17251",
        "title": "Structured Prototype-Guided Adaptation for EEG Foundation Models",
        "authors": [
            "Jingying Ma",
            "Feng Wu",
            "Yucheng Xing",
            "Qika Lin",
            "Tianyu Liu",
            "Chenyu Liu",
            "Ziyu Jia",
            "Mengling Feng"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Electroencephalography (EEG) foundation models (EFMs) have achieved strong performance under full fine-tuning but exhibit poor generalization when subject-level supervision is limited, a common constraint in real-world clinical settings. We show that this failure stems not merely from limited supervision, but from a structural mismatch between noisy, limited supervision and the highly plastic parameter space of EFMs. To address this challenge, we propose SCOPE, a Structured COnfidence-aware Prototype-guided adaptation framework for EFM fine-tuning. SCOPE follows a two-stage pipeline. In the first stage, we construct reliable external supervision by learning geometry-regularized task priors, constructing balanced class-level prototypes over the resulting embeddings, and producing confidence-aware pseudo-labels from their agreement to filter unreliable signals on unlabeled data. In the second stage, we introduce ProAdapter, which adapts frozen EEG foundation models via a lightweight adapter conditioned on the structured prototypes. Experiments across three EEG tasks and five foundation model backbones demonstrate that SCOPE consistently achieves strong performance and efficiency under label-limited cross-subject settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17263",
        "abs_url": "https://arxiv.org/abs/2602.17263",
        "pdf_url": "https://arxiv.org/pdf/2602.17263",
        "title": "Learning a Latent Pulse Shape Interface for Photoinjector Laser Systems",
        "authors": [
            "Alexander Klemps",
            "Denis Ilia",
            "Pradeep Kr. Banerjee",
            "Ye Chen",
            "Henrik Tünnermann",
            "Nihat Ay"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Controlling the longitudinal laser pulse shape in photoinjectors of Free-Electron Lasers is a powerful lever for optimizing electron beam quality, but systematic exploration of the vast design space is limited by the cost of brute-force pulse propagation simulations. We present a generative modeling framework based on Wasserstein Autoencoders to learn a differentiable latent interface between pulse shaping and downstream beam dynamics. Our empirical findings show that the learned latent space is continuous and interpretable while maintaining high-fidelity reconstructions. Pulse families such as higher-order Gaussians trace coherent trajectories, while standardizing the temporal pulse lengths shows a latent organization correlated with pulse energy. Analysis via principal components and Gaussian Mixture Models reveals a well behaved latent geometry, enabling smooth transitions between distinct pulse types via linear interpolation. The model generalizes from simulated data to real experimental pulse measurements, accurately reconstructing pulses and embedding them consistently into the learned manifold. Overall, the approach reduces reliance on expensive pulse-propagation simulations and facilitates downstream beam dynamics simulation and analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17276",
        "abs_url": "https://arxiv.org/abs/2602.17276",
        "pdf_url": "https://arxiv.org/pdf/2602.17276",
        "title": "RLGT: A reinforcement learning framework for extremal graph theory",
        "authors": [
            "Ivan Damnjanović",
            "Uroš Milivojević",
            "Irena Đorđević",
            "Dragan Stevanović"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Combinatorics (math.CO)",
        "abstract": "Reinforcement learning (RL) is a subfield of machine learning that focuses on developing models that can autonomously learn optimal decision-making strategies over time. In a recent pioneering paper, Wagner demonstrated how the Deep Cross-Entropy RL method can be applied to tackle various problems from extremal graph theory by reformulating them as combinatorial optimization problems. Subsequently, many researchers became interested in refining and extending the framework introduced by Wagner, thereby creating various RL environments specialized for graph theory. Moreover, a number of problems from extremal graph theory were solved through the use of RL. In particular, several inequalities concerning the Laplacian spectral radius of graphs were refuted, new lower bounds were obtained for certain Ramsey numbers, and contributions were made to the Turán-type extremal problem in which the forbidden structures are cycles of length three and four. Here, we present Reinforcement Learning for Graph Theory (RLGT), a novel RL framework that systematizes the previous work and provides support for both undirected and directed graphs, with or without loops, and with an arbitrary number of edge colors. The framework efficiently represents graphs and aims to facilitate future RL-based research in extremal graph theory through optimized computational performance and a clean and modular design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17284",
        "abs_url": "https://arxiv.org/abs/2602.17284",
        "pdf_url": "https://arxiv.org/pdf/2602.17284",
        "title": "Efficient privacy loss accounting for subsampling and random allocation",
        "authors": [
            "Vitaly Feldman",
            "Moshe Shenfeld"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We consider the privacy amplification properties of a sampling scheme in which a user's data is used in $k$ steps chosen randomly and uniformly from a sequence (or set) of $t$ steps. This sampling scheme has been recently applied in the context of differentially private optimization (Chua et al., 2024a; Choquette-Choo et al., 2025) and communication-efficient high-dimensional private aggregation (Asi et al., 2025), where it was shown to have utility advantages over the standard Poisson sampling. Theoretical analyses of this sampling scheme (Feldman & Shenfeld, 2025; Dong et al., 2025) lead to bounds that are close to those of Poisson sampling, yet still have two significant shortcomings. First, in many practical settings, the resulting privacy parameters are not tight due to the approximation steps in the analysis. Second, the computed parameters are either the hockey stick or Renyi divergence, both of which introduce overheads when used in privacy loss accounting. In this work, we demonstrate that the privacy loss distribution (PLD) of random allocation applied to any differentially private algorithm can be computed efficiently. When applied to the Gaussian mechanism, our results demonstrate that the privacy-utility trade-off for random allocation is at least as good as that of Poisson subsampling. In particular, random allocation is better suited for training via DP-SGD. To support these computations, our work develops new tools for general privacy loss accounting based on a notion of PLD realization. This notion allows us to extend accurate privacy loss accounting to subsampling which previously required manual noise-mechanism-specific analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17312",
        "abs_url": "https://arxiv.org/abs/2602.17312",
        "pdf_url": "https://arxiv.org/pdf/2602.17312",
        "title": "LexiSafe: Offline Safe Reinforcement Learning with Lexicographic Safety-Reward Hierarchy",
        "authors": [
            "Hsin-Jung Yang",
            "Zhanhong Jiang",
            "Prajwal Koirala",
            "Qisai Liu",
            "Cody Fleming",
            "Soumik Sarkar"
        ],
        "comments": "17th ACM/IEEE International Conference on Cyber-Physical Systems",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Offline safe reinforcement learning (RL) is increasingly important for cyber-physical systems (CPS), where safety violations during training are unacceptable and only pre-collected data are available. Existing offline safe RL methods typically balance reward-safety tradeoffs through constraint relaxation or joint optimization, but they often lack structural mechanisms to prevent safety drift. We propose LexiSafe, a lexicographic offline RL framework designed to preserve safety-aligned behavior. We first develop LexiSafe-SC, a single-cost formulation for standard offline safe RL, and derive safety-violation and performance-suboptimality bounds that together yield sample-complexity guarantees. We then extend the framework to hierarchical safety requirements with LexiSafe-MC, which supports multiple safety costs and admits its own sample-complexity analysis. Empirically, LexiSafe demonstrates reduced safety violations and improved task performance compared to constrained offline baselines. By unifying lexicographic prioritization with structural bias, LexiSafe offers a practical and theoretically grounded approach for safety-critical CPS decision-making.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17321",
        "abs_url": "https://arxiv.org/abs/2602.17321",
        "pdf_url": "https://arxiv.org/pdf/2602.17321",
        "title": "The Sound of Death: Deep Learning Reveals Vascular Damage from Carotid Ultrasound",
        "authors": [
            "Christoph Balada",
            "Aida Romano-Martinez",
            "Payal Varshney",
            "Vincent ten Cate",
            "Katharina Geschke",
            "Jonas Tesarz",
            "Paul Claßen",
            "Alexander K. Schuster",
            "Dativa Tibyampansha",
            "Karl-Patrik Kresoja",
            "Philipp S. Wild",
            "Sheraz Ahmed",
            "Andreas Dengel"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "Cardiovascular diseases (CVDs) remain the leading cause of mortality worldwide, yet early risk detection is often limited by available diagnostics. Carotid ultrasound, a non-invasive and widely accessible modality, encodes rich structural and hemodynamic information that is largely untapped. Here, we present a machine learning (ML) framework that extracts clinically meaningful representations of vascular damage (VD) from carotid ultrasound videos, using hypertension as a weak proxy label. The model learns robust features that are biologically plausible, interpretable, and strongly associated with established cardiovascular risk factors, comorbidities, and laboratory measures. High VD stratifies individuals for myocardial infarction, cardiac death, and all-cause mortality, matching or outperforming conventional risk models such as SCORE2. Explainable AI analyses reveal that the model relies on vessel morphology and perivascular tissue characteristics, uncovering novel functional and anatomical signatures of vascular damage. This work demonstrates that routine carotid ultrasound contains far more prognostic information than previously recognized. Our approach provides a scalable, non-invasive, and cost-effective tool for population-wide cardiovascular risk assessment, enabling earlier and more personalized prevention strategies without reliance on laboratory tests or complex clinical inputs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17342",
        "abs_url": "https://arxiv.org/abs/2602.17342",
        "pdf_url": "https://arxiv.org/pdf/2602.17342",
        "title": "From Subtle to Significant: Prompt-Driven Self-Improving Optimization in Test-Time Graph OOD Detection",
        "authors": [
            "Luzhi Wang",
            "Xuanshuo Fu",
            "He Zhang",
            "Chuang Liu",
            "Xiaobao Wang",
            "Hongbo Liu"
        ],
        "comments": "9pages, 5 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Graph Out-of-Distribution (OOD) detection aims to identify whether a test graph deviates from the distribution of graphs observed during training, which is critical for ensuring the reliability of Graph Neural Networks (GNNs) when deployed in open-world scenarios. Recent advances in graph OOD detection have focused on test-time training techniques that facilitate OOD detection without accessing potential supervisory information (e.g., training data). However, most of these methods employ a one-pass inference paradigm, which prevents them from progressively correcting erroneous predictions to amplify OOD signals. To this end, we propose a \\textbf{S}elf-\\textbf{I}mproving \\textbf{G}raph \\textbf{O}ut-\\textbf{o}f-\\textbf{D}istribution detector (SIGOOD), which is an unsupervised framework that integrates continuous self-learning with test-time training for effective graph OOD detection. Specifically, SIGOOD generates a prompt to construct a prompt-enhanced graph that amplifies potential OOD signals. To optimize prompts, SIGOOD introduces an Energy Preference Optimization (EPO) loss, which leverages energy variations between the original test graph and the prompt-enhanced graph. By iteratively optimizing the prompt by involving it into the detection model in a self-improving loop, the resulting optimal prompt-enhanced graph is ultimately used for OOD detection. Comprehensive evaluations on 21 real-world datasets confirm the effectiveness and outperformance of our SIGOOD method. The code is at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17350",
        "abs_url": "https://arxiv.org/abs/2602.17350",
        "pdf_url": "https://arxiv.org/pdf/2602.17350",
        "title": "Shortcut learning in geometric knot classification",
        "authors": [
            "Djordje Mihajlovic",
            "Davide Michieletto"
        ],
        "comments": "17 pages, 6 figures, submitted to Machine Learning: Science and Technology, IOP",
        "subjects": "Machine Learning (cs.LG); Soft Condensed Matter (cond-mat.soft); Geometric Topology (math.GT)",
        "abstract": "Classifying the topology of closed curves is a central problem in low dimensional topology with applications beyond mathematics spanning protein folding, polymer physics and even magnetohydrodynamics. The central problem is how to determine whether two embeddings of a closed arc are equivalent under ambient isotopy. Given the striking ability of neural networks to solve complex classification tasks, it is therefore natural to ask if the knot classification problem can be tackled using Machine Learning (ML). In this paper, we investigate generic shortcut methods employed by ML to solve the knot classification challenge and specifically discover hidden non-topological features in training data generated through Molecular Dynamics simulations of polygonal knots that are used by ML to arrive to positive classifications results. We then provide a rigorous foundation for future attempts to tackle the knot classification challenge using ML by developing a publicly-available (i) dataset, that aims to remove the potential of non-topological feature classification and (ii) code, that can generate knot embeddings that faithfully explore chosen geometric state space with fixed knot topology. We expect that our work will accelerate the development of ML models that can solve complex geometric knot classification challenges.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17363",
        "abs_url": "https://arxiv.org/abs/2602.17363",
        "pdf_url": "https://arxiv.org/pdf/2602.17363",
        "title": "2Mamba2Furious: Linear in Complexity, Competitive in Accuracy",
        "authors": [
            "Gabriel Mongaras",
            "Eric C. Larson"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Linear attention transformers have become a strong alternative to softmax attention due to their efficiency. However, linear attention tends to be less expressive and results in reduced accuracy compared to softmax attention. To bridge the accuracy gap between softmax attention and linear attention, we manipulate Mamba-2, a very strong linear attention variant. We first simplify Mamba-2 down to its most fundamental and important components, evaluating which specific choices make it most accurate. From this simplified Mamba variant (Mamba-2S), we improve the A-mask and increase the order of the hidden state, resulting in a method, which we call 2Mamba, that is nearly as accurate as softmax attention, yet much more memory efficient for long context lengths. We also investigate elements to Mamba-2 that help surpass softmax attention accuracy. Code is provided for all our experiments",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17375",
        "abs_url": "https://arxiv.org/abs/2602.17375",
        "pdf_url": "https://arxiv.org/pdf/2602.17375",
        "title": "MDP Planning as Policy Inference",
        "authors": [
            "David Tolpin"
        ],
        "comments": "28 pages, many figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We cast episodic Markov decision process (MDP) planning as Bayesian inference over _policies_. A policy is treated as the latent variable and is assigned an unnormalized probability of optimality that is monotone in its expected return, yielding a posterior distribution whose modes coincide with return-maximizing solutions while posterior dispersion represents uncertainty over optimal behavior. To approximate this posterior in discrete domains, we adapt variational sequential Monte Carlo (VSMC) to inference over deterministic policies under stochastic dynamics, introducing a sweep that enforces policy consistency across revisited states and couples transition randomness across particles to avoid confounding from simulator noise. Acting is performed by posterior predictive sampling, which induces a stochastic control policy through a Thompson-sampling interpretation rather than entropy regularization. Across grid worlds, Blackjack, Triangle Tireworld, and Academic Advising, we analyze the structure of inferred policy distributions and compare the resulting behavior to discrete Soft Actor-Critic, highlighting qualitative and statistical differences that arise from policy-level uncertainty.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17477",
        "abs_url": "https://arxiv.org/abs/2602.17477",
        "pdf_url": "https://arxiv.org/pdf/2602.17477",
        "title": "Variational Grey-Box Dynamics Matching",
        "authors": [
            "Gurjeet Sangra Singh",
            "Frantzeska Lavda",
            "Giangiacomo Mercatali",
            "Alexandros Kalousis"
        ],
        "comments": "AISTATS 2026. Code is available at this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deep generative models such as flow matching and diffusion models have shown great potential in learning complex distributions and dynamical systems, but often act as black-boxes, neglecting underlying physics. In contrast, physics-based simulation models described by ODEs/PDEs remain interpretable, but may have missing or unknown terms, unable to fully describe real-world observations. We bridge this gap with a novel grey-box method that integrates incomplete physics models directly into generative models. Our approach learns dynamics from observational trajectories alone, without ground-truth physics parameters, in a simulation-free manner that avoids scalability and stability issues of Neural ODEs. The core of our method lies in modelling a structured variational distribution within the flow matching framework, by using two latent encodings: one to model the missing stochasticity and multi-modal velocity, and a second to encode physics parameters as a latent variable with a physics-informed prior. Furthermore, we present an adaptation of the framework to handle second-order dynamics. Our experiments on representative ODE/PDE problems show that our method performs on par with or superior to fully data-driven approaches and previous grey-box baselines, while preserving the interpretability of the physics model. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17486",
        "abs_url": "https://arxiv.org/abs/2602.17486",
        "pdf_url": "https://arxiv.org/pdf/2602.17486",
        "title": "Linear Convergence in Games with Delayed Feedback via Extra Prediction",
        "authors": [
            "Yuma Fujimoto",
            "Kenshi Abe",
            "Kaito Ariu"
        ],
        "comments": "9 pages, 3 figures (main); 5 pages, 1 figure (appendix)",
        "subjects": "Machine Learning (cs.LG); Computer Science and Game Theory (cs.GT); Multiagent Systems (cs.MA); Optimization and Control (math.OC)",
        "abstract": "Feedback delays are inevitable in real-world multi-agent learning. They are known to severely degrade performance, and the convergence rate under delayed feedback is still unclear, even for bilinear games. This paper derives the rate of linear convergence of Weighted Optimistic Gradient Descent-Ascent (WOGDA), which predicts future rewards with extra optimism, in unconstrained bilinear games. To analyze the algorithm, we interpret it as an approximation of the Extra Proximal Point (EPP), which is updated based on farther future rewards than the classical Proximal Point (PP). Our theorems show that standard optimism (predicting the next-step reward) achieves linear convergence to the equilibrium at a rate $\\exp(-\\Theta(t/m^{5}))$ after $t$ iterations for delay $m$. Moreover, employing extra optimism (predicting farther future reward) tolerates a larger step size and significantly accelerates the rate to $\\exp(-\\Theta(t/(m^{2}\\log m)))$. Our experiments also show accelerated convergence driven by the extra optimism and are qualitatively consistent with our theorems. In summary, this paper validates that extra optimism is a promising countermeasure against performance degradation caused by feedback delays.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17493",
        "abs_url": "https://arxiv.org/abs/2602.17493",
        "pdf_url": "https://arxiv.org/pdf/2602.17493",
        "title": "Learning with Boolean threshold functions",
        "authors": [
            "Veit Elser",
            "Manish Krishan Lal"
        ],
        "comments": "22 pages, 21 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We develop a method for training neural networks on Boolean data in which the values at all nodes are strictly $\\pm 1$, and the resulting models are typically equivalent to networks whose nonzero weights are also $\\pm 1$. The method replaces loss minimization with a nonconvex constraint formulation. Each node implements a Boolean threshold function (BTF), and training is expressed through a divide-and-concur decomposition into two complementary constraints: one enforces local BTF consistency between inputs, weights, and output; the other imposes architectural concurrence, equating neuron outputs with downstream inputs and enforcing weight equality across training-data instantiations of the network. The reflect-reflect-relax (RRR) projection algorithm is used to reconcile these constraints. Each BTF constraint includes a lower bound on the margin. When this bound is sufficiently large, the learned representations are provably sparse and equivalent to networks composed of simple logical gates with $\\pm 1$ weights. Across a range of tasks -- including multiplier-circuit discovery, binary autoencoding, logic-network inference, and cellular automata learning -- the method achieves exact solutions or strong generalization in regimes where standard gradient-based methods struggle. These results demonstrate that projection-based constraint satisfaction provides a viable and conceptually distinct foundation for learning in discrete neural systems, with implications for interpretability and efficient inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17497",
        "abs_url": "https://arxiv.org/abs/2602.17497",
        "pdf_url": "https://arxiv.org/pdf/2602.17497",
        "title": "Retrospective In-Context Learning for Temporal Credit Assignment with Large Language Models",
        "authors": [
            "Wen-Tse Chen",
            "Jiayu Chen",
            "Fahim Tajwar",
            "Hao Zhu",
            "Xintong Duan",
            "Ruslan Salakhutdinov",
            "Jeff Schneider"
        ],
        "comments": "Accepted to NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Learning from self-sampled data and sparse environmental feedback remains a fundamental challenge in training self-evolving agents. Temporal credit assignment mitigates this issue by transforming sparse feedback into dense supervision signals. However, previous approaches typically depend on learning task-specific value functions for credit assignment, which suffer from poor sample efficiency and limited generalization. In this work, we propose to leverage pretrained knowledge from large language models (LLMs) to transform sparse rewards into dense training signals (i.e., the advantage function) through retrospective in-context learning (RICL). We further propose an online learning framework, RICOL, which iteratively refines the policy based on the credit assignment results from RICL. We empirically demonstrate that RICL can accurately estimate the advantage function with limited samples and effectively identify critical states in the environment for temporal credit assignment. Extended evaluation on four BabyAI scenarios show that RICOL achieves comparable convergent performance with traditional online RL algorithms with significantly higher sample efficiency. Our findings highlight the potential of leveraging LLMs for temporal credit assignment, paving the way for more sample-efficient and generalizable RL paradigms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17525",
        "abs_url": "https://arxiv.org/abs/2602.17525",
        "pdf_url": "https://arxiv.org/pdf/2602.17525",
        "title": "Variational inference via radial transport",
        "authors": [
            "Luca Ghafourpour",
            "Sinho Chewi",
            "Alessio Figalli",
            "Aram-Alexandre Pooladian"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Statistics Theory (math.ST); Machine Learning (stat.ML)",
        "abstract": "In variational inference (VI), the practitioner approximates a high-dimensional distribution $\\pi$ with a simple surrogate one, often a (product) Gaussian distribution. However, in many cases of practical interest, Gaussian distributions might not capture the correct radial profile of $\\pi$, resulting in poor coverage. In this work, we approach the VI problem from the perspective of optimizing over these radial profiles. Our algorithm radVI is a cheap, effective add-on to many existing VI schemes, such as Gaussian (mean-field) VI and Laplace approximation. We provide theoretical convergence guarantees for our algorithm, owing to recent developments in optimization over the Wasserstein space--the space of probability distributions endowed with the Wasserstein distance--and new regularity properties of radial transport maps in the style of Caffarelli (2000).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17530",
        "abs_url": "https://arxiv.org/abs/2602.17530",
        "pdf_url": "https://arxiv.org/pdf/2602.17530",
        "title": "Provably Explaining Neural Additive Models",
        "authors": [
            "Shahaf Bassan",
            "Yizhak Yisrael Elboher",
            "Tobias Ladner",
            "Volkan Şahin",
            "Jan Kretinsky",
            "Matthias Althoff",
            "Guy Katz"
        ],
        "comments": "To appear in ICLR 2026",
        "subjects": "Machine Learning (cs.LG); Computational Complexity (cs.CC); Logic in Computer Science (cs.LO)",
        "abstract": "Despite significant progress in post-hoc explanation methods for neural networks, many remain heuristic and lack provable guarantees. A key approach for obtaining explanations with provable guarantees is by identifying a cardinally-minimal subset of input features which by itself is provably sufficient to determine the prediction. However, for standard neural networks, this task is often computationally infeasible, as it demands a worst-case exponential number of verification queries in the number of input features, each of which is NP-hard. In this work, we show that for Neural Additive Models (NAMs), a recent and more interpretable neural network family, we can efficiently generate explanations with such guarantees. We present a new model-specific algorithm for NAMs that generates provably cardinally-minimal explanations using only a logarithmic number of verification queries in the number of input features, after a parallelized preprocessing step with logarithmic runtime in the required precision is applied to each small univariate NAM component. Our algorithm not only makes the task of obtaining cardinally-minimal explanations feasible, but even outperforms existing algorithms designed to find the relaxed variant of subset-minimal explanations - which may be larger and less informative but easier to compute - despite our algorithm solving a much more difficult task. Our experiments demonstrate that, compared to previous algorithms, our approach provides provably smaller explanations than existing works and substantially reduces the computation time. Moreover, we show that our generated provable explanations offer benefits that are unattainable by standard sampling-based techniques typically used to interpret NAMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17550",
        "abs_url": "https://arxiv.org/abs/2602.17550",
        "pdf_url": "https://arxiv.org/pdf/2602.17550",
        "title": "MASPO: Unifying Gradient Utilization, Probability Mass, and Signal Reliability for Robust and Sample-Efficient LLM Reasoning",
        "authors": [
            "Xiaoliang Fu",
            "Jiaye Lin",
            "Yangyi Fang",
            "Binbin Zheng",
            "Chaowen Hu",
            "Zekai Shao",
            "Cong Qin",
            "Lu Pan",
            "Ke Zeng",
            "Xunliang Cai"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Existing Reinforcement Learning with Verifiable Rewards (RLVR) algorithms, such as GRPO, rely on rigid, uniform, and symmetric trust region mechanisms that are fundamentally misaligned with the complex optimization dynamics of Large Language Models (LLMs). In this paper, we identify three critical challenges in these methods: (1) inefficient gradient utilization caused by the binary cutoff of hard clipping, (2) insensitive probability mass arising from uniform ratio constraints that ignore the token distribution, and (3) asymmetric signal reliability stemming from the disparate credit assignment ambiguity between positive and negative samples. To bridge these gaps, we propose Mass-Adaptive Soft Policy Optimization (MASPO), a unified framework designed to harmonize these three dimensions. MASPO integrates a differentiable soft Gaussian gating to maximize gradient utility, a mass-adaptive limiter to balance exploration across the probability spectrum, and an asymmetric risk controller to align update magnitudes with signal confidence. Extensive evaluations demonstrate that MASPO serves as a robust, all-in-one RLVR solution, significantly outperforming strong baselines. Our code is available at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17554",
        "abs_url": "https://arxiv.org/abs/2602.17554",
        "pdf_url": "https://arxiv.org/pdf/2602.17554",
        "title": "A Theoretical Framework for Modular Learning of Robust Generative Models",
        "authors": [
            "Corinna Cortes",
            "Mehryar Mohri",
            "Yutao Zhong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Training large-scale generative models is resource-intensive and relies heavily on heuristic dataset weighting. We address two fundamental questions: Can we train Large Language Models (LLMs) modularly-combining small, domain-specific experts to match monolithic performance-and can we do so robustly for any data mixture, eliminating heuristic tuning? We present a theoretical framework for modular generative modeling where a set of pre-trained experts are combined via a gating mechanism. We define the space of normalized gating functions, $G_{1}$, and formulate the problem as a minimax game to find a single robust gate that minimizes divergence to the worst-case data mixture. We prove the existence of such a robust gate using Kakutani's fixed-point theorem and show that modularity acts as a strong regularizer, with generalization bounds scaling with the lightweight gate's complexity. Furthermore, we prove that this modular approach can theoretically outperform models retrained on aggregate data, with the gap characterized by the Jensen-Shannon Divergence. Finally, we introduce a scalable Stochastic Primal-Dual algorithm and a Structural Distillation method for efficient inference. Empirical results on synthetic and real-world datasets confirm that our modular architecture effectively mitigates gradient conflict and can robustly outperform monolithic baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17559",
        "abs_url": "https://arxiv.org/abs/2602.17559",
        "pdf_url": "https://arxiv.org/pdf/2602.17559",
        "title": "Revisiting Weight Regularization for Low-Rank Continual Learning",
        "authors": [
            "Yaoyue Zheng",
            "Yin Zhang",
            "Joost van de Weijer",
            "Gido M van de Ven",
            "Shaoyi Du",
            "Xuetao Zhang",
            "Zhiqiang Tian"
        ],
        "comments": "Accepted by ICLR 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Continual Learning (CL) with large-scale pre-trained models (PTMs) has recently gained wide attention, shifting the focus from training from scratch to continually adapting PTMs. This has given rise to a promising paradigm: parameter-efficient continual learning (PECL), where task interference is typically mitigated by assigning a task-specific module during training, such as low-rank adapters. However, weight regularization techniques, such as Elastic Weight Consolidation (EWC)-a key strategy in CL-remain underexplored in this new paradigm. In this paper, we revisit weight regularization in low-rank CL as a new perspective for mitigating task interference in PECL. Unlike existing low-rank CL methods, we mitigate task interference by regularizing a shared low-rank update through EWC, thereby keeping the storage requirement and inference costs constant regardless of the number of tasks. Our proposed method EWC-LoRA leverages a low-rank representation to estimate parameter importance over the full-dimensional space. This design offers a practical, computational- and memory-efficient solution for CL with PTMs, and provides insights that may inform the broader application of regularization techniques within PECL. Extensive experiments on various benchmarks demonstrate the effectiveness of EWC-LoRA, achieving a stability-plasticity trade-off superior to existing low-rank CL approaches. These results indicate that, even under low-rank parameterizations, weight regularization remains an effective mechanism for mitigating task interference. Code is available at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17568",
        "abs_url": "https://arxiv.org/abs/2602.17568",
        "pdf_url": "https://arxiv.org/pdf/2602.17568",
        "title": "Be Wary of Your Time Series Preprocessing",
        "authors": [
            "Sofiane Ennadir",
            "Tianze Wang",
            "Oleg Smirnov",
            "Sahar Asadi",
            "Lele Cao"
        ],
        "comments": "Accepted at the AI4TS workshop at AAAI-26",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Normalization and scaling are fundamental preprocessing steps in time series modeling, yet their role in Transformer-based models remains underexplored from a theoretical perspective. In this work, we present the first formal analysis of how different normalization strategies, specifically instance-based and global scaling, impact the expressivity of Transformer-based architectures for time series representation learning. We propose a novel expressivity framework tailored to time series, which quantifies a model's ability to distinguish between similar and dissimilar inputs in the representation space. Using this framework, we derive theoretical bounds for two widely used normalization methods: Standard and Min-Max scaling. Our analysis reveals that the choice of normalization strategy can significantly influence the model's representational capacity, depending on the task and data characteristics. We complement our theory with empirical validation on classification and forecasting benchmarks using multiple Transformer-based models. Our results show that no single normalization method consistently outperforms others, and in some cases, omitting normalization entirely leads to superior performance. These findings highlight the critical role of preprocessing in time series learning and motivate the need for more principled normalization strategies tailored to specific tasks and datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17584",
        "abs_url": "https://arxiv.org/abs/2602.17584",
        "pdf_url": "https://arxiv.org/pdf/2602.17584",
        "title": "Canonicalizing Multimodal Contrastive Representation Learning",
        "authors": [
            "Sharut Gupta",
            "Sanyam Kansal",
            "Stefanie Jegelka",
            "Phillip Isola",
            "Vikas Garg"
        ],
        "comments": "78 pages, 57 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As models and data scale, independently trained networks often induce analogous notions of similarity. But, matching similarities is weaker than establishing an explicit correspondence between the representation spaces, especially for multimodal models, where consistency must hold not only within each modality, but also for the learned image-text coupling. We therefore ask: given two independently trained multimodal contrastive models (with encoders $(f, g)$ and $(\\widetilde{f},\\widetilde{g})$) -- trained on different distributions and with different architectures -- does a systematic geometric relationship exist between their embedding spaces? If so, what form does it take, and does it hold uniformly across modalities? In this work, we show that across model families such as CLIP, SigLIP, and FLAVA, this geometric relationship is well approximated by an orthogonal map (up to a global mean shift), i.e., there exists an orthogonal map $Q$ where $Q^\\top Q = I$ such that $\\widetilde{f}(x)\\approx Q f(x)$ for paired images $x$. Strikingly, the same $Q$ simultaneously aligns the text encoders i.e., $\\widetilde{g}(y)\\approx Q g(y)$ for texts $y$. Theoretically, we prove that if the multimodal kernel agrees across models on a small anchor set i.e. $\\langle f(x), g(y)\\rangle \\approx \\langle \\widetilde{f}(x), \\widetilde{g}(y)\\rangle$, then the two models must be related by a single orthogonal map $Q$ and the same $Q$ maps images and text across models. More broadly, this finding enables backward-compatible model upgrades, avoiding costly re-embedding, and has implications for the privacy of learned representations. Our project page: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17596",
        "abs_url": "https://arxiv.org/abs/2602.17596",
        "pdf_url": "https://arxiv.org/pdf/2602.17596",
        "title": "Asymptotic Smoothing of the Lipschitz Loss Landscape in Overparameterized One-Hidden-Layer ReLU Networks",
        "authors": [
            "Saveliy Baturin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study the topology of the loss landscape of one-hidden-layer ReLU networks under overparameterization. On the theory side, we (i) prove that for convex $L$-Lipschitz losses with an $\\ell_1$-regularized second layer, every pair of models at the same loss level can be connected by a continuous path within an arbitrarily small loss increase $\\epsilon$ (extending a known result for the quadratic loss); (ii) obtain an asymptotic upper bound on the energy gap $\\epsilon$ between local and global minima that vanishes as the width $m$ grows, implying that the landscape flattens and sublevel sets become connected in the limit. Empirically, on a synthetic Moons dataset and on the Wisconsin Breast Cancer dataset, we measure pairwise energy gaps via Dynamic String Sampling (DSS) and find that wider networks exhibit smaller gaps; in particular, a permutation test on the maximum gap yields $p_{perm}=0$, indicating a clear reduction in the barrier height.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17608",
        "abs_url": "https://arxiv.org/abs/2602.17608",
        "pdf_url": "https://arxiv.org/pdf/2602.17608",
        "title": "Towards Anytime-Valid Statistical Watermarking",
        "authors": [
            "Baihe Huang",
            "Eric Xu",
            "Kannan Ramchandran",
            "Jiantao Jiao",
            "Michael I. Jordan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Machine Learning (stat.ML)",
        "abstract": "The proliferation of Large Language Models (LLMs) necessitates efficient mechanisms to distinguish machine-generated content from human text. While statistical watermarking has emerged as a promising solution, existing methods suffer from two critical limitations: the lack of a principled approach for selecting sampling distributions and the reliance on fixed-horizon hypothesis testing, which precludes valid early stopping. In this paper, we bridge this gap by developing the first e-value-based watermarking framework, Anchored E-Watermarking, that unifies optimal sampling with anytime-valid inference. Unlike traditional approaches where optional stopping invalidates Type-I error guarantees, our framework enables valid, anytime-inference by constructing a test supermartingale for the detection process. By leveraging an anchor distribution to approximate the target model, we characterize the optimal e-value with respect to the worst-case log-growth rate and derive the optimal expected stopping time. Our theoretical claims are substantiated by simulations and evaluations on established benchmarks, showing that our framework can significantly enhance sample efficiency, reducing the average token budget required for detection by 13-15% relative to state-of-the-art baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17614",
        "abs_url": "https://arxiv.org/abs/2602.17614",
        "pdf_url": "https://arxiv.org/pdf/2602.17614",
        "title": "Guarding the Middle: Protecting Intermediate Representations in Federated Split Learning",
        "authors": [
            "Obaidullah Zaland",
            "Sajib Mistry",
            "Monowar Bhuyan"
        ],
        "comments": "Accepted for Publication in IEEE International Conference on Big Data (IEEE BigData) 2025",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Big data scenarios, where massive, heterogeneous datasets are distributed across clients, demand scalable, privacy-preserving learning methods. Federated learning (FL) enables decentralized training of machine learning (ML) models across clients without data centralization. Decentralized training, however, introduces a computational burden on client devices. U-shaped federated split learning (UFSL) offloads a fraction of the client computation to the server while keeping both data and labels on the clients' side. However, the intermediate representations (i.e., smashed data) shared by clients with the server are prone to exposing clients' private data. To reduce exposure of client data through intermediate data representations, this work proposes k-anonymous differentially private UFSL (KD-UFSL), which leverages privacy-enhancing techniques such as microaggregation and differential privacy to minimize data leakage from the smashed data transferred to the server. We first demonstrate that an adversary can access private client data from intermediate representations via a data-reconstruction attack, and then present a privacy-enhancing solution, KD-UFSL, to mitigate this risk. Our experiments indicate that, alongside increasing the mean squared error between the actual and reconstructed images by up to 50% in some cases, KD-UFSL also decreases the structural similarity between them by up to 40% on four benchmarking datasets. More importantly, KD-UFSL improves privacy while preserving the utility of the global model. This highlights its suitability for large-scale big data applications where privacy and utility must be balanced.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17625",
        "abs_url": "https://arxiv.org/abs/2602.17625",
        "pdf_url": "https://arxiv.org/pdf/2602.17625",
        "title": "Catastrophic Forgetting Resilient One-Shot Incremental Federated Learning",
        "authors": [
            "Obaidullah Zaland",
            "Zulfiqar Ahmad Khan",
            "Monowar Bhuyan"
        ],
        "comments": "Accepted for publication in the IEEE International Conference on Big Data (IEEE BigData) 2025",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Modern big-data systems generate massive, heterogeneous, and geographically dispersed streams that are large-scale and privacy-sensitive, making centralization challenging. While federated learning (FL) provides a privacy-enhancing training mechanism, it assumes a static data flow and learns a collaborative model over multiple rounds, making learning with \\textit{incremental} data challenging in limited-communication scenarios. This paper presents One-Shot Incremental Federated Learning (OSI-FL), the first FL framework that addresses the dual challenges of communication overhead and catastrophic forgetting. OSI-FL communicates category-specific embeddings, devised by a frozen vision-language model (VLM) from each client in a single communication round, which a pre-trained diffusion model at the server uses to synthesize new data similar to the client's data distribution. The synthesized samples are used on the server for training. However, two challenges still persist: i) tasks arriving incrementally need to retrain the global model, and ii) as future tasks arrive, retraining the model introduces catastrophic forgetting. To this end, we augment training with Selective Sample Retention (SSR), which identifies and retains the top-p most informative samples per category and task pair based on sample loss. SSR bounds forgetting by ensuring that representative retained samples are incorporated into training in further iterations. The experimental results indicate that OSI-FL outperforms baselines, including traditional and one-shot FL approaches, in both class-incremental and domain-incremental scenarios across three benchmark datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17633",
        "abs_url": "https://arxiv.org/abs/2602.17633",
        "pdf_url": "https://arxiv.org/pdf/2602.17633",
        "title": "When to Trust the Cheap Check: Weak and Strong Verification for Reasoning",
        "authors": [
            "Shayan Kiyani",
            "Sima Noorani",
            "George Pappas",
            "Hamed Hassani"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Machine Learning (stat.ML)",
        "abstract": "Reasoning with LLMs increasingly unfolds inside a broader verification loop. Internally, systems use cheap checks, such as self-consistency or proxy rewards, which we call weak verification. Externally, users inspect outputs and steer the model through feedback until results are trustworthy, which we call strong verification. These signals differ sharply in cost and reliability: strong verification can establish trust but is resource-intensive, while weak verification is fast and scalable but noisy and imperfect. We formalize this tension through weak--strong verification policies, which decide when to accept or reject based on weak verification and when to defer to strong verification. We introduce metrics capturing incorrect acceptance, incorrect rejection, and strong-verification frequency. Over population, we show that optimal policies admit a two-threshold structure and that calibration and sharpness govern the value of weak verifiers. Building on this, we develop an online algorithm that provably controls acceptance and rejection errors without assumptions on the query stream, the language model, or the weak verifier.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17641",
        "abs_url": "https://arxiv.org/abs/2602.17641",
        "pdf_url": "https://arxiv.org/pdf/2602.17641",
        "title": "FAMOSE: A ReAct Approach to Automated Feature Discovery",
        "authors": [
            "Keith Burghardt",
            "Jienan Liu",
            "Sadman Sakib",
            "Yuning Hao",
            "Bo Li"
        ],
        "comments": "23 pages, 6 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Feature engineering remains a critical yet challenging bottleneck in machine learning, particularly for tabular data, as identifying optimal features from an exponentially large feature space traditionally demands substantial domain expertise. To address this challenge, we introduce FAMOSE (Feature AugMentation and Optimal Selection agEnt), a novel framework that leverages the ReAct paradigm to autonomously explore, generate, and refine features while integrating feature selection and evaluation tools within an agent architecture. To our knowledge, FAMOSE represents the first application of an agentic ReAct framework to automated feature engineering, especially for both regression and classification tasks. Extensive experiments demonstrate that FAMOSE is at or near the state-of-the-art on classification tasks (especially tasks with more than 10K instances, where ROC-AUC increases 0.23% on average), and achieves the state-of-the-art for regression tasks by reducing RMSE by 2.0% on average, while remaining more robust to errors than other algorithms. We hypothesize that FAMOSE's strong performance is because ReAct allows the LLM context window to record (via iterative feature discovery and evaluation steps) what features did or did not work. This is similar to a few-shot prompt and guides the LLM to invent better, more innovative features. Our work offers evidence that AI agents are remarkably effective in solving problems that require highly inventive solutions, such as feature engineering.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17642",
        "abs_url": "https://arxiv.org/abs/2602.17642",
        "pdf_url": "https://arxiv.org/pdf/2602.17642",
        "title": "A.R.I.S.: Automated Recycling Identification System for E-Waste Classification Using Deep Learning",
        "authors": [
            "Dhruv Talwar",
            "Harsh Desai",
            "Wendong Yin",
            "Goutam Mohanty",
            "Rafael Reveles"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Traditional electronic recycling processes suffer from significant resource loss due to inadequate material separation and identification capabilities, limiting material recovery. We present A.R.I.S. (Automated Recycling Identification System), a low-cost, portable sorter for shredded e-waste that addresses this efficiency gap. The system employs a YOLOx model to classify metals, plastics, and circuit boards in real time, achieving low inference latency with high detection accuracy. Experimental evaluation yielded 90% overall precision, 82.2% mean average precision (mAP), and 84% sortation purity. By integrating deep learning with established sorting methods, A.R.I.S. enhances material recovery efficiency and lowers barriers to advanced recycling adoption. This work complements broader initiatives in extending product life cycles, supporting trade-in and recycling programs, and reducing environmental impact across the supply chain.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17646",
        "abs_url": "https://arxiv.org/abs/2602.17646",
        "pdf_url": "https://arxiv.org/pdf/2602.17646",
        "title": "Multi-Round Human-AI Collaboration with User-Specified Requirements",
        "authors": [
            "Sima Noorani",
            "Shayan Kiyani",
            "Hamed Hassani",
            "George Pappas"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As humans increasingly rely on multiround conversational AI for high stakes decisions, principled frameworks are needed to ensure such interactions reliably improve decision quality. We adopt a human centric view governed by two principles: counterfactual harm, ensuring the AI does not undermine human strengths, and complementarity, ensuring it adds value where the human is prone to err. We formalize these concepts via user defined rules, allowing users to specify exactly what harm and complementarity mean for their specific task. We then introduce an online, distribution free algorithm with finite sample guarantees that enforces the user-specified constraints over the collaboration dynamics. We evaluate our framework across two interactive settings: LLM simulated collaboration on a medical diagnostic task and a human crowdsourcing study on a pictorial reasoning task. We show that our online procedure maintains prescribed counterfactual harm and complementarity violation rates even under nonstationary interaction dynamics. Moreover, tightening or loosening these constraints produces predictable shifts in downstream human accuracy, confirming that the two principles serve as practical levers for steering multi-round collaboration toward better decision quality without the need to model or constrain human behavior.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17658",
        "abs_url": "https://arxiv.org/abs/2602.17658",
        "pdf_url": "https://arxiv.org/pdf/2602.17658",
        "title": "MARS: Margin-Aware Reward-Modeling with Self-Refinement",
        "authors": [
            "Payel Bhattacharjee",
            "Osvaldo Simeone",
            "Ravi Tandon"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Information Theory (cs.IT)",
        "abstract": "Reward modeling is a core component of modern alignment pipelines including RLHF and RLAIF, underpinning policy optimization methods including PPO and TRPO. However, training reliable reward models relies heavily on human-labeled preference data, which is costly and limited, motivating the use of data augmentation. Existing augmentation approaches typically operate at the representation or semantic level and remain agnostic to the reward model's estimation difficulty. In this paper, we propose MARS, an adaptive, margin-aware augmentation and sampling strategy that explicitly targets ambiguous and failure modes of the reward model. Our proposed framework, MARS, concentrates augmentation on low-margin (ambiguous) preference pairs where the reward model is most uncertain, and iteratively refines the training distribution via hard-sample augmentation. We provide theoretical guarantees showing that this strategy increases the average curvature of the loss function hence enhance information and improves conditioning, along with empirical results demonstrating consistent gains over uniform augmentation for robust reward modeling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2505.15847",
        "abs_url": "https://arxiv.org/abs/2505.15847",
        "pdf_url": "https://arxiv.org/pdf/2505.15847",
        "title": "Graph Neural Networks Based Anomalous RSSI Detection",
        "authors": [
            "Blaž Bertalanič",
            "Matej Vnučec",
            "Carolina Fortuna"
        ],
        "comments": "5 pages, 3 figures",
        "subjects": "Networking and Internet Architecture (cs.NI); Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "In today's world, modern infrastructures are being equipped with information and communication technologies to create large IoT networks. It is essential to monitor these networks to ensure smooth operations by detecting and correcting link failures or abnormal network behaviour proactively, which can otherwise cause interruptions in business operations. This paper presents a novel method for detecting anomalies in wireless links using graph neural networks. The proposed approach involves converting time series data into graphs and training a new graph neural network architecture based on graph attention networks that successfully detects anomalies at the level of individual measurements of the time series data. The model provides competitive results compared to the state of the art while being computationally more efficient with ~171 times fewer trainable parameters.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.09725",
        "abs_url": "https://arxiv.org/abs/2602.09725",
        "pdf_url": "https://arxiv.org/pdf/2602.09725",
        "title": "Efficient Remote Prefix Fetching with GPU-native Media ASICs",
        "authors": [
            "Liang Mi",
            "Weijun Wang",
            "Jinghan Chen",
            "Ting Cao",
            "Haipeng Dai",
            "Yunxin Liu"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "Remote KV cache reuse fetches KV cache for identical contexts from remote storage, avoiding recomputation, accelerating LLM inference. While it excels in high-speed networks, its performance degrades significantly in bandwidth-limited scenarios. Recent studies address this by transmitting KV caches in compressed form, but the associated heavyweight decompression counteracts the KV reuse benefits. In this paper, we propose an efficient and widely deployable remote KV cache reuse solution that leverages GPU-native video codecs. Our system, KVFetcher, enables effective KV cache coding with two techniques. The codec-friendly tensor layout compresses the KV cache in a highly compact video format, enabling fast transmission. The efficient KV fetcher orchestrates the transmission, decoding, and restoration of compressed KV caches in an efficient pipelined manner, eliminating resource contention, masking network fluctuations, and achieving minimum time-to-first-token (TTFT). We prototype KVFetcher on diverse GPUs from high- to low-end. Experiments reveal that it reduces TTFT by up to 3.51 times while maintaining lossless accuracy, compared to SOTA methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16075",
        "abs_url": "https://arxiv.org/abs/2602.16075",
        "pdf_url": "https://arxiv.org/pdf/2602.16075",
        "title": "DARTH-PUM: A Hybrid Processing-Using-Memory Architecture",
        "authors": [
            "Ryan Wong",
            "Ben Feinberg",
            "Saugata Ghose"
        ],
        "comments": "To appear in the ACM International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS) 2026",
        "subjects": "Hardware Architecture (cs.AR); Cryptography and Security (cs.CR); Emerging Technologies (cs.ET); Machine Learning (cs.LG)",
        "abstract": "Analog processing-using-memory (PUM; a.k.a. in-memory computing) makes use of electrical interactions inside memory arrays to perform bulk matrix-vector multiplication (MVM) operations. However, many popular matrix-based kernels need to execute non-MVM operations, which analog PUM cannot directly perform. To retain its energy efficiency, analog PUM architectures augment memory arrays with CMOS-based domain-specific fixed-function hardware to provide complete kernel functionality, but the difficulty of integrating such specialized CMOS logic with memory arrays has largely limited analog PUM to being an accelerator for machine learning inference, or for closely related kernels. An opportunity exists to harness analog PUM for general-purpose computation: recent works have shown that memory arrays can also perform Boolean PUM operations, albeit with very different supporting hardware and electrical signals than analog PUM. We propose DARTH-PUM, a general-purpose hybrid PUM architecture that tackles key hardware and software challenges to integrating analog PUM and digital PUM. We propose optimized peripheral circuitry, coordinating hardware to manage and interface between both types of PUM, an easy-to-use programming interface, and low-cost support for flexible data widths. These design elements allow us to build a practical PUM architecture that can execute kernels fully in memory, and can scale easily to cater to domains ranging from embedded applications to large-scale data-driven computing. We show how three popular applications (AES encryption, convolutional neural networks, large-language models) can map to and benefit from DARTH-PUM, with speedups of 59.4x, 14.8x, and 40.8x over an analog+CPU baseline.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16721",
        "abs_url": "https://arxiv.org/abs/2602.16721",
        "pdf_url": "https://arxiv.org/pdf/2602.16721",
        "title": "Speech to Speech Synthesis for Voice Impersonation",
        "authors": [
            "Bjorn Johnson",
            "Jared Levy"
        ],
        "comments": "Original work completed in April 2020. This version includes minor formatting updates",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG); Audio and Speech Processing (eess.AS)",
        "abstract": "Numerous models have shown great success in the fields of speech recognition as well as speech synthesis, but models for speech to speech processing have not been heavily explored. We propose Speech to Speech Synthesis Network (STSSN), a model based on current state of the art systems that fuses the two disciplines in order to perform effective speech to speech style transfer for the purpose of voice impersonation. We show that our proposed model is quite powerful, and succeeds in generating realistic audio samples despite a number of drawbacks in its capacity. We benchmark our proposed model by comparing it with a generative adversarial model which accomplishes a similar task, and show that ours produces more convincing results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16729",
        "abs_url": "https://arxiv.org/abs/2602.16729",
        "pdf_url": "https://arxiv.org/pdf/2602.16729",
        "title": "Intent Laundering: AI Safety Datasets Are Not What They Seem",
        "authors": [
            "Shahriar Golchin",
            "Marc Wetter"
        ],
        "comments": "v1 preprint",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "We systematically evaluate the quality of widely used AI safety datasets from two perspectives: in isolation and in practice. In isolation, we examine how well these datasets reflect real-world attacks based on three key properties: driven by ulterior intent, well-crafted, and out-of-distribution. We find that these datasets overrely on \"triggering cues\": words or phrases with overt negative/sensitive connotations that are intended to trigger safety mechanisms explicitly, which is unrealistic compared to real-world attacks. In practice, we evaluate whether these datasets genuinely measure safety risks or merely provoke refusals through triggering cues. To explore this, we introduce \"intent laundering\": a procedure that abstracts away triggering cues from attacks (data points) while strictly preserving their malicious intent and all relevant details. Our results indicate that current AI safety datasets fail to faithfully represent real-world attacks due to their overreliance on triggering cues. In fact, once these cues are removed, all previously evaluated \"reasonably safe\" models become unsafe, including Gemini 3 Pro and Claude Sonnet 3.7. Moreover, when intent laundering is adapted as a jailbreaking technique, it consistently achieves high attack success rates, ranging from 90% to over 98%, under fully black-box access. Overall, our findings expose a significant disconnect between how model safety is evaluated and how real-world adversaries behave.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16737",
        "abs_url": "https://arxiv.org/abs/2602.16737",
        "pdf_url": "https://arxiv.org/pdf/2602.16737",
        "title": "Exploring the Utility of MALDI-TOF Mass Spectrometry and Antimicrobial Resistance in Hospital Outbreak Detection",
        "authors": [
            "Chang Liu",
            "Jieshi Chen",
            "Alexander J. Sundermann",
            "Kathleen Shutt",
            "Marissa P. Griffith",
            "Lora Lee Pless",
            "Lee H. Harrison",
            "Artur W. Dubrawski"
        ],
        "comments": "",
        "subjects": "Quantitative Methods (q-bio.QM); Machine Learning (cs.LG)",
        "abstract": "Accurate and timely identification of hospital outbreak clusters is crucial for preventing the spread of infections that have epidemic potential. While assessing pathogen similarity through whole genome sequencing (WGS) is considered the gold standard for outbreak detection, its high cost and lengthy turnaround time preclude routine implementation in clinical laboratories. We explore the utility of two rapid and cost-effective alternatives to WGS, matrix-assisted laser desorption ionization-time of flight (MALDI-TOF) mass spectrometry and antimicrobial resistance (AR) patterns. We develop a machine learning framework that extracts informative representations from MALDI-TOF spectra and AR patterns for outbreak detection and explore their fusion. Through multi-species analyses, we demonstrate that in some cases MALDI-TOF and AR have the potential to reduce reliance on WGS, enabling more accessible and rapid outbreak surveillance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16738",
        "abs_url": "https://arxiv.org/abs/2602.16738",
        "pdf_url": "https://arxiv.org/pdf/2602.16738",
        "title": "Self-Evolving Multi-Agent Network for Industrial IoT Predictive Maintenance",
        "authors": [
            "Rebin Saleh",
            "Khanh Pham Dinh",
            "Balázs Villányi",
            "Truong-Son Hy"
        ],
        "comments": "",
        "subjects": "Multiagent Systems (cs.MA); Machine Learning (cs.LG)",
        "abstract": "Industrial IoT predictive maintenance requires systems capable of real-time anomaly detection without sacrificing interpretability or demanding excessive computational resources. Traditional approaches rely on static, offline-trained models that cannot adapt to evolving operational conditions, while LLM-based monolithic systems demand prohibitive memory and latency, rendering them impractical for on-site edge deployment. We introduce SEMAS, a self-evolving hierarchical multi-agent system that distributes specialized agents across Edge, Fog, and Cloud computational tiers. Edge agents perform lightweight feature extraction and pre-filtering; Fog agents execute diversified ensemble detection with dynamic consensus voting; and Cloud agents continuously optimize system policies via Proximal Policy Optimization (PPO) while maintaining asynchronous, non-blocking inference. The framework incorporates LLM-based response generation for explainability and federated knowledge aggregation for adaptive policy distribution. This architecture enables resource-aware specialization without sacrificing real-time performance or model interpretability. Empirical evaluation on two industrial benchmarks (Boiler Emulator and Wind Turbine) demonstrates that SEMAS achieves superior anomaly detection performance with exceptional stability under adaptation, sustains prediction accuracy across evolving operational contexts, and delivers substantial latency improvements enabling genuine real-time deployment. Ablation studies confirm that PPO-driven policy evolution, consensus voting, and federated aggregation each contribute materially to system effectiveness. These findings indicate that resource-aware, self-evolving 1multi-agent coordination is essential for production-ready industrial IoT predictive maintenance under strict latency and explainability constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16749",
        "abs_url": "https://arxiv.org/abs/2602.16749",
        "pdf_url": "https://arxiv.org/pdf/2602.16749",
        "title": "U-FedTomAtt: Ultra-lightweight Federated Learning with Attention for Tomato Disease Recognition",
        "authors": [
            "Romiyal George",
            "Sathiyamohan Nishankar",
            "Selvarajah Thuseethan",
            "Chathrie Wimalasooriya",
            "Yakub Sebastian",
            "Roshan G. Ragel",
            "Zhongwei Liang"
        ],
        "comments": "10 pages and 4 figures",
        "subjects": "Quantitative Methods (q-bio.QM); Machine Learning (cs.LG)",
        "abstract": "Federated learning has emerged as a privacy-preserving and efficient approach for deploying intelligent agricultural solutions. Accurate edge-based diagnosis across geographically dispersed farms is crucial for recognising tomato diseases in sustainable farming. Traditional centralised training aggregates raw data on a central server, leading to communication overhead, privacy risks and latency. Meanwhile, edge devices require lightweight networks to operate effectively within limited resources. In this paper, we propose U-FedTomAtt, an ultra-lightweight federated learning framework with attention for tomato disease recognition in resource-constrained and distributed environments. The model comprises only 245.34K parameters and 71.41 MFLOPS. First, we propose an ultra-lightweight neural network with dilated bottleneck (DBNeck) modules and a linear transformer to minimise computational and memory overhead. To mitigate potential accuracy loss, a novel local-global residual attention (LoGRA) module is incorporated. Second, we propose the federated dual adaptive weight aggregation (FedDAWA) algorithm that enhances global model accuracy. Third, our framework is validated using three benchmark datasets for tomato diseases under simulated federated settings. Experimental results show that the proposed method achieves 0.9910% and 0.9915% Top-1 accuracy and 0.9923% and 0.9897% F1-scores on SLIF-Tomato and PlantVillage tomato datasets, respectively.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16794",
        "abs_url": "https://arxiv.org/abs/2602.16794",
        "pdf_url": "https://arxiv.org/pdf/2602.16794",
        "title": "Beyond Procedure: Substantive Fairness in Conformal Prediction",
        "authors": [
            "Pengqi Liu",
            "Zijun Yu",
            "Mouloud Belbahri",
            "Arthur Charpentier",
            "Masoud Asgharian",
            "Jesse C. Cresswell"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Conformal prediction (CP) offers distribution-free uncertainty quantification for machine learning models, yet its interplay with fairness in downstream decision-making remains underexplored. Moving beyond CP as a standalone operation (procedural fairness), we analyze the holistic decision-making pipeline to evaluate substantive fairness-the equity of downstream outcomes. Theoretically, we derive an upper bound that decomposes prediction-set size disparity into interpretable components, clarifying how label-clustered CP helps control method-driven contributions to unfairness. To facilitate scalable empirical analysis, we introduce an LLM-in-the-loop evaluator that approximates human assessment of substantive fairness across diverse modalities. Our experiments reveal that label-clustered CP variants consistently deliver superior substantive fairness. Finally, we empirically show that equalized set sizes, rather than coverage, strongly correlate with improved substantive fairness, enabling practitioners to design more fair CP systems. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16802",
        "abs_url": "https://arxiv.org/abs/2602.16802",
        "pdf_url": "https://arxiv.org/pdf/2602.16802",
        "title": "References Improve LLM Alignment in Non-Verifiable Domains",
        "authors": [
            "Kejian Shi",
            "Yixin Liu",
            "Peifeng Wang",
            "Alexander R. Fabbri",
            "Shafiq Joty",
            "Arman Cohan"
        ],
        "comments": "ICLR 2026 Camera Ready",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "While Reinforcement Learning with Verifiable Rewards (RLVR) has shown strong effectiveness in reasoning tasks, it cannot be directly applied to non-verifiable domains lacking ground-truth verifiers, such as LLM alignment. In this work, we investigate whether reference-guided LLM-evaluators can bridge this gap by serving as soft \"verifiers\". First, we design evaluation protocols that enhance LLM-based evaluators for LLM alignment using reference outputs. Through comprehensive experiments, we show that a reference-guided approach substantially improves the accuracy of less capable LLM-judges using references from frontier models; stronger LLM-judges can also be enhanced by high-quality (i.e., human-written) references. Building on these improved judges, we demonstrate the utility of high-quality references in alignment tuning, where LLMs guided with references are used as judges to self-improve. We show that reference-guided self-improvement yields clear gains over both direct SFT on reference outputs and self-improvement with reference-free judges, achieving performance comparable to training with ArmoRM, a strong finetuned reward model. Specifically, our method achieves 73.1% and 58.7% on AlpacaEval and Arena-Hard with Llama-3-8B-Instruct, and 70.0% and 74.1% with Qwen2.5-7B, corresponding to average absolute gains of +20.2 / +17.1 points over SFT distillation and +5.3 / +3.6 points over reference-free self-improvement on AlpacaEval / Arena-Hard. These results highlight the potential of using reference-guided LLM-evaluators to enable effective LLM post-training in non-verifiable domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16819",
        "abs_url": "https://arxiv.org/abs/2602.16819",
        "pdf_url": "https://arxiv.org/pdf/2602.16819",
        "title": "Hybrid-Gym: Training Coding Agents to Generalize Across Tasks",
        "authors": [
            "Yiqing Xie",
            "Emmy Liu",
            "Gaokai Zhang",
            "Nachiket Kotalwar",
            "Shubham Gandhi",
            "Sathwik Acharya",
            "Xingyao Wang",
            "Carolyn Rose",
            "Graham Neubig",
            "Daniel Fried"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "When assessing the quality of coding agents, predominant benchmarks focus on solving single issues on GitHub, such as SWE-Bench. In contrast, in real use, these agents solve more various and complex tasks that involve other skills such as exploring codebases, testing software, and designing architecture. In this paper, we first characterize some transferable skills that are shared across diverse tasks by decomposing trajectories into fine-grained components, and derive a set of principles for designing auxiliary training tasks to teach language models these skills. Guided by these principles, we propose a training environment, Hybrid-Gym, consisting of a set of scalable synthetic tasks, such as function localization and dependency search. Experiments show that agents trained on our synthetic tasks effectively generalize to diverse real-world tasks that are not present in training, improving a base model by 25.4% absolute gain on SWE-Bench Verified, 7.9% on SWT-Bench Verified, and 5.1% on Commit-0 Lite. Hybrid-Gym also complements datasets built for the downstream tasks (e.g., improving SWE-Play by 4.9% on SWT-Bench Verified). Code available at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16830",
        "abs_url": "https://arxiv.org/abs/2602.16830",
        "pdf_url": "https://arxiv.org/pdf/2602.16830",
        "title": "The Impact of Formations on Football Matches Using Double Machine Learning. Is it worth parking the bus?",
        "authors": [
            "Genís Ruiz-Menárguez",
            "Llorenç Badiella"
        ],
        "comments": "17 pages, 5 figures, 3 tables",
        "subjects": "Applications (stat.AP); Machine Learning (cs.LG)",
        "abstract": "This study addresses a central tactical dilemma for football coaches: whether to employ a defensive strategy, colloquially known as \"parking the bus\", or a more offensive one. Using an advanced Double Machine Learning (DML) framework, this project provides a robust and interpretable tool to estimate the causal impact of different formations on key match outcomes such as goal difference, possession, corners, and disciplinary actions. Leveraging a dataset of over 22,000 matches from top European leagues, formations were categorized into six representative types based on tactical structure and expert consultation. A major methodological contribution lies in the adaptation of DML to handle categorical treatments, specifically formation combinations, through a novel matrix-based residualization process, allowing for a detailed estimation of formation-versus-formation effects that can inform a coach's tactical decision-making. Results show that while offensive formations like 4-3-3 and 4-2-3-1 offer modest statistical advantages in possession and corners, their impact on goals is limited. Furthermore, no evidence supports the idea that defensive formations, commonly associated with parking the bus, increase a team's winning potential. Additionally, red cards appear unaffected by formation choice, suggesting other behavioral factors dominate. Although this approach does not fully capture all aspects of playing style or team strength, it provides a valuable framework for coaches to analyze tactical efficiency and sets a precedent for future research in sports analytics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16835",
        "abs_url": "https://arxiv.org/abs/2602.16835",
        "pdf_url": "https://arxiv.org/pdf/2602.16835",
        "title": "NeST: Neuron Selective Tuning for LLM Safety",
        "authors": [
            "Sasha Behrouzi",
            "Lichao Wu",
            "Mohamadreza Rostami",
            "Ahmad-Reza Sadeghi"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Safety alignment is essential for the responsible deployment of large language models (LLMs). Yet, existing approaches often rely on heavyweight fine-tuning that is costly to update, audit, and maintain across model families. Full fine-tuning incurs substantial computational and storage overhead, while parameter-efficient methods such as LoRA trade efficiency for inconsistent safety gains and sensitivity to design choices. Safety intervention mechanisms such as circuit breakers reduce unsafe outputs without modifying model weights, but do not directly shape or preserve the internal representations that govern safety behavior. These limitations hinder rapid and reliable safety updates, particularly in settings where models evolve frequently or must adapt to new policies and domains. We present NeST, a lightweight, structure-aware safety alignment framework that strengthens refusal behavior by selectively adapting a small subset of safety-relevant neurons while freezing the remainder of the model. NeST aligns parameter updates with the internal organization of safety behavior by clustering functionally coherent safety neurons and enforcing shared updates within each cluster, enabling targeted and stable safety adaptation without broad model modification or inference-time overhead. We benchmark NeST against three dominant baselines: full fine-tuning, LoRA-based fine-tuning, and circuit breakers across 10 open-weight LLMs spanning multiple model families and sizes. Across all evaluated models, NeST reduces the attack success rate from an average of 44.5% to 4.36%, corresponding to a 90.2% reduction in unsafe generations, while requiring only 0.44 million trainable parameters on average. This amounts to a 17,310x decrease in updated parameters compared to full fine-tuning and a 9.25x reduction relative to LoRA, while consistently achieving stronger safety performance for alignment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16902",
        "abs_url": "https://arxiv.org/abs/2602.16902",
        "pdf_url": "https://arxiv.org/pdf/2602.16902",
        "title": "LLM-WikiRace: Benchmarking Long-term Planning and Reasoning over Real-World Knowledge Graphs",
        "authors": [
            "Juliusz Ziomek",
            "William Bankes",
            "Lorenz Wolf",
            "Shyam Sundhar Ramesh",
            "Xiaohang Tang",
            "Ilija Bogunovic"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "We introduce LLM-Wikirace, a benchmark for evaluating planning, reasoning, and world knowledge in large language models (LLMs). In LLM-Wikirace, models must efficiently navigate Wikipedia hyperlinks step by step to reach a target page from a given source, requiring look-ahead planning and the ability to reason about how concepts are connected in the real world. We evaluate a broad set of open- and closed-source models, including Gemini-3, GPT-5, and Claude Opus 4.5, which achieve the strongest results on the easy level of the task and demonstrate superhuman performance. Despite this, performance drops sharply on hard difficulty: the best-performing model, Gemini-3, succeeds in only 23\\% of hard games, highlighting substantial remaining challenges for frontier models. Our analysis shows that world knowledge is a necessary ingredient for success, but only up to a point, beyond this threshold, planning and long-horizon reasoning capabilities become the dominant factors. Trajectory-level analysis further reveals that even the strongest models struggle to replan after failure, frequently entering loops rather than recovering. LLM-Wikirace is a simple benchmark that reveals clear limitations in current reasoning systems, offering an open arena where planning-capable LLMs still have much to prove. Our code and leaderboard available at https:/llmwikirace.github.io.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16908",
        "abs_url": "https://arxiv.org/abs/2602.16908",
        "pdf_url": "https://arxiv.org/pdf/2602.16908",
        "title": "Multi-objective optimization and quantum hybridization of equivariant deep learning interatomic potentials on organic and inorganic compounds",
        "authors": [
            "G. Laskaris",
            "D. Morozov",
            "D. Tarpanov",
            "A. Seth",
            "J. Procelewska",
            "G. Sai Gautam",
            "A. Sagingalieva",
            "R. Brasher",
            "A. Melnikov"
        ],
        "comments": "13 pages, 6 figures, 5 tables",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "Allegro is a machine learning interatomic potential (MLIP) model designed to predict atomic properties in molecules using E(3) equivariant neural networks. When training this model, there tends to be a trade-off between accuracy and inference time. For this reason we apply multi-objective hyperparameter optimization to the two objectives. Additionally, we experiment with modified architectures by making variants of Allegro some by adding strictly classical multi-layer perceptron (MLP) layers and some by adding quantum-classical hybrid layers. We compare the results from QM9, rMD17-aspirin, rMD17-benzene and our own proprietary dataset consisting of copper and lithium atoms. As results, we have a list of variants that surpass the Allegro in accuracy and also results which demonstrate the trade-off with inference times.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16914",
        "abs_url": "https://arxiv.org/abs/2602.16914",
        "pdf_url": "https://arxiv.org/pdf/2602.16914",
        "title": "A statistical perspective on transformers for small longitudinal cohort data",
        "authors": [
            "Kiana Farhadyar",
            "Maren Hackenberg",
            "Kira Ahrens",
            "Charlotte Schenk",
            "Bianca Kollmann",
            "Oliver Tüscher",
            "Klaus Lieb",
            "Michael M. Plichta",
            "Andreas Reif",
            "Raffael Kalisch",
            "Martin Wolkewitz",
            "Moritz Hess",
            "Harald Binder"
        ],
        "comments": "",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Modeling of longitudinal cohort data typically involves complex temporal dependencies between multiple variables. There, the transformer architecture, which has been highly successful in language and vision applications, allows us to account for the fact that the most recently observed time points in an individual's history may not always be the most important for the immediate future. This is achieved by assigning attention weights to observations of an individual based on a transformation of their values. One reason why these ideas have not yet been fully leveraged for longitudinal cohort data is that typically, large datasets are required. Therefore, we present a simplified transformer architecture that retains the core attention mechanism while reducing the number of parameters to be estimated, to be more suitable for small datasets with few time points. Guided by a statistical perspective on transformers, we use an autoregressive model as a starting point and incorporate attention as a kernel-based operation with temporal decay, where aggregation of multiple transformer heads, i.e. different candidate weighting schemes, is expressed as accumulating evidence on different types of underlying characteristics of individuals. This also enables a permutation-based statistical testing procedure for identifying contextual patterns. In a simulation study, the approach is shown to recover contextual dependencies even with a small number of individuals and time points. In an application to data from a resilience study, we identify temporal patterns in the dynamics of stress and mental health. This indicates that properly adapted transformers can not only achieve competitive predictive performance, but also uncover complex context dependencies in small data settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16923",
        "abs_url": "https://arxiv.org/abs/2602.16923",
        "pdf_url": "https://arxiv.org/pdf/2602.16923",
        "title": "Poisson-MNL Bandit: Nearly Optimal Dynamic Joint Assortment and Pricing with Decision-Dependent Customer Arrivals",
        "authors": [
            "Junhui Cai",
            "Ran Chen",
            "Qitao Huang",
            "Linda Zhao",
            "Wu Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We study dynamic joint assortment and pricing where a seller updates decisions at regular accounting/operating intervals to maximize the cumulative per-period revenue over a horizon $T$. In many settings, assortment and prices affect not only what an arriving customer buys but also how many customers arrive within the period, whereas classical multinomial logit (MNL) models assume arrivals as fixed, potentially leading to suboptimal decisions. We propose a Poisson-MNL model that couples a contextual MNL choice model with a Poisson arrival model whose rate depends on the offered assortment and prices. Building on this model, we develop an efficient algorithm PMNL based on the idea of upper confidence bound (UCB). We establish its (near) optimality by proving a non-asymptotic regret bound of order $\\sqrt{T\\log{T}}$ and a matching lower bound (up to $\\log T$). Simulation studies underscore the importance of accounting for the dependency of arrival rates on assortment and pricing: PMNL effectively learns customer choice and arrival models and provides joint assortment-pricing decisions that outperform others that assume fixed arrival rates.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16951",
        "abs_url": "https://arxiv.org/abs/2602.16951",
        "pdf_url": "https://arxiv.org/pdf/2602.16951",
        "title": "BrainRVQ: A High-Fidelity EEG Foundation Model via Dual-Domain Residual Quantization and Hierarchical Autoregression",
        "authors": [
            "Mingzhe Cui",
            "Tao Chen",
            "Yang Jiao",
            "Yiqin Wang",
            "Lei Xie",
            "Yi Pan",
            "Luca Mainardi"
        ],
        "comments": "",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "Developing foundation models for electroencephalography (EEG) remains challenging due to the signal's low signal-to-noise ratio and complex spectro-temporal non-stationarity. Existing approaches often overlook the hierarchical latent structure inherent in neural dynamics, leading to suboptimal reconstruction of fine-grained information. In this work, we propose BrainRVQ, a general-purpose EEG foundation model pre-trained on a large-scale corpus of clinical EEG data. Unlike standard masked modeling, BrainRVQ features a Dual-Domain Residual Vector Quantization (DD-RVQ) tokenizer that disentangles temporal waveforms and spectral patterns into hierarchical discrete codes. We further introduce a hierarchical autoregressive pre-training objective that learns to reconstruct these codes in a coarse-to-fine manner, utilizing an importance-guided curriculum masking strategy to prioritize information-rich neural events over background noise. Extensive experiments across 8 diverse downstream datasets demonstrate that BrainRVQ consistently outperforms state-of-the-art baselines, validating its effectiveness in learning robust and generalizable neural representations. Our code and model weights are available:this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16958",
        "abs_url": "https://arxiv.org/abs/2602.16958",
        "pdf_url": "https://arxiv.org/pdf/2602.16958",
        "title": "Automating Agent Hijacking via Structural Template Injection",
        "authors": [
            "Xinhao Deng",
            "Jiaqing Wu",
            "Miao Chen",
            "Yue Xiao",
            "Ke Xu",
            "Qi Li"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Agent hijacking, highlighted by OWASP as a critical threat to the Large Language Model (LLM) ecosystem, enables adversaries to manipulate execution by injecting malicious instructions into retrieved content. Most existing attacks rely on manually crafted, semantics-driven prompt manipulation, which often yields low attack success rates and limited transferability to closed-source commercial models. In this paper, we propose Phantom, an automated agent hijacking framework built upon Structured Template Injection that targets the fundamental architectural mechanisms of LLM agents. Our key insight is that agents rely on specific chat template tokens to separate system, user, assistant, and tool instructions. By injecting optimized structured templates into the retrieved context, we induce role confusion and cause the agent to misinterpret the injected content as legitimate user instructions or prior tool outputs. To enhance attack transferability against black-box agents, Phantom introduces a novel attack template search framework. We first perform multi-level template augmentation to increase structural diversity and then train a Template Autoencoder (TAE) to embed discrete templates into a continuous, searchable latent space. Subsequently, we apply Bayesian optimization to efficiently identify optimal adversarial vectors that are decoded into high-potency structured templates. Extensive experiments on Qwen, GPT, and Gemini demonstrate that our framework significantly outperforms existing baselines in both Attack Success Rate (ASR) and query efficiency. Moreover, we identified over 70 vulnerabilities in real-world commercial products that have been confirmed by vendors, underscoring the practical severity of structured template-based hijacking and providing an empirical foundation for securing next-generation agentic systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16961",
        "abs_url": "https://arxiv.org/abs/2602.16961",
        "pdf_url": "https://arxiv.org/pdf/2602.16961",
        "title": "Greedy Multi-Path Block Verification for Faster Decoding in Speculative Sampling",
        "authors": [
            "Rahul Thomas",
            "Arka Pal"
        ],
        "comments": "",
        "subjects": "Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "The goal of $L$-step speculative decoding is to accelerate autoregressive decoding of a target model by using a cheaper draft model to generate a candidate path of $L$ tokens. Based on a verification algorithm involving target and draft model probabilities, a prefix of the candidate sequence is accepted, and an additional correction token is sampled from a residual distribution to ensure that the final output adheres to the target distribution. While standard speculative decoding uses a verification algorithm which is independent at each token on the path, a recent extension called block verification uses a joint condition involving all sampled on-path probabilities. Block verification (BV) was shown to be optimal over all verification algorithms which use only on-path probabilities, improving on standard speculative decoding. In this work, we first show that block verification is optimal even over verification algorithms that use off-path probabilities, by constructing an information-agnostic linear program (LP). Further, we can extend our LP to the setting where the draft model samples multiple candidate paths, and use it to construct a natural class of multi-path block verification generalizations. While computing the optimal algorithm in this class is not tractable, by considering a stricter class of greedy algorithms, we can formulate an efficient method called greedy multi-path block verification (GBV). Empirically, GBV can improve block efficiency by over 30% and reduce decoding walltimes by over 15% relative to BV. On Llama-3 70B, GBV can improve the end-to-end decoding throughput over SOTA multi-path verification methods by more than 15%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.16979",
        "abs_url": "https://arxiv.org/abs/2602.16979",
        "pdf_url": "https://arxiv.org/pdf/2602.16979",
        "title": "Characterizing the Predictive Impact of Modalities with Supervised Latent-Variable Modeling",
        "authors": [
            "Divyam Madaan",
            "Sumit Chopra",
            "Kyunghyun Cho"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Despite the recent success of Multimodal Large Language Models (MLLMs), existing approaches predominantly assume the availability of multiple modalities during training and inference. In practice, multimodal data is often incomplete because modalities may be missing, collected asynchronously, or available only for a subset of examples. In this work, we propose PRIMO, a supervised latent-variable imputation model that quantifies the predictive impact of any missing modality within the multimodal learning setting. PRIMO enables the use of all available training examples, whether modalities are complete or partial. Specifically, it models the missing modality through a latent variable that captures its relationship with the observed modality in the context of prediction. During inference, we draw many samples from the learned distribution over the missing modality to both obtain the marginal predictive distribution (for the purpose of prediction) and analyze the impact of the missing modalities on the prediction for each instance. We evaluate PRIMO on a synthetic XOR dataset, Audio-Vision MNIST, and MIMIC-III for mortality and ICD-9 prediction. Across all datasets, PRIMO obtains performance comparable to unimodal baselines when a modality is fully missing and to multimodal baselines when all modalities are available. PRIMO quantifies the predictive impact of a modality at the instance level using a variance-based metric computed from predictions across latent completions. We visually demonstrate how varying completions of the missing modality result in a set of plausible labels.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17036",
        "abs_url": "https://arxiv.org/abs/2602.17036",
        "pdf_url": "https://arxiv.org/pdf/2602.17036",
        "title": "LiveGraph: Active-Structure Neural Re-ranking for Exercise Recommendation",
        "authors": [
            "Rong Fu",
            "Zijian Zhang",
            "Haiyun Wei",
            "Jiekai Wu",
            "Kun Liu",
            "Xianda Li",
            "Haoyu Zhao",
            "Yang Li",
            "Yongtai Liu",
            "Ziming Wang",
            "Rui Lu",
            "Simon Fong"
        ],
        "comments": "19 pages, 5 figures",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "The continuous expansion of digital learning environments has catalyzed the demand for intelligent systems capable of providing personalized educational content. While current exercise recommendation frameworks have made significant strides, they frequently encounter obstacles regarding the long-tailed distribution of student engagement and the failure to adapt to idiosyncratic learning trajectories. We present LiveGraph, a novel active-structure neural re-ranking framework designed to overcome these limitations. Our approach utilizes a graph-based representation enhancement strategy to bridge the information gap between active and inactive students while integrating a dynamic re-ranking mechanism to foster content diversity. By prioritizing the structural relationships within learning histories, the proposed model effectively balances recommendation precision with pedagogical variety. Comprehensive experimental evaluations conducted on multiple real-world datasets demonstrate that LiveGraph surpasses contemporary baselines in both predictive accuracy and the breadth of exercise diversity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17086",
        "abs_url": "https://arxiv.org/abs/2602.17086",
        "pdf_url": "https://arxiv.org/pdf/2602.17086",
        "title": "Dynamic Decision-Making under Model Misspecification: A Stochastic Stability Approach",
        "authors": [
            "Xinyu Dai",
            "Daniel Chen",
            "Yian Qian"
        ],
        "comments": "",
        "subjects": "Theoretical Economics (econ.TH); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "Dynamic decision-making under model uncertainty is central to many economic environments, yet existing bandit and reinforcement learning algorithms rely on the assumption of correct model specification. This paper studies the behavior and performance of one of the most commonly used Bayesian reinforcement learning algorithms, Thompson Sampling (TS), when the model class is misspecified. We first provide a complete dynamic classification of posterior evolution in a misspecified two-armed Gaussian bandit, identifying distinct regimes: correct model concentration, incorrect model concentration, and persistent belief mixing, characterized by the direction of statistical evidence and the model-action mapping. These regimes yield sharp predictions for limiting beliefs, action frequencies, and asymptotic regret. We then extend the analysis to a general finite model class and develop a unified stochastic stability framework that represents posterior evolution as a Markov process on the belief simplex. This approach characterizes two sufficient conditions to classify the ergodic and transient behaviors and provides inductive dimensional reductions of the posterior dynamics. Our results offer the first qualitative and geometric classification of TS under misspecification, bridging Bayesian learning with evolutionary dynamics, and also build the foundations of robust decision-making in structured bandits.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17104",
        "abs_url": "https://arxiv.org/abs/2602.17104",
        "pdf_url": "https://arxiv.org/pdf/2602.17104",
        "title": "Simplify to Amplify: Achieving Information-Theoretic Bounds with Fewer Steps in Spectral Community Detection",
        "authors": [
            "Sie Hendrata Dharmawan",
            "Peter Chin"
        ],
        "comments": "9 pages plus appendix, 3 figures",
        "subjects": "Social and Information Networks (cs.SI); Machine Learning (cs.LG)",
        "abstract": "We propose a streamlined spectral algorithm for community detection in the two-community stochastic block model (SBM) under constant edge density assumptions. By reducing algorithmic complexity through the elimination of non-essential preprocessing steps, our method directly leverages the spectral properties of the adjacency matrix. We demonstrate that our algorithm exploits specific characteristics of the second eigenvalue to achieve improved error bounds that approach information-theoretic limits, representing a significant improvement over existing methods. Theoretical analysis establishes that our error rates are tighter than previously reported bounds in the literature. Comprehensive experimental validation confirms our theoretical findings and demonstrates the practical effectiveness of the simplified approach. Our results suggest that algorithmic simplification, rather than increasing complexity, can lead to both computational efficiency and enhanced performance in spectral community detection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17115",
        "abs_url": "https://arxiv.org/abs/2602.17115",
        "pdf_url": "https://arxiv.org/pdf/2602.17115",
        "title": "Semi-Supervised Learning on Graphs using Graph Neural Networks",
        "authors": [
            "Juntong Chen",
            "Claire Donnat",
            "Olga Klopp",
            "Johannes Schmidt-Hieber"
        ],
        "comments": "57 pages, 7 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Graph neural networks (GNNs) work remarkably well in semi-supervised node regression, yet a rigorous theory explaining when and why they succeed remains lacking. To address this gap, we study an aggregate-and-readout model that encompasses several common message passing architectures: node features are first propagated over the graph then mapped to responses via a nonlinear function. For least-squares estimation over GNNs with linear graph convolutions and a deep ReLU readout, we prove a sharp non-asymptotic risk bound that separates approximation, stochastic, and optimization errors. The bound makes explicit how performance scales with the fraction of labeled nodes and graph-induced dependence. Approximation guarantees are further derived for graph-smoothing followed by smooth nonlinear readouts, yielding convergence rates that recover classical nonparametric behavior under full supervision while characterizing performance when labels are scarce. Numerical experiments validate our theory, providing a systematic framework for understanding GNN performance and limitations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17187",
        "abs_url": "https://arxiv.org/abs/2602.17187",
        "pdf_url": "https://arxiv.org/pdf/2602.17187",
        "title": "Anti-causal domain generalization: Leveraging unlabeled data",
        "authors": [
            "Sorawit Saengkyongam",
            "Juan L. Gamella",
            "Andrew C. Miller",
            "Jonas Peters",
            "Nicolai Meinshausen",
            "Christina Heinze-Deml"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "The problem of domain generalization concerns learning predictive models that are robust to distribution shifts when deployed in new, previously unseen environments. Existing methods typically require labeled data from multiple training environments, limiting their applicability when labeled data are scarce. In this work, we study domain generalization in an anti-causal setting, where the outcome causes the observed covariates. Under this structure, environment perturbations that affect the covariates do not propagate to the outcome, which motivates regularizing the model's sensitivity to these perturbations. Crucially, estimating these perturbation directions does not require labels, enabling us to leverage unlabeled data from multiple environments. We propose two methods that penalize the model's sensitivity to variations in the mean and covariance of the covariates across environments, respectively, and prove that these methods have worst-case optimality guarantees under certain classes of environments. Finally, we demonstrate the empirical performance of our approach on a controlled physical system and a physiological signal dataset.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17211",
        "abs_url": "https://arxiv.org/abs/2602.17211",
        "pdf_url": "https://arxiv.org/pdf/2602.17211",
        "title": "MGD: Moment Guided Diffusion for Maximum Entropy Generation",
        "authors": [
            "Etienne Lempereur",
            "Nathanaël Cuvelle--Magar",
            "Florentin Coeurdoux",
            "Stéphane Mallat",
            "Eric Vanden-Eijnden"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Generating samples from limited information is a fundamental problem across scientific domains. Classical maximum entropy methods provide principled uncertainty quantification from moment constraints but require sampling via MCMC or Langevin dynamics, which typically exhibit exponential slowdown in high dimensions. In contrast, generative models based on diffusion and flow matching efficiently transport noise to data but offer limited theoretical guarantees and can overfit when data is scarce. We introduce Moment Guided Diffusion (MGD), which combines elements of both approaches. Building on the stochastic interpolant framework, MGD samples maximum entropy distributions by solving a stochastic differential equation that guides moments toward prescribed values in finite time, thereby avoiding slow mixing in equilibrium-based methods. We formally obtain, in the large-volatility limit, convergence of MGD to the maximum entropy distribution and derive a tractable estimator of the resulting entropy computed directly from the dynamics. Applications to financial time series, turbulent flows, and cosmological fields using wavelet scattering moments yield estimates of negentropy for high-dimensional multiscale processes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17223",
        "abs_url": "https://arxiv.org/abs/2602.17223",
        "pdf_url": "https://arxiv.org/pdf/2602.17223",
        "title": "Privacy-Preserving Mechanisms Enable Cheap Verifiable Inference of LLMs",
        "authors": [
            "Arka Pal",
            "Louai Zahran",
            "William Gvozdjak",
            "Akilesh Potti",
            "Micah Goldblum"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "As large language models (LLMs) continue to grow in size, fewer users are able to host and run models locally. This has led to increased use of third-party hosting services. However, in this setting, there is a lack of guarantees on the computation performed by the inference provider. For example, a dishonest provider may replace an expensive large model with a cheaper-to-run weaker model and return the results from the weaker model to the user. Existing tools to verify inference typically rely on methods from cryptography such as zero-knowledge proofs (ZKPs), but these add significant computational overhead, and remain infeasible for use for large models. In this work, we develop a new insight -- that given a method for performing private LLM inference, one can obtain forms of verified inference at marginal extra cost. Specifically, we propose two new protocols which leverage privacy-preserving LLM inference in order to provide guarantees over the inference that was carried out. Our approaches are cheap, requiring the addition of a few extra tokens of computation, and have little to no downstream impact. As the fastest privacy-preserving inference methods are typically faster than ZK methods, the proposed protocols also improve verification runtime. Our work provides novel insights into the connections between privacy and verifiability in LLM inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17281",
        "abs_url": "https://arxiv.org/abs/2602.17281",
        "pdf_url": "https://arxiv.org/pdf/2602.17281",
        "title": "Quantum Scrambling Born Machine",
        "authors": [
            "Marcin Płodzień"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "Quantum generative modeling, where the Born rule naturally defines probability distributions through measurement of parameterized quantum states, is a promising near-term application of quantum computing. We propose a Quantum Scrambling Born Machine in which a fixed entangling unitary -- acting as a scrambling reservoir -- provides multi-qubit entanglement, while only single-qubit rotations are optimized. We consider three entangling unitaries -- a Haar random unitary and two physically realizable approximations, a finite-depth brickwork random circuit and analog time evolution under nearest-neighbor spin-chain Hamiltonians -- and show that, for the benchmark distributions and system sizes considered, once the entangler produces near-Haar-typical entanglement the model learns the target distribution with weak sensitivity to the scrambler's microscopic origin. Finally, promoting the Hamiltonian couplings to trainable parameters casts the generative task as a variational Hamiltonian problem, with performance competitive with representative classical generative models at matched parameter count.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17287",
        "abs_url": "https://arxiv.org/abs/2602.17287",
        "pdf_url": "https://arxiv.org/pdf/2602.17287",
        "title": "Representation Collapse in Machine Translation Through the Lens of Angular Dispersion",
        "authors": [
            "Evgeniia Tokarchuk",
            "Maya K. Nachesa",
            "Sergey Troshin",
            "Vlad Niculae"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Modern neural translation models based on the Transformer architecture are known for their high performance, particularly when trained on high-resource datasets. A standard next-token prediction training strategy, while widely adopted in practice, may lead to overlooked artifacts such as representation collapse. Previous works have shown that this problem is especially pronounced in the representation of the deeper Transformer layers, where it often fails to efficiently utilize the geometric space. Representation collapse is even more evident in end-to-end training of continuous-output neural machine translation, where the trivial solution would be to set all vectors to the same value. In this work, we analyze the dynamics of representation collapse at different levels of discrete and continuous NMT transformers throughout training. We incorporate an existing regularization method based on angular dispersion and demonstrate empirically that it not only mitigates collapse but also improves translation quality. Furthermore, we show that quantized models exhibit similar collapse behavior and that the benefits of regularization are preserved even after quantization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17314",
        "abs_url": "https://arxiv.org/abs/2602.17314",
        "pdf_url": "https://arxiv.org/pdf/2602.17314",
        "title": "Open Datasets in Learning Analytics: Trends, Challenges, and Best PRACTICE",
        "authors": [
            "Valdemar Švábenský",
            "Brendan Flanagan",
            "Erwin Daniel López Zapata",
            "Atsushi Shimada"
        ],
        "comments": "Recently accepted to ACM Transactions on Knowledge Discovery from Data (TKDD). To appear. (Preprint will be updated with full bibliographic info.)",
        "subjects": "Computers and Society (cs.CY); Databases (cs.DB); Machine Learning (cs.LG)",
        "abstract": "Open datasets play a crucial role in three research domains that intersect data science and education: learning analytics, educational data mining, and artificial intelligence in education. Researchers in these domains apply computational methods to analyze data from educational contexts, aiming to better understand and improve teaching and learning. Providing open datasets alongside research papers supports reproducibility, collaboration, and trust in research findings. It also provides individual benefits for authors, such as greater visibility, credibility, and citation potential. Despite these advantages, the availability of open datasets and the associated practices within the learning analytics research communities, especially at their flagship conference venues, remain unclear. We surveyed available datasets published alongside research papers in learning analytics. We manually examined 1,125 papers from three flagship conferences (LAK, EDM, and AIED) over the past five years. We discovered, categorized, and analyzed 172 datasets used in 204 publications. Our study presents the most comprehensive collection and analysis of open educational datasets to date, along with the most detailed categorization. Of the 172 datasets identified, 143 were not captured in any prior survey of open data in learning analytics. We provide insights into the datasets' context, analytical methods, use, and other properties. Based on this survey, we summarize the current gaps in the field. Furthermore, we list practical recommendations, advice, and 8-item guidelines under the acronym PRACTICE with a checklist to help researchers publish their data. Lastly, we share our original dataset: an annotated inventory detailing the discovered datasets and the corresponding publications. We hope these findings will support further adoption of open data practices in learning analytics communities and beyond.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17346",
        "abs_url": "https://arxiv.org/abs/2602.17346",
        "pdf_url": "https://arxiv.org/pdf/2602.17346",
        "title": "Partial Optimality in the Preordering Problem",
        "authors": [
            "David Stein",
            "Jannik Irmai",
            "Bjoern Andres"
        ],
        "comments": "",
        "subjects": "Discrete Mathematics (cs.DM); Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG)",
        "abstract": "Preordering is a generalization of clustering and partial ordering with applications in bioinformatics and social network analysis. Given a finite set $V$ and a value $c_{ab} \\in \\mathbb{R}$ for every ordered pair $ab$ of elements of $V$, the preordering problem asks for a preorder $\\lesssim$ on $V$ that maximizes the sum of the values of those pairs $ab$ for which $a \\lesssim b$. Building on the state of the art in solving this NP-hard problem partially, we contribute new partial optimality conditions and efficient algorithms for deciding these conditions. In experiments with real and synthetic data, these new conditions increase, in particular, the fraction of pairs $ab$ for which it is decided efficiently that $a \\not\\lesssim b$ in an optimal preorder.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17431",
        "abs_url": "https://arxiv.org/abs/2602.17431",
        "pdf_url": "https://arxiv.org/pdf/2602.17431",
        "title": "Fine-Grained Uncertainty Quantification for Long-Form Language Model Outputs: A Comparative Study",
        "authors": [
            "Dylan Bouchard",
            "Mohit Singh Chauhan",
            "Viren Bajaj",
            "David Skarbrevik"
        ],
        "comments": "UQLM repository: this https URL",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Uncertainty quantification has emerged as an effective approach to closed-book hallucination detection for LLMs, but existing methods are largely designed for short-form outputs and do not generalize well to long-form generation. We introduce a taxonomy for fine-grained uncertainty quantification in long-form LLM outputs that distinguishes methods by design choices at three stages: response decomposition, unit-level scoring, and response-level aggregation. We formalize several families of consistency-based black-box scorers, providing generalizations and extensions of existing methods. In our experiments across multiple LLMs and datasets, we find 1) claim-response entailment consistently performs better or on par with more complex claim-level scorers, 2) claim-level scoring generally yields better results than sentence-level scoring, and 3) uncertainty-aware decoding is highly effective for improving the factuality of long-form outputs. Our framework clarifies relationships between prior methods, enables apples-to-apples comparisons, and provides practical guidance for selecting components for fine-grained UQ.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17445",
        "abs_url": "https://arxiv.org/abs/2602.17445",
        "pdf_url": "https://arxiv.org/pdf/2602.17445",
        "title": "ABCD: All Biases Come Disguised",
        "authors": [
            "Mateusz Nowak",
            "Xavier Cadet",
            "Peter Chin"
        ],
        "comments": "29 pages, 20 figures, pre-print, 12 tables",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Multiple-choice question (MCQ) benchmarks have been a standard evaluation practice for measuring LLMs' ability to reason and answer knowledge-based questions. Through a synthetic NonsenseQA benchmark, we observe that different LLMs exhibit varying degrees of label-position-few-shot-prompt bias, where the model either uses the answer position, the label in front of the answer, the distributions of correct answers present in the few-shot prompt, or a combination of all to answer each MCQ question. We propose a simple bias-reduced evaluation protocol that replaces the labels of each question with uniform, unordered labels and prompts the LLM to use the whole answer presented. With a simple sentence similarity model, we demonstrate improved robustness and lower standard deviation between different permutations of answers with a minimal drop in LLM's performance, exposing the LLM's capabilities under reduced evaluation artifacts, without any help from the prompt examples or the option labels. Across multiple benchmarks and models, this protocol substantially improves the robustness to answer permutations, reducing mean accuracy variance $3\\times$ with only a minimal decrease in the mean model's performance. Through ablation studies on various embedding models and similarity functions, we show that the method is more robust than the standard ones.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17537",
        "abs_url": "https://arxiv.org/abs/2602.17537",
        "pdf_url": "https://arxiv.org/pdf/2602.17537",
        "title": "IRIS: Learning-Driven Task-Specific Cinema Robot Arm for Visuomotor Motion Control",
        "authors": [
            "Qilong Cheng",
            "Matthew Mackay",
            "Ali Bereyhi"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Robotic camera systems enable dynamic, repeatable motion beyond human capabilities, yet their adoption remains limited by the high cost and operational complexity of industrial-grade platforms. We present the Intelligent Robotic Imaging System (IRIS), a task-specific 6-DOF manipulator designed for autonomous, learning-driven cinematic motion control. IRIS integrates a lightweight, fully 3D-printed hardware design with a goal-conditioned visuomotor imitation learning framework based on Action Chunking with Transformers (ACT). The system learns object-aware and perceptually smooth camera trajectories directly from human demonstrations, eliminating the need for explicit geometric programming. The complete platform costs under $1,000 USD, supports a 1.5 kg payload, and achieves approximately 1 mm repeatability. Real-world experiments demonstrate accurate trajectory tracking, reliable autonomous execution, and generalization across diverse cinematic motions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 113,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17543",
        "abs_url": "https://arxiv.org/abs/2602.17543",
        "pdf_url": "https://arxiv.org/pdf/2602.17543",
        "title": "genriesz: A Python Package for Automatic Debiased Machine Learning with Generalized Riesz Regression",
        "authors": [
            "Masahiro Kato"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Econometrics (econ.EM); Statistics Theory (math.ST); Methodology (stat.ME)",
        "abstract": "Efficient estimation of causal and structural parameters can be automated using the Riesz representation theorem and debiased machine learning (DML). We present genriesz, an open-source Python package that implements automatic DML and generalized Riesz regression, a unified framework for estimating Riesz representers by minimizing empirical Bregman divergences. This framework includes covariate balancing, nearest-neighbor matching, calibrated estimation, and density ratio estimation as special cases. A key design principle of the package is automatic regressor balancing (ARB): given a Bregman generator $g$ and a representer model class, genriesz} automatically constructs a compatible link function so that the generalized Riesz regression estimator satisfies balancing (moment-matching) optimality conditions in a user-chosen basis. The package provides a modulr interface for specifying (i) the target linear functional via a black-box evaluation oracle, (ii) the representer model via basis functions (polynomial, RKHS approximations, random forest leaf encodings, neural embeddings, and a nearest-neighbor catchment basis), and (iii) the Bregman generator, with optional user-supplied derivatives. It returns regression adjustment (RA), Riesz weighting (RW), augmented Riesz weighting (ARW), and TMLE-style estimators with cross-fitting, confidence intervals, and $p$-values. We highlight representative workflows for estimation problems such as the average treatment effect (ATE), ATE on treated (ATT), and average marginal effect estimation. The Python package is available at this https URL and on PyPI.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 114,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17545",
        "abs_url": "https://arxiv.org/abs/2602.17545",
        "pdf_url": "https://arxiv.org/pdf/2602.17545",
        "title": "Adaptive Decentralized Composite Optimization via Three-Operator Splitting",
        "authors": [
            "Xiaokai Chen",
            "Ilya Kuruzov",
            "Gesualdo Scutari"
        ],
        "comments": "25 pages, 3 figures",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "The paper studies decentralized optimization over networks, where agents minimize a sum of {\\it locally} smooth (strongly) convex losses and plus a nonsmooth convex extended value term. We propose decentralized methods wherein agents {\\it adaptively} adjust their stepsize via local backtracking procedures coupled with lightweight min-consensus protocols. Our design stems from a three-operator splitting factorization applied to an equivalent reformulation of the problem. The reformulation is endowed with a new BCV preconditioning metric (Bertsekas-O'Connor-Vandenberghe), which enables efficient decentralized implementation and local stepsize adjustments. We establish robust convergence guarantees. Under mere convexity, the proposed methods converge with a sublinear rate. Under strong convexity of the sum-function, and assuming the nonsmooth component is partly smooth, we further prove linear convergence. Numerical experiments corroborate the theory and highlight the effectiveness of the proposed adaptive stepsize strategy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 115,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17546",
        "abs_url": "https://arxiv.org/abs/2602.17546",
        "pdf_url": "https://arxiv.org/pdf/2602.17546",
        "title": "Learning to Stay Safe: Adaptive Regularization Against Safety Degradation during Fine-Tuning",
        "authors": [
            "Jyotin Goel",
            "Souvik Maji",
            "Pratik Mazumder"
        ],
        "comments": "Work in progress (30 pages)",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Instruction-following language models are trained to be helpful and safe, yet their safety behavior can deteriorate under benign fine-tuning and worsen under adversarial updates. Existing defenses often offer limited protection or force a trade-off between safety and utility. We introduce a training framework that adapts regularization in response to safety risk, enabling models to remain aligned throughout fine-tuning. To estimate safety risk at training time, we explore two distinct approaches: a judge-based Safety Critic that assigns high-level harm scores to training batches, and an activation-based risk predictor built with a lightweight classifier trained on intermediate model activations to estimate harmful intent. Each approach provides a risk signal that is used to constrain updates deemed higher risk to remain close to a safe reference policy, while lower-risk updates proceed with standard training. We empirically verify that harmful intent signals are predictable from pre-generation activations and that judge scores provide effective high-recall safety guidance. Across multiple model families and attack scenarios, adaptive regularization with either risk estimation approach consistently lowers attack success rate compared to standard fine-tuning, preserves downstream performance, and adds no inference-time cost. This work demonstrates a principled mechanism for maintaining safety without sacrificing utility.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 116,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17565",
        "abs_url": "https://arxiv.org/abs/2602.17565",
        "pdf_url": "https://arxiv.org/pdf/2602.17565",
        "title": "Optimal Unconstrained Self-Distillation in Ridge Regression: Strict Improvements, Precise Asymptotics, and One-Shot Tuning",
        "authors": [
            "Hien Dang",
            "Pratik Patil",
            "Alessandro Rinaldo"
        ],
        "comments": "78 pages, 25 figures",
        "subjects": "Statistics Theory (math.ST); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Self-distillation (SD) is the process of retraining a student on a mixture of ground-truth labels and the teacher's own predictions using the same architecture and training data. Although SD has been empirically shown to often improve generalization, its formal guarantees remain limited. We study SD for ridge regression in unconstrained setting in which the mixing weight $\\xi$ may be outside the unit interval. Conditioned on the training data and without any distributional assumptions, we prove that for any squared prediction risk (including out-of-distribution), the optimally mixed student strictly improves upon the ridge teacher for every regularization level $\\lambda > 0$ at which the teacher ridge risk $R(\\lambda)$ is nonstationary (i.e., $R'(\\lambda) \\neq 0$). We obtain a closed-form expression for the optimal mixing weight $\\xi^\\star(\\lambda)$ for any value of $\\lambda$ and show that it obeys the sign rule: $\\operatorname{sign}(\\xi^\\star(\\lambda))=-\\operatorname{sign}(R'(\\lambda))$. In particular, $\\xi^\\star(\\lambda)$ can be negative, which is the case in over-regularized regimes. To quantify the risk improvement due to SD, we derive exact deterministic equivalents for the optimal SD risk in the proportional asymptotics regime (where the sample and feature sizes $n$ and $p$ both diverge but their aspect ratio $p/n$ converges) under general anisotropic covariance and deterministic signals. Our asymptotic analysis extends standard second-order ridge deterministic equivalents to their fourth-order analogs using block linearization, which may be of independent interest. From a practical standpoint, we propose a consistent one-shot tuning method to estimate $\\xi^\\star$ without grid search, sample splitting, or refitting. Experiments on real-world datasets and pretrained neural network features support our theory and the one-shot tuning method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 117,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17577",
        "abs_url": "https://arxiv.org/abs/2602.17577",
        "pdf_url": "https://arxiv.org/pdf/2602.17577",
        "title": "Simultaneous Blackwell Approachability and Applications to Multiclass Omniprediction",
        "authors": [
            "Lunjia Hu",
            "Kevin Tian",
            "Chutong Yang"
        ],
        "comments": "",
        "subjects": "Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Omniprediction is a learning problem that requires suboptimality bounds for each of a family of losses $\\mathcal{L}$ against a family of comparator predictors $\\mathcal{C}$. We initiate the study of omniprediction in a multiclass setting, where the comparator family $\\mathcal{C}$ may be infinite. Our main result is an extension of the recent binary omniprediction algorithm of [OKK25] to the multiclass setting, with sample complexity (in statistical settings) or regret horizon (in online settings) $\\approx \\varepsilon^{-(k+1)}$, for $\\varepsilon$-omniprediction in a $k$-class prediction problem. En route to proving this result, we design a framework of potential broader interest for solving Blackwell approachability problems where multiple sets must simultaneously be approached via coupled actions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 118,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17587",
        "abs_url": "https://arxiv.org/abs/2602.17587",
        "pdf_url": "https://arxiv.org/pdf/2602.17587",
        "title": "Asymptotically Optimal Sequential Testing with Markovian Data",
        "authors": [
            "Alhad Sethi",
            "Kavali Sofia Sagar",
            "Shubhada Agrawal",
            "Debabrota Basu",
            "P. N. Karthik"
        ],
        "comments": "",
        "subjects": "Statistics Theory (math.ST); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study one-sided and $\\alpha$-correct sequential hypothesis testing for data generated by an ergodic Markov chain. The null hypothesis is that the unknown transition matrix belongs to a prescribed set $P$ of stochastic matrices, and the alternative corresponds to a disjoint set $Q$. We establish a tight non-asymptotic instance-dependent lower bound on the expected stopping time of any valid sequential test under the alternative. Our novel analysis improves the existing lower bounds, which are either asymptotic or provably sub-optimal in this setting. Our lower bound incorporates both the stationary distribution and the transition structure induced by the unknown Markov chain. We further propose an optimal test whose expected stopping time matches this lower bound asymptotically as $\\alpha \\to 0$. We illustrate the usefulness of our framework through applications to sequential detection of model misspecification in Markov Chain Monte Carlo and to testing structural properties, such as the linearity of transition dynamics, in Markov decision processes. Our findings yield a sharp and general characterization of optimal sequential testing procedures under Markovian dependence.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 119,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17607",
        "abs_url": "https://arxiv.org/abs/2602.17607",
        "pdf_url": "https://arxiv.org/pdf/2602.17607",
        "title": "AutoNumerics: An Autonomous, PDE-Agnostic Multi-Agent Pipeline for Scientific Computing",
        "authors": [
            "Jianda Du",
            "Youran Sun",
            "Haizhao Yang"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "PDEs are central to scientific and engineering modeling, yet designing accurate numerical solvers typically requires substantial mathematical expertise and manual tuning. Recent neural network-based approaches improve flexibility but often demand high computational cost and suffer from limited interpretability. We introduce \\texttt{AutoNumerics}, a multi-agent framework that autonomously designs, implements, debugs, and verifies numerical solvers for general PDEs directly from natural language descriptions. Unlike black-box neural solvers, our framework generates transparent solvers grounded in classical numerical analysis. We introduce a coarse-to-fine execution strategy and a residual-based self-verification mechanism. Experiments on 24 canonical and real-world PDE problems demonstrate that \\texttt{AutoNumerics} achieves competitive or superior accuracy compared to existing neural and LLM-based baselines, and correctly selects numerical schemes based on PDE structural properties, suggesting its viability as an accessible paradigm for automated PDE solving.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 120,
        "date": "2026-02-20",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-20?abs=True",
        "arxiv_id": "2602.17654",
        "abs_url": "https://arxiv.org/abs/2602.17654",
        "pdf_url": "https://arxiv.org/pdf/2602.17654",
        "title": "Mine and Refine: Optimizing Graded Relevance in E-commerce Search Retrieval",
        "authors": [
            "Jiaqi Xi",
            "Raghav Saboo",
            "Luming Chen",
            "Martin Wang",
            "Sudeep Das"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "We propose a two-stage \"Mine and Refine\" contrastive training framework for semantic text embeddings to enhance multi-category e-commerce search retrieval. Large scale e-commerce search demands embeddings that generalize to long tail, noisy queries while adhering to scalable supervision compatible with product and policy constraints. A practical challenge is that relevance is often graded: users accept substitutes or complements beyond exact matches, and production systems benefit from clear separation of similarity scores across these relevance strata for stable hybrid blending and thresholding. To obtain scalable policy consistent supervision, we fine-tune a lightweight LLM on human annotations under a three-level relevance guideline and further reduce residual noise via engagement driven auditing. In Stage 1, we train a multilingual Siamese two-tower retriever with a label aware supervised contrastive objective that shapes a robust global semantic space. In Stage 2, we mine hard samples via ANN and re-annotate them with the policy aligned LLM, and introduce a multi-class extension of circle loss that explicitly sharpens similarity boundaries between relevance levels, to further refine and enrich the embedding space. Robustness is additionally improved through additive spelling augmentation and synthetic query generation. Extensive offline evaluations and production A/B tests show that our framework improves retrieval relevance and delivers statistically significant gains in engagement and business impact.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]