[
    {
        "order": 1,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15076",
        "abs_url": "https://arxiv.org/abs/2602.15076",
        "pdf_url": "https://arxiv.org/pdf/2602.15076",
        "title": "Near-Optimal Sample Complexity for Online Constrained MDPs",
        "authors": [
            "Chang Liu",
            "Yunfan Li",
            "Lin F. Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Safety is a fundamental challenge in reinforcement learning (RL), particularly in real-world applications such as autonomous driving, robotics, and healthcare. To address this, Constrained Markov Decision Processes (CMDPs) are commonly used to enforce safety constraints while optimizing performance. However, existing methods often suffer from significant safety violations or require a high sample complexity to generate near-optimal policies. We address two settings: relaxed feasibility, where small violations are allowed, and strict feasibility, where no violation is allowed. We propose a model-based primal-dual algorithm that balances regret and bounded constraint violations, drawing on techniques from online RL and constrained optimization. For relaxed feasibility, we prove that our algorithm returns an $\\varepsilon$-optimal policy with $\\varepsilon$-bounded violation with arbitrarily high probability, requiring $\\tilde{O}\\left(\\frac{SAH^3}{\\varepsilon^2}\\right)$ learning episodes, matching the lower bound for unconstrained MDPs. For strict feasibility, we prove that our algorithm returns an $\\varepsilon$-optimal policy with zero violation with arbitrarily high probability, requiring $\\tilde{O}\\left(\\frac{SAH^5}{\\varepsilon^2\\zeta^2}\\right)$ learning episodes, where $\\zeta$ is the problem-dependent Slater constant characterizing the size of the feasible region. This result matches the lower bound for learning CMDPs with access to a generative model. Our results demonstrate that learning CMDPs in an online setting is as easy as learning with a generative model and is no more challenging than learning unconstrained MDPs when small violations are allowed.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15089",
        "abs_url": "https://arxiv.org/abs/2602.15089",
        "pdf_url": "https://arxiv.org/pdf/2602.15089",
        "title": "Hybrid Feature Learning with Time Series Embeddings for Equipment Anomaly Prediction",
        "authors": [
            "Takato Yasuno"
        ],
        "comments": "17 pages, 7 figures, 1 table",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "In predictive maintenance of equipment, deep learning-based time series anomaly detection has garnered significant attention; however, pure deep learning approaches often fail to achieve sufficient accuracy on real-world data. This study proposes a hybrid approach that integrates 64-dimensional time series embeddings from Granite TinyTimeMixer with 28-dimensional statistical features based on domain knowledge for HVAC equipment anomaly prediction tasks. Specifically, we combine time series embeddings extracted from a Granite TinyTimeMixer encoder fine-tuned with LoRA (Low-Rank Adaptation) and 28 types of statistical features including trend, volatility, and drawdown indicators, which are then learned using a LightGBM gradient boosting classifier. In experiments using 64 equipment units and 51,564 samples, we achieved Precision of 91--95\\% and ROC-AUC of 0.995 for anomaly prediction at 30-day, 60-day, and 90-day horizons. Furthermore, we achieved production-ready performance with a false positive rate of 1.1\\% or less and a detection rate of 88--94\\%, demonstrating the effectiveness of the system for predictive maintenance applications. This work demonstrates that practical anomaly detection systems can be realized by leveraging the complementary strengths between deep learning's representation learning capabilities and statistical feature engineering.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15128",
        "abs_url": "https://arxiv.org/abs/2602.15128",
        "pdf_url": "https://arxiv.org/pdf/2602.15128",
        "title": "PolyNODE: Variable-dimension Neural ODEs on M-polyfolds",
        "authors": [
            "Per Åhag",
            "Alexander Friedrich",
            "Fredrik Ohlsson",
            "Viktor Vigren Näslund"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Neural ordinary differential equations (NODEs) are geometric deep learning models based on dynamical systems and flows generated by vector fields on manifolds. Despite numerous successful applications, particularly within the flow matching paradigm, all existing NODE models are fundamentally constrained to fixed-dimensional dynamics by the intrinsic nature of the manifold's dimension. In this paper, we extend NODEs to M-polyfolds (spaces that can simultaneously accommodate varying dimensions and a notion of differentiability) and introduce PolyNODEs, the first variable-dimensional flow-based model in geometric deep learning. As an example application, we construct explicit M-polyfolds featuring dimensional bottlenecks and PolyNODE autoencoders based on parametrised vector fields that traverse these bottlenecks. We demonstrate experimentally that our PolyNODE models can be trained to solve reconstruction tasks in these spaces, and that latent representations of the input can be extracted and used to solve downstream classification tasks. The code used in our experiments is publicly available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15159",
        "abs_url": "https://arxiv.org/abs/2602.15159",
        "pdf_url": "https://arxiv.org/pdf/2602.15159",
        "title": "Learning Representations from Incomplete EHR Data with Dual-Masked Autoencoding",
        "authors": [
            "Xiao Xiang",
            "David Restrepo",
            "Hyewon Jeong",
            "Yugang Jia",
            "Leo Anthony Celi"
        ],
        "comments": "10 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Learning from electronic health records (EHRs) time series is challenging due to irregular sam- pling, heterogeneous missingness, and the resulting sparsity of observations. Prior self-supervised meth- ods either impute before learning, represent missingness through a dedicated input signal, or optimize solely for imputation, reducing their capacity to efficiently learn representations that support clinical downstream tasks. We propose the Augmented-Intrinsic Dual-Masked Autoencoder (AID-MAE), which learns directly from incomplete time series by applying an intrinsic missing mask to represent naturally missing values and an augmented mask that hides a subset of observed values for reconstruction during training. AID-MAE processes only the unmasked subset of tokens and consistently outperforms strong baselines, including XGBoost and DuETT, across multiple clinical tasks on two datasets. In addition, the learned embeddings naturally stratify patient cohorts in the representation space.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15183",
        "abs_url": "https://arxiv.org/abs/2602.15183",
        "pdf_url": "https://arxiv.org/pdf/2602.15183",
        "title": "Seeing to Generalize: How Visual Data Corrects Binding Shortcuts",
        "authors": [
            "Nicolas Buzeta",
            "Felipe del Rio",
            "Cristian Hinostroza",
            "Denis Parra",
            "Hans Lobel",
            "Rodrigo Toro Icarte"
        ],
        "comments": "Submitted to ICML 2026",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Vision Language Models (VLMs) are designed to extend Large Language Models (LLMs) with visual capabilities, yet in this work we observe a surprising phenomenon: VLMs can outperform their underlying LLMs on purely text-only tasks, particularly in long-context information retrieval. To investigate this effect, we build a controlled synthetic retrieval task and find that a transformer trained only on text achieves perfect in-distribution accuracy but fails to generalize out of distribution, while subsequent training on an image-tokenized version of the same task nearly doubles text-only OOD performance. Mechanistic interpretability reveals that visual training changes the model's internal binding strategy: text-only training encourages positional shortcuts, whereas image-based training disrupts them through spatial translation invariance, forcing the model to adopt a more robust symbolic binding mechanism that persists even after text-only examples are reintroduced. We further characterize how binding strategies vary across training regimes, visual encoders, and initializations, and show that analogous shifts occur during pretrained LLM-to-VLM transitions. Our findings suggest that cross-modal training can enhance reasoning and generalization even for tasks grounded in a single modality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15184",
        "abs_url": "https://arxiv.org/abs/2602.15184",
        "pdf_url": "https://arxiv.org/pdf/2602.15184",
        "title": "Learning Data-Efficient and Generalizable Neural Operators via Fundamental Physics Knowledge",
        "authors": [
            "Siying Ma",
            "Mehrdad M. Zadeh",
            "Mauricio Soroco",
            "Wuyang Chen",
            "Jiguo Cao",
            "Vijay Ganesh"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Recent advances in scientific machine learning (SciML) have enabled neural operators (NOs) to serve as powerful surrogates for modeling the dynamic evolution of physical systems governed by partial differential equations (PDEs). While existing approaches focus primarily on learning simulations from the target PDE, they often overlook more fundamental physical principles underlying these equations. Inspired by how numerical solvers are compatible with simulations of different settings of PDEs, we propose a multiphysics training framework that jointly learns from both the original PDEs and their simplified basic forms. Our framework enhances data efficiency, reduces predictive errors, and improves out-of-distribution (OOD) generalization, particularly in scenarios involving shifts of physical parameters and synthetic-to-real transfer. Our method is architecture-agnostic and demonstrates consistent improvements in normalized root mean square error (nRMSE) across a wide range of 1D/2D/3D PDE problems. Through extensive experiments, we show that explicit incorporation of fundamental physics knowledge significantly strengthens the generalization ability of neural operators. We will release models and codes at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15200",
        "abs_url": "https://arxiv.org/abs/2602.15200",
        "pdf_url": "https://arxiv.org/pdf/2602.15200",
        "title": "COMPOT: Calibration-Optimized Matrix Procrustes Orthogonalization for Transformers Compression",
        "authors": [
            "Denis Makhov",
            "Dmitriy Shopkhoev",
            "Magauiya Zhussip",
            "Ammar Ali",
            "Baher Mohammad",
            "Stamatios Lefkimmiatis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Post-training compression of Transformer models commonly relies on truncated singular value decomposition (SVD). However, enforcing a single shared subspace can degrade accuracy even at moderate compression. Sparse dictionary learning provides a more flexible union-of-subspaces representation, but existing approaches often suffer from iterative dictionary and coefficient updates. We propose COMPOT (Calibration-Optimized Matrix Procrustes Orthogonalization for Transformers), a training-free compression framework that uses a small calibration dataset to estimate a sparse weight factorization. COMPOT employs orthogonal dictionaries that enable closed-form Procrustes updates for the dictionary and analytical single-step sparse coding for the coefficients, eliminating iterative optimization. To handle heterogeneous layer sensitivity under a global compression budget, COMPOT further introduces a one-shot dynamic allocation strategy that adaptively redistributes layer-wise compression rates. Extensive experiments across diverse architectures and tasks show that COMPOT consistently delivers a superior quality-compression trade-off over strong low-rank and sparse baselines, while remaining fully compatible with post-training quantization for extreme compression. Code is available $\\href{this https URL}{here}$.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15210",
        "abs_url": "https://arxiv.org/abs/2602.15210",
        "pdf_url": "https://arxiv.org/pdf/2602.15210",
        "title": "ÜberWeb: Insights from Multilingual Curation for a 20-Trillion-Token Dataset",
        "authors": [
            "DatologyAI",
            "Aldo Gael Carranza",
            "Kaleigh Mentzer",
            "Ricardo Pio Monti",
            "Alex Fang",
            "Alvin Deng",
            "Amro Abbas",
            "Anshuman Suri",
            "Brett Larsen",
            "Cody Blakeney",
            "Darren Teh",
            "David Schwab",
            "Diego Kiner",
            "Fan Pan",
            "Haakon Mongstad",
            "Jack Urbanek",
            "Jason Lee",
            "Jason Telanoff",
            "Josh Wills",
            "Luke Merrick",
            "Parth Doshi",
            "Paul Burstein",
            "Pratyush Maini",
            "Spandan Das",
            "Tony Jiang",
            "Vineeth Dorna",
            "Zhengping Wang",
            "Bogdan Gaza",
            "Ari Morcos",
            "Matthew Leavitt"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multilinguality is a core capability for modern foundation models, yet training high-quality multilingual models remains challenging due to uneven data availability across languages. A further challenge is the performance interference that can arise from joint multilingual training, commonly referred to as the \"curse of multilinguality\". We study multilingual data curation across thirteen languages and find that many reported regressions are not inherent to multilingual scaling but instead stem from correctable deficiencies in data quality and composition rather than fundamental capacity limits. In controlled bilingual experiments, improving data quality for any single language benefits others: curating English improves non-English performance in 12 of 13 languages, while curating non-English yields reciprocal improvements in English. Bespoke per-language curation produces substantially larger within-language improvements. Extending these findings to large-scale general-purpose training mixtures, we show that curated multilingual allocations comprising under 8% of total tokens remain remarkably effective. We operationalize this approach within an effort that produced a 20T-token pretraining corpus derived entirely from public sources. Models with 3B and 8B parameters trained on a 1T-token random subset achieve competitive multilingual accuracy with 4-10x fewer training FLOPs than strong public baselines, establishing a new Pareto frontier in multilingual performance versus compute. Moreover, these benefits extend to frontier model scale: the 20T-token corpus served as part of the pretraining dataset for Trinity Large (400B/A13B), which exhibits strong multilingual performance relative to its training FLOPs. These results show that targeted, per-language data curation mitigates multilingual interference and enables compute-efficient multilingual scaling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15229",
        "abs_url": "https://arxiv.org/abs/2602.15229",
        "pdf_url": "https://arxiv.org/pdf/2602.15229",
        "title": "tensorFM: Low-Rank Approximations of Cross-Order Feature Interactions",
        "authors": [
            "Alessio Mazzetto",
            "Mohammad Mahdi Khalili",
            "Laura Fee Nern",
            "Michael Viderman",
            "Alex Shtoff",
            "Krzysztof Dembczyński"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Information Retrieval (cs.IR)",
        "abstract": "We address prediction problems on tabular categorical data, where each instance is defined by multiple categorical attributes, each taking values from a finite set. These attributes are often referred to as fields, and their categorical values as features. Such problems frequently arise in practical applications, including click-through rate prediction and social sciences. We introduce and analyze {tensorFM}, a new model that efficiently captures high-order interactions between attributes via a low-rank tensor approximation representing the strength of these interactions. Our model generalizes field-weighted factorization machines. Empirically, tensorFM demonstrates competitive performance with state-of-the-art methods. Additionally, its low latency makes it well-suited for time-sensitive applications, such as online advertising.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15236",
        "abs_url": "https://arxiv.org/abs/2602.15236",
        "pdf_url": "https://arxiv.org/pdf/2602.15236",
        "title": "BindCLIP: A Unified Contrastive-Generative Representation Learning Framework for Virtual Screening",
        "authors": [
            "Anjie Qiao",
            "Zhen Wang",
            "Yaliang Li",
            "Jiahua Rao",
            "Yuedong Yang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Virtual screening aims to efficiently identify active ligands from massive chemical libraries for a given target pocket. Recent CLIP-style models such as DrugCLIP enable scalable virtual screening by embedding pockets and ligands into a shared space. However, our analyses indicate that such representations can be insensitive to fine-grained binding interactions and may rely on shortcut correlations in training data, limiting their ability to rank ligands by true binding compatibility. To address these issues, we propose BindCLIP, a unified contrastive-generative representation learning framework for virtual screening. BindCLIP jointly trains pocket and ligand encoders using CLIP-style contrastive learning together with a pocket-conditioned diffusion objective for binding pose generation, so that pose-level supervision directly shapes the retrieval embedding space toward interaction-relevant features. To further mitigate shortcut reliance, we introduce hard-negative augmentation and a ligand-ligand anchoring regularizer that prevents representation collapse. Experiments on two public benchmarks demonstrate consistent improvements over strong baselines. BindCLIP achieves substantial gains on challenging out-of-distribution virtual screening and improves ligand-analogue ranking on the FEP+ benchmark. Together, these results indicate that integrating generative, pose-level supervision with contrastive learning yields more interaction-aware embeddings and improves generalization in realistic screening settings, bringing virtual screening closer to real-world applicability.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15239",
        "abs_url": "https://arxiv.org/abs/2602.15239",
        "pdf_url": "https://arxiv.org/pdf/2602.15239",
        "title": "Size Transferability of Graph Transformers with Convolutional Positional Encodings",
        "authors": [
            "Javier Porras-Valenzuela",
            "Zhiyang Wang",
            "Alejandro Ribeiro"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Transformers have achieved remarkable success across domains, motivating the rise of Graph Transformers (GTs) as attention-based architectures for graph-structured data. A key design choice in GTs is the use of Graph Neural Network (GNN)-based positional encodings to incorporate structural information. In this work, we study GTs through the lens of manifold limit models for graph sequences and establish a theoretical connection between GTs with GNN positional encodings and Manifold Neural Networks (MNNs). Building on transferability results for GNNs under manifold convergence, we show that GTs inherit transferability guarantees from their positional encodings. In particular, GTs trained on small graphs provably generalize to larger graphs under mild assumptions. We complement our theory with extensive experiments on standard graph benchmarks, demonstrating that GTs exhibit scalable behavior on par with GNNs. To further show the efficiency in a real-world scenario, we implement GTs for shortest path distance estimation over terrains to better illustrate the efficiency of the transferable GTs. Our results provide new insights into the understanding of GTs and suggest practical directions for efficient training of GTs in large-scale settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15253",
        "abs_url": "https://arxiv.org/abs/2602.15253",
        "pdf_url": "https://arxiv.org/pdf/2602.15253",
        "title": "Scaling Laws for Masked-Reconstruction Transformers on Single-Cell Transcriptomics",
        "authors": [
            "Ihor Kendiukhov"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Genomics (q-bio.GN)",
        "abstract": "Neural scaling laws -- power-law relationships between loss, model size, and data -- have been extensively documented for language and vision transformers, yet their existence in single-cell genomics remains largely unexplored. We present the first systematic study of scaling behaviour for masked-reconstruction transformers trained on single-cell RNA sequencing (scRNA-seq) data. Using expression profiles from the CELLxGENE Census, we construct two experimental regimes: a data-rich regime (512 highly variable genes, 200,000 cells) and a data-limited regime (1,024 genes, 10,000 cells). Across seven model sizes spanning three orders of magnitude in parameter count (533 to 3.4 x 10^8 parameters), we fit the parametric scaling law to validation mean squared error (MSE). The data-rich regime exhibits clear power-law scaling with an irreducible loss floor of c ~ 1.44, while the data-limited regime shows negligible scaling, indicating that model capacity is not the binding constraint when data are scarce. These results establish that scaling laws analogous to those observed in natural language processing do emerge in single-cell transcriptomics when sufficient data are available, and they identify the data-to-parameter ratio as a critical determinant of scaling behaviour. A preliminary conversion of the data-rich asymptotic floor to information-theoretic units yields an estimate of approximately 2.30 bits of entropy per masked gene position. We discuss implications for the design of single-cell foundation models and outline the additional measurements needed to refine this entropy estimate.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15283",
        "abs_url": "https://arxiv.org/abs/2602.15283",
        "pdf_url": "https://arxiv.org/pdf/2602.15283",
        "title": "Complex-Valued Unitary Representations as Classification Heads for Improved Uncertainty Quantification in Deep Neural Networks",
        "authors": [
            "Akbar Anbar Jafari",
            "Cagri Ozcinar",
            "Gholamreza Anbarjafari"
        ],
        "comments": "21 pages, 12 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Modern deep neural networks achieve high predictive accuracy but remain poorly calibrated: their confidence scores do not reliably reflect the true probability of correctness. We propose a quantum-inspired classification head architecture that projects backbone features into a complex-valued Hilbert space and evolves them under a learned unitary transformation parameterised via the Cayley map. Through a controlled hybrid experimental design - training a single shared backbone and comparing lightweight interchangeable heads - we isolate the effect of complex-valued unitary representations on calibration. Our ablation study on CIFAR-10 reveals that the unitary magnitude head (complex features evolved under a Cayley unitary, read out via magnitude and softmax) achieves an Expected Calibration Error (ECE) of 0.0146, representing a 2.4x improvement over a standard softmax head (0.0355) and a 3.5x improvement over temperature scaling (0.0510). Surprisingly, replacing the softmax readout with a Born rule measurement layer - the quantum-mechanically motivated approach - degrades calibration to an ECE of 0.0819. On the CIFAR-10H human-uncertainty benchmark, the wave function head achieves the lowest KL-divergence (0.336) to human soft labels among all compared methods, indicating that complex-valued representations better capture the structure of human perceptual ambiguity. We provide theoretical analysis connecting norm-preserving unitary dynamics to calibration through feature-space geometry, report negative results on out-of-distribution detection and sentiment analysis to delineate the method's scope, and discuss practical implications for safety-critical applications. Code is publicly available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15304",
        "abs_url": "https://arxiv.org/abs/2602.15304",
        "pdf_url": "https://arxiv.org/pdf/2602.15304",
        "title": "Hybrid Federated and Split Learning for Privacy Preserving Clinical Prediction and Treatment Optimization",
        "authors": [
            "Farzana Akter",
            "Rakib Hossain",
            "Deb Kanna Roy Toushi",
            "Mahmood Menon Khan",
            "Sultana Amin",
            "Lisan Al Amin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Collaborative clinical decision support is often constrained by governance and privacy rules that prevent pooling patient-level records across institutions. We present a hybrid privacy-preserving framework that combines Federated Learning (FL) and Split Learning (SL) to support decision-oriented healthcare modeling without raw-data sharing. The approach keeps feature-extraction trunks on clients while hosting prediction heads on a coordinating server, enabling shared representation learning and exposing an explicit collaboration boundary where privacy controls can be applied. Rather than assuming distributed training is inherently private, we audit leakage empirically using membership inference on cut-layer representations and study lightweight defenses based on activation clipping and additive Gaussian noise. We evaluate across three public clinical datasets under non-IID client partitions using a unified pipeline and assess performance jointly along four deployment-relevant axes: factual predictive utility, uplift-based ranking under capacity constraints, audited privacy leakage, and communication overhead. Results show that hybrid FL-SL variants achieve competitive predictive performance and decision-facing prioritization behavior relative to standalone FL or SL, while providing a tunable privacy-utility trade-off that can reduce audited leakage without requiring raw-data sharing. Overall, the work positions hybrid FL-SL as a practical design space for privacy-preserving healthcare decision support where utility, leakage risk, and deployment cost must be balanced explicitly.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15322",
        "abs_url": "https://arxiv.org/abs/2602.15322",
        "pdf_url": "https://arxiv.org/pdf/2602.15322",
        "title": "On Surprising Effectiveness of Masking Updates in Adaptive Optimizers",
        "authors": [
            "Taejong Joo",
            "Wenhan Xia",
            "Cheolmin Kim",
            "Ming Zhang",
            "Eugene Ie"
        ],
        "comments": "Preprint",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Training large language models (LLMs) relies almost exclusively on dense adaptive optimizers with increasingly sophisticated preconditioners. We challenge this by showing that randomly masking parameter updates can be highly effective, with a masked variant of RMSProp consistently outperforming recent state-of-the-art optimizers. Our analysis reveals that the random masking induces a curvature-dependent geometric regularization that smooths the optimization trajectory. Motivated by this finding, we introduce Momentum-aligned gradient masking (Magma), which modulates the masked updates using momentum-gradient alignment. Extensive LLM pre-training experiments show that Magma is a simple drop-in replacement for adaptive optimizers with consistent gains and negligible computational overhead. Notably, for the 1B model size, Magma reduces perplexity by over 19\\% and 9\\% compared to Adam and Muon, respectively.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15330",
        "abs_url": "https://arxiv.org/abs/2602.15330",
        "pdf_url": "https://arxiv.org/pdf/2602.15330",
        "title": "A Scalable Curiosity-Driven Game-Theoretic Framework for Long-Tail Multi-Label Learning in Data Mining",
        "authors": [
            "Jing Yang",
            "Keze Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "The long-tail distribution, where a few head labels dominate while rare tail labels abound, poses a persistent challenge for large-scale Multi-Label Classification (MLC) in real-world data mining applications. Existing resampling and reweighting strategies often disrupt inter-label dependencies or require brittle hyperparameter tuning, especially as the label space expands to tens of thousands of labels. To address this issue, we propose Curiosity-Driven Game-Theoretic Multi-Label Learning (CD-GTMLL), a scalable cooperative framework that recasts long-tail MLC as a multi-player game - each sub-predictor (\"player\") specializes in a partition of the label space, collaborating to maximize global accuracy while pursuing intrinsic curiosity rewards based on tail label rarity and inter-player disagreement. This mechanism adaptively injects learning signals into under-represented tail labels without manual balancing or tuning. We further provide a theoretical analysis showing that our CD-GTMLL converges to a tail-aware equilibrium and formally links the optimization dynamics to improvements in the Rare-F1 metric. Extensive experiments across 7 benchmarks, including extreme multi-label classification datasets with 30,000+ labels, demonstrate that CD-GTMLL consistently surpasses state-of-the-art methods, with gains up to +1.6% P@3 on Wiki10-31K. Ablation studies further confirm the contributions of both game-theoretic cooperation and curiosity-driven exploration to robust tail performance. By integrating game theory with curiosity mechanisms, CD-GTMLL not only enhances model efficiency in resource-constrained environments but also paves the way for more adaptive learning in imbalanced data scenarios across industries like e-commerce and healthcare.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15332",
        "abs_url": "https://arxiv.org/abs/2602.15332",
        "pdf_url": "https://arxiv.org/pdf/2602.15332",
        "title": "Directional Reasoning Trajectory Change (DRTC): Identifying Critical Trace Segments in Reasoning Models",
        "authors": [
            "Waldemar Chang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Understanding how language models carry out long-horizon reasoning remains an open challenge. Existing interpretability methods often highlight tokens or spans correlated with an answer, but they rarely reveal where the model makes consequential reasoning turns, which earlier context causally triggers those turns, or whether the highlighted text actually steers the reasoning process. We introduce Directional Reasoning Trajectory Change (DRTC), a process-causal framework for interpreting long-form reasoning from a single on-policy rollout. DRTC detects pivot decision points using uncertainty and distribution-shift signals, then applies receiver-side interventions that preserve the realized rollout without resampling the continuation while blocking information flow from selected earlier chunks only at a pivot. It measures whether each intervention redirects the direction of the model's log-probability trajectory relative to the realized rollout direction, producing a signed per-chunk attribution score. We also compute turning-angle curvature changes on raw logits as a complementary diagnostic and introduce curvature signatures to summarize shared intervention-response geometry. Empirically, directional influence is sharply concentrated across four reasoning models (per-example |DRTC| shares yield Gini 0.50 to 0.58 and top-5 percent mass 0.23 to 0.28), and learned pivots induce stronger intervention magnitudes than matched random spans. In a scaling study on 500 MATH problems with R1-Distill-Qwen-1.5B, learned spans outperform matched random spans (median delta = 0.409, 355 of 500 positive; sign test p = 2.3e-21). Overall, DRTC provides a causally grounded, trajectory-level view of how specific context elements steer reasoning under on-policy dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15338",
        "abs_url": "https://arxiv.org/abs/2602.15338",
        "pdf_url": "https://arxiv.org/pdf/2602.15338",
        "title": "Discovering Implicit Large Language Model Alignment Objectives",
        "authors": [
            "Edward Chen",
            "Sanmi Koyejo",
            "Carlos Guestrin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Large language model (LLM) alignment relies on complex reward signals that often obscure the specific behaviors being incentivized, creating critical risks of misalignment and reward hacking. Existing interpretation methods typically rely on pre-defined rubrics, risking the omission of \"unknown unknowns\", or fail to identify objectives that comprehensively cover and are causal to the model behavior. To address these limitations, we introduce Obj-Disco, a framework that automatically decomposes an alignment reward signal into a sparse, weighted combination of human-interpretable natural language objectives. Our approach utilizes an iterative greedy algorithm to analyze behavioral changes across training checkpoints, identifying and validating candidate objectives that best explain the residual reward signal. Extensive evaluations across diverse tasks, model sizes, and alignment algorithms demonstrate the framework's robustness. Experiments with popular open-source reward models show that the framework consistently captures > 90% of reward behavior, a finding further corroborated by human evaluation. Additionally, a case study on alignment with an open-source reward model reveals that Obj-Disco can successfully identify latent misaligned incentives that emerge alongside intended behaviors. Our work provides a crucial tool for uncovering the implicit objectives in LLM alignment, paving the way for more transparent and safer AI development.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15344",
        "abs_url": "https://arxiv.org/abs/2602.15344",
        "pdf_url": "https://arxiv.org/pdf/2602.15344",
        "title": "ER-MIA: Black-Box Adversarial Memory Injection Attacks on Long-Term Memory-Augmented Large Language Models",
        "authors": [
            "Mitchell Piehl",
            "Zhaohan Xi",
            "Zuobin Xiong",
            "Pan He",
            "Muchao Ye"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) are increasingly augmented with long-term memory systems to overcome finite context windows and enable persistent reasoning across interactions. However, recent research finds that LLMs become more vulnerable because memory provides extra attack surfaces. In this paper, we present the first systematic study of black-box adversarial memory injection attacks that target the similarity-based retrieval mechanism in long-term memory-augmented LLMs. We introduce ER-MIA, a unified framework that exposes this vulnerability and formalizes two realistic attack settings: content-based attacks and question-targeted attacks. In these settings, ER-MIA includes an arsenal of composable attack primitives and ensemble attacks that achieve high success rates under minimal attacker assumptions. Extensive experiments across multiple LLMs and long-term memory systems demonstrate that similarity-based retrieval constitutes a fundamental and system-level vulnerability, revealing security risks that persist across memory designs and application scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15380",
        "abs_url": "https://arxiv.org/abs/2602.15380",
        "pdf_url": "https://arxiv.org/pdf/2602.15380",
        "title": "Fractional-Order Federated Learning",
        "authors": [
            "Mohammad Partohaghighi",
            "Roummel Marcia",
            "YangQuan Chen"
        ],
        "comments": "This paper is submitted to IEEE-TAI",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated learning (FL) allows remote clients to train a global model collaboratively while protecting client privacy. Despite its privacy-preserving benefits, FL has significant drawbacks, including slow convergence, high communication cost, and non-independent-and-identically-distributed (non-IID) data. In this work, we present a novel FedAvg variation called Fractional-Order Federated Averaging (FOFedAvg), which incorporates Fractional-Order Stochastic Gradient Descent (FOSGD) to capture long-range relationships and deeper historical information. By introducing memory-aware fractional-order updates, FOFedAvg improves communication efficiency and accelerates convergence while mitigating instability caused by heterogeneous, non-IID client data. We compare FOFedAvg against a broad set of established federated optimization algorithms on benchmark datasets including MNIST, FEMNIST, CIFAR-10, CIFAR-100, EMNIST, the Cleveland heart disease dataset, Sent140, PneumoniaMNIST, and Edge-IIoTset. Across a range of non-IID partitioning schemes, FOFedAvg is competitive with, and often outperforms, these baselines in terms of test performance and convergence speed. On the theoretical side, we prove that FOFedAvg converges to a stationary point under standard smoothness and bounded-variance assumptions for fractional order $0<\\alpha\\le 1$. Together, these results show that fractional-order, memory-aware updates can substantially improve the robustness and effectiveness of federated learning, offering a practical path toward distributed training on heterogeneous data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15405",
        "abs_url": "https://arxiv.org/abs/2602.15405",
        "pdf_url": "https://arxiv.org/pdf/2602.15405",
        "title": "Joint Enhancement and Classification using Coupled Diffusion Models of Signals and Logits",
        "authors": [
            "Gilad Nurko",
            "Roi Benita",
            "Yehoshua Dissen",
            "Tomohiro Nakatani",
            "Marc Delcroix",
            "Shoko Araki",
            "Joseph Keshet"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Robust classification in noisy environments remains a fundamental challenge in machine learning. Standard approaches typically treat signal enhancement and classification as separate, sequential stages: first enhancing the signal and then applying a classifier. This approach fails to leverage the semantic information in the classifier's output during denoising. In this work, we propose a general, domain-agnostic framework that integrates two interacting diffusion models: one operating on the input signal and the other on the classifier's output logits, without requiring any retraining or fine-tuning of the classifier. This coupled formulation enables mutual guidance, where the enhancing signal refines the class estimation and, conversely, the evolving class logits guide the signal reconstruction towards discriminative regions of the manifold. We introduce three strategies to effectively model the joint distribution of the input and the logit. We evaluated our joint enhancement method for image classification and automatic speech recognition. The proposed framework surpasses traditional sequential enhancement baselines, delivering robust and flexible improvements in classification accuracy under diverse noise conditions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15407",
        "abs_url": "https://arxiv.org/abs/2602.15407",
        "pdf_url": "https://arxiv.org/pdf/2602.15407",
        "title": "Fairness over Equality: Correcting Social Incentives in Asymmetric Sequential Social Dilemmas",
        "authors": [
            "Alper Demir",
            "Hüseyin Aydın",
            "Kale-ab Abebe Tessera",
            "David Abel",
            "Stefano V. Albrecht"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Sequential Social Dilemmas (SSDs) provide a key framework for studying how cooperation emerges when individual incentives conflict with collective welfare. In Multi-Agent Reinforcement Learning, these problems are often addressed by incorporating intrinsic drives that encourage prosocial or fair behavior. However, most existing methods assume that agents face identical incentives in the dilemma and require continuous access to global information about other agents to assess fairness. In this work, we introduce asymmetric variants of well-known SSD environments and examine how natural differences between agents influence cooperation dynamics. Our findings reveal that existing fairness-based methods struggle to adapt under asymmetric conditions by enforcing raw equality that wrongfully incentivize defection. To address this, we propose three modifications: (i) redefining fairness by accounting for agents' reward ranges, (ii) introducing an agent-based weighting mechanism to better handle inherent asymmetries, and (iii) localizing social feedback to make the methods effective under partial observability without requiring global information sharing. Experimental results show that in asymmetric scenarios, our method fosters faster emergence of cooperative policies compared to existing approaches, without sacrificing scalability or practicality.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15457",
        "abs_url": "https://arxiv.org/abs/2602.15457",
        "pdf_url": "https://arxiv.org/pdf/2602.15457",
        "title": "Benchmarking IoT Time-Series AD with Event-Level Augmentations",
        "authors": [
            "Dmitry Zhevnenko",
            "Ilya Makarov",
            "Aleksandr Kovalenko",
            "Fedor Meshchaninov",
            "Anton Kozhukhov",
            "Vladislav Travnikov",
            "Makar Ippolitov",
            "Kirill Yashunin",
            "Iurii Katser"
        ],
        "comments": "this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Anomaly detection (AD) for safety-critical IoT time series should be judged at the event level: reliability and earliness under realistic perturbations. Yet many studies still emphasize point-level results on curated base datasets, limiting value for model selection in practice. We introduce an evaluation protocol with unified event-level augmentations that simulate real-world issues: calibrated sensor dropout, linear and log drift, additive noise, and window shifts. We also perform sensor-level probing via mask-as-missing zeroing with per-channel influence estimation to support root-cause analysis. We evaluate 14 representative models on five public anomaly datasets (SWaT, WADI, SMD, SKAB, TEP) and two industrial datasets (steam turbine, nuclear turbogenerator) using unified splits and event aggregation. There is no universal winner: graph-structured models transfer best under dropout and long events (e.g., on SWaT under additive noise F1 drops 0.804->0.677 for a graph autoencoder, 0.759->0.680 for a graph-attention variant, and 0.762->0.756 for a hybrid graph attention model); density/flow models work well on clean stationary plants but can be fragile to monotone drift; spectral CNNs lead when periodicity is strong; reconstruction autoencoders become competitive after basic sensor vetting; predictive/hybrid dynamics help when faults break temporal dependencies but remain window-sensitive. The protocol also informs design choices: on SWaT under log drift, replacing normalizing flows with Gaussian density reduces high-stress F1 from ~0.75 to ~0.57, and fixing a learned DAG gives a small clean-set gain (~0.5-1.0 points) but increases drift sensitivity by ~8x.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15473",
        "abs_url": "https://arxiv.org/abs/2602.15473",
        "pdf_url": "https://arxiv.org/pdf/2602.15473",
        "title": "POP: Prior-fitted Optimizer Policies",
        "authors": [
            "Jan Kobiolka",
            "Christian Frey",
            "Gresa Shala",
            "Arlind Kadra",
            "Erind Bedalli",
            "Josif Grabocka"
        ],
        "comments": "Under Review",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Optimization refers to the task of finding extrema of an objective function. Classical gradient-based optimizers are highly sensitive to hyperparameter choices. In highly non-convex settings their performance relies on carefully tuned learning rates, momentum, and gradient accumulation. To address these limitations, we introduce POP (Prior-fitted Optimizer Policies), a meta-learned optimizer that predicts coordinate-wise step sizes conditioned on the contextual information provided in the optimization trajectory. Our model is learned on millions of synthetic optimization problems sampled from a novel prior spanning both convex and non-convex objectives. We evaluate POP on an established benchmark including 47 optimization functions of various complexity, where it consistently outperforms first-order gradient-based methods, non-convex optimization approaches (e.g., evolutionary strategies), Bayesian optimization, and a recent meta-learned competitor under matched budget constraints. Our evaluation demonstrates strong generalization capabilities without task-specific tuning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15478",
        "abs_url": "https://arxiv.org/abs/2602.15478",
        "pdf_url": "https://arxiv.org/pdf/2602.15478",
        "title": "Evaluating Federated Learning for Cross-Country Mood Inference from Smartphone Sensing Data",
        "authors": [
            "Sharmad Kalpande",
            "Saurabh Shirke",
            "Haroon R. Lone"
        ],
        "comments": "21 pages, 6 figure",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Mood instability is a key behavioral indicator of mental health, yet traditional assessments rely on infrequent and retrospective reports that fail to capture its continuous nature. Smartphone-based mobile sensing enables passive, in-the-wild mood inference from everyday behaviors; however, deploying such systems at scale remains challenging due to privacy constraints, uneven sensing availability, and substantial variability in behavioral patterns. In this work, we study mood inference using smartphone sensing data in a cross-country federated learning setting, where each country participates as an independent client while retaining local data. We introduce FedFAP, a feature-aware personalized federated framework designed to accommodate heterogeneous sensing modalities across regions. Evaluations across geographically and culturally diverse populations show that FedFAP achieves an AUROC of 0.744, outperforming both centralized approaches and existing personalized federated baselines. Beyond inference, our results offer design insights for mood-aware systems, demonstrating how population-aware personalization and privacy-preserving learning can enable scalable and mood-aware mobile sensing technologies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15481",
        "abs_url": "https://arxiv.org/abs/2602.15481",
        "pdf_url": "https://arxiv.org/pdf/2602.15481",
        "title": "LLM-as-Judge on a Budget",
        "authors": [
            "Aadirupa Saha",
            "Aniket Wagde",
            "Branislav Kveton"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "LLM-as-a-judge has emerged as a cornerstone technique for evaluating large language models by leveraging LLM reasoning to score prompt-response pairs. Since LLM judgments are stochastic, practitioners commonly query each pair multiple times to estimate mean scores accurately. This raises a critical challenge: given a fixed computational budget $B$, how to optimally allocate queries across $K$ prompt-response pairs to minimize estimation error? % We present a principled variance-adaptive approach leveraging multi-armed bandit theory and concentration inequalities. Our method dynamically allocates queries based on estimated score variances, concentrating resources where uncertainty is highest. Further, our algorithm is shown to achieve a worst-case score-estimation error of $\\tilde{O}\\left(\\sqrt{\\frac{\\sum_{i=1}^K \\sigma_i^2}{B}}\\right)$, $\\sigma_i^2$ being the unknown score variance for pair $i \\in [K]$ with near-optimal budget allocation. % Experiments on \\emph{Summarize-From-Feedback} and \\emph{HelpSteer2} demonstrate that our method significantly outperforms uniform allocation, reducing worst-case estimation error while maintaining identical budgets. Our work establishes a theoretical foundation for efficient LLM evaluation with practical implications for AI safety, model alignment, and automated assessment at scale.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15499",
        "abs_url": "https://arxiv.org/abs/2602.15499",
        "pdf_url": "https://arxiv.org/pdf/2602.15499",
        "title": "ExLipBaB: Exact Lipschitz Constant Computation for Piecewise Linear Neural Networks",
        "authors": [
            "Tom A. Splittgerber"
        ],
        "comments": "14 pages, 1 figure",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "It has been shown that a neural network's Lipschitz constant can be leveraged to derive robustness guarantees, to improve generalizability via regularization or even to construct invertible networks. Therefore, a number of methods varying in the tightness of their bounds and their computational cost have been developed to approximate the Lipschitz constant for different classes of networks. However, comparatively little research exists on methods for exact computation, which has been shown to be NP-hard. Nonetheless, there are applications where one might readily accept the computational cost of an exact method. These applications could include the benchmarking of new methods or the computation of robustness guarantees for small models on sensitive data. Unfortunately, existing exact algorithms restrict themselves to only ReLU-activated networks, which are known to come with severe downsides in the context of Lipschitz-constrained networks. We therefore propose a generalization of the LipBaB algorithm to compute exact Lipschitz constants for arbitrary piecewise linear neural networks and $p$-norms. With our method, networks may contain traditional activations like ReLU or LeakyReLU, activations like GroupSort or the related MinMax and FullSort, which have been of increasing interest in the context of Lipschitz constrained networks, or even other piecewise linear functions like MaxPool.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15503",
        "abs_url": "https://arxiv.org/abs/2602.15503",
        "pdf_url": "https://arxiv.org/pdf/2602.15503",
        "title": "Approximation Theory for Lipschitz Continuous Transformers",
        "authors": [
            "Takashi Furuya",
            "Davide Murari",
            "Carola-Bibiane Schönlieb"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Stability and robustness are critical for deploying Transformers in safety-sensitive settings. A principled way to enforce such behavior is to constrain the model's Lipschitz constant. However, approximation-theoretic guarantees for architectures that explicitly preserve Lipschitz continuity have yet to be established. In this work, we bridge this gap by introducing a class of gradient-descent-type in-context Transformers that are Lipschitz-continuous by construction. We realize both MLP and attention blocks as explicit Euler steps of negative gradient flows, ensuring inherent stability without sacrificing expressivity. We prove a universal approximation theorem for this class within a Lipschitz-constrained function space. Crucially, our analysis adopts a measure-theoretic formalism, interpreting Transformers as operators on probability measures, to yield approximation guarantees independent of token count. These results provide a rigorous theoretical foundation for the design of robust, Lipschitz continuous Transformer architectures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15510",
        "abs_url": "https://arxiv.org/abs/2602.15510",
        "pdf_url": "https://arxiv.org/pdf/2602.15510",
        "title": "On the Geometric Coherence of Global Aggregation in Federated GNN",
        "authors": [
            "Chethana Prasad Kabgere",
            "Shylaja SS"
        ],
        "comments": "This is a developing preprint of an 18-page journal manuscript (6 figures), currently being prepared for formal peer-review submission",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC); Networking and Internet Architecture (cs.NI)",
        "abstract": "Federated Learning (FL) enables distributed training across multiple clients without centralized data sharing, while Graph Neural Networks (GNNs) model relational data through message passing. In federated GNN settings, client graphs often exhibit heterogeneous structural and propagation characteristics. When standard aggregation mechanisms are applied to such heterogeneous updates, the global model may converge numerically while exhibiting degraded relational this http URL work identifies a geometric failure mode of global aggregation in Cross- Domain Federated GNNs. Although GNN parameters are numerically represented as vectors, they encode relational transformations that govern the direction, strength, and sensitivity of information flow across graph neighborhoods. Aggregating updates originating from incompatible propagation regimes can therefore introduce destructive interference in this transformation this http URL leads to loss of coherence in global message passing. Importantly, this degradation is not necessarily reflected in conventional metrics such as loss or this http URL address this issue, we propose GGRS (Global Geometric Reference Structure), a server-side framework that regulates client updates prior to aggregation based on geometric admissibility criteria. GGRS preserves directional consistency of relational transformations as well as maintains diversity of admissible propagation subspaces. It also stabilizes sensitivity to neighborhood interactions, without accessing client data or graph topology. Experiments on heterogeneous GNN-native, Amazon Co-purchase datasets demonstrate that GGRS preserves global message-passing coherence across training rounds by highlighting the necessity of geometry-aware regulation in federated graph learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15546",
        "abs_url": "https://arxiv.org/abs/2602.15546",
        "pdf_url": "https://arxiv.org/pdf/2602.15546",
        "title": "CEPAE: Conditional Entropy-Penalized Autoencoders for Time Series Counterfactuals",
        "authors": [
            "Tomàs Garriga",
            "Gerard Sanz",
            "Eduard Serrahima de Cambra",
            "Axel Brando"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The ability to accurately perform counterfactual inference on time series is crucial for decision-making in fields like finance, healthcare, and marketing, as it allows us to understand the impact of events or treatments on outcomes over time. In this paper, we introduce a new counterfactual inference approach tailored to time series data impacted by market events, which is motivated by an industrial application. Utilizing the abduction-action-prediction procedure and the Structural Causal Model framework, we first adapt methods based on variational autoencoders and adversarial autoencoders, both previously used in counterfactual literature although not in time series settings. Then, we present the Conditional Entropy-Penalized Autoencoder (CEPAE), a novel autoencoder-based approach for counterfactual inference, which employs an entropy penalization loss over the latent space to encourage disentangled data representations. We validate our approach both theoretically and experimentally on synthetic, semi-synthetic, and real-world datasets, showing that CEPAE generally outperforms the other approaches in the evaluated metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15563",
        "abs_url": "https://arxiv.org/abs/2602.15563",
        "pdf_url": "https://arxiv.org/pdf/2602.15563",
        "title": "1-Bit Wonder: Improving QAT Performance in the Low-Bit Regime through K-Means Quantization",
        "authors": [
            "Sohir Maskey",
            "Constantin Eichenberg",
            "Johannes Messner",
            "Douglas Orr"
        ],
        "comments": "Preprint. Under Review. 23 pages, 9 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Quantization-aware training (QAT) is an effective method to drastically reduce the memory footprint of LLMs while keeping performance degradation at an acceptable level. However, the optimal choice of quantization format and bit-width presents a challenge in practice. The full design space of quantization is not fully explored in the context of QAT, and the precise trade-off between quantization and downstream performance is poorly understood, as comparisons often rely solely on perplexity-based evaluations. In this work, we address these shortcomings with an empirical study of QAT in the low-bit regime. We show that k-means based weight quantization outperforms integer formats and can be implemented efficiently on standard hardware. Furthermore, we find that, under a fixed inference memory budget, the best performance on generative downstream tasks is achieved with $1$-bit quantized weights.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15571",
        "abs_url": "https://arxiv.org/abs/2602.15571",
        "pdf_url": "https://arxiv.org/pdf/2602.15571",
        "title": "Accelerated Predictive Coding Networks via Direct Kolen-Pollack Feedback Alignment",
        "authors": [
            "Davide Casnici",
            "Martin Lefebvre",
            "Justin Dauwels",
            "Charlotte Frenkel"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Predictive coding (PC) is a biologically inspired algorithm for training neural networks that relies only on local updates, allowing parallel learning across layers. However, practical implementations face two key limitations: error signals must still propagate from the output to early layers through multiple inference-phase steps, and feedback decays exponentially during this process, leading to vanishing updates in early layers. We propose direct Kolen-Pollack predictive coding (DKP-PC), which simultaneously addresses both feedback delay and exponential decay, yielding a more efficient and scalable variant of PC while preserving update locality. Leveraging direct feedback alignment and direct Kolen-Pollack algorithms, DKP-PC introduces learnable feedback connections from the output layer to all hidden layers, establishing a direct pathway for error transmission. This yields an algorithm that reduces the theoretical error propagation time complexity from O(L), with L being the network depth, to O(1), removing depth-dependent delay in error signals. Moreover, empirical results demonstrate that DKP-PC achieves performance at least comparable to, and often exceeding, that of standard PC, while offering improved latency and computational performance, supporting its potential for custom hardware-efficient implementations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15572",
        "abs_url": "https://arxiv.org/abs/2602.15572",
        "pdf_url": "https://arxiv.org/pdf/2602.15572",
        "title": "Neural Network-Based Parameter Estimation of a Labour Market Agent-Based Model",
        "authors": [
            "M Lopes Alves",
            "Joel Dyer",
            "Doyne Farmer",
            "Michael Wooldridge",
            "Anisoara Calinescu"
        ],
        "comments": "To be presented at the 6th World Conference on Complex Systems (WCCS 2026)",
        "subjects": "Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Agent-based modelling (ABM) is a widespread approach to simulate complex systems. Advancements in computational processing and storage have facilitated the adoption of ABMs across many fields; however, ABMs face challenges that limit their use as decision-support tools. A significant issue is parameter estimation in large-scale ABMs, particularly due to computational constraints on exploring the parameter space. This study evaluates a state-of-the-art simulation-based inference (SBI) framework that uses neural networks (NN) for parameter estimation. This framework is applied to an established labour market ABM based on job transition networks. The ABM is initiated with synthetic datasets and the real U.S. labour market. Next, we compare the effectiveness of summary statistics derived from a list of statistical measures with that learned by an embedded NN. The results demonstrate that the NN-based approach recovers the original parameters when evaluating posterior distributions across various dataset scales and improves efficiency compared to traditional Bayesian methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15586",
        "abs_url": "https://arxiv.org/abs/2602.15586",
        "pdf_url": "https://arxiv.org/pdf/2602.15586",
        "title": "Uniform error bounds for quantized dynamical models",
        "authors": [
            "Abdelkader Metakalard",
            "Fabien Lauer",
            "Kevin Colin",
            "Marion Gilson"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "This paper provides statistical guarantees on the accuracy of dynamical models learned from dependent data sequences. Specifically, we develop uniform error bounds that apply to quantized models and imperfect optimization algorithms commonly used in practical contexts for system identification, and in particular hybrid system identification. Two families of bounds are obtained: slow-rate bounds via a block decomposition and fast-rate, variance-adaptive, bounds via a novel spaced-point strategy. The bounds scale with the number of bits required to encode the model and thus translate hardware constraints into interpretable statistical complexities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15593",
        "abs_url": "https://arxiv.org/abs/2602.15593",
        "pdf_url": "https://arxiv.org/pdf/2602.15593",
        "title": "A unified theory of feature learning in RNNs and DNNs",
        "authors": [
            "Jan P. Bauer",
            "Kirsten Fischer",
            "Moritz Helias",
            "Agostina Palmigiano"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Disordered Systems and Neural Networks (cond-mat.dis-nn)",
        "abstract": "Recurrent and deep neural networks (RNNs/DNNs) are cornerstone architectures in machine learning. Remarkably, RNNs differ from DNNs only by weight sharing, as can be shown through unrolling in time. How does this structural similarity fit with the distinct functional properties these networks exhibit? To address this question, we here develop a unified mean-field theory for RNNs and DNNs in terms of representational kernels, describing fully trained networks in the feature learning ($\\mu$P) regime. This theory casts training as Bayesian inference over sequences and patterns, directly revealing the functional implications induced by the RNNs' weight sharing. In DNN-typical tasks, we identify a phase transition when the learning signal overcomes the noise due to randomness in the weights: below this threshold, RNNs and DNNs behave identically; above it, only RNNs develop correlated representations across timesteps. For sequential tasks, the RNNs' weight sharing furthermore induces an inductive bias that aids generalization by interpolating unsupervised time steps. Overall, our theory offers a way to connect architectural structure to functional biases.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15595",
        "abs_url": "https://arxiv.org/abs/2602.15595",
        "pdf_url": "https://arxiv.org/pdf/2602.15595",
        "title": "Multi-Objective Coverage via Constraint Active Search",
        "authors": [
            "Zakaria Shams Siam",
            "Xuefeng Liu",
            "Chong Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In this paper, we formulate the new multi-objective coverage (MOC) problem where our goal is to identify a small set of representative samples whose predicted outcomes broadly cover the feasible multi-objective space. This problem is of great importance in many critical real-world applications, e.g., drug discovery and materials design, as this representative set can be evaluated much faster than the whole feasible set, thus significantly accelerating the scientific discovery process. Existing works cannot be directly applied as they either focus on sample space coverage or multi-objective optimization that targets the Pareto front. However, chemically diverse samples often yield identical objective profiles, and safety constraints are usually defined on the objectives. To solve this MOC problem, we propose a novel search algorithm, MOC-CAS, which employs an upper confidence bound-based acquisition function to select optimistic samples guided by Gaussian process posterior predictions. For enabling efficient optimization, we develop a smoothed relaxation of the hard feasibility test and derive an approximate optimizer. Compared to the competitive baselines, we show that our MOC-CAS empirically achieves superior performances across large-scale protein-target datasets for SARS-CoV-2 and cancer, each assessed on five objectives derived from SMILES-based features.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15602",
        "abs_url": "https://arxiv.org/abs/2602.15602",
        "pdf_url": "https://arxiv.org/pdf/2602.15602",
        "title": "Certified Per-Instance Unlearning Using Individual Sensitivity Bounds",
        "authors": [
            "Hanna Benarroch",
            "Jamal Atif",
            "Olivier Cappé"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Certified machine unlearning can be achieved via noise injection leading to differential privacy guarantees, where noise is calibrated to worst-case sensitivity. Such conservative calibration often results in performance degradation, limiting practical applicability. In this work, we investigate an alternative approach based on adaptive per-instance noise calibration tailored to the individual contribution of each data point to the learned solution. This raises the following challenge: how can one establish formal unlearning guarantees when the mechanism depends on the specific point to be removed? To define individual data point sensitivities in noisy gradient dynamics, we consider the use of per-instance differential privacy. For ridge regression trained via Langevin dynamics, we derive high-probability per-instance sensitivity bounds, yielding certified unlearning with substantially less noise injection. We corroborate our theoretical findings through experiments in linear settings and provide further empirical evidence on the relevance of the approach in deep learning settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15603",
        "abs_url": "https://arxiv.org/abs/2602.15603",
        "pdf_url": "https://arxiv.org/pdf/2602.15603",
        "title": "Symbolic recovery of PDEs from measurement data",
        "authors": [
            "Erion Morina",
            "Philipp Scholl",
            "Martin Holler"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Symbolic Computation (cs.SC); Optimization and Control (math.OC)",
        "abstract": "Models based on partial differential equations (PDEs) are powerful for describing a wide range of complex relationships in the natural sciences. Accurately identifying the PDE model, which represents the underlying physical law, is essential for a proper understanding of the problem. This reconstruction typically relies on indirect and noisy measurements of the system's state and, without specifically tailored methods, rarely yields symbolic expressions, thereby hindering interpretability. In this work, we address this issue by considering existing neural network architectures based on rational functions for the symbolic representation of physical laws. These networks leverage the approximation power of rational functions while also benefiting from their flexibility in representing arithmetic operations. Our main contribution is an identifiability result, showing that, in the limit of noiseless, complete measurements, such symbolic networks can uniquely reconstruct the simplest physical law within the PDE model. Specifically, reconstructed laws remain expressible within the symbolic network architecture, with regularization-minimizing parameterizations promoting interpretability and sparsity in case of $L^1$-regularization. In addition, we provide regularity results for symbolic networks. Empirical validation using the ParFam architecture supports these theoretical findings, providing evidence for the practical reconstructibility of physical laws.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15617",
        "abs_url": "https://arxiv.org/abs/2602.15617",
        "pdf_url": "https://arxiv.org/pdf/2602.15617",
        "title": "DNN-Enabled Multi-User Beamforming for Throughput Maximization under Adjustable Fairness",
        "authors": [
            "Kaifeng Lu",
            "Markus Rupp",
            "Stefan Schwarz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "Ensuring user fairness in wireless communications is a fundamental challenge, as balancing the trade-off between fairness and sum rate leads to a non-convex, multi-objective optimization whose complexity grows with network scale. To alleviate this conflict, we propose an optimization-based unsupervised learning approach based on the wireless transformer (WiT) architecture that learns from channel state information (CSI) features. We reformulate the trade-off by combining the sum rate and fairness objectives through a Lagrangian multiplier, which is updated automatically via a dual-ascent algorithm. This mechanism allows for a controllable fairness constraint while simultaneously maximizing the sum rate, effectively realizing a trace on the Pareto front between two conflicting objectives. Our findings show that the proposed approach offers a flexible solution for managing the trade-off optimization under prescribed fairness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15634",
        "abs_url": "https://arxiv.org/abs/2602.15634",
        "pdf_url": "https://arxiv.org/pdf/2602.15634",
        "title": "Beyond ReLU: Bifurcation, Oversmoothing, and Topological Priors",
        "authors": [
            "Erkan Turan",
            "Gaspard Abel",
            "Maysam Behmanesh",
            "Emery Pierson",
            "Maks Ovsjanikov"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph Neural Networks (GNNs) learn node representations through iterative network-based message-passing. While powerful, deep GNNs suffer from oversmoothing, where node features converge to a homogeneous, non-informative state. We re-frame this problem of representational collapse from a \\emph{bifurcation theory} perspective, characterizing oversmoothing as convergence to a stable ``homogeneous fixed point.'' Our central contribution is the theoretical discovery that this undesired stability can be broken by replacing standard monotone activations (e.g., ReLU) with a class of functions. Using Lyapunov-Schmidt reduction, we analytically prove that this substitution induces a bifurcation that destabilizes the homogeneous state and creates a new pair of stable, non-homogeneous \\emph{patterns} that provably resist oversmoothing. Our theory predicts a precise, nontrivial scaling law for the amplitude of these emergent patterns, which we quantitatively validate in experiments. Finally, we demonstrate the practical utility of our theory by deriving a closed-form, bifurcation-aware initialization and showing its utility in real benchmark experiments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15637",
        "abs_url": "https://arxiv.org/abs/2602.15637",
        "pdf_url": "https://arxiv.org/pdf/2602.15637",
        "title": "The Stationarity Bias: Stratified Stress-Testing for Time-Series Imputation in Regulated Dynamical Systems",
        "authors": [
            "Amirreza Dolatpour Fathkouhi",
            "Alireza Namazi",
            "Heman Shakeri"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time-series imputation benchmarks employ uniform random masking and shape-agnostic metrics (MSE, RMSE), implicitly weighting evaluation by regime prevalence. In systems with a dominant attractor -- homeostatic physiology, nominal industrial operation, stable network traffic -- this creates a systematic \\emph{Stationarity Bias}: simple methods appear superior because the benchmark predominantly samples the easy, low-entropy regime where they trivially succeed. We formalize this bias and propose a \\emph{Stratified Stress-Test} that partitions evaluation into Stationary and Transient regimes. Using Continuous Glucose Monitoring (CGM) as a testbed -- chosen for its rigorous ground-truth forcing functions (meals, insulin) that enable precise regime identification -- we establish three findings with broad implications:(i)~Stationary Efficiency: Linear interpolation achieves state-of-the-art reconstruction during stable intervals, confirming that complex architectures are computationally wasteful in low-entropy regimes.(ii)~Transient Fidelity: During critical transients (post-prandial peaks, hypoglycemic events), linear methods exhibit drastically degraded morphological fidelity (DTW), disproportionate to their RMSE -- a phenomenon we term the \\emph{RMSE Mirage}, where low pointwise error masks the destruction of signal shape.(iii)~Regime-Conditional Model Selection: Deep learning models preserve both pointwise accuracy and morphological integrity during transients, making them essential for safety-critical downstream tasks. We further derive empirical missingness distributions from clinical trials and impose them on complete training data, preventing models from exploiting unrealistically clean observations and encouraging robustness under real-world missingness. This framework generalizes to any regulated system where routine stationarity dominates critical transients.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15649",
        "abs_url": "https://arxiv.org/abs/2602.15649",
        "pdf_url": "https://arxiv.org/pdf/2602.15649",
        "title": "Continuous-Time Piecewise-Linear Recurrent Neural Networks",
        "authors": [
            "Alena Brändle",
            "Lukas Eisenmann",
            "Florian Götz",
            "Daniel Durstewitz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In dynamical systems reconstruction (DSR) we aim to recover the dynamical system (DS) underlying observed time series. Specifically, we aim to learn a generative surrogate model which approximates the underlying, data-generating DS, and recreates its long-term properties (`climate statistics'). In scientific and medical areas, in particular, these models need to be mechanistically tractable -- through their mathematical analysis we would like to obtain insight into the recovered system's workings. Piecewise-linear (PL), ReLU-based RNNs (PLRNNs) have a strong track-record in this regard, representing SOTA DSR models while allowing mathematical insight by virtue of their PL design. However, all current PLRNN variants are discrete-time maps. This is in disaccord with the assumed continuous-time nature of most physical and biological processes, and makes it hard to accommodate data arriving at irregular temporal intervals. Neural ODEs are one solution, but they do not reach the DSR performance of PLRNNs and often lack their tractability. Here we develop theory for continuous-time PLRNNs (cPLRNNs): We present a novel algorithm for training and simulating such models, bypassing numerical integration by efficiently exploiting their PL structure. We further demonstrate how important topological objects like equilibria or limit cycles can be determined semi-analytically in trained models. We compare cPLRNNs to both their discrete-time cousins as well as Neural ODEs on DSR benchmarks, including systems with discontinuities which come with hard thresholds.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15676",
        "abs_url": "https://arxiv.org/abs/2602.15676",
        "pdf_url": "https://arxiv.org/pdf/2602.15676",
        "title": "Relative Geometry of Neural Forecasters: Linking Accuracy and Alignment in Learned Latent Geometry",
        "authors": [
            "Deniz Kucukahmetler",
            "Maximilian Jean Hemmann",
            "Julian Mosig von Aehrenfeld",
            "Maximilian Amthor",
            "Christian Deubel",
            "Nico Scherf",
            "Diaaeldin Taha"
        ],
        "comments": "Accepted to Transactions on Machine Learning Research (TMLR)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Neural networks can accurately forecast complex dynamical systems, yet how they internally represent underlying latent geometry remains poorly understood. We study neural forecasters through the lens of representational alignment, introducing anchor-based, geometry-agnostic relative embeddings that remove rotational and scaling ambiguities in latent spaces. Applying this framework across seven canonical dynamical systems - ranging from periodic to chaotic - we reveal reproducible family-level structure: multilayer perceptrons align with other MLPs, recurrent networks with RNNs, while transformers and echo-state networks achieve strong forecasts despite weaker alignment. Alignment generally correlates with forecasting accuracy, yet high accuracy can coexist with low alignment. Relative geometry thus provides a simple, reproducible foundation for comparing how model families internalize and represent dynamical structure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15677",
        "abs_url": "https://arxiv.org/abs/2602.15677",
        "pdf_url": "https://arxiv.org/pdf/2602.15677",
        "title": "CAMEL: An ECG Language Model for Forecasting Cardiac Events",
        "authors": [
            "Neelay Velingker",
            "Alaia Solko-Breslin",
            "Mayank Keoliya",
            "Seewon Choi",
            "Jiayi Xin",
            "Anika Marathe",
            "Alireza Oraii",
            "Rajat Deo",
            "Sameed Khatana",
            "Rajeev Alur",
            "Mayur Naik",
            "Eric Wong"
        ],
        "comments": "24 pages, 6 figures",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "Electrocardiograms (ECG) are electrical recordings of the heart that are critical for diagnosing cardiovascular conditions. ECG language models (ELMs) have recently emerged as a promising framework for ECG classification accompanied by report generation. However, current models cannot forecast future cardiac events despite the immense clinical value for planning earlier intervention. To address this gap, we propose CAMEL, the first ELM that is capable of inference over longer signal durations which enables its forecasting capability. Our key insight is a specialized ECG encoder which enables cross-understanding of ECG signals with text. We train CAMEL using established LLM training procedures, combining LoRA adaptation with a curriculum learning pipeline. Our curriculum includes ECG classification, metrics calculations, and multi-turn conversations to elicit reasoning. CAMEL demonstrates strong zero-shot performance across 6 tasks and 9 datasets, including ECGForecastBench, a new benchmark that we introduce for forecasting arrhythmias. CAMEL is on par with or surpasses ELMs and fully supervised baselines both in- and out-of-distribution, achieving SOTA results on ECGBench (+7.0% absolute average gain) as well as ECGForecastBench (+12.4% over fully supervised models and +21.1% over zero-shot ELMs).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15704",
        "abs_url": "https://arxiv.org/abs/2602.15704",
        "pdf_url": "https://arxiv.org/pdf/2602.15704",
        "title": "Controlled oscillation modeling using port-Hamiltonian neural networks",
        "authors": [
            "Maximino Linares",
            "Guillaume Doras",
            "Thomas Hélie"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY); Dynamical Systems (math.DS)",
        "abstract": "Learning dynamical systems through purely data-driven methods is challenging as they do not learn the underlying conservation laws that enable them to correctly generalize. Existing port-Hamiltonian neural network methods have recently been successfully applied for modeling mechanical systems. However, even though these methods are designed on power-balance principles, they usually do not consider power-preserving discretizations and often rely on Runge-Kutta numerical methods. In this work, we propose to use a second-order discrete gradient method embedded in the learning of dynamical systems with port-Hamiltonian neural networks. Numerical results are provided for three systems deliberately selected to span different ranges of dynamical behavior under control: a baseline harmonic oscillator with quadratic energy storage; a Duffing oscillator, with a non-quadratic Hamiltonian offering amplitude-dependent effects; and a self-sustained oscillator, which can stabilize in a controlled limit cycle through the incorporation of a nonlinear dissipation. We show how the use of this discrete gradient method outperforms the performance of a Runge-Kutta method of the same order. Experiments are also carried out to compare two theoretically equivalent port-Hamiltonian systems formulations and to analyze the impact of regularizing the Jacobian of port-Hamiltonian neural networks during training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15740",
        "abs_url": "https://arxiv.org/abs/2602.15740",
        "pdf_url": "https://arxiv.org/pdf/2602.15740",
        "title": "MRC-GAT: A Meta-Relational Copula-Based Graph Attention Network for Interpretable Multimodal Alzheimer's Disease Diagnosis",
        "authors": [
            "Fatemeh Khalvandi",
            "Saadat Izadi",
            "Abdolah Chalechale"
        ],
        "comments": "27 pages, 10 figures, 10 table",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Quantitative Methods (q-bio.QM)",
        "abstract": "Alzheimer's disease (AD) is a progressive neurodegenerative condition necessitating early and precise diagnosis to provide prompt clinical management. Given the paramount importance of early diagnosis, recent studies have increasingly focused on computer-aided diagnostic models to enhance precision and reliability. However, most graph-based approaches still rely on fixed structural designs, which restrict their flexibility and limit generalization across heterogeneous patient data. To overcome these limitations, the Meta-Relational Copula-Based Graph Attention Network (MRC-GAT) is proposed as an efficient multimodal model for AD classification tasks. The proposed architecture, copula-based similarity alignment, relational attention, and node fusion are integrated as the core components of episodic meta-learning, such that the multimodal features, including risk factors (RF), Cognitive test scores, and MRI attributes, are first aligned via a copula-based transformation in a common statistical space and then combined by a multi-relational attention mechanism. According to evaluations performed on the TADPOLE and NACC datasets, the MRC-GAT model achieved accuracies of 96.87% and 92.31%, respectively, demonstrating state-of-the-art performance compared to existing diagnostic models. Finally, the proposed model confirms the robustness and applicability of the proposed method by providing interpretability at various stages of disease diagnosis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15752",
        "abs_url": "https://arxiv.org/abs/2602.15752",
        "pdf_url": "https://arxiv.org/pdf/2602.15752",
        "title": "Beyond Match Maximization and Fairness: Retention-Optimized Two-Sided Matching",
        "authors": [
            "Ren Kishimoto",
            "Rikiya Takehi",
            "Koichi Tanaka",
            "Masahiro Nomura",
            "Riku Togashi",
            "Yoji Tomita",
            "Yuta Saito"
        ],
        "comments": "Published as a conference paper at ICLR 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "On two-sided matching platforms such as online dating and recruiting, recommendation algorithms often aim to maximize the total number of matches. However, this objective creates an imbalance, where some users receive far too many matches while many others receive very few and eventually abandon the platform. Retaining users is crucial for many platforms, such as those that depend heavily on subscriptions. Some may use fairness objectives to solve the problem of match maximization. However, fairness in itself is not the ultimate objective for many platforms, as users do not suddenly reward the platform simply because exposure is equalized. In practice, where user retention is often the ultimate goal, casually relying on fairness will leave the optimization of retention up to luck. In this work, instead of maximizing matches or axiomatically defining fairness, we formally define the new problem setting of maximizing user retention in two-sided matching platforms. To this end, we introduce a dynamic learning-to-rank (LTR) algorithm called Matching for Retention (MRet). Unlike conventional algorithms for two-sided matching, our approach models user retention by learning personalized retention curves from each user's profile and interaction history. Based on these curves, MRet dynamically adapts recommendations by jointly considering the retention gains of both the user receiving recommendations and those who are being recommended, so that limited matching opportunities can be allocated where they most improve overall retention. Naturally but importantly, empirical evaluations on synthetic and real-world datasets from a major online dating platform show that MRet achieves higher user retention, since conventional methods optimize matches or fairness rather than retention.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15763",
        "abs_url": "https://arxiv.org/abs/2602.15763",
        "pdf_url": "https://arxiv.org/pdf/2602.15763",
        "title": "GLM-5: from Vibe Coding to Agentic Engineering",
        "authors": [
            "GLM-5 Team",
            "Aohan Zeng",
            "Xin Lv",
            "Zhenyu Hou",
            "Zhengxiao Du",
            "Qinkai Zheng",
            "Bin Chen",
            "Da Yin",
            "Chendi Ge",
            "Chengxing Xie",
            "Cunxiang Wang",
            "Gengzheng Pan",
            "Hao Zeng",
            "Haoke Zhang",
            "Haoran Wang",
            "Huilong Chen",
            "Jiajie Zhang",
            "Jian Jiao",
            "Jiaqi Guo",
            "Jingsen Wang",
            "Jingzhao Du",
            "Jinzhu Wu",
            "Kedong Wang",
            "Lei Li",
            "Lin Fan",
            "Lucen Zhong",
            "Mingdao Liu",
            "Mingming Zhao",
            "Pengfan Du",
            "Qian Dong",
            "Rui Lu",
            "Shuang-Li",
            "Shulin Cao",
            "Song Liu",
            "Ting Jiang",
            "Xiaodong Chen",
            "Xiaohan Zhang",
            "Xuancheng Huang",
            "Xuezhen Dong",
            "Yabo Xu",
            "Yao Wei",
            "Yifan An",
            "Yilin Niu",
            "Yitong Zhu",
            "Yuanhao Wen",
            "Yukuo Cen",
            "Yushi Bai",
            "Zhongpei Qiao",
            "Zihan Wang",
            "Zikang Wang",
            "Zilin Zhu",
            "Ziqiang Liu",
            "Zixuan Li",
            "Bojie Wang",
            "Bosi Wen",
            "Can Huang",
            "Changpeng Cai",
            "Chao Yu",
            "Chen Li",
            "Chen Li",
            "Chenghua Huang",
            "Chengwei Hu",
            "Chenhui Zhang",
            "Chenzheng Zhu",
            "Congfeng Yin",
            "Daoyan Lin",
            "Dayong Yang",
            "Di Wang",
            "Ding Ai",
            "Erle Zhu",
            "Fangzhou Yi",
            "Feiyu Chen",
            "Guohong Wen",
            "Hailong Sun",
            "Haisha Zhao",
            "Haiyi Hu",
            "Hanchen Zhang",
            "Hanrui Liu",
            "Hanyu Zhang",
            "Hao Peng",
            "Hao Tai",
            "Haobo Zhang",
            "He Liu",
            "Hongwei Wang",
            "Hongxi Yan",
            "Hongyu Ge",
            "Huan Liu",
            "Huan Liu",
            "Huanpeng Chu",
            "Jia'ni Zhao",
            "Jiachen Wang",
            "Jiajing Zhao",
            "Jiamin Ren",
            "Jiapeng Wang",
            "Jiaxin Zhang",
            "Jiayi Gui",
            "Jiayue Zhao",
            "Jijie Li",
            "Jing An",
            "Jing Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "We present GLM-5, a next-generation foundation model designed to transition the paradigm of vibe coding to agentic engineering. Building upon the agentic, reasoning, and coding (ARC) capabilities of its predecessor, GLM-5 adopts DSA to significantly reduce training and inference costs while maintaining long-context fidelity. To advance model alignment and autonomy, we implement a new asynchronous reinforcement learning infrastructure that drastically improves post-training efficiency by decoupling generation from training. Furthermore, we propose novel asynchronous agent RL algorithms that further improve RL quality, enabling the model to learn from complex, long-horizon interactions more effectively. Through these innovations, GLM-5 achieves state-of-the-art performance on major open benchmarks. Most critically, GLM-5 demonstrates unprecedented capability in real-world coding tasks, surpassing previous baselines in handling end-to-end software engineering challenges. Code, models, and more information are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15799",
        "abs_url": "https://arxiv.org/abs/2602.15799",
        "pdf_url": "https://arxiv.org/pdf/2602.15799",
        "title": "The Geometry of Alignment Collapse: When Fine-Tuning Breaks Safety",
        "authors": [
            "Max Springer",
            "Chung Peng Lee",
            "Blossom Metevier",
            "Jane Castleman",
            "Bohdan Turbal",
            "Hayoung Jung",
            "Zeyu Shen",
            "Aleksandra Korolova"
        ],
        "comments": "27 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Fine-tuning aligned language models on benign tasks unpredictably degrades safety guardrails, even when training data contains no harmful content and developers have no adversarial intent. We show that the prevailing explanation, that fine-tuning updates should be orthogonal to safety-critical directions in high-dimensional parameter space, offers false reassurance: we show this orthogonality is structurally unstable and collapses under the dynamics of gradient descent. We then resolve this through a novel geometric analysis, proving that alignment concentrates in low-dimensional subspaces with sharp curvature, creating a brittle structure that first-order methods cannot detect or defend. While initial fine-tuning updates may indeed avoid these subspaces, the curvature of the fine-tuning loss generates second-order acceleration that systematically steers trajectories into alignment-sensitive regions. We formalize this mechanism through the Alignment Instability Condition, three geometric properties that, when jointly satisfied, lead to safety degradation. Our main result establishes a quartic scaling law: alignment loss grows with the fourth power of training time, governed by the sharpness of alignment geometry and the strength of curvature coupling between the fine-tuning task and safety-critical parameters. These results expose a structural blind spot in the current safety paradigm. The dominant approaches to safe fine-tuning address only the initial snapshot of a fundamentally dynamic problem. Alignment fragility is not a bug to be patched; it is an intrinsic geometric property of gradient descent on curved manifolds. Our results motivate the development of curvature-aware methods, and we hope will further enable a shift in alignment safety analysis from reactive red-teaming to predictive diagnostics for open-weight model deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15817",
        "abs_url": "https://arxiv.org/abs/2602.15817",
        "pdf_url": "https://arxiv.org/pdf/2602.15817",
        "title": "Solving Parameter-Robust Avoid Problems with Unknown Feasibility using Reinforcement Learning",
        "authors": [
            "Oswin So",
            "Eric Yang Yu",
            "Songyuan Zhang",
            "Matthew Cleaveland",
            "Mitchell Black",
            "Chuchu Fan"
        ],
        "comments": "ICLR 2026. The project page can be found at this https URL",
        "subjects": "Machine Learning (cs.LG); Robotics (cs.RO); Optimization and Control (math.OC)",
        "abstract": "Recent advances in deep reinforcement learning (RL) have achieved strong results on high-dimensional control tasks, but applying RL to reachability problems raises a fundamental mismatch: reachability seeks to maximize the set of states from which a system remains safe indefinitely, while RL optimizes expected returns over a user-specified distribution. This mismatch can result in policies that perform poorly on low-probability states that are still within the safe set. A natural alternative is to frame the problem as a robust optimization over a set of initial conditions that specify the initial state, dynamics and safe set, but whether this problem has a solution depends on the feasibility of the specified set, which is unknown a priori. We propose Feasibility-Guided Exploration (FGE), a method that simultaneously identifies a subset of feasible initial conditions under which a safe policy exists, and learns a policy to solve the reachability problem over this set of initial conditions. Empirical results demonstrate that FGE learns policies with over 50% more coverage than the best existing method for challenging initial conditions across tasks in the MuJoCo simulator and the Kinetix simulator with pixel observations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15820",
        "abs_url": "https://arxiv.org/abs/2602.15820",
        "pdf_url": "https://arxiv.org/pdf/2602.15820",
        "title": "Stabilizing Test-Time Adaptation of High-Dimensional Simulation Surrogates via D-Optimal Statistics",
        "authors": [
            "Anna Zimmel",
            "Paul Setinek",
            "Gianluca Galletti",
            "Johannes Brandstetter",
            "Werner Zellinger"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine learning surrogates are increasingly used in engineering to accelerate costly simulations, yet distribution shifts between training and deployment often cause severe performance degradation (e.g., unseen geometries or configurations). Test-Time Adaptation (TTA) can mitigate such shifts, but existing methods are largely developed for lower-dimensional classification with structured outputs and visually aligned input-output relationships, making them unstable for the high-dimensional, unstructured and regression problems common in simulation. We address this challenge by proposing a TTA framework based on storing maximally informative (D-optimal) statistics, which jointly enables stable adaptation and principled parameter selection at test time. When applied to pretrained simulation surrogates, our method yields up to 7% out-of-distribution improvements at negligible computational cost. To the best of our knowledge, this is the first systematic demonstration of effective TTA for high-dimensional simulation regression and generative design optimization, validated on the SIMSHIFT and EngiBench benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15829",
        "abs_url": "https://arxiv.org/abs/2602.15829",
        "pdf_url": "https://arxiv.org/pdf/2602.15829",
        "title": "Operationalising the Superficial Alignment Hypothesis via Task Complexity",
        "authors": [
            "Tomás Vergara-Browne",
            "Darshan Patil",
            "Ivan Titov",
            "Siva Reddy",
            "Tiago Pimentel",
            "Marius Mosbach"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The superficial alignment hypothesis (SAH) posits that large language models learn most of their knowledge during pre-training, and that post-training merely surfaces this knowledge. The SAH, however, lacks a precise definition, which has led to (i) different and seemingly orthogonal arguments supporting it, and (ii) important critiques to it. We propose a new metric called task complexity: the length of the shortest program that achieves a target performance on a task. In this framework, the SAH simply claims that pre-trained models drastically reduce the complexity of achieving high performance on many tasks. Our definition unifies prior arguments supporting the SAH, interpreting them as different strategies to find such short programs. Experimentally, we estimate the task complexity of mathematical reasoning, machine translation, and instruction following; we then show that these complexities can be remarkably low when conditioned on a pre-trained model. Further, we find that pre-training enables access to strong performances on our tasks, but it can require programs of gigabytes of length to access them. Post-training, on the other hand, collapses the complexity of reaching this same performance by several orders of magnitude. Overall, our results highlight that task adaptation often requires surprisingly little information -- often just a few kilobytes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2306.17652",
        "abs_url": "https://arxiv.org/abs/2306.17652",
        "pdf_url": "https://arxiv.org/pdf/2306.17652",
        "title": "Accurate 2D Reconstruction for PET Scanners based on the Analytical White Image Model",
        "authors": [
            "Tomislav Matulić",
            "Damir Seršić"
        ],
        "comments": "37 pages, 16 figures",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "In this paper, we provide a precise mathematical model of crystal-to-crystal response which is used to generate the white image - a necessary compensation model needed to overcome the physical limitations of the PET scanner. We present a closed-form solution, as well as several accurate approximations, due to the complexity of the exact mathematical expressions. We prove, experimentally and analytically, that the difference between the best approximations and real crystal-to-crystal response is insignificant. The obtained responses are used to generate the white image compensation model. It can be written as a single closed-form expression making it easy to implement in known reconstruction methods. The maximum likelihood expectation maximization (MLEM) algorithm is modified and our white image model is integrated into it. The modified MLEM algorithm is not based on the system matrix, rather it is based on ray-driven projections and back-projections. The compensation model provides all necessary information about the system. Finally, we check our approach on synthetic and real data. For the real-world acquisition, we use the Raytest ClearPET camera for small animals and the NEMA NU 4-2008 phantom. The proposed approach overperforms competitive, non-compensated reconstruction methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2504.15370",
        "abs_url": "https://arxiv.org/abs/2504.15370",
        "pdf_url": "https://arxiv.org/pdf/2504.15370",
        "title": "Transferable Learning of Reaction Pathways from Geometric Priors",
        "authors": [
            "Juno Nam",
            "Miguel Steiner",
            "Max Misterka",
            "Soojung Yang",
            "Avni Singhal",
            "Rafael Gómez-Bombarelli"
        ],
        "comments": "14 pages, 6 figures; Supporting Information in ancillary files",
        "subjects": "Chemical Physics (physics.chem-ph); Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG)",
        "abstract": "Identifying minimum-energy paths (MEPs) is crucial for understanding chemical reaction mechanisms but remains computationally demanding. We introduce MEPIN, a scalable machine-learning method for efficiently predicting MEPs from reactant and product configurations, without relying on transition-state geometries or pre-optimized reaction paths during training. The task is defined as predicting deviations from geometric interpolations along reaction coordinates. We address this task with a continuous reaction path model based on a symmetry-broken equivariant neural network that generates a flexible number of intermediate structures. The model is trained using an energy-based objective, with efficiency enhanced by incorporating geometric priors from geodesic interpolation as initial interpolations or pre-training objectives. Our approach generalizes across diverse chemical reactions and achieves accurate alignment with reference intrinsic reaction coordinates, as demonstrated on various small molecule reactions and [3+2] cycloadditions. Our method enables the exploration of large chemical reaction spaces with efficient, data-driven predictions of reaction pathways.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2510.11923",
        "abs_url": "https://arxiv.org/abs/2510.11923",
        "pdf_url": "https://arxiv.org/pdf/2510.11923",
        "title": "Enhancing Diffusion-Based Sampling with Molecular Collective Variables",
        "authors": [
            "Juno Nam",
            "Bálint Máté",
            "Artur P. Toshev",
            "Manasa Kaniselvan",
            "Rafael Gómez-Bombarelli",
            "Ricky T. Q. Chen",
            "Brandon Wood",
            "Guan-Horng Liu",
            "Benjamin Kurt Miller"
        ],
        "comments": "",
        "subjects": "Chemical Physics (physics.chem-ph); Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Diffusion-based samplers learn to sample complex, high-dimensional distributions using energies or log densities alone, without training data. Yet, they remain impractical for molecular sampling because they are often slower than molecular dynamics and miss thermodynamically relevant modes. Inspired by enhanced sampling, we encourage exploration by introducing a sequential bias along bespoke, information-rich, low-dimensional projections of atomic coordinates known as collective variables (CVs). We introduce a repulsive potential centered on the CVs from recent samples, which pushes future samples towards novel CV regions and effectively increases the temperature in the projected space. Our resulting method improves efficiency, mode discovery, enables the estimation of free energy differences, and retains independent sampling from the approximate Boltzmann distribution via reweighting by the bias. On standard peptide conformational sampling benchmarks, the method recovers diverse conformational states and accurate free energy profiles. We are the first to demonstrate reactive sampling using a diffusion-based sampler, capturing bond breaking and formation with universal interatomic potentials at near-first-principles accuracy. The approach resolves reactive energy landscapes at a fraction of the wall-clock time of standard sampling methods, advancing diffusion-based sampling towards practical use in molecular sciences.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15033",
        "abs_url": "https://arxiv.org/abs/2602.15033",
        "pdf_url": "https://arxiv.org/pdf/2602.15033",
        "title": "High Convergence Rates of CMOS Invertible Logic Circuits Based on Many-Body Hamiltonians",
        "authors": [
            "Naoya Onizawa",
            "Takahiro Hanyu"
        ],
        "comments": "5 pages",
        "subjects": "Emerging Technologies (cs.ET); Machine Learning (cs.LG)",
        "abstract": "This paper introduces CMOS invertible-logic (CIL) circuits based on many-body Hamiltonians. CIL can realize probabilistic forward and backward operations of a function by annealing a corresponding Hamiltonian using stochastic computing. We have created a Hamiltonian that includes three-body interaction of spins (probabilistic nodes). It provides some degrees of freedom to design a simpler landscape of Hamiltonian (energy) than that of the conventional two-body Hamiltonian. The simpler landscape makes it easier to reach the global minimum energy. The proposed three-body CIL circuits are designed and evaluated with the conventional two-body CIL circuits, resulting in few-times higher convergence rates with negligible area overhead on FPGA.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15040",
        "abs_url": "https://arxiv.org/abs/2602.15040",
        "pdf_url": "https://arxiv.org/pdf/2602.15040",
        "title": "SOON: Symmetric Orthogonal Operator Network for Global Subseasonal-to-Seasonal Climate Forecasting",
        "authors": [
            "Ziyu Zhou",
            "Tian Zhou",
            "Shiyu Wang",
            "James Kwok",
            "Yuxuan Liang"
        ],
        "comments": "",
        "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph); Machine Learning (cs.LG)",
        "abstract": "Accurate global Subseasonal-to-Seasonal (S2S) climate forecasting is critical for disaster preparedness and resource management, yet it remains challenging due to chaotic atmospheric dynamics. Existing models predominantly treat atmospheric fields as isotropic images, conflating the distinct physical processes of zonal wave propagation and meridional transport, and leading to suboptimal modeling of anisotropic dynamics. In this paper, we propose the Symmetric Orthogonal Operator Network (SOON) for global S2S climate forecasting. It couples: (1) an Anisotropic Embedding strategy that tokenizes the global grid into latitudinal rings, preserving the integrity of zonal periodic structures; and (2) a stack of SOON Blocks that models the alternating interaction of Zonal and Meridional Operators via a symmetric decomposition, structurally mitigating discretization errors inherent in long-term integration. Extensive experiments on the Earth Reanalysis 5 dataset demonstrate that SOON establishes a new state-of-the-art, significantly outperforming existing methods in both forecasting accuracy and computational efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15045",
        "abs_url": "https://arxiv.org/abs/2602.15045",
        "pdf_url": "https://arxiv.org/pdf/2602.15045",
        "title": "VQ-DSC-R: Robust Vector Quantized-Enabled Digital Semantic Communication With OFDM Transmission",
        "authors": [
            "Jianqiao Chen",
            "Nan Ma",
            "Xiaodong Xu",
            "Tingting Zhu",
            "Huishi Song",
            "Chen Dong",
            "Wenkai Liu",
            "Rui Meng",
            "Ping Zhang"
        ],
        "comments": "",
        "subjects": "Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "Digital mapping of semantic features is essential for achieving interoperability between semantic communication and practical digital infrastructure. However, current research efforts predominantly concentrate on analog semantic communication with simplified channel models. To bridge these gaps, we develop a robust vector quantized-enabled digital semantic communication (VQ-DSC-R) system built upon orthogonal frequency division multiplexing (OFDM) transmission. Our work encompasses the framework design of VQ-DSC-R, followed by a comprehensive optimization study. Firstly, we design a Swin Transformer-based backbone for hierarchical semantic feature extraction, integrated with VQ modules that map the features into a shared semantic quantized codebook (SQC) for efficient index transmission. Secondly, we propose a differentiable vector quantization with adaptive noise-variance (ANDVQ) scheme to mitigate quantization errors in SQC, which dynamically adjusts the quantization process using K-nearest neighbor statistics, while exponential moving average mechanism stabilizes SQC training. Thirdly, for robust index transmission over multipath fading channel and noise, we develop a conditional diffusion model (CDM) to refine channel state information, and design an attention-based module to dynamically adapt to channel noise. The entire VQ-DSC-R system is optimized via a three-stage training strategy. Extensive experiments demonstrate superiority of VQ-DSC-R over benchmark schemes, achieving high compression ratios and robust performance in practical scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15084",
        "abs_url": "https://arxiv.org/abs/2602.15084",
        "pdf_url": "https://arxiv.org/pdf/2602.15084",
        "title": "TokaMind: A Multi-Modal Transformer Foundation Model for Tokamak Plasma Dynamics",
        "authors": [
            "Tobia Boschi",
            "Andrea Loreti",
            "Nicola C. Amorisco",
            "Rodrigo H. Ordonez-Hurtado",
            "Cécile Rousseau",
            "George K. Holt",
            "Eszter Székely",
            "Alexander Whittle",
            "Samuel Jackson",
            "Adriano Agnello",
            "Stanislas Pamela",
            "Alessandra Pascale",
            "Robert Akers",
            "Juan Bernabe Moreno",
            "Vassil Alexandrov",
            "Mykhaylo Zayats"
        ],
        "comments": "",
        "subjects": "Plasma Physics (physics.plasm-ph); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "We present TokaMind, an open-source foundation model framework for fusion plasma modeling, based on a Multi-Modal Transformer (MMT) and trained on heterogeneous tokamak diagnostics from the publicly available MAST dataset. TokaMind supports multiple data modalities (time-series, 2D profiles, and videos) with different sampling rates, robust missing-signal handling, and efficient task adaptation via selectively loading and freezing four model components. To represent multi-modal signals, we use a training-free Discrete Cosine Transform embedding (DCT3D) and provide a clean interface for alternative embeddings (e.g., Variational Autoencoders - VAEs). We evaluate TokaMind on the recently introduced MAST benchmark TokaMark, comparing training and embedding strategies. Our results show that fine-tuned TokaMind outperforms the benchmark baseline on all but one task, and that, for several tasks, lightweight fine-tuning yields better performance than training the same architecture from scratch under a matched epoch budget. These findings highlight the benefits of multi-modal pretraining for tokamak plasma dynamics and provide a practical, extensible foundation for future fusion modeling tasks. Training code and model weights will be made publicly available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15088",
        "abs_url": "https://arxiv.org/abs/2602.15088",
        "pdf_url": "https://arxiv.org/pdf/2602.15088",
        "title": "IT-DPC-SRI: A Cloud-Optimized Archive of Italian Radar Precipitation (2010-2025)",
        "authors": [
            "Gabriele Franch",
            "Elena Tomasi",
            "Uladzislau Azhel",
            "Giacomo Tomezzoli",
            "Alessandro Camilletti",
            "Virginia Poli",
            "Renata Pelosini",
            "Gianfranco Vulpiani",
            "Gabriella Scipione",
            "Giuseppe Trotta",
            "Matteo Angelinelli",
            "Leif Denby",
            "Irene Livia Kruse",
            "Marco Cristoforetti"
        ],
        "comments": "15 pages, 7 figures",
        "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph); Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)",
        "abstract": "We present IT-DPC-SRI, the first publicly available long-term archive of Italian weather radar precipitation estimates, spanning 16 years (2010--2025). The dataset contains Surface Rainfall Intensity (SRI) observations from the Italian Civil Protection Department's national radar mosaic, harmonized into a coherent Analysis-Ready Cloud-Optimized (ARCO) Zarr datacube. The archive comprises over one million timesteps at temporal resolutions from 15 to 5 minutes, covering a $1200\\times1400$ kilometer domain at 1 kilometer spatial resolution, compressed from 7TB to 51GB on disk. We address the historical fragmentation of Italian radar data - previously scattered across heterogeneous formats (OPERA BUFR, HDF5, GeoTIFF) with varying spatial domains and projections - by reprocessing the entire record into a unified store. The dataset is accessible as a static versioned snapshot on Zenodo, via cloud-native access on the ECMWF European Weather Cloud, and as a continuously updated live version on the ArcoDataHub platform. This release fills a significant gap in European radar data availability, as Italy does not participate in the EUMETNET OPERA pan-European radar composite. The dataset is released under a CC BY-SA 4.0 license.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15091",
        "abs_url": "https://arxiv.org/abs/2602.15091",
        "pdf_url": "https://arxiv.org/pdf/2602.15091",
        "title": "Mixture-of-Experts under Finite-Rate Gating: Communication--Generalization Trade-offs",
        "authors": [
            "Ali Khalesi",
            "Mohammad Reza Deylam Salehi"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "Mixture-of-Experts (MoE) architectures decompose prediction tasks into specialized expert sub-networks selected by a gating mechanism. This letter adopts a communication-theoretic view of MoE gating, modeling the gate as a stochastic channel operating under a finite information rate. Within an information-theoretic learning framework, we specialize a mutual-information generalization bound and develop a rate-distortion characterization $D(R_g)$ of finite-rate gating, where $R_g:=I(X; T)$, yielding (under a standard empirical rate-distortion optimality condition) $\\mathbb{E}[R(W)] \\le D(R_g)+\\delta_m+\\sqrt{(2/m)\\, I(S; W)}$. The analysis yields capacity-aware limits for communication-constrained MoE systems, and numerical simulations on synthetic multi-expert models empirically confirm the predicted trade-offs between gating rate, expressivity, and generalization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15136",
        "abs_url": "https://arxiv.org/abs/2602.15136",
        "pdf_url": "https://arxiv.org/pdf/2602.15136",
        "title": "Universal priors: solving empirical Bayes via Bayesian inference and pretraining",
        "authors": [
            "Nick Cannella",
            "Anzo Teh",
            "Yanjun Han",
            "Yury Polyanskiy"
        ],
        "comments": "40 pages, 5 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We theoretically justify the recent empirical finding of [Teh et al., 2025] that a transformer pretrained on synthetically generated data achieves strong performance on empirical Bayes (EB) problems. We take an indirect approach to this question: rather than analyzing the model architecture or training dynamics, we ask why a pretrained Bayes estimator, trained under a prespecified training distribution, can adapt to arbitrary test distributions. Focusing on Poisson EB problems, we identify the existence of universal priors such that training under these priors yields a near-optimal regret bound of $\\widetilde{O}(\\frac{1}{n})$ uniformly over all test distributions. Our analysis leverages the classical phenomenon of posterior contraction in Bayesian statistics, showing that the pretrained transformer adapts to unknown test distributions precisely through posterior contraction. This perspective also explains the phenomenon of length generalization, in which the test sequence length exceeds the training length, as the model performs Bayesian inference using a generalized posterior.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15146",
        "abs_url": "https://arxiv.org/abs/2602.15146",
        "pdf_url": "https://arxiv.org/pdf/2602.15146",
        "title": "Beyond Reinforcement Learning: Fast and Scalable Quantum Circuit Synthesis",
        "authors": [
            "Lukas Theissinger",
            "Thore Gerlach",
            "David Berghaus",
            "Christian Bauckhage"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "Quantum unitary synthesis addresses the problem of translating abstract quantum algorithms into sequences of hardware-executable quantum gates. Solving this task exactly is infeasible in general due to the exponential growth of the underlying combinatorial search space. Existing approaches suffer from misaligned optimization objectives, substantial training costs and limited generalization across different qubit counts. We mitigate these limitations by using supervised learning to approximate the minimum description length of residual unitaries and combining this estimate with stochastic beam search to identify near optimal gate sequences. Our method relies on a lightweight model with zero-shot generalization, substantially reducing training overhead compared to prior baselines. Across multiple benchmarks, we achieve faster wall-clock synthesis times while exceeding state-of-the-art methods in terms of success rate for complex circuits.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15161",
        "abs_url": "https://arxiv.org/abs/2602.15161",
        "pdf_url": "https://arxiv.org/pdf/2602.15161",
        "title": "Exploiting Layer-Specific Vulnerabilities to Backdoor Attack in Federated Learning",
        "authors": [
            "Mohammad Hadi Foroughi",
            "Seyed Hamed Rastegar",
            "Mohammad Sabokrou",
            "Ahmad Khonsari"
        ],
        "comments": "This paper has been accepted for publication in IEEE ICC 2026",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Federated learning (FL) enables distributed model training across edge devices while preserving data locality. This decentralized approach has emerged as a promising solution for collaborative learning on sensitive user data, effectively addressing the longstanding privacy concerns inherent in centralized systems. However, the decentralized nature of FL exposes new security vulnerabilities, especially backdoor attacks that threaten model integrity. To investigate this critical concern, this paper presents the Layer Smoothing Attack (LSA), a novel backdoor attack that exploits layer-specific vulnerabilities in neural networks. First, a Layer Substitution Analysis methodology systematically identifies backdoor-critical (BC) layers that contribute most significantly to backdoor success. Subsequently, LSA strategically manipulates these BC layers to inject persistent backdoors while remaining undetected by state-of-the-art defense mechanisms. Extensive experiments across diverse model architectures and datasets demonstrate that LSA achieves a remarkably backdoor success rate of up to 97% while maintaining high model accuracy on the primary task, consistently bypassing modern FL defenses. These findings uncover fundamental vulnerabilities in current FL security frameworks, demonstrating that future defenses must incorporate layer-aware detection and mitigation strategies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15169",
        "abs_url": "https://arxiv.org/abs/2602.15169",
        "pdf_url": "https://arxiv.org/pdf/2602.15169",
        "title": "Learning the S-matrix from data: Rediscovering gravity from gauge theory via symbolic regression",
        "authors": [
            "Nathan Moynihan"
        ],
        "comments": "",
        "subjects": "High Energy Physics - Theory (hep-th); Machine Learning (cs.LG); High Energy Physics - Phenomenology (hep-ph)",
        "abstract": "We demonstrate that modern machine-learning methods can autonomously reconstruct several flagship analytic structures in scattering amplitudes directly from numerical on-shell data. In particular, we show that the Kawai--Lewellen--Tye (KLT) relations can be rediscovered using symbolic regression applied to colour-ordered Yang--Mills amplitudes with Mandelstam invariants as input features. Using standard feature-selection techniques, specifically column-pivoted QR factorisation, we simultaneously recover the Kleiss--Kuijf and Bern--Carrasco--Johansson (BCJ) relations, identifying a minimal basis of partial amplitudes without any group-theoretic input. We obtain the tree-level KLT relations with high numerical accuracy up to five external legs, using only minimal theoretical priors, and we comment on the obstacles to generalising the method to higher multiplicity. Our results establish symbolic regression as a practical tool for exploring the analytic structure of the scattering-amplitude landscape, and suggests a general data-driven strategy for uncovering hidden relations in general theories. For comparison, we benchmark this general approach with a recently introduced neural-network based method.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15195",
        "abs_url": "https://arxiv.org/abs/2602.15195",
        "pdf_url": "https://arxiv.org/pdf/2602.15195",
        "title": "Weight space Detection of Backdoors in LoRA Adapters",
        "authors": [
            "David Puertolas Merenciano",
            "Ekaterina Vasyagina",
            "Raghav Dixit",
            "Kevin Zhu",
            "Ruizhe Li",
            "Javier Ferrando",
            "Maheep Chaudhary"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "LoRA adapters let users fine-tune large language models (LLMs) efficiently. However, LoRA adapters are shared through open repositories like Hugging Face Hub \\citep{huggingface_hub_docs}, making them vulnerable to backdoor attacks. Current detection methods require running the model with test input data -- making them impractical for screening thousands of adapters where the trigger for backdoor behavior is unknown. We detect poisoned adapters by analyzing their weight matrices directly, without running the model -- making our method data-agnostic. Our method extracts simple statistics -- how concentrated the singular values are, their entropy, and the distribution shape -- and flags adapters that deviate from normal patterns. We evaluate the method on 500 LoRA adapters -- 400 clean, and 100 poisoned for Llama-3.2-3B on instruction and reasoning datasets: Alpaca, Dolly, GSM8K, ARC-Challenge, SQuADv2, NaturalQuestions, HumanEval, and GLUE dataset. We achieve 97\\% detection accuracy with less than 2\\% false positives.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15259",
        "abs_url": "https://arxiv.org/abs/2602.15259",
        "pdf_url": "https://arxiv.org/pdf/2602.15259",
        "title": "Knowing Isn't Understanding: Re-grounding Generative Proactivity with Epistemic and Behavioral Insight",
        "authors": [
            "Kirandeep Kaur",
            "Xingda Lyu",
            "Chirag Shah"
        ],
        "comments": "",
        "subjects": "Computers and Society (cs.CY); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Generative AI agents equate understanding with resolving explicit queries, an assumption that confines interaction to what users can articulate. This assumption breaks down when users themselves lack awareness of what is missing, risky, or worth considering. In such conditions, proactivity is not merely an efficiency enhancement, but an epistemic necessity. We refer to this condition as epistemic incompleteness: where progress depends on engaging with unknown unknowns for effective partnership. Existing approaches to proactivity remain narrowly anticipatory, extrapolating from past behavior and presuming that goals are already well defined, thereby failing to support users meaningfully. However, surfacing possibilities beyond a user's current awareness is not inherently beneficial. Unconstrained proactive interventions can misdirect attention, overwhelm users, or introduce harm. Proactive agents, therefore, require behavioral grounding: principled constraints on when, how, and to what extent an agent should intervene. We advance the position that generative proactivity must be grounded both epistemically and behaviorally. Drawing on the philosophy of ignorance and research on proactive behavior, we argue that these theories offer critical guidance for designing agents that can engage responsibly and foster meaningful partnerships.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15277",
        "abs_url": "https://arxiv.org/abs/2602.15277",
        "pdf_url": "https://arxiv.org/pdf/2602.15277",
        "title": "Accelerating Large-Scale Dataset Distillation via Exploration-Exploitation Optimization",
        "authors": [
            "Muhammad J. Alahmadi",
            "Peng Gao",
            "Feiyi Wang",
            "Dongkuan"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Dataset distillation compresses the original data into compact synthetic datasets, reducing training time and storage while retaining model performance, enabling deployment under limited resources. Although recent decoupling-based distillation methods enable dataset distillation at large-scale, they continue to face an efficiency gap: optimization-based decoupling methods achieve higher accuracy but demand intensive computation, whereas optimization-free decoupling methods are efficient but sacrifice accuracy. To overcome this trade-off, we propose Exploration-Exploitation Distillation (E^2D), a simple, practical method that minimizes redundant computation through an efficient pipeline that begins with full-image initialization to preserve semantic integrity and feature diversity. It then uses a two-phase optimization strategy: an exploration phase that performs uniform updates and identifies high-loss regions, and an exploitation phase that focuses updates on these regions to accelerate convergence. We evaluate E^2D on large-scale benchmarks, surpassing the state-of-the-art on ImageNet-1K while being 18x faster, and on ImageNet-21K, our method substantially improves accuracy while remaining 4.3x faster. These results demonstrate that targeted, redundancy-reducing updates, rather than brute-force optimization, bridge the gap between accuracy and efficiency in large-scale dataset distillation. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15306",
        "abs_url": "https://arxiv.org/abs/2602.15306",
        "pdf_url": "https://arxiv.org/pdf/2602.15306",
        "title": "Sparse Additive Model Pruning for Order-Based Causal Structure Learning",
        "authors": [
            "Kentaro Kanamori",
            "Hirofumi Suzuki",
            "Takuya Takagi"
        ],
        "comments": "15 pages, 12 figures, to appear in the 40th AAAI Conference on Artificial Intelligence (AAAI 2026)",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Causal structure learning, also known as causal discovery, aims to estimate causal relationships between variables as a form of a causal directed acyclic graph (DAG) from observational data. One of the major frameworks is the order-based approach that first estimates a topological order of the underlying DAG and then prunes spurious edges from the fully-connected DAG induced by the estimated topological order. Previous studies often focus on the former ordering step because it can dramatically reduce the search space of DAGs. In practice, the latter pruning step is equally crucial for ensuring both computational efficiency and estimation accuracy. Most existing methods employ a pruning technique based on generalized additive models and hypothesis testing, commonly known as CAM-pruning. However, this approach can be a computational bottleneck as it requires repeatedly fitting additive models for all variables. Furthermore, it may harm estimation quality due to multiple testing. To address these issues, we introduce a new pruning method based on sparse additive models, which enables direct pruning of redundant edges without relying on hypothesis testing. We propose an efficient algorithm for learning sparse additive models by combining the randomized tree embedding technique with group-wise sparse regression. Experimental results on both synthetic and real datasets demonstrated that our method is significantly faster than existing pruning methods while maintaining comparable or superior accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15326",
        "abs_url": "https://arxiv.org/abs/2602.15326",
        "pdf_url": "https://arxiv.org/pdf/2602.15326",
        "title": "SCENE OTA-FD: Self-Centering Noncoherent Estimator for Over-the-Air Federated Distillation",
        "authors": [
            "Hao Chen",
            "Zavareh Bozorgasl"
        ],
        "comments": "Work in progress. Codes will be available on: this https URL",
        "subjects": "Signal Processing (eess.SP); Artificial Intelligence (cs.AI); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "We propose SCENE (Self-Centering Noncoherent Estimator), a pilot-free and phase-invariant aggregation primitive for over-the-air federated distillation (OTA-FD). Each device maps its soft-label (class-probability) vector to nonnegative transmit energies under constant per-round power and constant-envelope signaling (PAPR near 1). At the server, a self-centering energy estimator removes the noise-energy offset and yields an unbiased estimate of the weighted soft-label average, with variance decaying on the order of 1/(SM) in the number of receive antennas M and repetition factor S. We also develop a pilot-free ratio-normalized variant that cancels unknown large-scale gains, provide a convergence bound consistent with coherent OTA-FD analyses, and present an overhead-based crossover comparison. SCENE targets short-coherence and hardware-constrained regimes, where avoiding per-round CSI is essential: it trades a modest noncoherent variance constant for zero uplink pilots, unbiased aggregation, and hardware-friendly transmission, and can outperform coherent designs when pilot overhead is non-negligible.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15379",
        "abs_url": "https://arxiv.org/abs/2602.15379",
        "pdf_url": "https://arxiv.org/pdf/2602.15379",
        "title": "FlashMem: Supporting Modern DNN Workloads on Mobile with GPU Memory Hierarchy Optimizations",
        "authors": [
            "Zhihao Shu",
            "Md Musfiqur Rahman Sanim",
            "Hangyu Zheng",
            "Kunxiong Zhu",
            "Miao Yin",
            "Gagan Agrawal",
            "Wei Niu"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "The increasing size and complexity of modern deep neural networks (DNNs) pose significant challenges for on-device inference on mobile GPUs, with limited memory and computational resources. Existing DNN acceleration frameworks primarily deploy a weight preloading strategy, where all model parameters are loaded into memory before execution on mobile GPUs. We posit that this approach is not adequate for modern DNN workloads that comprise very large model(s) and possibly execution of several distinct models in succession. In this work, we introduce FlashMem, a memory streaming framework designed to efficiently execute large-scale modern DNNs and multi-DNN workloads while minimizing memory consumption and reducing inference latency. Instead of fully preloading weights, FlashMem statically determines model loading schedules and dynamically streams them on demand, leveraging 2.5D texture memory to minimize data transformations and improve execution efficiency. Experimental results on 11 models demonstrate that FlashMem achieves 2.0x to 8.4x memory reduction and 1.7x to 75.0x speedup compared to existing frameworks, enabling efficient execution of large-scale models and multi-DNN support on resource-constrained mobile GPUs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15423",
        "abs_url": "https://arxiv.org/abs/2602.15423",
        "pdf_url": "https://arxiv.org/pdf/2602.15423",
        "title": "GaiaFlow: Semantic-Guided Diffusion Tuning for Carbon-Frugal Search",
        "authors": [
            "Rong Fu",
            "Wenxin Zhang",
            "Jia Yee Tan",
            "Chunlei Meng",
            "Shuo Yin",
            "Xiaowen Ma",
            "Wangyu Wu",
            "Muge Qi",
            "Guangzhen Yao",
            "Zhaolu Kang",
            "Zeli Su",
            "Simon Fong"
        ],
        "comments": "19 pages, 7 figures",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "As the burgeoning power requirements of sophisticated neural architectures escalate, the information retrieval community has recognized ecological sustainability as a pivotal priority that necessitates a fundamental paradigm shift in model design. While contemporary neural rankers have attained unprecedented accuracy, the substantial environmental externalities associated with their computational intensity often remain overlooked in large-scale deployments. We present GaiaFlow, an innovative framework engineered to facilitate carbon-frugal search by operationalizing semantic-guided diffusion tuning. Our methodology orchestrates the convergence of retrieval-guided Langevin dynamics and a hardware-independent performance modeling strategy to optimize the trade-off between search precision and environmental preservation. By incorporating adaptive early exit protocols and precision-aware quantized inference, the proposed architecture significantly mitigates operational carbon footprints while maintaining robust retrieval quality across heterogeneous computing infrastructures. Extensive experimental evaluations demonstrate that GaiaFlow achieves a superior equilibrium between effectiveness and energy efficiency, offering a scalable and sustainable pathway for next-generation neural search systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15449",
        "abs_url": "https://arxiv.org/abs/2602.15449",
        "pdf_url": "https://arxiv.org/pdf/2602.15449",
        "title": "TAROT: Test-driven and Capability-adaptive Curriculum Reinforcement Fine-tuning for Code Generation with Large Language Models",
        "authors": [
            "Chansung Park",
            "Juyong Jiang",
            "Fan Wang",
            "Sayak Paul",
            "Jiasi Shen",
            "Jing Tang",
            "Jianguo Li"
        ],
        "comments": "The first three authors contributed equally to this work; listing order is random",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG); Software Engineering (cs.SE)",
        "abstract": "Large Language Models (LLMs) are changing the coding paradigm, known as vibe coding, yet synthesizing algorithmically sophisticated and robust code still remains a critical challenge. Incentivizing the deep reasoning capabilities of LLMs is essential to overcoming this hurdle. Reinforcement Fine-Tuning (RFT) has emerged as a promising strategy to address this need. However, most existing approaches overlook the heterogeneous difficulty and granularity inherent in test cases, leading to an imbalanced distribution of reward signals and consequently biased gradient updates during training. To address this, we propose Test-driven and cApability-adaptive cuRriculum reinfOrcement fine-Tuning (TAROT). TAROT systematically constructs, for each problem, a four-tier test suite (basic, intermediate, complex, edge), providing a controlled difficulty landscape for curriculum design and evaluation. Crucially, TAROT decouples curriculum progression from raw reward scores, enabling capability-conditioned evaluation and principled selection from a portfolio of curriculum policies rather than incidental test-case difficulty composition. This design fosters stable optimization and more efficient competency acquisition. Extensive experimental results reveal that the optimal curriculum for RFT in code generation is closely tied to a model's inherent capability, with less capable models achieving greater gains with an easy-to-hard progression, whereas more competent models excel under a hard-first curriculum. TAROT provides a reproducible method that adaptively tailors curriculum design to a model's capability, thereby consistently improving the functional correctness and robustness of the generated code. All code and data are released to foster reproducibility and advance community research at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15470",
        "abs_url": "https://arxiv.org/abs/2602.15470",
        "pdf_url": "https://arxiv.org/pdf/2602.15470",
        "title": "The Skeletal Trap: Mapping Spatial Inequality and Ghost Stops in Ankara's Transit Network",
        "authors": [
            "Elifnaz Kancan"
        ],
        "comments": "13 pages, 12 figures. Spatial analysis of Ankara transit network using anomaly detection and grid-based modeling",
        "subjects": "Physics and Society (physics.soc-ph); Machine Learning (cs.LG)",
        "abstract": "Ankara's public transport crisis is commonly framed as a shortage of buses or operational inefficiency. This study argues that the problem is fundamentally morphological and structural. The city's leapfrog urban expansion has produced fragmented peripheral clusters disconnected from a rigid, center-oriented bus network. As a result, demand remains intensely concentrated along the Kizilay-Ulus axis and western corridors, while peripheral districts experience either chronic under-service or enforced transfer dependency. The deficiency is therefore not merely quantitative but rooted in the misalignment between urban macroform and network architecture. The empirical analysis draws on a 173-day operational dataset derived from route-level passenger and trip reports published by EGO under the former \"Transparent Ankara\" initiative. To overcome the absence of stop-level geospatial data, a Connectivity-Based Weighted Distribution Model reallocates passenger volumes to 1 km x 1 km grid cells using network centrality. The findings reveal persistent center-periphery asymmetries, structural bottlenecks, and spatially embedded accessibility inequalities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15472",
        "abs_url": "https://arxiv.org/abs/2602.15472",
        "pdf_url": "https://arxiv.org/pdf/2602.15472",
        "title": "Fluids You Can Trust: Property-Preserving Operator Learning for Incompressible Flows",
        "authors": [
            "Ramansh Sharma",
            "Matthew Lowery",
            "Houman Owhadi",
            "Varun Shankar"
        ],
        "comments": "",
        "subjects": "Fluid Dynamics (physics.flu-dyn); Machine Learning (cs.LG)",
        "abstract": "We present a novel property-preserving kernel-based operator learning method for incompressible flows governed by the incompressible Navier-Stokes equations. Traditional numerical solvers incur significant computational costs to respect incompressibility. Operator learning offers efficient surrogate models, but current neural operators fail to exactly enforce physical properties such as incompressibility, periodicity, and turbulence. Our method maps input functions to expansion coefficients of output functions in a property-preserving kernel basis, ensuring that predicted velocity fields analytically and simultaneously preserve the aforementioned physical properties. We evaluate the method on challenging 2D and 3D, laminar and turbulent, incompressible flow problems. Our method achieves up to six orders of magnitude lower relative $\\ell_2$ errors upon generalization and trains up to five orders of magnitude faster compared to neural operators. Moreover, while our method enforces incompressibility analytically, neural operators exhibit very large deviations. Our results show that our method provides an accurate and efficient surrogate for incompressible flows.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15484",
        "abs_url": "https://arxiv.org/abs/2602.15484",
        "pdf_url": "https://arxiv.org/pdf/2602.15484",
        "title": "Bottleneck Transformer-Based Approach for Improved Automatic STOI Score Prediction",
        "authors": [
            "Amartyaveer",
            "Murali Kadambi",
            "Chandra Mohan Sharma",
            "Anupam Mondal",
            "Prasanta Kumar Ghosh"
        ],
        "comments": "7 pages, 7 tables, 2 figures, ASRU 2025",
        "subjects": "Audio and Speech Processing (eess.AS); Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "In this study, we have presented a novel approach to predict the Short-Time Objective Intelligibility (STOI) metric using a bottleneck transformer architecture. Traditional methods for calculating STOI typically requires clean reference speech, which limits their applicability in the real world. To address this, numerous deep learning-based nonintrusive speech assessment models have garnered significant interest. Many studies have achieved commendable performance, but there is room for further improvement. We propose the use of bottleneck transformer, incorporating convolution blocks for learning frame-level features and a multi-head self-attention (MHSA) layer to aggregate the information. These components enable the transformer to focus on the key aspects of the input data. Our model has shown higher correlation and lower mean squared error for both seen and unseen scenarios compared to the state-of-the-art model using self-supervised learning (SSL) and spectral features as inputs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15521",
        "abs_url": "https://arxiv.org/abs/2602.15521",
        "pdf_url": "https://arxiv.org/pdf/2602.15521",
        "title": "ExpertWeaver: Unlocking the Inherent MoE in Dense LLMs with GLU Activation Patterns",
        "authors": [
            "Ziyu Zhao",
            "Tong Zhu",
            "Zhi Zhang",
            "Tiantian Fan",
            "Jinluan Yang",
            "Kun Kuang",
            "Zhongyu Wei",
            "Fei Wu",
            "Yu Cheng"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Mixture-of-Experts (MoE) effectively scales model capacity while preserving computational efficiency through sparse expert activation. However, training high-quality MoEs from scratch is prohibitively expensive. A promising alternative is to convert pretrained dense models into sparse MoEs. Existing dense-to-MoE methods fall into two categories: \\textbf{dynamic structural pruning} that converts dense models into MoE architectures with moderate sparsity to balance performance and inference efficiency, and \\textbf{downcycling} approaches that use pretrained dense models to initialize highly sparse MoE architectures. However, existing methods break the intrinsic activation patterns within dense models, leading to suboptimal expert construction. In this work, we argue that the Gated Linear Unit (GLU) mechanism provides a natural blueprint for dense-to-MoE conversion. We show that the fine-grained neural-wise activation patterns of GLU reveal a coarse-grained structure, uncovering an inherent MoE architecture composed of consistently activated universal neurons and dynamically activated specialized neurons. Leveraging this discovery, we introduce ExpertWeaver, a training-free framework that partitions neurons according to their activation patterns and constructs shared experts and specialized routed experts with layer-adaptive configurations. Our experiments demonstrate that ExpertWeaver significantly outperforms existing methods, both as a training-free dynamic structural pruning technique and as a downcycling strategy for superior MoE initialization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15538",
        "abs_url": "https://arxiv.org/abs/2602.15538",
        "pdf_url": "https://arxiv.org/pdf/2602.15538",
        "title": "Functional Central Limit Theorem for Stochastic Gradient Descent",
        "authors": [
            "Kessang Flamand",
            "Victor-Emmanuel Brunel"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "We study the asymptotic shape of the trajectory of the stochastic gradient descent algorithm applied to a convex objective function. Under mild regularity assumptions, we prove a functional central limit theorem for the properly rescaled trajectory. Our result characterizes the long-term fluctuations of the algorithm around the minimizer by providing a diffusion limit for the trajectory. In contrast with classical central limit theorems for the last iterate or Polyak-Ruppert averages, this functional result captures the temporal structure of the fluctuations and applies to non-smooth settings such as robust location estimation, including the geometric median.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15552",
        "abs_url": "https://arxiv.org/abs/2602.15552",
        "pdf_url": "https://arxiv.org/pdf/2602.15552",
        "title": "Latent Regularization in Generative Test Input Generation",
        "authors": [
            "Giorgi Merabishvili",
            "Oliver Weißl",
            "Andrea Stocco"
        ],
        "comments": "Accepted for publication at the 7th International Workshop on Deep Learning for Testing and Testing for Deep Learning (DeepTest 2026), co-located with ICSE 2026",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "This study investigates the impact of regularization of latent spaces through truncation on the quality of generated test inputs for deep learning classifiers. We evaluate this effect using style-based GANs, a state-of-the-art generative approach, and assess quality along three dimensions: validity, diversity, and fault detection. We evaluate our approach on the boundary testing of deep learning image classifiers across three datasets, MNIST, Fashion MNIST, and CIFAR-10. We compare two truncation strategies: latent code mixing with binary search optimization and random latent truncation for generative exploration. Our experiments show that the latent code-mixing approach yields a higher fault detection rate than random truncation, while also improving both diversity and validity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15568",
        "abs_url": "https://arxiv.org/abs/2602.15568",
        "pdf_url": "https://arxiv.org/pdf/2602.15568",
        "title": "Scenario Approach with Post-Design Certification of User-Specified Properties",
        "authors": [
            "Algo Carè",
            "Marco C. Campi",
            "Simone Garatti"
        ],
        "comments": "",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG); Systems and Control (eess.SY); Machine Learning (stat.ML)",
        "abstract": "The scenario approach is an established data-driven design framework that comes equipped with a powerful theory linking design complexity to generalization properties. In this approach, data are simultaneously used both for design and for certifying the design's reliability, without resorting to a separate test dataset. This paper takes a step further by guaranteeing additional properties, useful in post-design usage but not considered during the design phase. To this end, we introduce a two-level framework of appropriateness: baseline appropriateness, which guides the design process, and post-design appropriateness, which serves as a criterion for a posteriori evaluation. We provide distribution-free upper bounds on the risk of failing to meet the post-design appropriateness; these bounds are computable without using any additional test data. Under additional assumptions, lower bounds are also derived. As part of an effort to demonstrate the usefulness of the proposed methodology, the paper presents two practical examples in H2 and pole-placement problems. Moreover, a method is provided to infer comprehensive distributional knowledge of relevant performance indexes from the available dataset.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15592",
        "abs_url": "https://arxiv.org/abs/2602.15592",
        "pdf_url": "https://arxiv.org/pdf/2602.15592",
        "title": "Uni-Flow: a unified autoregressive-diffusion model for complex multiscale flows",
        "authors": [
            "Xiao Xue",
            "Tianyue Yang",
            "Mingyang Gao",
            "Leyu Pan",
            "Maida Wang",
            "Kewei Zhu",
            "Shuo Wang",
            "Jiuling Li",
            "Marco F.P. ten Eikelder",
            "Peter V. Coveney"
        ],
        "comments": "",
        "subjects": "Fluid Dynamics (physics.flu-dyn); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "Spatiotemporal flows govern diverse phenomena across physics, biology, and engineering, yet modelling their multiscale dynamics remains a central challenge. Despite major advances in physics-informed machine learning, existing approaches struggle to simultaneously maintain long-term temporal evolution and resolve fine-scale structure across chaotic, turbulent, and physiological regimes. Here, we introduce Uni-Flow, a unified autoregressive-diffusion framework that explicitly separates temporal evolution from spatial refinement for modelling complex dynamical systems. The autoregressive component learns low-resolution latent dynamics that preserve large-scale structure and ensure stable long-horizon rollouts, while the diffusion component reconstructs high-resolution physical fields, recovering fine-scale features in a small number of denoising steps. We validate Uni-Flow across canonical benchmarks, including two-dimensional Kolmogorov flow, three-dimensional turbulent channel inflow generation with a quantum-informed autoregressive prior, and patient-specific simulations of aortic coarctation derived from high-fidelity lattice Boltzmann hemodynamic solvers. In the cardiovascular setting, Uni-Flow enables task-level faster than real-time inference of pulsatile hemodynamics, reconstructing high-resolution pressure fields over physiologically relevant time horizons in seconds rather than hours. By transforming high-fidelity hemodynamic simulation from an offline, HPC-bound process into a deployable surrogate, Uni-Flow establishes a pathway to faster-than-real-time modelling of complex multiscale flows, with broad implications for scientific machine learning in flow physics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15632",
        "abs_url": "https://arxiv.org/abs/2602.15632",
        "pdf_url": "https://arxiv.org/pdf/2602.15632",
        "title": "Neural-POD: A Plug-and-Play Neural Operator Framework for Infinite-Dimensional Functional Nonlinear Proper Orthogonal Decomposition",
        "authors": [
            "Changhong Mou",
            "Binghang Lu",
            "Guang Lin"
        ],
        "comments": "",
        "subjects": "Computational Physics (physics.comp-ph); Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "The rapid development of AI for Science is often hindered by the \"discretization\", where learned representations remain restricted to the specific grids or resolutions used during training. We propose the Neural Proper Orthogonal Decomposition (Neural-POD), a plug-and-play neural operator framework that constructs nonlinear, orthogonal basis functions in infinite-dimensional space using neural networks. Unlike the classical Proper Orthogonal Decomposition (POD), which is limited to linear subspace approximations obtained through singular value decomposition (SVD), Neural-POD formulates basis construction as a sequence of residual minimization problems solved through neural network training. Each basis function is obtained by learning to represent the remaining structure in the data, following a process analogous to Gram--Schmidt orthogonalization. This neural formulation introduces several key advantages over classical POD: it enables optimization in arbitrary norms (e.g., $L^2$, $L^1$), learns mappings between infinite-dimensional function spaces that is resolution-invariant, generalizes effectively to unseen parameter regimes, and inherently captures nonlinear structures in complex spatiotemporal systems. The resulting basis functions are interpretable, reusable, and enabling integration into both reduced order modeling (ROM) and operator learning frameworks such as deep operator learning (DeepONet). We demonstrate the robustness of Neural-POD with different complex spatiotemporal systems, including the Burgers' and Navier-Stokes equations. We further show that Neural-POD serves as a high performance, plug-and-play bridge between classical Galerkin projection and operator learning that enables consistent integration with both projection-based reduced order models and DeepONet frameworks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15640",
        "abs_url": "https://arxiv.org/abs/2602.15640",
        "pdf_url": "https://arxiv.org/pdf/2602.15640",
        "title": "Latency-aware Human-in-the-Loop Reinforcement Learning for Semantic Communications",
        "authors": [
            "Peizheng Li",
            "Xinyi Lin",
            "Adnan Aijaz"
        ],
        "comments": "6 pages, 8 figures. This paper has been accepted for publication in IEEE ICC 2026",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "Semantic communication promises task-aligned transmission but must reconcile semantic fidelity with stringent latency guarantees in immersive and safety-critical services. This paper introduces a time-constrained human-in-the-loop reinforcement learning (TC-HITL-RL) framework that embeds human feedback, semantic utility, and latency control within a semantic-aware Open radio access network (RAN) architecture. We formulate semantic adaptation driven by human feedback as a constrained Markov decision process (CMDP) whose state captures semantic quality, human preferences, queue slack, and channel dynamics, and solve it via a primal--dual proximal policy optimization algorithm with action shielding and latency-aware reward shaping. The resulting policy preserves PPO-level semantic rewards while tightening the variability of both air-interface and near-real-time RAN intelligent controller processing budgets. Simulations over point-to-multipoint links with heterogeneous deadlines show that TC-HITL-RL consistently meets per-user timing constraints, outperforms baseline schedulers in reward, and stabilizes resource consumption, providing a practical blueprint for latency-aware semantic adaptation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15707",
        "abs_url": "https://arxiv.org/abs/2602.15707",
        "pdf_url": "https://arxiv.org/pdf/2602.15707",
        "title": "Proactive Conversational Assistant for a Procedural Manual Task based on Audio and IMU",
        "authors": [
            "Rehana Mahfuz",
            "Yinyi Guo",
            "Erik Visser",
            "Phanidhar Chinchili"
        ],
        "comments": "3 figures",
        "subjects": "Multimedia (cs.MM); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Real-time conversational assistants for procedural tasks often depend on video input, which can be computationally expensive and compromise user privacy. For the first time, we propose a real-time conversational assistant that provides comprehensive guidance for a procedural task using only lightweight privacy-preserving modalities such as audio and IMU inputs from a user's wearable device to understand the context. This assistant proactively communicates step-by-step instructions to a user performing a furniture assembly task, and answers user questions. We construct a dataset containing conversations where the assistant guides the user in performing the task. On observing that an off-the-shelf language model is a very talkative assistant, we design a novel User Whim Agnostic (UWA) LoRA finetuning method which improves the model's ability to suppress less informative dialogues, while maintaining its tendency to communicate important instructions. This leads to >30% improvement in the F-score. Finetuning the model also results in a 16x speedup by eliminating the need to provide in-context examples in the prompt. We further describe how such an assistant is implemented on edge devices with no dependence on the cloud.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15727",
        "abs_url": "https://arxiv.org/abs/2602.15727",
        "pdf_url": "https://arxiv.org/pdf/2602.15727",
        "title": "Spanning the Visual Analogy Space with a Weight Basis of LoRAs",
        "authors": [
            "Hila Manor",
            "Rinon Gal",
            "Haggai Maron",
            "Tomer Michaeli",
            "Gal Chechik"
        ],
        "comments": "Code and data are in this https URL",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Graphics (cs.GR); Machine Learning (cs.LG); Image and Video Processing (eess.IV)",
        "abstract": "Visual analogy learning enables image manipulation through demonstration rather than textual description, allowing users to specify complex transformations difficult to articulate in words. Given a triplet $\\{\\mathbf{a}$, $\\mathbf{a}'$, $\\mathbf{b}\\}$, the goal is to generate $\\mathbf{b}'$ such that $\\mathbf{a} : \\mathbf{a}' :: \\mathbf{b} : \\mathbf{b}'$. Recent methods adapt text-to-image models to this task using a single Low-Rank Adaptation (LoRA) module, but they face a fundamental limitation: attempting to capture the diverse space of visual transformations within a fixed adaptation module constrains generalization capabilities. Inspired by recent work showing that LoRAs in constrained domains span meaningful, interpolatable semantic spaces, we propose LoRWeB, a novel approach that specializes the model for each analogy task at inference time through dynamic composition of learned transformation primitives, informally, choosing a point in a \"space of LoRAs\". We introduce two key components: (1) a learnable basis of LoRA modules, to span the space of different visual transformations, and (2) a lightweight encoder that dynamically selects and weighs these basis LoRAs based on the input analogy pair. Comprehensive evaluations demonstrate our approach achieves state-of-the-art performance and significantly improves generalization to unseen visual transformations. Our findings suggest that LoRA basis decompositions are a promising direction for flexible visual manipulation. Code and data are in this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15738",
        "abs_url": "https://arxiv.org/abs/2602.15738",
        "pdf_url": "https://arxiv.org/pdf/2602.15738",
        "title": "Beyond Labels: Information-Efficient Human-in-the-Loop Learning using Ranking and Selection Queries",
        "authors": [
            "Belén Martín-Urcelay",
            "Yoonsang Lee",
            "Matthieu R. Bloch",
            "Christopher J. Rozell"
        ],
        "comments": "",
        "subjects": "Human-Computer Interaction (cs.HC); Machine Learning (cs.LG)",
        "abstract": "Integrating human expertise into machine learning systems often reduces the role of experts to labeling oracles, a paradigm that limits the amount of information exchanged and fails to capture the nuances of human judgment. We address this challenge by developing a human-in-the-loop framework to learn binary classifiers with rich query types, consisting of item ranking and exemplar selection. We first introduce probabilistic human response models for these rich queries motivated by the relationship experimentally observed between the perceived implicit score of an item and its distance to the unknown classifier. Using these models, we then design active learning algorithms that leverage the rich queries to increase the information gained per interaction. We provide theoretical bounds on sample complexity and develop a tractable and computationally efficient variational approximation. Through experiments with simulated annotators derived from crowdsourced word-sentiment and image-aesthetic datasets, we demonstrate significant reductions on sample complexity. We further extend active learning strategies to select queries that maximize information rate, explicitly balancing informational value against annotation cost. This algorithm in the word sentiment classification task reduces learning time by more than 57\\% compared to traditional label-only active learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15751",
        "abs_url": "https://arxiv.org/abs/2602.15751",
        "pdf_url": "https://arxiv.org/pdf/2602.15751",
        "title": "Enabling Low-Latency Machine learning on Radiation-Hard FPGAs with hls4ml",
        "authors": [
            "Katya Govorkova",
            "Julian Garcia Pardinas",
            "Vladimir Loncar",
            "Victoria Nguyen",
            "Sebastian Schmitt",
            "Marco Pizzichemi",
            "Loris Martinazzoli",
            "Eluned Anne Smith"
        ],
        "comments": "",
        "subjects": "High Energy Physics - Experiment (hep-ex); Machine Learning (cs.LG)",
        "abstract": "This paper presents the first demonstration of a viable, ultra-fast, radiation-hard machine learning (ML) application on FPGAs, which could be used in future high-energy physics experiments. We present a three-fold contribution, with the PicoCal calorimeter, planned for the LHCb Upgrade II experiment, used as a test case. First, we develop a lightweight autoencoder to compress a 32-sample timing readout, representative of that of the PicoCal, into a two-dimensional latent space. Second, we introduce a systematic, hardware-aware quantization strategy and show that the model can be reduced to 10-bit weights with minimal performance loss. Third, as a barrier to the adoption of on-detector ML is the lack of support for radiation-hard FPGAs in the High-Energy Physics community's standard ML synthesis tool, hls4ml, we develop a new backend for this library. This new back-end enables the automatic translation of ML models into High-Level Synthesis (HLS) projects for the Microchip PolarFire family of FPGAs, one of the few commercially available and radiation hard FPGAs. We present the synthesis of the autoencoder on a target PolarFire FPGA, which indicates that a latency of 25 ns can be achieved. We show that the resources utilized are low enough that the model can be placed within the inherently protected logic of the FPGA. Our extension to hls4ml is a significant contribution, paving the way for broader adoption of ML on FPGAs in high-radiation environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15756",
        "abs_url": "https://arxiv.org/abs/2602.15756",
        "pdf_url": "https://arxiv.org/pdf/2602.15756",
        "title": "A Note on Non-Composability of Layerwise Approximate Verification for Neural Inference",
        "authors": [
            "Or Zamir"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "A natural and informal approach to verifiable (or zero-knowledge) ML inference over floating-point data is: ``prove that each layer was computed correctly up to tolerance $\\delta$; therefore the final output is a reasonable inference result''. This short note gives a simple counterexample showing that this inference is false in general: for any neural network, we can construct a functionally equivalent network for which adversarially chosen approximation-magnitude errors in individual layer computations suffice to steer the final output arbitrarily (within a prescribed bounded range).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15781",
        "abs_url": "https://arxiv.org/abs/2602.15781",
        "pdf_url": "https://arxiv.org/pdf/2602.15781",
        "title": "Neural Scaling Laws for Boosted Jet Tagging",
        "authors": [
            "Matthias Vigl",
            "Nicole Hartman",
            "Michael Kagan",
            "Lukas Heinrich"
        ],
        "comments": "9 pages, 6 figures",
        "subjects": "High Energy Physics - Experiment (hep-ex); Machine Learning (cs.LG); High Energy Physics - Phenomenology (hep-ph); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "The success of Large Language Models (LLMs) has established that scaling compute, through joint increases in model capacity and dataset size, is the primary driver of performance in modern machine learning. While machine learning has long been an integral component of High Energy Physics (HEP) data analysis workflows, the compute used to train state-of-the-art HEP models remains orders of magnitude below that of industry foundation models. With scaling laws only beginning to be studied in the field, we investigate neural scaling laws for boosted jet classification using the public JetClass dataset. We derive compute optimal scaling laws and identify an effective performance limit that can be consistently approached through increased compute. We study how data repetition, common in HEP where simulation is expensive, modifies the scaling yielding a quantifiable effective dataset size gain. We then study how the scaling coefficients and asymptotic performance limits vary with the choice of input features and particle multiplicity, demonstrating that increased compute reliably drives performance toward an asymptotic limit, and that more expressive, lower-level features can raise the performance limit and improve results at fixed dataset size.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15828",
        "abs_url": "https://arxiv.org/abs/2602.15828",
        "pdf_url": "https://arxiv.org/pdf/2602.15828",
        "title": "Dex4D: Task-Agnostic Point Track Policy for Sim-to-Real Dexterous Manipulation",
        "authors": [
            "Yuxuan Kuang",
            "Sungjae Park",
            "Katerina Fragkiadaki",
            "Shubham Tulsiani"
        ],
        "comments": "Project page: this https URL",
        "subjects": "Robotics (cs.RO); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "Learning generalist policies capable of accomplishing a plethora of everyday tasks remains an open challenge in dexterous manipulation. In particular, collecting large-scale manipulation data via real-world teleoperation is expensive and difficult to scale. While learning in simulation provides a feasible alternative, designing multiple task-specific environments and rewards for training is similarly challenging. We propose Dex4D, a framework that instead leverages simulation for learning task-agnostic dexterous skills that can be flexibly recomposed to perform diverse real-world manipulation tasks. Specifically, Dex4D learns a domain-agnostic 3D point track conditioned policy capable of manipulating any object to any desired pose. We train this 'Anypose-to-Anypose' policy in simulation across thousands of objects with diverse pose configurations, covering a broad space of robot-object interactions that can be composed at test time. At deployment, this policy can be zero-shot transferred to real-world tasks without finetuning, simply by prompting it with desired object-centric point tracks extracted from generated videos. During execution, Dex4D uses online point tracking for closed-loop perception and control. Extensive experiments in simulation and on real robots show that our method enables zero-shot deployment for diverse dexterous manipulation tasks and yields consistent improvements over prior baselines. Furthermore, we demonstrate strong generalization to novel objects, scene layouts, backgrounds, and trajectories, highlighting the robustness and scalability of the proposed framework.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2026-02-18",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-02-18?abs=True",
        "arxiv_id": "2602.15830",
        "abs_url": "https://arxiv.org/abs/2602.15830",
        "pdf_url": "https://arxiv.org/pdf/2602.15830",
        "title": "Ensemble-size-dependence of deep-learning post-processing methods that minimize an (un)fair score: motivating examples and a proof-of-concept solution",
        "authors": [
            "Christopher David Roberts"
        ],
        "comments": "",
        "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph); Machine Learning (cs.LG)",
        "abstract": "Fair scores reward ensemble forecast members that behave like samples from the same distribution as the verifying observations. They are therefore an attractive choice as loss functions to train data-driven ensemble forecasts or post-processing methods when large training ensembles are either unavailable or computationally prohibitive. The adjusted continuous ranked probability score (aCRPS) is fair and unbiased with respect to ensemble size, provided forecast members are exchangeable and interpretable as conditionally independent draws from an underlying predictive distribution. However, distribution-aware post-processing methods that introduce structural dependency between members can violate this assumption, rendering aCRPS unfair. We demonstrate this effect using two approaches designed to minimize the expected aCRPS of a finite ensemble: (1) a linear member-by-member calibration, which couples members through a common dependency on the sample ensemble mean, and (2) a deep-learning method, which couples members via transformer self-attention across the ensemble dimension. In both cases, the results are sensitive to ensemble size and apparent gains in aCRPS can correspond to systematic unreliability characterized by over-dispersion. We introduce trajectory transformers as a proof-of-concept that ensemble-size independence can be achieved. This approach is an adaptation of the Post-processing Ensembles with Transformers (PoET) framework and applies self-attention over lead time while preserving the conditional independence required by aCRPS. When applied to weekly mean $T_{2m}$ forecasts from the ECMWF subseasonal forecasting system, this approach successfully reduces systematic model biases whilst also improving or maintaining forecast reliability regardless of the ensemble size used in training (3 vs 9 members) or real-time forecasts (9 vs 100 members).",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]