[
    {
        "order": 1,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19938",
        "abs_url": "https://arxiv.org/abs/2601.19938",
        "pdf_url": "https://arxiv.org/pdf/2601.19938",
        "title": "DecHW: Heterogeneous Decentralized Federated Learning Exploiting Second-Order Information",
        "authors": [
            "Adnan Ahmad",
            "Chiara Boldrini",
            "Lorenzo Valerio",
            "Andrea Passarella",
            "Marco Conti"
        ],
        "comments": "Funding: SoBigDatait (PNRR IR0000013), FAIR (PNRR PE00000013), RESTART (PNRR PE00000001)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Decentralized Federated Learning (DFL) is a serverless collaborative machine learning paradigm where devices collaborate directly with neighbouring devices to exchange model information for learning a generalized model. However, variations in individual experiences and different levels of device interactions lead to data and model initialization heterogeneities across devices. Such heterogeneities leave variations in local model parameters across devices that leads to slower convergence. This paper tackles the data and model heterogeneity by explicitly addressing the parameter level varying evidential credence across local models. A novel aggregation approach is introduced that captures these parameter variations in local models and performs robust aggregation of neighbourhood local updates. Specifically, consensus weights are generated via approximation of second-order information of local models on their local datasets. These weights are utilized to scale neighbourhood updates before aggregating them into global neighbourhood representation. In extensive experiments with computer vision tasks, the proposed approach shows strong generalizability of local models at reduced communication costs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19940",
        "abs_url": "https://arxiv.org/abs/2601.19940",
        "pdf_url": "https://arxiv.org/pdf/2601.19940",
        "title": "Continuous-Flow Data-Rate-Aware CNN Inference on FPGA",
        "authors": [
            "Tobias Habermann",
            "Michael Mecik",
            "Zhenyu Wang",
            "César David Vera",
            "Martin Kumm",
            "Mario Garrido"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Hardware Architecture (cs.AR)",
        "abstract": "Among hardware accelerators for deep-learning inference, data flow implementations offer low latency and high throughput capabilities. In these architectures, each neuron is mapped to a dedicated hardware unit, making them well-suited for field-programmable gate array (FPGA) implementation. Previous unrolled implementations mostly focus on fully connected networks because of their simplicity, although it is well known that convolutional neural networks (CNNs) require fewer computations for the same accuracy. When observing the data flow in CNNs, pooling layers and convolutional layers with a stride larger than one, the number of data at their output is reduced with respect to their input. This data reduction strongly affects the data rate in a fully parallel implementation, making hardware units heavily underutilized unless it is handled properly. This work addresses this issue by analyzing the data flow of CNNs and presents a novel approach to designing data-rate-aware, continuous-flow CNN architectures. The proposed approach ensures a high hardware utilization close to 100% by interleaving low data rate signals and sharing hardware units, as well as using the right parallelization to achieve the throughput of a fully parallel implementation. The results show that a significant amount of the arithmetic logic can be saved, which allows implementing complex CNNs like MobileNet on a single FPGA with high throughput.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19942",
        "abs_url": "https://arxiv.org/abs/2601.19942",
        "pdf_url": "https://arxiv.org/pdf/2601.19942",
        "title": "Latent Object Permanence: Topological Phase Transitions, Free-Energy Principles, and Renormalization Group Flows in Deep Transformer Manifolds",
        "authors": [
            "Faruk Alpay",
            "Bugra Kilictas"
        ],
        "comments": "12 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "We study the emergence of multi-step reasoning in deep Transformer language models through a geometric and statistical-physics lens. Treating the hidden-state trajectory as a flow on an implicit Riemannian manifold, we analyze the layerwise covariance spectrum of activations, where $C^{(\\ell)}=\\mathbb{E}[h^{(\\ell)}h^{(\\ell)\\top}]$, and track deviations from a random-matrix bulk. Across model scales (1.5B--30B), we observe a sharp reduction in effective dimensionality consistent with a phase transition: an order parameter based on sparsity/localization, $\\Omega(h)=1-\\|h\\|_1/(\\sqrt{d}\\|h\\|_2)$, exhibits a discontinuity near a critical normalized depth $\\gamma_c\\approx 0.42$ in sufficiently large models. We formalize the forward pass as a discrete coarse-graining map and relate the appearance of stable \"concept basins\" to fixed points of this renormalization-like dynamics. The resulting low-entropy regime is characterized by a spectral tail collapse and by the formation of transient, reusable object-like structures in representation space, which we call Transient Class Objects (TCOs). We provide theoretical conditions connecting logical separability to spectral decay and validate the predicted signatures with layerwise probes on multiple open-weight model families.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19943",
        "abs_url": "https://arxiv.org/abs/2601.19943",
        "pdf_url": "https://arxiv.org/pdf/2601.19943",
        "title": "Emergent Specialization in Learner Populations: Competition as the Source of Diversity",
        "authors": [
            "Yuhao Li"
        ],
        "comments": "15 pages, 5 figures, code available at this https URL",
        "subjects": "Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "How can populations of learners develop coordinated, diverse behaviors without explicit communication or diversity incentives? We demonstrate that competition alone is sufficient to induce emergent specialization -- learners spontaneously partition into specialists for different environmental regimes through competitive dynamics, consistent with ecological niche theory. We introduce the NichePopulation algorithm, a simple mechanism combining competitive exclusion with niche affinity tracking. Validated across six real-world domains (cryptocurrency trading, commodity prices, weather forecasting, solar irradiance, urban traffic, and air quality), our approach achieves a mean Specialization Index of 0.75 with effect sizes of Cohen's d > 20. Key findings: (1) At lambda=0 (no niche bonus), learners still achieve SI > 0.30, proving specialization is genuinely emergent; (2) Diverse populations outperform homogeneous baselines by +26.5% through method-level division of labor; (3) Our approach outperforms MARL baselines (QMIX, MAPPO, IQL) by 4.3x while being 4x faster.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19944",
        "abs_url": "https://arxiv.org/abs/2601.19944",
        "pdf_url": "https://arxiv.org/pdf/2601.19944",
        "title": "Classifier Calibration at Scale: An Empirical Study of Model-Agnostic Post-Hoc Methods",
        "authors": [
            "Valery Manokhin",
            "Daniel Grønhaug"
        ],
        "comments": "61 pages, 23 figures",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP); Machine Learning (stat.ML)",
        "abstract": "We study model-agnostic post-hoc calibration methods intended to improve probabilistic predictions in supervised binary classification on real i.i.d. tabular data, with particular emphasis on conformal and Venn-based approaches that provide distribution-free validity guarantees under exchangeability. We benchmark 21 widely used classifiers, including linear models, SVMs, tree ensembles (CatBoost, XGBoost, LightGBM), and modern tabular neural and foundation models, on binary tasks from the TabArena-v0.1 suite using randomized, stratified five-fold cross-validation with a held-out test fold. Five calibrators; Isotonic regression, Platt scaling, Beta calibration, Venn-Abers predictors, and Pearsonify are trained on a separate calibration split and applied to test predictions. Calibration is evaluated using proper scoring rules (log-loss and Brier score) and diagnostic measures (Spiegelhalter's Z, ECE, and ECI), alongside discrimination (AUC-ROC) and standard classification metrics. Across tasks and architectures, Venn-Abers predictors achieve the largest average reductions in log-loss, followed closely by Beta calibration, while Platt scaling exhibits weaker and less consistent effects. Beta calibration improves log-loss most frequently across tasks, whereas Venn-Abers displays fewer instances of extreme degradation and slightly more instances of extreme improvement. Importantly, we find that commonly used calibration procedures, most notably Platt scaling and isotonic regression, can systematically degrade proper scoring performance for strong modern tabular models. Overall classification performance is often preserved, but calibration effects vary substantially across datasets and architectures, and no method dominates uniformly. In expectation, all methods except Pearsonify slightly increase accuracy, but the effect is marginal, with the largest expected gain about 0.008%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19953",
        "abs_url": "https://arxiv.org/abs/2601.19953",
        "pdf_url": "https://arxiv.org/pdf/2601.19953",
        "title": "Probabilistic Sensing: Intelligence in Data Sampling",
        "authors": [
            "Ibrahim Albulushi",
            "Saleh Bunaiyan",
            "Suraj S. Cheema",
            "Hesham ElSawy",
            "Feras Al-Dirini"
        ],
        "comments": "Accepted for presentation at IEEE ISCAS 2026 as a lecture",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Hardware Architecture (cs.AR); Emerging Technologies (cs.ET); Systems and Control (eess.SY)",
        "abstract": "Extending the intelligence of sensors to the data-acquisition process - deciding whether to sample or not - can result in transformative energy-efficiency gains. However, making such a decision in a deterministic manner involves risk of losing information. Here we present a sensing paradigm that enables making such a decision in a probabilistic manner. The paradigm takes inspiration from the autonomous nervous system and employs a probabilistic neuron (p-neuron) driven by an analog feature extraction circuit. The response time of the system is on the order of microseconds, over-coming the sub-sampling-rate response time limit and enabling real-time intelligent autonomous activation of data-sampling. Validation experiments on active seismic survey data demonstrate lossless probabilistic data acquisition, with a normalized mean squared error of 0.41%, and 93% saving in the active operation time of the system and the number of generated samples.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19963",
        "abs_url": "https://arxiv.org/abs/2601.19963",
        "pdf_url": "https://arxiv.org/pdf/2601.19963",
        "title": "Cross-Session Decoding of Neural Spiking Data via Task-Conditioned Latent Alignment",
        "authors": [
            "Canyang Zhao",
            "Bolin Peng",
            "J. Patrick Mayo",
            "Ce Ju",
            "Bing Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Cross-session nonstationarity in neural activity recorded by implanted electrodes is a major challenge for invasive Brain-computer interfaces (BCIs), as decoders trained on data from one session often fail to generalize to subsequent sessions. This issue is further exacerbated in practice, as retraining or adapting decoders becomes particularly challenging when only limited data are available from a new session. To address this challenge, we propose a Task-Conditioned Latent Alignment framework (TCLA) for cross-session neural decoding. Building upon an autoencoder architecture, TCLA first learns a low-dimensional representation of neural dynamics from a source session with sufficient data. For target sessions with limited data, TCLA then aligns target latent representations to the source in a task-conditioned manner, enabling effective transfer of learned neural dynamics. We evaluate TCLA on the macaque motor and oculomotor center-out dataset. Compared to baseline methods trained solely on target-session data, TCLA consistently improves decoding performance across datasets and decoding settings, with gains in the coefficient of determination of up to 0.386 for y coordinate velocity decoding in a motor dataset. These results suggest that TCLA provides an effective strategy for transferring knowledge from source to target sessions, enabling more robust neural decoding under conditions with limited data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19965",
        "abs_url": "https://arxiv.org/abs/2601.19965",
        "pdf_url": "https://arxiv.org/pdf/2601.19965",
        "title": "Modeling Cascaded Delay Feedback for Online Net Conversion Rate Prediction: Benchmark, Insights and Solutions",
        "authors": [
            "Mingxuan Luo",
            "Guipeng Xv",
            "Sishuo Chen",
            "Xinyu Li",
            "Li Zhang",
            "Zhangming Chan",
            "Xiang-Rong Sheng",
            "Han Zhu",
            "Jian Xu",
            "Bo Zheng",
            "Chen Lin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In industrial recommender systems, conversion rate (CVR) is widely used for traffic allocation, but it fails to fully reflect recommendation effectiveness because it ignores refund behavior. To better capture true user satisfaction and business value, net conversion rate (NetCVR), defined as the probability that a clicked item is purchased and not refunded, has been this http URL CVR, NetCVR prediction involves a more complex multi-stage cascaded delayed feedback process. The two cascaded delays from click to conversion and from conversion to refund have opposite effects, making traditional CVR modeling methods inapplicable. Moreover, the lack of open-source datasets and online continuous training schemes further hinders progress in this this http URL address these challenges, we introduce CASCADE (Cascaded Sequences of Conversion and Delayed Refund), the first large-scale open dataset derived from the Taobao app for online continuous NetCVR prediction. Through an in-depth analysis of CASCADE, we identify three key insights: (1) NetCVR exhibits strong temporal dynamics, necessitating online continuous modeling; (2) cascaded modeling of CVR and refund rate outperforms direct NetCVR modeling; and (3) delay time, which correlates with both CVR and refund rate, is an important feature for NetCVR this http URL on these insights, we propose TESLA, a continuous NetCVR modeling framework featuring a CVR-refund-rate cascaded architecture, stage-wise debiasing, and a delay-time-aware ranking loss. Extensive experiments demonstrate that TESLA consistently outperforms state-of-the-art methods on CASCADE, achieving absolute improvements of 12.41 percent in RI-AUC and 14.94 percent in RI-PRAUC on NetCVR prediction. The code and dataset are publicly available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19992",
        "abs_url": "https://arxiv.org/abs/2601.19992",
        "pdf_url": "https://arxiv.org/pdf/2601.19992",
        "title": "BayPrAnoMeta: Bayesian Proto-MAML for Few-Shot Industrial Image Anomaly Detection",
        "authors": [
            "Soham Sarkar",
            "Tanmay Sen",
            "Sayantan Banerjee"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Industrial image anomaly detection is a challenging problem owing to extreme class imbalance and the scarcity of labeled defective samples, particularly in few-shot settings. We propose BayPrAnoMeta, a Bayesian generalization of Proto-MAML for few-shot industrial image anomaly detection. Unlike existing Proto-MAML approaches that rely on deterministic class prototypes and distance-based adaptation, BayPrAnoMeta replaces prototypes with task-specific probabilistic normality models and performs inner-loop adaptation via a Bayesian posterior predictive likelihood. We model normal support embeddings with a Normal-Inverse-Wishart (NIW) prior, producing a Student-$t$ predictive distribution that enables uncertainty-aware, heavy-tailed anomaly scoring and is essential for robustness in extreme few-shot settings. We further extend BayPrAnoMeta to a federated meta-learning framework with supervised contrastive regularization for heterogeneous industrial clients and prove convergence to stationary points of the resulting nonconvex objective. Experiments on the MVTec AD benchmark demonstrate consistent and significant AUROC improvements over MAML, Proto-MAML, and PatchCore-based methods in few-shot anomaly detection settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20028",
        "abs_url": "https://arxiv.org/abs/2601.20028",
        "pdf_url": "https://arxiv.org/pdf/2601.20028",
        "title": "Decomposing multimodal embedding spaces with group-sparse autoencoders",
        "authors": [
            "Chiraag Kaushik",
            "Davis Barch",
            "Andrea Fanelli"
        ],
        "comments": "19 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The Linear Representation Hypothesis asserts that the embeddings learned by neural networks can be understood as linear combinations of features corresponding to high-level concepts. Based on this ansatz, sparse autoencoders (SAEs) have recently become a popular method for decomposing embeddings into a sparse combination of linear directions, which have been shown empirically to often correspond to human-interpretable semantics. However, recent attempts to apply SAEs to multimodal embedding spaces (such as the popular CLIP embeddings for image/text data) have found that SAEs often learn \"split dictionaries\", where most of the learned sparse features are essentially unimodal, active only for data of a single modality. In this work, we study how to effectively adapt SAEs for the setting of multimodal embeddings while ensuring multimodal alignment. We first argue that the existence of a split dictionary decomposition on an aligned embedding space implies the existence of a non-split dictionary with improved modality alignment. Then, we propose a new SAE-based approach to multimodal embedding decomposition using cross-modal random masking and group-sparse regularization. We apply our method to popular embeddings for image/text (CLIP) and audio/text (CLAP) data and show that, compared to standard SAEs, our approach learns a more multimodal dictionary while reducing the number of dead neurons and improving feature semanticity. We finally demonstrate how this improvement in alignment of concepts between modalities can enable improvements in the interpretability and control of cross-modal tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20041",
        "abs_url": "https://arxiv.org/abs/2601.20041",
        "pdf_url": "https://arxiv.org/pdf/2601.20041",
        "title": "CiMRAG: Cim-Aware Domain-Adaptive and Noise-Resilient Retrieval-Augmented Generation for Edge-Based LLMs",
        "authors": [
            "Shih-Hsuan Chiu",
            "Ming-Syan Chen"
        ],
        "comments": "Accepted by ICASSP 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Personalized virtual assistants powered by large language models (LLMs) on edge devices are attracting growing attention, with Retrieval-Augmented Generation (RAG) emerging as a key method for personalization by retrieving relevant profile data and generating tailored responses. However, deploying RAG on edge devices faces efficiency hurdles due to the rapid growth of profile data, such as user-LLM interactions and recent updates. While Computing-in-Memory (CiM) architectures mitigate this bottleneck by eliminating data movement between memory and processing units via in-situ operations, they are susceptible to environmental noise that can degrade retrieval precision. This poses a critical issue in dynamic, multi-domain edge-based scenarios (e.g., travel, medicine, and law) where both accuracy and adaptability are paramount. To address these challenges, we propose Task-Oriented Noise-resilient Embedding Learning (TONEL), a framework that improves noise robustness and domain adaptability for RAG in noisy edge environments. TONEL employs a noise-aware projection model to learn task-specific embeddings compatible with CiM hardware constraints, enabling accurate retrieval under noisy conditions. Extensive experiments conducted on personalization benchmarks demonstrate the effectiveness and practicality of our methods relative to strong baselines, especially in task-specific noisy scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20043",
        "abs_url": "https://arxiv.org/abs/2601.20043",
        "pdf_url": "https://arxiv.org/pdf/2601.20043",
        "title": "Regime-Adaptive Bayesian Optimization via Dirichlet Process Mixtures of Gaussian Processes",
        "authors": [
            "Yan Zhang",
            "Xuefeng Liu",
            "Sipeng Chen",
            "Sascha Ranftl",
            "Chong Liu",
            "Shibo Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Standard Bayesian Optimization (BO) assumes uniform smoothness across the search space an assumption violated in multi-regime problems such as molecular conformation search through distinct energy basins or drug discovery across heterogeneous molecular scaffolds. A single GP either oversmooths sharp transitions or hallucinates noise in smooth regions, yielding miscalibrated uncertainty. We propose RAMBO, a Dirichlet Process Mixture of Gaussian Processes that automatically discovers latent regimes during optimization, each modeled by an independent GP with locally-optimized hyperparameters. We derive collapsed Gibbs sampling that analytically marginalizes latent functions for efficient inference, and introduce adaptive concentration parameter scheduling for coarse-to-fine regime discovery. Our acquisition functions decompose uncertainty into intra-regime and inter-regime components. Experiments on synthetic benchmarks and real-world applications, including molecular conformer optimization, virtual screening for drug discovery, and fusion reactor design, demonstrate consistent improvements over state-of-the-art baselines on multi-regime objectives.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20046",
        "abs_url": "https://arxiv.org/abs/2601.20046",
        "pdf_url": "https://arxiv.org/pdf/2601.20046",
        "title": "Externally Validated Longitudinal GRU Model for Visit-Level 180-Day Mortality Risk in Metastatic Castration-Resistant Prostate Cancer",
        "authors": [
            "Javier Mencia-Ledo",
            "Mohammad Noaeen",
            "Zahra Shakeri"
        ],
        "comments": "7 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "Metastatic castration-resistant prostate cancer (mCRPC) is a highly aggressive disease with poor prognosis and heterogeneous treatment response. In this work, we developed and externally validated a visit-level 180-day mortality risk model using longitudinal data from two Phase III cohorts (n=526 and n=640). Only visits with observable 180-day outcomes were labeled; right-censored cases were excluded from analysis. We compared five candidate architectures: Long Short-Term Memory, Gated Recurrent Unit (GRU), Cox Proportional Hazards, Random Survival Forest (RSF), and Logistic Regression. For each dataset, we selected the smallest risk-threshold that achieved an 85% sensitivity floor. The GRU and RSF models showed high discrimination capabilities initially (C-index: 87% for both). In external validation, the GRU obtained a higher calibration (slope: 0.93; intercept: 0.07) and achieved an PR-AUC of 0.87. Clinical impact analysis showed a median time-in-warning of 151.0 days for true positives (59.0 days for false positives) and 18.3 alerts per 100 patient-visits. Given late-stage frailty or cachexia and hemodynamic instability, permutation importance ranked BMI and systolic blood pressure as the strongest associations. These results suggest that longitudinal routine clinical markers can estimate short-horizon mortality risk in mCRPC and support proactive care planning over a multi-month window.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20069",
        "abs_url": "https://arxiv.org/abs/2601.20069",
        "pdf_url": "https://arxiv.org/pdf/2601.20069",
        "title": "Domain Expansion: A Latent Space Construction Framework for Multi-Task Learning",
        "authors": [
            "Chi-Yao Huang",
            "Khoa Vo",
            "Aayush Atul Verma",
            "Duo Lu",
            "Yezhou Yang"
        ],
        "comments": "Accepted to ICLR 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Training a single network with multiple objectives often leads to conflicting gradients that degrade shared representations, forcing them into a compromised state that is suboptimal for any single task--a problem we term latent representation collapse. We introduce Domain Expansion, a framework that prevents these conflicts by restructuring the latent space itself. Our framework uses a novel orthogonal pooling mechanism to construct a latent space where each objective is assigned to a mutually orthogonal subspace. We validate our approach across diverse benchmarks--including ShapeNet, MPIIGaze, and Rotated MNIST--on challenging multi-objective problems combining classification with pose and gaze estimation. Our experiments demonstrate that this structure not only prevents collapse but also yields an explicit, interpretable, and compositional latent space where concepts can be directly manipulated.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20071",
        "abs_url": "https://arxiv.org/abs/2601.20071",
        "pdf_url": "https://arxiv.org/pdf/2601.20071",
        "title": "Distributional value gradients for stochastic environments",
        "authors": [
            "Baptiste Debes",
            "Tinne Tuytelaars"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Gradient-regularized value learning methods improve sample efficiency by leveraging learned models of transition dynamics and rewards to estimate return gradients. However, existing approaches, such as MAGE, struggle in stochastic or noisy environments, limiting their applicability. In this work, we address these limitations by extending distributional reinforcement learning on continuous state-action spaces to model not only the distribution over scalar state-action value functions but also over their gradients. We refer to this approach as Distributional Sobolev Training. Inspired by Stochastic Value Gradients (SVG), our method utilizes a one-step world model of reward and transition distributions implemented via a conditional Variational Autoencoder (cVAE). The proposed framework is sample-based and employs Max-sliced Maximum Mean Discrepancy (MSMMD) to instantiate the distributional Bellman operator. We prove that the Sobolev-augmented Bellman operator is a contraction with a unique fixed point, and highlight a fundamental smoothness trade-off underlying contraction in gradient-aware RL. To validate our method, we first showcase its effectiveness on a simple stochastic reinforcement learning toy problem, then benchmark its performance on several MuJoCo environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20079",
        "abs_url": "https://arxiv.org/abs/2601.20079",
        "pdf_url": "https://arxiv.org/pdf/2601.20079",
        "title": "Techno-economic optimization of a heat-pipe microreactor, part II: multi-objective optimization analysis",
        "authors": [
            "Paul Seurin",
            "Dean Price"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "Heat-pipe microreactors (HPMRs) are compact and transportable nuclear power systems exhibiting inherent safety, well-suited for deployment in remote regions where access is limited and reliance on costly fossil fuels is prevalent. In prior work, we developed a design optimization framework that incorporates techno-economic considerations through surrogate modeling and reinforcement learning (RL)-based optimization, focusing solely on minimizing the levelized cost of electricity (LCOE) by using a bottom-up cost estimation approach. In this study, we extend that framework to a multi-objective optimization that uses the Pareto Envelope Augmented with Reinforcement Learning (PEARL) algorithm. The objectives include minimizing both the rod-integrated peaking factor ($F_{\\Delta h}$) and LCOE -- subject to safety and operational constraints. We evaluate three cost scenarios: (1) a high-cost axial and drum reflectors, (2) a low-cost axial reflector, and (3) low-cost axial and drum reflectors. Our findings indicate that reducing the solid moderator radius, pin pitch, and drum coating angle -- all while increasing the fuel height -- effectively lowers $F_{\\Delta h}$. Across all three scenarios, four key strategies consistently emerged for optimizing LCOE: (1) minimizing the axial reflector contribution when costly, (2) reducing control drum reliance, (3) substituting expensive tri-structural isotropic (TRISO) fuel with axial reflector material priced at the level of graphite, and (4) maximizing fuel burnup. While PEARL demonstrates promise in navigating trade-offs across diverse design scenarios, discrepancies between surrogate model predictions and full-order simulations remain. Further improvements are anticipated through constraint relaxation and surrogate development, constituting an ongoing area of investigation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20088",
        "abs_url": "https://arxiv.org/abs/2601.20088",
        "pdf_url": "https://arxiv.org/pdf/2601.20088",
        "title": "Quantization-Aware Distillation for NVFP4 Inference Accuracy Recovery",
        "authors": [
            "Meng Xin",
            "Sweta Priyadarshi",
            "Jingyu Xin",
            "Bilal Kartal",
            "Aditya Vavre",
            "Asma Kuriparambil Thekkumpate",
            "Zijia Chen",
            "Ameya Sunil Mahabaleshwarkar",
            "Ido Shahaf",
            "Akhiad Bercovich",
            "Kinjal Patel",
            "Suguna Varshini Velury",
            "Chenjie Luo",
            "Zhiyu Cheng",
            "Jenny Chen",
            "Chen-Han Yu",
            "Wei Ping",
            "Oleg Rybakov",
            "Nima Tajbakhsh",
            "Oluwatobi Olabiyi",
            "Dusan Stosic",
            "Di Wu",
            "Song Han",
            "Eric Chung",
            "Sharath Turuvekere Sreenivas",
            "Bryan Catanzaro",
            "Yoshi Suhara",
            "Tijmen Blankevoort",
            "Huizi Mao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This technical report presents quantization-aware distillation (QAD) and our best practices for recovering accuracy of NVFP4-quantized large language models (LLMs) and vision-language models (VLMs). QAD distills a full-precision teacher model into a quantized student model using a KL divergence loss. While applying distillation to quantized models is not a new idea, we observe key advantages of QAD for today's LLMs: 1. It shows remarkable effectiveness and stability for models trained through multi-stage post-training pipelines, including supervised fine-tuning (SFT), reinforcement learning (RL), and model merging, where traditional quantization-aware training (QAT) suffers from engineering complexity and training instability; 2. It is robust to data quality and coverage, enabling accuracy recovery without full training data. We evaluate QAD across multiple post-trained models including AceReason Nemotron, Nemotron 3 Nano, Nemotron Nano V2, Nemotron Nano V2 VL (VLM), and Llama Nemotron Super v1, showing consistent recovery to near-BF16 accuracy.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20116",
        "abs_url": "https://arxiv.org/abs/2601.20116",
        "pdf_url": "https://arxiv.org/pdf/2601.20116",
        "title": "In-Context Reinforcement Learning From Suboptimal Historical Data",
        "authors": [
            "Juncheng Dong",
            "Moyang Guo",
            "Ethan X. Fang",
            "Zhuoran Yang",
            "Vahid Tarokh"
        ],
        "comments": "Accepted to Forty-Second International Conference on Machine Learning (ICML2025)",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Transformer models have achieved remarkable empirical successes, largely due to their in-context learning capabilities. Inspired by this, we explore training an autoregressive transformer for in-context reinforcement learning (ICRL). In this setting, we initially train a transformer on an offline dataset consisting of trajectories collected from various RL tasks, and then fix and use this transformer to create an action policy for new RL tasks. Notably, we consider the setting where the offline dataset contains trajectories sampled from suboptimal behavioral policies. In this case, standard autoregressive training corresponds to imitation learning and results in suboptimal performance. To address this, we propose the Decision Importance Transformer(DIT) framework, which emulates the actor-critic algorithm in an in-context manner. In particular, we first train a transformer-based value function that estimates the advantage functions of the behavior policies that collected the suboptimal trajectories. Then we train a transformer-based policy via a weighted maximum likelihood estimation loss, where the weights are constructed based on the trained value function to steer the suboptimal policies to the optimal ones. We conduct extensive experiments to test the performance of DIT on both bandit and Markov Decision Process problems. Our results show that DIT achieves superior performance, particularly when the offline dataset contains suboptimal historical data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20118",
        "abs_url": "https://arxiv.org/abs/2601.20118",
        "pdf_url": "https://arxiv.org/pdf/2601.20118",
        "title": "A Reinforcement Learning Based Universal Sequence Design for Polar Codes",
        "authors": [
            "David Kin Wai Ho",
            "Arman Fazeli",
            "Mohamad M. Mansour",
            "Louay M. A. Jalloul"
        ],
        "comments": "8 pages, 4 figures, ICML2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "To advance Polar code design for 6G applications, we develop a reinforcement learning-based universal sequence design framework that is extensible and adaptable to diverse channel conditions and decoding strategies. Crucially, our method scales to code lengths up to $2048$, making it suitable for use in standardization. Across all $(N,K)$ configurations supported in 5G, our approach achieves competitive performance relative to the NR sequence adopted in 5G and yields up to a 0.2 dB gain over the beta-expansion baseline at $N=2048$. We further highlight the key elements that enabled learning at scale: (i) incorporation of physical law constrained learning grounded in the universal partial order property of Polar codes, (ii) exploitation of the weak long term influence of decisions to limit lookahead evaluation, and (iii) joint multi-configuration optimization to increase learning efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20120",
        "abs_url": "https://arxiv.org/abs/2601.20120",
        "pdf_url": "https://arxiv.org/pdf/2601.20120",
        "title": "Going NUTS with ADVI: Exploring various Bayesian Inference techniques with Facebook Prophet",
        "authors": [
            "Jovan Krajevski",
            "Biljana Tojtovska Ribarski"
        ],
        "comments": "6 pages, 5 figures, Published in Proceedings of the 22nd International Conference for Informatics and Information Technologies - CiiT 2025",
        "subjects": "Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "Since its introduction, Facebook Prophet has attracted positive attention from both classical statisticians and the Bayesian statistics community. The model provides two built-in inference methods: maximum a posteriori estimation using the L-BFGS-B algorithm, and Markov Chain Monte Carlo (MCMC) sampling via the No-U-Turn Sampler (NUTS). While exploring various time-series forecasting problems using Bayesian inference with Prophet, we encountered limitations stemming from the inability to apply alternative inference techniques beyond those provided by default. Additionally, the fluent API design of Facebook Prophet proved insufficiently flexible for implementing our custom modeling ideas. To address these shortcomings, we developed a complete reimplementation of the Prophet model in PyMC, which enables us to extend the base model and evaluate and compare multiple Bayesian inference methods. In this paper, we present our PyMC-based implementation and analyze in detail the implementation of different Bayesian inference techniques. We consider full MCMC techniques, MAP estimation and Variational inference techniques on a time-series forecasting problem. We discuss in details the sampling approach, convergence diagnostics, forecasting metrics as well as their computational efficiency and detect possible issues which will be addressed in our future work.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20138",
        "abs_url": "https://arxiv.org/abs/2601.20138",
        "pdf_url": "https://arxiv.org/pdf/2601.20138",
        "title": "Scaling Next-Brain-Token Prediction for MEG",
        "authors": [
            "Richard Csaky"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Image and Video Processing (eess.IV)",
        "abstract": "We present a large autoregressive model for source-space MEG that scales next-token prediction to long context across datasets and scanners: handling a corpus of over 500 hours and thousands of sessions across the three largest MEG datasets. A modified SEANet-style vector-quantizer reduces multichannel MEG into a flattened token stream on which we train a Qwen2.5-VL backbone from scratch to predict the next brain token and to recursively generate minutes of MEG from up to a minute of context. To evaluate long-horizon generation, we introduce three task-matched tests: (i) on-manifold stability via generated-only drift compared to the time-resolved distribution of real sliding windows, and (ii) conditional specificity via correct context versus prompt-swap controls using a neurophysiologically grounded metric set. We train on CamCAN and Omega and run all analyses on held-out MOUS, establishing cross-dataset generalization. Across metrics, generations remain relatively stable over long rollouts and are closer to the correct continuation than swapped controls. Code available at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20154",
        "abs_url": "https://arxiv.org/abs/2601.20154",
        "pdf_url": "https://arxiv.org/pdf/2601.20154",
        "title": "Spectral Ghost in Representation Learning: from Component Analysis to Self-Supervised Learning",
        "authors": [
            "Bo Dai",
            "Na Li",
            "Dale Schuurmans"
        ],
        "comments": "43 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Self-supervised learning (SSL) have improved empirical performance by unleashing the power of unlabeled data for practical applications. Specifically, SSL extracts the representation from massive unlabeled data, which will be transferred to a plenty of down streaming tasks with limited data. The significant improvement on diverse applications of representation learning has attracted increasing attention, resulting in a variety of dramatically different self-supervised learning objectives for representation extraction, with an assortment of learning procedures, but the lack of a clear and unified understanding. Such an absence hampers the ongoing development of representation learning, leaving a theoretical understanding missing, principles for efficient algorithm design unclear, and the use of representation learning methods in practice unjustified. The urgency for a unified framework is further motivated by the rapid growth in representation learning methods. In this paper, we are therefore compelled to develop a principled foundation of representation learning. We first theoretically investigate the sufficiency of the representation from a spectral representation view, which reveals the spectral essence of the existing successful SSL algorithms and paves the path to a unified framework for understanding and analysis. Such a framework work also inspires the development of more efficient and easy-to-use representation learning algorithms with principled way in real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20157",
        "abs_url": "https://arxiv.org/abs/2601.20157",
        "pdf_url": "https://arxiv.org/pdf/2601.20157",
        "title": "PASS: Ambiguity Guided Subsets for Scalable Classical and Quantum Constrained Clustering",
        "authors": [
            "Pedro Chumpitaz-Flores",
            "My Duong",
            "Ying Mao",
            "Kaixun Hua"
        ],
        "comments": "25 pages, 8 figures, preprint",
        "subjects": "Machine Learning (cs.LG); Emerging Technologies (cs.ET)",
        "abstract": "Pairwise-constrained clustering augments unsupervised partitioning with side information by enforcing must-link (ML) and cannot-link (CL) constraints between specific samples, yielding labelings that respect known affinities and separations. However, ML and CL constraints add an extra layer of complexity to the clustering problem, with current methods struggling in data scalability, especially in niche applications like quantum or quantum-hybrid clustering. We propose PASS, a pairwise-constraints and ambiguity-driven subset selection framework that preserves ML and CL constraints satisfaction while allowing scalable, high-quality clustering solution. PASS collapses ML constraints into pseudo-points and offers two selectors: a constraint-aware margin rule that collects near-boundary points and all detected CL violations, and an information-geometric rule that scores points via a Fisher-Rao distance derived from soft assignment posteriors, then selects the highest-information subset under a simple budget. Across diverse benchmarks, PASS attains competitive SSE at substantially lower cost than exact or penalty-based methods, and remains effective in regimes where prior approaches fail.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20170",
        "abs_url": "https://arxiv.org/abs/2601.20170",
        "pdf_url": "https://arxiv.org/pdf/2601.20170",
        "title": "Local Duality for Sparse Support Vector Machines",
        "authors": [
            "Penghe Zhang",
            "Naihua Xiu",
            "Houduo Qi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Due to the rise of cardinality minimization in optimization, sparse support vector machines (SSVMs) have attracted much attention lately and show certain empirical advantages over convex SVMs. A common way to derive an SSVM is to add a cardinality function such as $\\ell_0$-norm to the dual problem of a convex SVM. However, this process lacks theoretical justification. This paper fills the gap by developing a local duality theory for such an SSVM formulation and exploring its relationship with the hinge-loss SVM (hSVM) and the ramp-loss SVM (rSVM). In particular, we prove that the derived SSVM is exactly the dual problem of the 0/1-loss SVM, and the linear representer theorem holds for their local solutions. The local solution of SSVM also provides guidelines on selecting hyperparameters of hSVM and rSVM. {Under specific conditions, we show that a sequence of global solutions of hSVM converges to a local solution of 0/1-loss SVM. Moreover, a local minimizer of 0/1-loss SVM is a local minimizer of rSVM.} This explains why a local solution induced by SSVM outperforms hSVM and rSVM in the prior empirical study. We further conduct numerical tests on real datasets and demonstrate potential advantages of SSVM by working with locally nice solutions proposed in this paper.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20172",
        "abs_url": "https://arxiv.org/abs/2601.20172",
        "pdf_url": "https://arxiv.org/pdf/2601.20172",
        "title": "Loss Landscape Geometry and the Learning of Symmetries: Or, What Influence Functions Reveal About Robust Generalization",
        "authors": [
            "James Amarel",
            "Robyn Miller",
            "Nicolas Hengartner",
            "Benjamin Migliori",
            "Emily Casleton",
            "Alexei Skurikhin",
            "Earl Lawrence",
            "Gerd J. Kunde"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "We study how neural emulators of partial differential equation solution operators internalize physical symmetries by introducing an influence-based diagnostic that measures the propagation of parameter updates between symmetry-related states, defined as the metric-weighted overlap of loss gradients evaluated along group orbits. This quantity probes the local geometry of the learned loss landscape and goes beyond forward-pass equivariance tests by directly assessing whether learning dynamics couple physically equivalent configurations. Applying our diagnostic to autoregressive fluid flow emulators, we show that orbit-wise gradient coherence provides the mechanism for learning to generalize over symmetry transformations and indicates when training selects a symmetry compatible basin. The result is a novel technique for evaluating if surrogate models have internalized symmetry properties of the known solution operator.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20173",
        "abs_url": "https://arxiv.org/abs/2601.20173",
        "pdf_url": "https://arxiv.org/pdf/2601.20173",
        "title": "MAPLE: Self-supervised Learning-Enhanced Nonlinear Dimensionality Reduction for Visual Analysis",
        "authors": [
            "Zeyang Huang",
            "Takanori Fujiwara",
            "Angelos Chatzimparmpas",
            "Wandrille Duchemin",
            "Andreas Kerren"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Human-Computer Interaction (cs.HC)",
        "abstract": "We present a new nonlinear dimensionality reduction method, MAPLE, that enhances UMAP by improving manifold modeling. MAPLE employs a self-supervised learning approach to more efficiently encode low-dimensional manifold geometry. Central to this approach are maximum manifold capacity representations (MMCRs), which help untangle complex manifolds by compressing variances among locally similar data points while amplifying variance among dissimilar data points. This design is particularly effective for high-dimensional data with substantial intra-cluster variance and curved manifold structures, such as biological or image data. Our qualitative and quantitative evaluations demonstrate that MAPLE can produce clearer visual cluster separations and finer subcluster resolution than UMAP while maintaining comparable computational cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20176",
        "abs_url": "https://arxiv.org/abs/2601.20176",
        "pdf_url": "https://arxiv.org/pdf/2601.20176",
        "title": "Causal-Driven Feature Evaluation for Cross-Domain Image Classification",
        "authors": [
            "Chen Cheng",
            "Ang Li"
        ],
        "comments": "Preprint",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Out-of-distribution (OOD) generalization remains a fundamental challenge in real-world classification, where test distributions often differ substantially from training data. Most existing approaches pursue domain-invariant representations, implicitly assuming that invariance implies reliability. However, features that are invariant across domains are not necessarily causally effective for prediction. In this work, we revisit OOD classification from a causal perspective and propose to evaluate learned representations based on their necessity and sufficiency under distribution shift. We introduce an explicit segment-level framework that directly measures causal effectiveness across domains, providing a more faithful criterion than invariance alone. Experiments on multi-domain benchmarks demonstrate consistent improvements in OOD performance, particularly under challenging domain shifts, highlighting the value of causal evaluation for robust generalization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20180",
        "abs_url": "https://arxiv.org/abs/2601.20180",
        "pdf_url": "https://arxiv.org/pdf/2601.20180",
        "title": "On the Computational Complexity of Performative Prediction",
        "authors": [
            "Ioannis Anagnostides",
            "Rohan Chauhan",
            "Ioannis Panageas",
            "Tuomas Sandholm",
            "Jingming Yan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Performative prediction captures the phenomenon where deploying a predictive model shifts the underlying data distribution. While simple retraining dynamics are known to converge linearly when the performative effects are weak ($\\rho < 1$), the complexity in the regime $\\rho > 1$ was hitherto open. In this paper, we establish a sharp phase transition: computing an $\\epsilon$-performatively stable point is PPAD-complete -- and thus polynomial-time equivalent to Nash equilibria in general-sum games -- even when $\\rho = 1 + O(\\epsilon)$. This intractability persists even in the ostensibly simple setting with a quadratic loss function and linear distribution shifts. One of our key technical contributions is to extend this PPAD-hardness result to general convex domains, which is of broader interest in the complexity of variational inequalities. Finally, we address the special case of strategic classification, showing that computing a strategic local optimum is PLS-hard.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20198",
        "abs_url": "https://arxiv.org/abs/2601.20198",
        "pdf_url": "https://arxiv.org/pdf/2601.20198",
        "title": "DeRaDiff: Denoising Time Realignment of Diffusion Models",
        "authors": [
            "Ratnavibusena Don Shahain Manujith",
            "Yang Zhang",
            "Teoh Tze Tzun",
            "Kenji Kawaguchi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent advances align diffusion models with human preferences to increase aesthetic appeal and mitigate artifacts and biases. Such methods aim to maximize a conditional output distribution aligned with higher rewards whilst not drifting far from a pretrained prior. This is commonly enforced by KL (Kullback Leibler) regularization. As such, a central issue still remains: how does one choose the right regularization strength? Too high of a strength leads to limited alignment and too low of a strength leads to \"reward hacking\". This renders the task of choosing the correct regularization strength highly non-trivial. Existing approaches sweep over this hyperparameter by aligning a pretrained model at multiple regularization strengths and then choose the best strength. Unfortunately, this is prohibitively expensive. We introduce DeRaDiff, a denoising time realignment procedure that, after aligning a pretrained model once, modulates the regularization strength during sampling to emulate models trained at other regularization strengths without any additional training or finetuning. Extending decoding-time realignment from language to diffusion models, DeRaDiff operates over iterative predictions of continuous latents by replacing the reverse step reference distribution by a geometric mixture of an aligned and reference posterior, thus giving rise to a closed form update under common schedulers and a single tunable parameter, lambda, for on the fly control. Our experiments show that across multiple text image alignment and image-quality metrics, our method consistently provides a strong approximation for models aligned entirely from scratch at different regularization strengths. Thus, our method yields an efficient way to search for the optimal strength, eliminating the need for expensive alignment sweeps and thereby substantially reducing computational costs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20203",
        "abs_url": "https://arxiv.org/abs/2601.20203",
        "pdf_url": "https://arxiv.org/pdf/2601.20203",
        "title": "Minimum-Cost Network Flow with Dual Predictions",
        "authors": [
            "Zhiyang Chen",
            "Hailong Yao",
            "Xia Yin"
        ],
        "comments": "accepted by AAAI 2026",
        "subjects": "Machine Learning (cs.LG); Data Structures and Algorithms (cs.DS)",
        "abstract": "Recent work has shown that machine-learned predictions can provably improve the performance of classic algorithms. In this work, we propose the first minimum-cost network flow algorithm augmented with a dual prediction. Our method is based on a classic minimum-cost flow algorithm, namely $\\varepsilon$-relaxation. We provide time complexity bounds in terms of the infinity norm prediction error, which is both consistent and robust. We also prove sample complexity bounds for PAC-learning the prediction. We empirically validate our theoretical results on two applications of minimum-cost flow, i.e., traffic networks and chip escape routing, in which we learn a fixed prediction, and a feature-based neural network model to infer the prediction, respectively. Experimental results illustrate $12.74\\times$ and $1.64\\times$ average speedup on two applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20205",
        "abs_url": "https://arxiv.org/abs/2601.20205",
        "pdf_url": "https://arxiv.org/pdf/2601.20205",
        "title": "Hyperparameter Transfer with Mixture-of-Expert Layers",
        "authors": [
            "Tianze Jiang",
            "Blake Bordelon",
            "Cengiz Pehlevan",
            "Boris Hanin"
        ],
        "comments": "25 Pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Mixture-of-Experts (MoE) layers have emerged as an important tool in scaling up modern neural networks by decoupling total trainable parameters from activated parameters in the forward pass for each token. However, sparse MoEs add complexity to training due to (i) new trainable parameters (router weights) that, like all other parameter groups, require hyperparameter (HP) tuning; (ii) new architecture scale dimensions (number of and size of experts) that must be chosen and potentially taken large. To make HP selection cheap and reliable, we propose a new parameterization for transformer models with MoE layers when scaling model width, depth, number of experts, and expert (hidden) size. Our parameterization is justified by a novel dynamical mean-field theory (DMFT) analysis. When varying different model dimensions trained at a fixed token budget, we find empirically that our parameterization enables reliable HP transfer across models from 51M to over 2B total parameters. We further take HPs identified from sweeping small models on a short token horizon to train larger models on longer horizons and report performant model behaviors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20209",
        "abs_url": "https://arxiv.org/abs/2601.20209",
        "pdf_url": "https://arxiv.org/pdf/2601.20209",
        "title": "Spark: Strategic Policy-Aware Exploration via Dynamic Branching for Long-Horizon Agentic Learning",
        "authors": [
            "Jinyang Wu",
            "Shuo Yang",
            "Changpeng Yang",
            "Yuhao Shen",
            "Shuai Zhang",
            "Zhengqi Wen",
            "Jianhua Tao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Reinforcement learning has empowered large language models to act as intelligent agents, yet training them for long-horizon tasks remains challenging due to the scarcity of high-quality trajectories, especially under limited resources. Existing methods typically scale up rollout sizes and indiscriminately allocate computational resources among intermediate steps. Such attempts inherently waste substantial computation budget on trivial steps while failing to guarantee sample quality. To address this, we propose \\textbf{Spark} (\\textbf{S}trategic \\textbf{P}olicy-\\textbf{A}ware explo\\textbf{R}ation via \\textbf{K}ey-state dynamic branching), a novel framework that selectively branches at critical decision states for resource-efficient exploration. Our key insight is to activate adaptive branching exploration at critical decision points to probe promising trajectories, thereby achieving precise resource allocation that prioritizes sampling quality over blind coverage. This design leverages the agent's intrinsic decision-making signals to reduce dependence on human priors, enabling the agent to autonomously expand exploration and achieve stronger generalization. Experiments across diverse tasks (e.g., embodied planning), demonstrate that \\textsc{Spark} achieves superior success rates with significantly fewer training samples, exhibiting robust generalization even in unseen scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20217",
        "abs_url": "https://arxiv.org/abs/2601.20217",
        "pdf_url": "https://arxiv.org/pdf/2601.20217",
        "title": "An Accounting Identity for Algorithmic Fairness",
        "authors": [
            "Hadi Elzayn",
            "Jacob Goldin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We derive an accounting identity for predictive models that links accuracy with common fairness criteria. The identity shows that for globally calibrated models, the weighted sums of miscalibration within groups and error imbalance across groups is equal to a \"total unfairness budget.\" For binary outcomes, this budget is the model's mean-squared error times the difference in group prevalence across outcome classes. The identity nests standard impossibility results as special cases, while also describing inherent tradeoffs when one or more fairness measures are not perfectly satisfied. The results suggest that accuracy and fairness are best viewed as complements in binary prediction tasks: increasing accuracy necessarily shrinks the total unfairness budget and vice-versa. Experiments on benchmark data confirm the theory and show that many fairness interventions largely substitute between fairness violations, and when they reduce accuracy they tend to expand the total unfairness budget. The results extend naturally to prediction tasks with non-binary outcomes, illustrating how additional outcome information can relax fairness incompatibilities and identifying conditions under which the binary-style impossibility does and does not extend to regression tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20226",
        "abs_url": "https://arxiv.org/abs/2601.20226",
        "pdf_url": "https://arxiv.org/pdf/2601.20226",
        "title": "Parametric and Generative Forecasts of Day-Ahead Market Curves for Storage Optimization",
        "authors": [
            "Julian Gutierrez",
            "Redouane Silvente"
        ],
        "comments": "46 pages, 41 figures",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "We present two machine learning frameworks for forecasting aggregated curves and optimizing storage in the EPEX SPOT day-ahead market. First, a fast parametric model forecasts hourly demand and supply curves in a low-dimensional and grid-robust representation, with minimum and maximum volumes combined with a Chebyshev polynomial for the elastic segment. The model enables daily use with low error and clear interpretability. Second, for a more comprehensive analysis, though less suited to daily operation, we employ generative models that learn the joint distribution of 24-hour order-level submissions given weather and fuel variables. These models generate synthetic daily scenarios of individual buy and sell orders, which, once aggregated, yield hourly supply and demand curves. Based on these forecasts, we optimize a price-making storage strategy, quantify revenue distributions, and highlight the price-compression effect with lower peaks, higher off-peak levels, and diminishing returns as capacity expands.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20231",
        "abs_url": "https://arxiv.org/abs/2601.20231",
        "pdf_url": "https://arxiv.org/pdf/2601.20231",
        "title": "Certificate-Guided Pruning for Stochastic Lipschitz Optimization",
        "authors": [
            "Ibne Farabi Shihab",
            "Sanjeda Akter",
            "Anuj Sharma"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We study black-box optimization of Lipschitz functions under noisy evaluations. Existing adaptive discretization methods implicitly avoid suboptimal regions but do not provide explicit certificates of optimality or measurable progress guarantees. We introduce \\textbf{Certificate-Guided Pruning (CGP)}, which maintains an explicit \\emph{active set} $A_t$ of potentially optimal points via confidence-adjusted Lipschitz envelopes. Any point outside $A_t$ is certifiably suboptimal with high probability, and under a margin condition with near-optimality dimension $\\alpha$, we prove $\\Vol(A_t)$ shrinks at a controlled rate yielding sample complexity $\\tildeO(\\varepsilon^{-(2+\\alpha)})$. We develop three extensions: CGP-Adaptive learns $L$ online with $O(\\log T)$ overhead; CGP-TR scales to $d > 50$ via trust regions with local certificates; and CGP-Hybrid switches to GP refinement when local smoothness is detected. Experiments on 12 benchmarks ($d \\in [2, 100]$) show CGP variants match or exceed strong baselines while providing principled stopping criteria via certificate volume.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20255",
        "abs_url": "https://arxiv.org/abs/2601.20255",
        "pdf_url": "https://arxiv.org/pdf/2601.20255",
        "title": "HE-SNR: Uncovering Latent Logic via Entropy for Guiding Mid-Training on SWE-BENCH",
        "authors": [
            "Yueyang Wang",
            "Jiawei Fu",
            "Baolong Bi",
            "Xili Wang",
            "Xiaoqing Liu"
        ],
        "comments": "21 pages, 15 figures",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL); Software Engineering (cs.SE)",
        "abstract": "SWE-bench has emerged as the premier benchmark for evaluating Large Language Models on complex software engineering tasks. While these capabilities are fundamentally acquired during the mid-training phase and subsequently elicited during Supervised Fine-Tuning (SFT), there remains a critical deficit in metrics capable of guiding mid-training effectively. Standard metrics such as Perplexity (PPL) are compromised by the \"Long-Context Tax\" and exhibit weak correlation with downstream SWE performance. In this paper, we bridge this gap by first introducing a rigorous data filtering strategy. Crucially, we propose the Entropy Compression Hypothesis, redefining intelligence not by scalar Top-1 compression, but by the capacity to structure uncertainty into Entropy-Compressed States of low orders (\"reasonable hesitation\"). Grounded in this fine-grained entropy analysis, we formulate a novel metric, HE-SNR (High-Entropy Signal-to-Noise Ratio). Validated on industrial-scale Mixture-of-Experts (MoE) models across varying context windows (32K/128K), our approach demonstrates superior robustness and predictive power. This work provides both the theoretical foundation and practical tools for optimizing the latent potential of LLMs in complex engineering domains.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20257",
        "abs_url": "https://arxiv.org/abs/2601.20257",
        "pdf_url": "https://arxiv.org/pdf/2601.20257",
        "title": "C2:Cross learning module enhanced decision transformer with Constraint-aware loss for auto-bidding",
        "authors": [
            "Jinren Ding",
            "Xuejian Xu",
            "Shen Jiang",
            "Zhitong Hao",
            "Jinhui Yang",
            "Peng Jiang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Science and Game Theory (cs.GT)",
        "abstract": "Decision Transformer (DT) shows promise for generative auto-bidding by capturing temporal dependencies, but suffers from two critical limitations: insufficient cross-correlation modeling among state, action, and return-to-go (RTG) sequences, and indiscriminate learning of optimal/suboptimal behaviors. To address these, we propose C2, a novel framework enhancing DT with two core innovations: (1) a Cross Learning Block (CLB) via cross-attention to strengthen inter-sequence correlation modeling; (2) a Constraint-aware Loss (CL) incorporating budget and Cost-Per-Acquisition (CPA) constraints for selective learning of optimal trajectories. Extensive offline evaluations on the AuctionNet dataset demonstrate consistent performance gains (up to 3.23\\% over state-of-the-art GAVE) across diverse budget settings; ablation studies verify the complementary synergy of CLB and CL, confirming C2's superiority in auto-bidding. The code for reproducing our results is available at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20280",
        "abs_url": "https://arxiv.org/abs/2601.20280",
        "pdf_url": "https://arxiv.org/pdf/2601.20280",
        "title": "The Forecast After the Forecast: A Post-Processing Shift in Time Series",
        "authors": [
            "Daojun Liang",
            "Qi Li",
            "Yinglong Wang",
            "Jing Chen",
            "Hu Zhang",
            "Xiaoxiao Cui",
            "Qizheng Wang",
            "Shuo Li"
        ],
        "comments": "30 Pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Time series forecasting has long been dominated by advances in model architecture, with recent progress driven by deep learning and hybrid statistical techniques. However, as forecasting models approach diminishing returns in accuracy, a critical yet underexplored opportunity emerges: the strategic use of post-processing. In this paper, we address the last-mile gap in time-series forecasting, which is to improve accuracy and uncertainty without retraining or modifying a deployed backbone. We propose $\\delta$-Adapter, a lightweight, architecture-agnostic way to boost deployed time series forecasters without retraining. $\\delta$-Adapter learns tiny, bounded modules at two interfaces: input nudging (soft edits to covariates) and output residual correction. We provide local descent guarantees, $O(\\delta)$ drift bounds, and compositional stability for combined adapters. Meanwhile, it can act as a feature selector by learning a sparse, horizon-aware mask over inputs to select important features, thereby improving interpretability. In addition, it can also be used as a distribution calibrator to measure uncertainty. Thus, we introduce a Quantile Calibrator and a Conformal Corrector that together deliver calibrated, personalized intervals with finite-sample coverage. Our experiments across diverse backbones and datasets show that $\\delta$-Adapter improves accuracy and calibration with negligible compute and no interface changes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20282",
        "abs_url": "https://arxiv.org/abs/2601.20282",
        "pdf_url": "https://arxiv.org/pdf/2601.20282",
        "title": "Memory Retrieval in Transformers: Insights from The Encoding Specificity Principle",
        "authors": [
            "Viet Hung Dinh",
            "Ming Ding",
            "Youyang Qu",
            "Kanchana Thilakarathna"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "While explainable artificial intelligence (XAI) for large language models (LLMs) remains an evolving field with many unresolved questions, increasing regulatory pressures have spurred interest in its role in ensuring transparency, accountability, and privacy-preserving machine unlearning. Despite recent advances in XAI have provided some insights, the specific role of attention layers in transformer based LLMs remains underexplored. This study investigates the memory mechanisms instantiated by attention layers, drawing on prior research in psychology and computational psycholinguistics that links Transformer attention to cue based retrieval in human memory. In this view, queries encode the retrieval context, keys index candidate memory traces, attention weights quantify cue trace similarity, and values carry the encoded content, jointly enabling the construction of a context representation that precedes and facilitates memory retrieval. Guided by the Encoding Specificity Principle, we hypothesize that the cues used in the initial stage of retrieval are instantiated as keywords. We provide converging evidence for this keywords-as-cues hypothesis. In addition, we isolate neurons within attention layers whose activations selectively encode and facilitate the retrieval of context-defining keywords. Consequently, these keywords can be extracted from identified neurons and further contribute to downstream applications such as unlearning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20291",
        "abs_url": "https://arxiv.org/abs/2601.20291",
        "pdf_url": "https://arxiv.org/pdf/2601.20291",
        "title": "A Learning-based Framework for Spatial Impulse Response Compensation in 3D Photoacoustic Computed Tomography",
        "authors": [
            "Kaiyi Yang",
            "Seonyeong Park",
            "Gangwon Jeong",
            "Hsuan-Kai Huang",
            "Alexander A. Oraevsky",
            "Umberto Villa",
            "Mark A. Anastasio"
        ],
        "comments": "Submitted to IEEE TMI",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP); Medical Physics (physics.med-ph)",
        "abstract": "Photoacoustic computed tomography (PACT) is a promising imaging modality that combines the advantages of optical contrast with ultrasound detection. Utilizing ultrasound transducers with larger surface areas can improve detection sensitivity. However, when computationally efficient analytic reconstruction methods that neglect the spatial impulse responses (SIRs) of the transducer are employed, the spatial resolution of the reconstructed images will be compromised. Although optimization-based reconstruction methods can explicitly account for SIR effects, their computational cost is generally high, particularly in three-dimensional (3D) applications. To address the need for accurate but rapid 3D PACT image reconstruction, this study presents a framework for establishing a learned SIR compensation method that operates in the data domain. The learned compensation method maps SIR-corrupted PACT measurement data to compensated data that would have been recorded by idealized point-like transducers. Subsequently, the compensated data can be used with a computationally efficient reconstruction method that neglects SIR effects. Two variants of the learned compensation model are investigated that employ a U-Net model and a specifically designed, physics-inspired model, referred to as Deconv-Net. A fast and analytical training data generation procedure is also a component of the presented framework. The framework is rigorously validated in virtual imaging studies, demonstrating resolution improvement and robustness to noise variations, object complexity, and sound speed heterogeneity. When applied to in-vivo breast imaging data, the learned compensation models revealed fine structures that had been obscured by SIR-induced artifacts. To our knowledge, this is the first demonstration of learned SIR compensation in 3D PACT imaging.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20299",
        "abs_url": "https://arxiv.org/abs/2601.20299",
        "pdf_url": "https://arxiv.org/pdf/2601.20299",
        "title": "Truthfulness Despite Weak Supervision: Evaluating and Training LLMs Using Peer Prediction",
        "authors": [
            "Tianyi Alex Qiu",
            "Micah Carroll",
            "Cameron Allen"
        ],
        "comments": "ICLR 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Computer Science and Game Theory (cs.GT)",
        "abstract": "The evaluation and post-training of large language models (LLMs) rely on supervision, but strong supervision for difficult tasks is often unavailable, especially when evaluating frontier models. In such cases, models are demonstrated to exploit evaluations built on such imperfect supervision, leading to deceptive results. However, underutilized in LLM research, a wealth of mechanism design research focuses on game-theoretic incentive compatibility, i.e., eliciting honest and informative answers with weak supervision. Drawing from this literature, we introduce the peer prediction method for model evaluation and post-training. It rewards honest and informative answers over deceptive and uninformative ones, using a metric based on mutual predictability and without requiring ground truth labels. We demonstrate the method's effectiveness and resistance to deception, with both theoretical guarantees and empirical validation on models with up to 405B parameters. We show that training an 8B model with peer prediction-based reward recovers most of the drop in truthfulness due to prior malicious finetuning, even when the reward is produced by a 0.135B language model with no finetuning. On the evaluation front, in contrast to LLM-as-a-Judge which requires strong and trusted judges, we discover an inverse scaling property in peer prediction, where, surprisingly, resistance to deception is strengthened as the capability gap between the experts and participants widens, enabling reliable evaluation of strong models with weak supervision. In particular, LLM-as-a-Judge become worse than random guess when facing deceptive models 5-20x the judge's size, while peer prediction thrives when such gaps are large, including in cases with over 100x size difference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20307",
        "abs_url": "https://arxiv.org/abs/2601.20307",
        "pdf_url": "https://arxiv.org/pdf/2601.20307",
        "title": "Delayed Feedback Modeling for Post-Click Gross Merchandise Volume Prediction: Benchmark, Insights and Approaches",
        "authors": [
            "Xinyu Li",
            "Sishuo Chen",
            "Guipeng Xv",
            "Li Zhang",
            "Mingxuan Luo",
            "Zhangming Chan",
            "Xiang-Rong Sheng",
            "Han Zhu",
            "Jian Xu",
            "Chen Lin"
        ],
        "comments": "This paper has been accepted by the ACM Web Conference (WWW) 2026. This is the camera-ready version. Please refer to the published version for citation once available",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The prediction objectives of online advertisement ranking models are evolving from probabilistic metrics like conversion rate (CVR) to numerical business metrics like post-click gross merchandise volume (GMV). Unlike the well-studied delayed feedback problem in CVR prediction, delayed feedback modeling for GMV prediction remains unexplored and poses greater challenges, as GMV is a continuous target, and a single click can lead to multiple purchases that cumulatively form the label. To bridge the research gap, we establish TRACE, a GMV prediction benchmark containing complete transaction sequences rising from each user click, which supports delayed feedback modeling in an online streaming manner. Our analysis and exploratory experiments on TRACE reveal two key insights: (1) the rapid evolution of the GMV label distribution necessitates modeling delayed feedback under online streaming training; (2) the label distribution of repurchase samples substantially differs from that of single-purchase samples, highlighting the need for separate modeling. Motivated by these findings, we propose RepurchasE-Aware Dual-branch prEdictoR (READER), a novel GMV modeling paradigm that selectively activates expert parameters according to repurchase predictions produced by a router. Moreover, READER dynamically calibrates the regression target to mitigate under-estimation caused by incomplete labels. Experimental results show that READER yields superior performance on TRACE over baselines, achieving a 2.19% improvement in terms of accuracy. We believe that our study will open up a new avenue for studying online delayed feedback modeling for GMV prediction, and our TRACE benchmark with the gathered insights will facilitate future research and application in this promising direction. Our code and dataset are available at this https URL .",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20332",
        "abs_url": "https://arxiv.org/abs/2601.20332",
        "pdf_url": "https://arxiv.org/pdf/2601.20332",
        "title": "Window-Diffusion: Accelerating Diffusion Language Model Inference with Windowed Token Pruning and Caching",
        "authors": [
            "Fengrui Zuo",
            "Zhiwei Ke",
            "Yiming Liu",
            "Wenqi Lou",
            "Chao Wang",
            "Xvehai Zhou"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Diffusion language models (DLMs) generate text through iterative denoising, but inference requires full-sequence attention at every iteration, resulting in substantial redundant computation on masked tokens. Block-wise diffusion can reduce this cost, yet it typically relies on retraining and constrained update orders, limiting its direct applicability to pretrained DLMs. Our token-level analysis reveals pronounced structural locality in DLM inference. Decoding is driven by a small set of prefix-localized active tokens; the influence of distant undecoded context diminishes rapidly, and decoded tokens exhibit stage-wise temporal stability, enabling reuse of intermediate representations except for a brief post-decode transient. Motivated by these observations, we propose \\textbf{\\placeholder}\\footnote{The source code is available at this https URL.}, a window-based token pruning and caching method for inference. We maintain a local computation window that slides rightward as denoising progresses, and partition undecoded tokens into: (i) \\textit{active tokens} that are computed online, (ii) \\textit{buffer tokens} whose KV states are cached and periodically refreshed, and (iii) \\textit{far-field tokens} that are pruned outside the window. Computation is restricted to active and buffer tokens within the window, while far-field tokens are omitted at each stage. Experiments on LLaDA and Dream show that, under matched compute budgets, our method achieves up to $99\\times$ inference speedup while largely preserving generation performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20357",
        "abs_url": "https://arxiv.org/abs/2601.20357",
        "pdf_url": "https://arxiv.org/pdf/2601.20357",
        "title": "TABED: Test-Time Adaptive Ensemble Drafting for Robust Speculative Decoding in LVLMs",
        "authors": [
            "Minjae Lee",
            "Wonjun Kang",
            "Byeongkeun Ahn",
            "Christian Classen",
            "Kevin Galim",
            "Seunghyuk Oh",
            "Minghao Yan",
            "Hyung Il Koo",
            "Kangwook Lee"
        ],
        "comments": "Accepted to Findings of EACL 2026",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Speculative decoding (SD) has proven effective for accelerating LLM inference by quickly generating draft tokens and verifying them in parallel. However, SD remains largely unexplored for Large Vision-Language Models (LVLMs), which extend LLMs to process both image and text prompts. To address this gap, we benchmark existing inference methods with small draft models on 11 datasets across diverse input scenarios and observe scenario-specific performance fluctuations. Motivated by these findings, we propose Test-time Adaptive Batched Ensemble Drafting (TABED), which dynamically ensembles multiple drafts obtained via batch inference by leveraging deviations from past ground truths available in the SD setting. The dynamic ensemble method achieves an average robust walltime speedup of 1.74x over autoregressive decoding and a 5% improvement over single drafting methods, while remaining training-free and keeping ensembling costs negligible through parameter sharing. With its plug-and-play compatibility, we further enhance TABED by integrating advanced verification and alternative drafting methods. Code and custom-trained models are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20361",
        "abs_url": "https://arxiv.org/abs/2601.20361",
        "pdf_url": "https://arxiv.org/pdf/2601.20361",
        "title": "TINNs: Time-Induced Neural Networks for Solving Time-Dependent PDEs",
        "authors": [
            "Chen-Yang Dai",
            "Che-Chia Chang",
            "Te-Sheng Lin",
            "Ming-Chih Lai",
            "Chieh-Hsin Lai"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "Physics-informed neural networks (PINNs) solve time-dependent partial differential equations (PDEs) by learning a mesh-free, differentiable solution that can be evaluated anywhere in space and time. However, standard space--time PINNs take time as an input but reuse a single network with shared weights across all times, forcing the same features to represent markedly different dynamics. This coupling degrades accuracy and can destabilize training when enforcing PDE, boundary, and initial constraints jointly. We propose Time-Induced Neural Networks (TINNs), a novel architecture that parameterizes the network weights as a learned function of time, allowing the effective spatial representation to evolve over time while maintaining shared structure. The resulting formulation naturally yields a nonlinear least-squares problem, which we optimize efficiently using a Levenberg--Marquardt method. Experiments on various time-dependent PDEs show up to $4\\times$ improved accuracy and $10\\times$ faster convergence compared to PINNs and strong baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20367",
        "abs_url": "https://arxiv.org/abs/2601.20367",
        "pdf_url": "https://arxiv.org/pdf/2601.20367",
        "title": "Unsupervised Anomaly Detection in Multi-Agent Trajectory Prediction via Transformer-Based Models",
        "authors": [
            "Qing Lyu",
            "Zhe Fu",
            "Alexandre Bayen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Identifying safety-critical scenarios is essential for autonomous driving, but the rarity of such events makes supervised labeling impractical. Traditional rule-based metrics like Time-to-Collision are too simplistic to capture complex interaction risks, and existing methods lack a systematic way to verify whether statistical anomalies truly reflect physical danger. To address this gap, we propose an unsupervised anomaly detection framework based on a multi-agent Transformer that models normal driving and measures deviations through prediction residuals. A dual evaluation scheme has been proposed to assess both detection stability and physical alignment: Stability is measured using standard ranking metrics in which Kendall Rank Correlation Coefficient captures rank agreement and Jaccard index captures the consistency of the top-K selected items; Physical alignment is assessed through correlations with established Surrogate Safety Measures (SSM). Experiments on the NGSIM dataset demonstrate our framework's effectiveness: We show that the maximum residual aggregator achieves the highest physical alignment while maintaining stability. Furthermore, our framework identifies 388 unique anomalies missed by Time-to-Collision and statistical baselines, capturing subtle multi-agent risks like reactive braking under lateral drift. The detected anomalies are further clustered into four interpretable risk types, offering actionable insights for simulation and testing.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20397",
        "abs_url": "https://arxiv.org/abs/2601.20397",
        "pdf_url": "https://arxiv.org/pdf/2601.20397",
        "title": "FedRD: Reducing Divergences for Generalized Federated Learning via Heterogeneity-aware Parameter Guidance",
        "authors": [
            "Kaile Wang",
            "Jiannong Cao",
            "Yu Yang",
            "Xiaoyin Li",
            "Mingjin Zhang"
        ],
        "comments": "Accepted by ICASSP 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Heterogeneous federated learning (HFL) aims to ensure effective and privacy-preserving collaboration among different entities. As newly joined clients require significant adjustments and additional training to align with the existing system, the problem of generalizing federated learning models to unseen clients under heterogeneous data has become progressively crucial. Consequently, we highlight two unsolved challenging issues in federated domain generalization: Optimization Divergence and Performance Divergence. To tackle the above challenges, we propose FedRD, a novel heterogeneity-aware federated learning algorithm that collaboratively utilizes parameter-guided global generalization aggregation and local debiased classification to reduce divergences, aiming to obtain an optimal global model for participating and unseen clients. Extensive experiments on public multi-domain datasets demonstrate that our approach exhibits a substantial performance advantage over competing baselines in addressing this specific problem.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20401",
        "abs_url": "https://arxiv.org/abs/2601.20401",
        "pdf_url": "https://arxiv.org/pdf/2601.20401",
        "title": "ScatterFusion: A Hierarchical Scattering Transform Framework for Enhanced Time Series Forecasting",
        "authors": [
            "Wei Li"
        ],
        "comments": "Accepted by ICASSP 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series forecasting presents significant challenges due to the complex temporal dependencies at multiple time scales. This paper introduces ScatterFusion, a novel framework that synergistically integrates scattering transforms with hierarchical attention mechanisms for robust time series forecasting. Our approach comprises four key components: (1) a Hierarchical Scattering Transform Module (HSTM) that extracts multi-scale invariant features capturing both local and global patterns; (2) a Scale-Adaptive Feature Enhancement (SAFE) module that dynamically adjusts feature importance across different scales; (3) a Multi-Resolution Temporal Attention (MRTA) mechanism that learns dependencies at varying time horizons; and (4) a Trend-Seasonal-Residual (TSR) decomposition-guided structure-aware loss function. Extensive experiments on seven benchmark datasets demonstrate that ScatterFusion outperforms other common methods, achieving significant reductions in error metrics across various prediction horizons.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20409",
        "abs_url": "https://arxiv.org/abs/2601.20409",
        "pdf_url": "https://arxiv.org/pdf/2601.20409",
        "title": "AWGformer: Adaptive Wavelet-Guided Transformer for Multi-Resolution Time Series Forecasting",
        "authors": [
            "Wei Li"
        ],
        "comments": "Accepted by ICASSP 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series forecasting requires capturing patterns across multiple temporal scales while maintaining computational efficiency. This paper introduces AWGformer, a novel architecture that integrates adaptive wavelet decomposition with cross-scale attention mechanisms for enhanced multi-variate time series prediction. Our approach comprises: (1) an Adaptive Wavelet Decomposition Module (AWDM) that dynamically selects optimal wavelet bases and decomposition levels based on signal characteristics; (2) a Cross-Scale Feature Fusion (CSFF) mechanism that captures interactions between different frequency bands through learnable coupling matrices; (3) a Frequency-Aware Multi-Head Attention (FAMA) module that weights attention heads according to their frequency selectivity; (4) a Hierarchical Prediction Network (HPN) that generates forecasts at multiple resolutions before reconstruction. Extensive experiments on benchmark datasets demonstrate that AWGformer achieves significant average improvements over state-of-the-art methods, with particular effectiveness on multi-scale and non-stationary time series. Theoretical analysis provides convergence guarantees and establishes the connection between our wavelet-guided attention and classical signal processing principles.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20420",
        "abs_url": "https://arxiv.org/abs/2601.20420",
        "pdf_url": "https://arxiv.org/pdf/2601.20420",
        "title": "Concept Component Analysis: A Principled Approach for Concept Extraction in LLMs",
        "authors": [
            "Yuhang Liu",
            "Erdun Gao",
            "Dong Gong",
            "Anton van den Hengel",
            "Javen Qinfeng Shi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Developing human understandable interpretation of large language models (LLMs) becomes increasingly critical for their deployment in essential domains. Mechanistic interpretability seeks to mitigate the issues through extracts human-interpretable process and concepts from LLMs' activations. Sparse autoencoders (SAEs) have emerged as a popular approach for extracting interpretable and monosemantic concepts by decomposing the LLM internal representations into a dictionary. Despite their empirical progress, SAEs suffer from a fundamental theoretical ambiguity: the well-defined correspondence between LLM representations and human-interpretable concepts remains unclear. This lack of theoretical grounding gives rise to several methodological challenges, including difficulties in principled method design and evaluation criteria. In this work, we show that, under mild assumptions, LLM representations can be approximated as a {linear mixture} of the log-posteriors over concepts given the input context, through the lens of a latent variable model where concepts are treated as latent variables. This motivates a principled framework for concept extraction, namely Concept Component Analysis (ConCA), which aims to recover the log-posterior of each concept from LLM representations through a {unsupervised} linear unmixing process. We explore a specific variant, termed sparse ConCA, which leverages a sparsity prior to address the inherent ill-posedness of the unmixing problem. We implement 12 sparse ConCA variants and demonstrate their ability to extract meaningful concepts across multiple LLMs, offering theory-backed advantages over SAEs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20428",
        "abs_url": "https://arxiv.org/abs/2601.20428",
        "pdf_url": "https://arxiv.org/pdf/2601.20428",
        "title": "Nonlinear Dimensionality Reduction with Diffusion Maps in Practice",
        "authors": [
            "Sönke Beier",
            "Paula Pirker-Díaz",
            "Friedrich Pagenkopf",
            "Karoline Wiesner"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "Diffusion Map is a spectral dimensionality reduction technique which is able to uncover nonlinear submanifolds in high-dimensional data. And, it is increasingly applied across a wide range of scientific disciplines, such as biology, engineering, and social sciences. But data preprocessing, parameter settings and component selection have a significant influence on the resulting manifold, something which has not been comprehensively discussed in the literature so far. We provide a practice oriented review of the Diffusion Map technique, illustrate pitfalls and showcase a recently introduced technique for identifying the most relevant components. Our results show that the first components are not necessarily the most relevant ones.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20448",
        "abs_url": "https://arxiv.org/abs/2601.20448",
        "pdf_url": "https://arxiv.org/pdf/2601.20448",
        "title": "TimeCatcher: A Variational Framework for Volatility-Aware Forecasting of Non-Stationary Time Series",
        "authors": [
            "Zhiyu Chen",
            "Minhao Liu",
            "Yanru Zhang"
        ],
        "comments": "Under review. 13 pages, 8 figures. This paper proposes a variational framework with adaptive volatility enhancement for non-stationary time series forecasting",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent lightweight MLP-based models have achieved strong performance in time series forecasting by capturing stable trends and seasonal patterns. However, their effectiveness hinges on an implicit assumption of local stationarity assumption, making them prone to errors in long-term forecasting of highly non-stationary series, especially when abrupt fluctuations occur, a common challenge in domains like web traffic monitoring. To overcome this limitation, we propose TimeCatcher, a novel Volatility-Aware Variational Forecasting framework. TimeCatcher extends linear architectures with a variational encoder to capture latent dynamic patterns hidden in historical data and a volatility-aware enhancement mechanism to detect and amplify significant local variations. Experiments on nine real-world datasets from traffic, financial, energy, and weather domains show that TimeCatcher consistently outperforms state-of-the-art baselines, with particularly large improvements in long-term forecasting scenarios characterized by high volatility and sudden fluctuations. Our code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20477",
        "abs_url": "https://arxiv.org/abs/2601.20477",
        "pdf_url": "https://arxiv.org/pdf/2601.20477",
        "title": "Implicit Hypothesis Testing and Divergence Preservation in Neural Network Representations",
        "authors": [
            "Kadircan Aksoy",
            "Peter Jung",
            "Protim Bhattacharjee"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Information Theory (cs.IT)",
        "abstract": "We study the supervised training dynamics of neural classifiers through the lens of binary hypothesis testing. We model classification as a set of binary tests between class-conditional distributions of representations and empirically show that, along training trajectories, well-generalizing networks increasingly align with Neyman-Pearson optimal decision rules via monotonic improvements in KL divergence that relate to error rate exponents. We finally discuss how this yields an explanation and possible training or regularization strategies for different classes of neural networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20480",
        "abs_url": "https://arxiv.org/abs/2601.20480",
        "pdf_url": "https://arxiv.org/pdf/2601.20480",
        "title": "An explainable framework for the relationship between dementia and glucose metabolism patterns",
        "authors": [
            "C. Vázquez-García",
            "F. J. Martínez-Murcia",
            "F. Segovia Román",
            "A. Forte",
            "J. Ramírez",
            "I. Illán",
            "A. Hernández-Segura",
            "C. Jiménez-Mesa",
            "Juan M. Górriz"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Neurons and Cognition (q-bio.NC)",
        "abstract": "High-dimensional neuroimaging data presents challenges for assessing neurodegenerative diseases due to complex non-linear relationships. Variational Autoencoders (VAEs) can encode scans into lower-dimensional latent spaces capturing disease-relevant features. We propose a semi-supervised VAE framework with a flexible similarity regularization term that aligns selected latent variables with clinical or biomarker measures of dementia progression. This allows adapting the similarity metric and supervised variables to specific goals or available data. We demonstrate the approach using PET scans from the Alzheimer's Disease Neuroimaging Initiative (ADNI), guiding the first latent dimension to align with a cognitive score. Using this supervised latent variable, we generate average reconstructions across levels of cognitive impairment. Voxel-wise GLM analysis reveals reduced metabolism in key regions, mainly the hippocampus, and within major Resting State Networks, particularly the Default Mode and Central Executive Networks. The remaining latent variables encode affine transformations and intensity variations, capturing confounds such as inter-subject variability and site effects. Our framework effectively extracts disease-related patterns aligned with established Alzheimer's biomarkers, offering an interpretable and adaptable tool for studying neurodegenerative progression.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20556",
        "abs_url": "https://arxiv.org/abs/2601.20556",
        "pdf_url": "https://arxiv.org/pdf/2601.20556",
        "title": "Unsupervised Ensemble Learning Through Deep Energy-based Models",
        "authors": [
            "Ariel Maymon",
            "Yanir Buznah",
            "Uri Shaham"
        ],
        "comments": "Accepted to AISTATS 2026. 29 pages, 13 figures. Code available at: this https URL",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Unsupervised ensemble learning emerged to address the challenge of combining multiple learners' predictions without access to ground truth labels or additional data. This paradigm is crucial in scenarios where evaluating individual classifier performance or understanding their strengths is challenging due to limited information. We propose a novel deep energy-based method for constructing an accurate meta-learner using only the predictions of individual learners, potentially capable of capturing complex dependence structures between them. Our approach requires no labeled data, learner features, or problem-specific information, and has theoretical guarantees for when learners are conditionally independent. We demonstrate superior performance across diverse ensemble scenarios, including challenging mixture of experts settings. Our experiments span standard ensemble datasets and curated datasets designed to test how the model fuses expertise from multiple sources. These results highlight the potential of unsupervised ensemble learning to harness collective intelligence, especially in data-scarce or privacy-sensitive environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20568",
        "abs_url": "https://arxiv.org/abs/2601.20568",
        "pdf_url": "https://arxiv.org/pdf/2601.20568",
        "title": "Reinforcement Unlearning via Group Relative Policy Optimization",
        "authors": [
            "Efstratios Zaradoukas",
            "Bardh Prenkaj",
            "Gjergji Kasneci"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "During pretraining, LLMs inadvertently memorize sensitive or copyrighted data, posing significant compliance challenges under legal frameworks like the GDPR and the EU AI Act. Fulfilling these mandates demands techniques that can remove information from a deployed model without retraining from scratch. Existing unlearning approaches attempt to address this need, but often leak the very data they aim to erase, sacrifice fluency and robustness, or depend on costly external reward models. We introduce PURGE (Policy Unlearning through Relative Group Erasure), a novel method grounded in the Group Relative Policy Optimization framework that formulates unlearning as a verifiable problem. PURGE uses an intrinsic reward signal that penalizes any mention of forbidden concepts, allowing safe and consistent unlearning. Our approach reduces token usage per target by up to a factor of 46 compared with SotA methods, while improving fluency by 5.48 percent and adversarial robustness by 12.02 percent over the base model. On the Real World Knowledge Unlearning (RWKU) benchmark, PURGE achieves 11 percent unlearning effectiveness while preserving 98 percent of original utility. PURGE shows that framing LLM unlearning as a verifiable task, enables more reliable, efficient, and scalable forgetting, suggesting a promising new direction for unlearning research that combines theoretical guarantees, improved safety, and practical deployment efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20585",
        "abs_url": "https://arxiv.org/abs/2601.20585",
        "pdf_url": "https://arxiv.org/pdf/2601.20585",
        "title": "Ranking-aware Reinforcement Learning for Ordinal Ranking",
        "authors": [
            "Aiming Hao",
            "Chen Zhu",
            "Jiashu Zhu",
            "Jiahong Wu",
            "Xiangxiang Chu"
        ],
        "comments": "Accepted to ICASSP2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Ordinal regression and ranking are challenging due to inherent ordinal dependencies that conventional methods struggle to model. We propose Ranking-Aware Reinforcement Learning (RARL), a novel RL framework that explicitly learns these relationships. At its core, RARL features a unified objective that synergistically integrates regression and Learning-to-Rank (L2R), enabling mutual improvement between the two tasks. This is driven by a ranking-aware verifiable reward that jointly assesses regression precision and ranking accuracy, facilitating direct model updates via policy optimization. To further enhance training, we introduce Response Mutation Operations (RMO), which inject controlled noise to improve exploration and prevent stagnation at saddle points. The effectiveness of RARL is validated through extensive experiments on three distinct benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20599",
        "abs_url": "https://arxiv.org/abs/2601.20599",
        "pdf_url": "https://arxiv.org/pdf/2601.20599",
        "title": "Regularized Gradient Temporal-Difference Learning",
        "authors": [
            "Hyunjun Na",
            "Donghwan Lee"
        ],
        "comments": "27 pages, 8 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Gradient temporal-difference (GTD) learning algorithms are widely used for off-policy policy evaluation with function approximation. However, existing convergence analyses rely on the restrictive assumption that the so-called feature interaction matrix (FIM) is nonsingular. In practice, the FIM can become singular and leads to instability or degraded performance. In this paper, we propose a regularized optimization objective by reformulating the mean-square projected Bellman error (MSPBE) minimization. This formulation naturally yields a regularized GTD algorithms, referred to as R-GTD, which guarantees convergence to a unique solution even when the FIM is singular. We establish theoretical convergence guarantees and explicit error bounds for the proposed method, and validate its effectiveness through empirical experiments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20605",
        "abs_url": "https://arxiv.org/abs/2601.20605",
        "pdf_url": "https://arxiv.org/pdf/2601.20605",
        "title": "CoBA: Integrated Deep Learning Model for Reliable Low-Altitude UAV Classification in mmWave Radio Networks",
        "authors": [
            "Junaid Sajid",
            "Ivo Müürsepp",
            "Luca Reggiani",
            "Davide Scazzoli",
            "Federico Francesco Luigi Mariani",
            "Maurizio Magarini",
            "Rizwan Ahmad",
            "Muhammad Mahtab Alam"
        ],
        "comments": "6 Pages, This paper has been accepted for publication at the IEEE International Conference on Communications (ICC) 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Uncrewed Aerial Vehicles (UAVs) are increasingly used in civilian and industrial applications, making secure low-altitude operations crucial. In dense mmWave environments, accurately classifying low-altitude UAVs as either inside authorized or restricted airspaces remains challenging, requiring models that handle complex propagation and signal variability. This paper proposes a deep learning model, referred to as CoBA, which stands for integrated Convolutional Neural Network (CNN), Bidirectional Long Short-Term Memory (BiLSTM), and Attention which leverages Fifth Generation (5G) millimeter-wave (mmWave) radio measurements to classify UAV operations in authorized and restricted airspaces at low altitude. The proposed CoBA model integrates convolutional, bidirectional recurrent, and attention layers to capture both spatial and temporal patterns in UAV radio measurements. To validate the model, a dedicated dataset is collected using the 5G mmWave network at TalTech, with controlled low altitude UAV flights in authorized and restricted scenarios. The model is evaluated against conventional ML models and a fingerprinting-based benchmark. Experimental results show that CoBA achieves superior accuracy, significantly outperforming all baseline models and demonstrating its potential for reliable and regulated UAV airspace monitoring.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20606",
        "abs_url": "https://arxiv.org/abs/2601.20606",
        "pdf_url": "https://arxiv.org/pdf/2601.20606",
        "title": "WFR-MFM: One-Step Inference for Dynamic Unbalanced Optimal Transport",
        "authors": [
            "Xinyu Wang",
            "Ruoyu Wang",
            "Qiangwei Peng",
            "Peijie Zhou",
            "Tiejun Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Genomics (q-bio.GN)",
        "abstract": "Reconstructing dynamical evolution from limited observations is a fundamental challenge in single-cell biology, where dynamic unbalanced optimal transport provides a principled framework for modeling coupled transport and mass variation. However, existing approaches rely on trajectory simulation at inference time, making inference a key bottleneck for scalable applications. In this work, we propose a mean-flow framework for unbalanced flow matching that summarizes both transport and mass-growth dynamics over arbitrary time intervals using mean velocity and mass-growth fields, enabling fast one-step generation without trajectory simulation. To solve dynamic unbalanced optimal transport under the Wasserstein-Fisher-Rao geometry, we further build on this framework to develop Wasserstein-Fisher-Rao Mean Flow Matching (WFR-MFM). Across synthetic and real single-cell RNA sequencing datasets, WFR-MFM achieves orders-of-magnitude faster inference than a range of existing baselines while maintaining high predictive accuracy, and enables efficient perturbation response prediction on large synthetic datasets with thousands of conditions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20611",
        "abs_url": "https://arxiv.org/abs/2601.20611",
        "pdf_url": "https://arxiv.org/pdf/2601.20611",
        "title": "ACFormer: Mitigating Non-linearity with Auto Convolutional Encoder for Time Series Forecasting",
        "authors": [
            "Gawon Lee",
            "Hanbyeol Park",
            "Minseop Kim",
            "Dohee Kim",
            "Hyerim Bae"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series forecasting (TSF) faces challenges in modeling complex intra-channel temporal dependencies and inter-channel correlations. Although recent research has highlighted the efficiency of linear architectures in capturing global trends, these models often struggle with non-linear signals. To address this gap, we conducted a systematic receptive field analysis of convolutional neural network (CNN) TSF models. We introduce the \"individual receptive field\" to uncover granular structural dependencies, revealing that convolutional layers act as feature extractors that mirror channel-wise attention while exhibiting superior robustness to non-linear fluctuations. Based on these insights, we propose ACFormer, an architecture designed to reconcile the efficiency of linear projections with the non-linear feature-extraction power of convolutions. ACFormer captures fine-grained information through a shared compression module, preserves temporal locality via gated attention, and reconstructs variable-specific temporal patterns using an independent patch expansion layer. Extensive experiments on multiple benchmark datasets demonstrate that ACFormer consistently achieves state-of-the-art performance, effectively mitigating the inherent drawbacks of linear models in capturing high-frequency components.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20627",
        "abs_url": "https://arxiv.org/abs/2601.20627",
        "pdf_url": "https://arxiv.org/pdf/2601.20627",
        "title": "DIVERSE: Disagreement-Inducing Vector Evolution for Rashomon Set Exploration",
        "authors": [
            "Gilles Eerlings",
            "Brent Zoomers",
            "Jori Liesenborgs",
            "Gustavo Rovelo Ruiz",
            "Kris Luyten"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We propose DIVERSE, a framework for systematically exploring the Rashomon set of deep neural networks, the collection of models that match a reference model's accuracy while differing in their predictive behavior. DIVERSE augments a pretrained model with Feature-wise Linear Modulation (FiLM) layers and uses Covariance Matrix Adaptation Evolution Strategy (CMA-ES) to search a latent modulation space, generating diverse model variants without retraining or gradient access. Across MNIST, PneumoniaMNIST, and CIFAR-10, DIVERSE uncovers multiple high-performing yet functionally distinct models. Our experiments show that DIVERSE offers a competitive and efficient exploration of the Rashomon set, making it feasible to construct diverse sets that maintain robustness and performance while supporting well-balanced model multiplicity. While retraining remains the baseline to generate Rashomon sets, DIVERSE achieves comparable diversity at reduced computational cost.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20634",
        "abs_url": "https://arxiv.org/abs/2601.20634",
        "pdf_url": "https://arxiv.org/pdf/2601.20634",
        "title": "A Foundation Model for Virtual Sensors",
        "authors": [
            "Leon Götz",
            "Lars Frederik Peiss",
            "Erik Sauer",
            "Andreas Udo Sass",
            "Thorsten Bagdonat",
            "Stephan Günnemann",
            "Leo Schwinn"
        ],
        "comments": "18 pages in total, 15 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Virtual sensors use machine learning to predict target signals from available measurements, replacing expensive physical sensors in critical applications. Existing virtual sensor approaches require application-specific models with hand-selected inputs for each sensor, cannot leverage task synergies, and lack consistent benchmarks. At the same time, emerging time series foundation models are computationally expensive and limited to predicting their input signals, making them incompatible with virtual sensors. We introduce the first foundation model for virtual sensors addressing both limitations. Our unified model can simultaneously predict diverse virtual sensors exploiting synergies while maintaining computational efficiency. It learns relevant input signals for each virtual sensor, eliminating expert knowledge requirements while adding explainability. In our large-scale evaluation on a standard benchmark and an application-specific dataset with over 18 billion samples, our architecture achieves 415x reduction in computation time and 951x reduction in memory requirements, while maintaining or even improving predictive quality compared to baselines. Our model scales gracefully to hundreds of virtual sensors with nearly constant parameter count, enabling practical deployment in large-scale sensor networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20637",
        "abs_url": "https://arxiv.org/abs/2601.20637",
        "pdf_url": "https://arxiv.org/pdf/2601.20637",
        "title": "An Empirical Investigation of Neural ODEs and Symbolic Regression for Dynamical Systems",
        "authors": [
            "Panayiotis Ioannou",
            "Pietro Liò",
            "Pietro Cicuta"
        ],
        "comments": "Accepted at the Machine Learning and the Physical Sciences Workshop, NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "Accurately modelling the dynamics of complex systems and discovering their governing differential equations are critical tasks for accelerating scientific discovery. Using noisy, synthetic data from two damped oscillatory systems, we explore the extrapolation capabilities of Neural Ordinary Differential Equations (NODEs) and the ability of Symbolic Regression (SR) to recover the underlying equations. Our study yields three key insights. First, we demonstrate that NODEs can extrapolate effectively to new boundary conditions, provided the resulting trajectories share dynamic similarity with the training data. Second, SR successfully recovers the equations from noisy ground-truth data, though its performance is contingent on the correct selection of input variables. Finally, we find that SR recovers two out of the three governing equations, along with a good approximation for the third, when using data generated by a NODE trained on just 10% of the full simulation. While this last finding highlights an area for future work, our results suggest that using NODEs to enrich limited data and enable symbolic regression to infer physical laws represents a promising new approach for scientific discovery.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20666",
        "abs_url": "https://arxiv.org/abs/2601.20666",
        "pdf_url": "https://arxiv.org/pdf/2601.20666",
        "title": "Learning Contextual Runtime Monitors for Safe AI-Based Autonomy",
        "authors": [
            "Alejandro Luque-Cerpa",
            "Mengyuan Wang",
            "Emil Carlsson",
            "Sanjit A. Seshia",
            "Devdatt Dubhashi",
            "Hazem Torfah"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Systems and Control (eess.SY)",
        "abstract": "We introduce a novel framework for learning context-aware runtime monitors for AI-based control ensembles. Machine-learning (ML) controllers are increasingly deployed in (autonomous) cyber-physical systems because of their ability to solve complex decision-making tasks. However, their accuracy can degrade sharply in unfamiliar environments, creating significant safety concerns. Traditional ensemble methods aim to improve robustness by averaging or voting across multiple controllers, yet this often dilutes the specialized strengths that individual controllers exhibit in different operating contexts. We argue that, rather than blending controller outputs, a monitoring framework should identify and exploit these contextual strengths. In this paper, we reformulate the design of safe AI-based control ensembles as a contextual monitoring problem. A monitor continuously observes the system's context and selects the controller best suited to the current conditions. To achieve this, we cast monitor learning as a contextual learning task and draw on techniques from contextual multi-armed bandits. Our approach comes with two key benefits: (1) theoretical safety guarantees during controller selection, and (2) improved utilization of controller diversity. We validate our framework in two simulated autonomous driving scenarios, demonstrating significant improvements in both safety and performance compared to non-contextual baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20686",
        "abs_url": "https://arxiv.org/abs/2601.20686",
        "pdf_url": "https://arxiv.org/pdf/2601.20686",
        "title": "MuRAL-CPD: Active Learning for Multiresolution Change Point Detection",
        "authors": [
            "Stefano Bertolasi",
            "Diego Carrera",
            "Diego Stucchi",
            "Pasqualina Fragneto",
            "Luigi Amedeo Bianchi"
        ],
        "comments": "Presented at 2025 IEEE International Conference on Data Mining (ICDM), to appear in the Proceedings",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Change Point Detection (CPD) is a critical task in time series analysis, aiming to identify moments when the underlying data-generating process shifts. Traditional CPD methods often rely on unsupervised techniques, which lack adaptability to task-specific definitions of change and cannot benefit from user knowledge. To address these limitations, we propose MuRAL-CPD, a novel semi-supervised method that integrates active learning into a multiresolution CPD algorithm. MuRAL-CPD leverages a wavelet-based multiresolution decomposition to detect changes across multiple temporal scales and incorporates user feedback to iteratively optimize key hyperparameters. This interaction enables the model to align its notion of change with that of the user, improving both accuracy and interpretability. Our experimental results on several real-world datasets show the effectiveness of MuRAL-CPD against state-of-the-art methods, particularly in scenarios where minimal supervision is available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20687",
        "abs_url": "https://arxiv.org/abs/2601.20687",
        "pdf_url": "https://arxiv.org/pdf/2601.20687",
        "title": "Positive-Unlabeled Reinforcement Learning Distillation for On-Premise Small Models",
        "authors": [
            "Zhiqiang Kou",
            "Junyang Chen",
            "Xin-Qiang Cai",
            "Xiaobo Xia",
            "Ming-Kun Xie",
            "Dong-Dong Wu",
            "Biao Liu",
            "Yuheng Jia",
            "Xin Geng",
            "Masashi Sugiyama",
            "Tat-Seng Chua"
        ],
        "comments": "22 pages, 8 figures, 7 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Due to constraints on privacy, cost, and latency, on-premise deployment of small models is increasingly common. However, most practical pipelines stop at supervised fine-tuning (SFT) and fail to reach the reinforcement learning (RL) alignment stage. The main reason is that RL alignment typically requires either expensive human preference annotation or heavy reliance on high-quality reward models with large-scale API usage and ongoing engineering maintenance, both of which are ill-suited to on-premise settings. To bridge this gap, we propose a positive-unlabeled (PU) RL distillation method for on-premise small-model deployment. Without human-labeled preferences or a reward model, our method distills the teacher's preference-optimization capability from black-box generations into a locally trainable student. For each prompt, we query the teacher once to obtain an anchor response, locally sample multiple student candidates, and perform anchor-conditioned self-ranking to induce pairwise or listwise preferences, enabling a fully local training loop via direct preference optimization or group relative policy optimization. Theoretical analysis justifies that the induced preference signal by our method is order-consistent and concentrates on near-optimal candidates, supporting its stability for preference optimization. Experiments demonstrate that our method achieves consistently strong performance under a low-cost setting.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20692",
        "abs_url": "https://arxiv.org/abs/2601.20692",
        "pdf_url": "https://arxiv.org/pdf/2601.20692",
        "title": "Optimal Transport Group Counterfactual Explanations",
        "authors": [
            "Enrique Valero-Leal",
            "Bernd Bischl",
            "Pedro Larrañaga",
            "Concha Bielza",
            "Giuseppe Casalicchio"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Group counterfactual explanations find a set of counterfactual instances to explain a group of input instances contrastively. However, existing methods either (i) optimize counterfactuals only for a fixed group and do not generalize to new group members, (ii) strictly rely on strong model assumptions (e.g., linearity) for tractability or/and (iii) poorly control the counterfactual group geometry distortion. We instead learn an explicit optimal transport map that sends any group instance to its counterfactual without re-optimization, minimizing the group's total transport cost. This enables generalization with fewer parameters, making it easier to interpret the common actionable recourse. For linear classifiers, we prove that functions representing group counterfactuals are derived via mathematical optimization, identifying the underlying convex optimization type (QP, QCQP, ...). Experiments show that they accurately generalize, preserve group geometry and incur only negligible additional transport cost compared to baseline methods. If model linearity cannot be exploited, our approach also significantly outperforms the baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20694",
        "abs_url": "https://arxiv.org/abs/2601.20694",
        "pdf_url": "https://arxiv.org/pdf/2601.20694",
        "title": "Is Pure Exploitation Sufficient in Exogenous MDPs with Linear Function Approximation?",
        "authors": [
            "Hao Liang",
            "Jiayu Cheng",
            "Sean R. Sinclair",
            "Yali Du"
        ],
        "comments": "Accepted to ICLR 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Exogenous MDPs (Exo-MDPs) capture sequential decision-making where uncertainty comes solely from exogenous inputs that evolve independently of the learner's actions. This structure is especially common in operations research applications such as inventory control, energy storage, and resource allocation, where exogenous randomness (e.g., demand, arrivals, or prices) drives system behavior. Despite decades of empirical evidence that greedy, exploitation-only methods work remarkably well in these settings, theory has lagged behind: all existing regret guarantees for Exo-MDPs rely on explicit exploration or tabular assumptions. We show that exploration is unnecessary. We propose Pure Exploitation Learning (PEL) and prove the first general finite-sample regret bounds for exploitation-only algorithms in Exo-MDPs. In the tabular case, PEL achieves $\\widetilde{O}(H^2|\\Xi|\\sqrt{K})$. For large, continuous endogenous state spaces, we introduce LSVI-PE, a simple linear-approximation method whose regret is polynomial in the feature dimension, exogenous state space, and horizon, independent of the endogenous state and action spaces. Our analysis introduces two new tools: counterfactual trajectories and Bellman-closed feature transport, which together allow greedy policies to have accurate value estimates without optimism. Experiments on synthetic and resource-management tasks show that PEL consistently outperforming baselines. Overall, our results overturn the conventional wisdom that exploration is required, demonstrating that in Exo-MDPs, pure exploitation is enough.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20704",
        "abs_url": "https://arxiv.org/abs/2601.20704",
        "pdf_url": "https://arxiv.org/pdf/2601.20704",
        "title": "Structurally Human, Semantically Biased: Detecting LLM-Generated References with Embeddings and GNNs",
        "authors": [
            "Melika Mobini",
            "Vincent Holst",
            "Floriano Tori",
            "Andres Algaba",
            "Vincent Ginis"
        ],
        "comments": "34 pages, 20 figures. Accepted at ICLR 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large language models are increasingly used to curate bibliographies, raising the question: are their reference lists distinguishable from human ones? We build paired citation graphs, ground truth and GPT-4o-generated (from parametric knowledge), for 10,000 focal papers ($\\approx$ 275k references) from SciSciNet, and added a field-matched random baseline that preserves out-degree and field distributions while breaking latent structure. We compare (i) structure-only node features (degree/closeness/eigenvector centrality, clustering, edge count) with (ii) 3072-D title/abstract embeddings, using an RF on graph-level aggregates and Graph Neural Networks with node features. Structure alone barely separates GPT from ground truth (RF accuracy $\\approx$ 0.60) despite cleanly rejecting the random baseline ($\\approx$ 0.89--0.92). By contrast, embeddings sharply increase separability: RF on aggregated embeddings reaches $\\approx$ 0.83, and GNNs with embedding node features achieve 93\\% test accuracy on GPT vs.\\ ground truth. We show the robustness of our findings by replicating the pipeline with Claude Sonnet 4.5 and with multiple embedding models (OpenAI and SPECTER), with RF separability for ground truth vs.\\ Claude $\\approx 0.77$ and clean rejection of the random baseline. Thus, LLM bibliographies, generated purely from parametric knowledge, closely mimic human citation topology, but leave detectable semantic fingerprints; detection and debiasing should target content signals rather than global graph structure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20729",
        "abs_url": "https://arxiv.org/abs/2601.20729",
        "pdf_url": "https://arxiv.org/pdf/2601.20729",
        "title": "Deep Semi-Supervised Survival Analysis for Predicting Cancer Prognosis",
        "authors": [
            "Anchen Sun",
            "Zhibin Chen",
            "Xiaodong Cai"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The Cox Proportional Hazards (PH) model is widely used in survival analysis. Recently, artificial neural network (ANN)-based Cox-PH models have been developed. However, training these Cox models with high-dimensional features typically requires a substantial number of labeled samples containing information about time-to-event. The limited availability of labeled data for training often constrains the performance of ANN-based Cox models. To address this issue, we employed a deep semi-supervised learning (DSSL) approach to develop single- and multi-modal ANN-based Cox models based on the Mean Teacher (MT) framework, which utilizes both labeled and unlabeled data for training. We applied our model, named Cox-MT, to predict the prognosis of several types of cancer using data from The Cancer Genome Atlas (TCGA). Our single-modal Cox-MT models, utilizing TCGA RNA-seq data or whole slide images, significantly outperformed the existing ANN-based Cox model, Cox-nnet, using the same data set across four types of cancer considered. As the number of unlabeled samples increased, the performance of Cox-MT significantly improved with a given set of labeled data. Furthermore, our multi-modal Cox-MT model demonstrated considerably better performance than the single-modal model. In summary, the Cox-MT model effectively leverages both labeled and unlabeled data to significantly enhance prediction accuracy compared to existing ANN-based Cox models trained solely on labeled data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20738",
        "abs_url": "https://arxiv.org/abs/2601.20738",
        "pdf_url": "https://arxiv.org/pdf/2601.20738",
        "title": "SA-PEF: Step-Ahead Partial Error Feedback for Efficient Federated Learning",
        "authors": [
            "Dawit Kiros Redie",
            "Reza Arablouei",
            "Stefan Werner"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC); Signal Processing (eess.SP); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "Biased gradient compression with error feedback (EF) reduces communication in federated learning (FL), but under non-IID data, the residual error can decay slowly, causing gradient mismatch and stalled progress in the early rounds. We propose step-ahead partial error feedback (SA-PEF), which integrates step-ahead (SA) correction with partial error feedback (PEF). SA-PEF recovers EF when the step-ahead coefficient $\\alpha=0$ and step-ahead EF (SAEF) when $\\alpha=1$. For non-convex objectives and $\\delta$-contractive compressors, we establish a second-moment bound and a residual recursion that guarantee convergence to stationarity under heterogeneous data and partial client participation. The resulting rates match standard non-convex Fed-SGD guarantees up to constant factors, achieving $O((\\eta,\\eta_0TR)^{-1})$ convergence to a variance/heterogeneity floor with a fixed inner step size. Our analysis reveals a step-ahead-controlled residual contraction $\\rho_r$ that explains the observed acceleration in the early training phase. To balance SAEF's rapid warm-up with EF's long-term stability, we select $\\alpha$ near its theory-predicted optimum. Experiments across diverse architectures and datasets show that SA-PEF consistently reaches target accuracy faster than EF.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20753",
        "abs_url": "https://arxiv.org/abs/2601.20753",
        "pdf_url": "https://arxiv.org/pdf/2601.20753",
        "title": "GraphAllocBench: A Flexible Benchmark for Preference-Conditioned Multi-Objective Policy Learning",
        "authors": [
            "Zhiheng Jiang",
            "Yunzhe Wang",
            "Ryan Marr",
            "Ellen Novoseller",
            "Benjamin T. Files",
            "Volkan Ustun"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Preference-Conditioned Policy Learning (PCPL) in Multi-Objective Reinforcement Learning (MORL) aims to approximate diverse Pareto-optimal solutions by conditioning policies on user-specified preferences over objectives. This enables a single model to flexibly adapt to arbitrary trade-offs at run-time by producing a policy on or near the Pareto front. However, existing benchmarks for PCPL are largely restricted to toy tasks and fixed environments, limiting their realism and scalability. To address this gap, we introduce GraphAllocBench, a flexible benchmark built on a novel graph-based resource allocation sandbox environment inspired by city management, which we call CityPlannerEnv. GraphAllocBench provides a rich suite of problems with diverse objective functions, varying preference conditions, and high-dimensional scalability. We also propose two new evaluation metrics -- Proportion of Non-Dominated Solutions (PNDS) and Ordering Score (OS) -- that directly capture preference consistency while complementing the widely used hypervolume metric. Through experiments with Multi-Layer Perceptrons (MLPs) and graph-aware models, we show that GraphAllocBench exposes the limitations of existing MORL approaches and paves the way for using graph-based methods such as Graph Neural Networks in complex, high-dimensional combinatorial allocation tasks. Beyond its predefined problem set, GraphAllocBench enables users to flexibly vary objectives, preferences, and allocation rules, establishing it as a versatile and extensible benchmark for advancing PCPL. Code: this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20756",
        "abs_url": "https://arxiv.org/abs/2601.20756",
        "pdf_url": "https://arxiv.org/pdf/2601.20756",
        "title": "Supervised Guidance Training for Infinite-Dimensional Diffusion Models",
        "authors": [
            "Elizabeth L. Baker",
            "Alexander Denker",
            "Jes Frellsen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Score-based diffusion models have recently been extended to infinite-dimensional function spaces, with uses such as inverse problems arising from partial differential equations. In the Bayesian formulation of inverse problems, the aim is to sample from a posterior distribution over functions obtained by conditioning a prior on noisy observations. While diffusion models provide expressive priors in function space, the theory of conditioning them to sample from the posterior remains open. We address this, assuming that either the prior lies in the Cameron-Martin space, or is absolutely continuous with respect to a Gaussian measure. We prove that the models can be conditioned using an infinite-dimensional extension of Doob's $h$-transform, and that the conditional score decomposes into an unconditional score and a guidance term. As the guidance term is intractable, we propose a simulation-free score matching objective (called Supervised Guidance Training) enabling efficient and stable posterior sampling. We illustrate the theory with numerical examples on Bayesian inverse problems in function spaces. In summary, our work offers the first function-space method for fine-tuning trained diffusion models to accurately sample from a posterior.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20765",
        "abs_url": "https://arxiv.org/abs/2601.20765",
        "pdf_url": "https://arxiv.org/pdf/2601.20765",
        "title": "Less is More: Clustered Cross-Covariance Control for Offline RL",
        "authors": [
            "Nan Qiao",
            "Sheng Yue",
            "Shuning Wang",
            "Yongheng Deng",
            "Ju Ren"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "A fundamental challenge in offline reinforcement learning is distributional shift. Scarce data or datasets dominated by out-of-distribution (OOD) areas exacerbate this issue. Our theoretical analysis and experiments show that the standard squared error objective induces a harmful TD cross covariance. This effect amplifies in OOD areas, biasing optimization and degrading policy learning. To counteract this mechanism, we develop two complementary strategies: partitioned buffer sampling that restricts updates to localized replay partitions, attenuates irregular covariance effects, and aligns update directions, yielding a scheme that is easy to integrate with existing implementations, namely Clustered Cross-Covariance Control for TD (C^4). We also introduce an explicit gradient-based corrective penalty that cancels the covariance induced bias within each update. We prove that buffer partitioning preserves the lower bound property of the maximization objective, and that these constraints mitigate excessive conservatism in extreme OOD areas without altering the core behavior of policy constrained offline reinforcement learning. Empirically, our method showcases higher stability and up to 30% improvement in returns over prior methods, especially with small datasets and splits that emphasize OOD areas.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20772",
        "abs_url": "https://arxiv.org/abs/2601.20772",
        "pdf_url": "https://arxiv.org/pdf/2601.20772",
        "title": "COMET-SG1: Lightweight Autoregressive Regressor for Edge and Embedded AI",
        "authors": [
            "Shakhyar Gogoi"
        ],
        "comments": "Preprint. Submitted to an IEEE conference. 6 pages, 6 figures, 2 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "COMET-SG1 is a lightweight, stability-oriented autoregressive regression model designed for time-series prediction on edge and embedded AI systems. Unlike recurrent neural networks or transformer-based sequence models, COMET-SG1 operates through linear behavior-space encoding, memory-anchored transition estimation, and deterministic state updates. This structure prioritizes bounded long-horizon behavior under fully autoregressive inference, a critical requirement for edge deployment where prediction errors accumulate over time. Experiments on non-stationary synthetic time-series data demonstrate that COMET-SG1 achieves competitive short-horizon accuracy while exhibiting significantly reduced long-horizon drift compared to MLP, LSTM, and k-nearest neighbor baselines. With a compact parameter footprint and operations compatible with fixed-point arithmetic, COMET-SG1 provides a practical and interpretable approach for stable autoregressive prediction in edge and embedded AI applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20773",
        "abs_url": "https://arxiv.org/abs/2601.20773",
        "pdf_url": "https://arxiv.org/pdf/2601.20773",
        "title": "Smoothing the Black-Box: Signed-Distance Supervision for Black-Box Model Copying",
        "authors": [
            "Rubén Jiménez",
            "Oriol Pujol"
        ],
        "comments": "27 pages",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deployed machine learning systems must continuously evolve as data, architectures, and regulations change, often without access to original training data or model internals. In such settings, black-box copying provides a practical refactoring mechanism, i.e. upgrading legacy models by learning replicas from input-output queries alone. When restricted to hard-label outputs, copying turns into a discontinuous surface reconstruction problem from pointwise queries, severely limiting the ability to recover boundary geometry efficiently. We propose a distance-based copying (distillation) framework that replaces hard-label supervision with signed distances to the teacher's decision boundary, converting copying into a smooth regression problem that exploits local geometry. We develop an $\\alpha$-governed smoothing and regularization scheme with Hölder/Lipschitz control over the induced target surface, and introduce two model-agnostic algorithms to estimate signed distances under label-only access. Experiments on synthetic problems and UCI benchmarks show consistent improvements in fidelity and generalization accuracy over hard-label baselines, while enabling distance outputs as uncertainty-related signals for black-box replicas.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20774",
        "abs_url": "https://arxiv.org/abs/2601.20774",
        "pdf_url": "https://arxiv.org/pdf/2601.20774",
        "title": "When More Data Doesn't Help: Limits of Adaptation in Multitask Learning",
        "authors": [
            "Steve Hanneke",
            "Mingyue Xu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multitask learning and related frameworks have achieved tremendous success in modern applications. In multitask learning problem, we are given a set of heterogeneous datasets collected from related source tasks and hope to enhance the performance above what we could hope to achieve by solving each of them individually. The recent work of arXiv:2006.15785 has showed that, without access to distributional information, no algorithm based on aggregating samples alone can guarantee optimal risk as long as the sample size per task is bounded. In this paper, we focus on understanding the statistical limits of multitask learning. We go beyond the no-free-lunch theorem in arXiv:2006.15785 by establishing a stronger impossibility result of adaptation that holds for arbitrarily large sample size per task. This improvement conveys an important message that the hardness of multitask learning cannot be overcame by having abundant data per task. We also discuss the notion of optimal adaptivity that may be of future interests.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20775",
        "abs_url": "https://arxiv.org/abs/2601.20775",
        "pdf_url": "https://arxiv.org/pdf/2601.20775",
        "title": "Active Learning for Decision Trees with Provable Guarantees",
        "authors": [
            "Arshia Soltani Moakhar",
            "Tanapoom Laoaron",
            "Faraz Ghahremani",
            "Kiarash Banihashem",
            "MohammadTaghi Hajiaghayi"
        ],
        "comments": "10 pages, 43 pages with appendix, ICLR 2026, Conference URL: this https URL",
        "subjects": "Machine Learning (cs.LG); Computational Complexity (cs.CC); Data Structures and Algorithms (cs.DS)",
        "abstract": "This paper advances the theoretical understanding of active learning label complexity for decision trees as binary classifiers. We make two main contributions. First, we provide the first analysis of the disagreement coefficient for decision trees-a key parameter governing active learning label complexity. Our analysis holds under two natural assumptions required for achieving polylogarithmic label complexity, (i) each root-to-leaf path queries distinct feature dimensions, and (ii) the input data has a regular, grid-like structure. We show these assumptions are essential, as relaxing them leads to polynomial label complexity. Second, we present the first general active learning algorithm for binary classification that achieves a multiplicative error guarantee, producing a $(1+\\epsilon)$-approximate classifier. By combining these results, we design an active learning algorithm for decision trees that uses only a polylogarithmic number of label queries in the dataset size, under the stated assumptions. Finally, we establish a label complexity lower bound, showing our algorithm's dependence on the error tolerance $\\epsilon$ is close to optimal.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20800",
        "abs_url": "https://arxiv.org/abs/2601.20800",
        "pdf_url": "https://arxiv.org/pdf/2601.20800",
        "title": "Conditional PED-ANOVA: Hyperparameter Importance in Hierarchical & Dynamic Search Spaces",
        "authors": [
            "Kaito Baba",
            "Yoshihiko Ozaki",
            "Shuhei Watanabe"
        ],
        "comments": "16 pages, 9 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We propose conditional PED-ANOVA (condPED-ANOVA), a principled framework for estimating hyperparameter importance (HPI) in conditional search spaces, where the presence or domain of a hyperparameter can depend on other hyperparameters. Although the original PED-ANOVA provides a fast and efficient way to estimate HPI within the top-performing regions of the search space, it assumes a fixed, unconditional search space and therefore cannot properly handle conditional hyperparameters. To address this, we introduce a conditional HPI for top-performing regions and derive a closed-form estimator that accurately reflects conditional activation and domain changes. Experiments show that naive adaptations of existing HPI estimators yield misleading or uninterpretable importance estimates in conditional settings, whereas condPED-ANOVA consistently provides meaningful importances that reflect the underlying conditional structure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20815",
        "abs_url": "https://arxiv.org/abs/2601.20815",
        "pdf_url": "https://arxiv.org/pdf/2601.20815",
        "title": "GNN Explanations that do not Explain and How to find Them",
        "authors": [
            "Steve Azzolin",
            "Stefano Teso",
            "Bruno Lepri",
            "Andrea Passerini",
            "Sagar Malhotra"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Explanations provided by Self-explainable Graph Neural Networks (SE-GNNs) are fundamental for understanding the model's inner workings and for identifying potential misuse of sensitive attributes. Although recent works have highlighted that these explanations can be suboptimal and potentially misleading, a characterization of their failure cases is unavailable. In this work, we identify a critical failure of SE-GNN explanations: explanations can be unambiguously unrelated to how the SE-GNNs infer labels. We show that, on the one hand, many SE-GNNs can achieve optimal true risk while producing these degenerate explanations, and on the other, most faithfulness metrics can fail to identify these failure modes. Our empirical analysis reveals that degenerate explanations can be maliciously planted (allowing an attacker to hide the use of sensitive attributes) and can also emerge naturally, highlighting the need for reliable auditing. To address this, we introduce a novel faithfulness metric that reliably marks degenerate explanations as unfaithful, in both malicious and natural settings. Our code is available in the supplemental.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20838",
        "abs_url": "https://arxiv.org/abs/2601.20838",
        "pdf_url": "https://arxiv.org/pdf/2601.20838",
        "title": "Reward Models Inherit Value Biases from Pretraining",
        "authors": [
            "Brian Christian",
            "Jessica A. F. Thompson",
            "Elle Michelle Yang",
            "Vincent Adam",
            "Hannah Rose Kirk",
            "Christopher Summerfield",
            "Tsvetomira Dumbalska"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Computers and Society (cs.CY)",
        "abstract": "Reward models (RMs) are central to aligning large language models (LLMs) with human values but have received less attention than pre-trained and post-trained LLMs themselves. Because RMs are initialized from LLMs, they inherit representations that shape their behavior, but the nature and extent of this influence remain understudied. In a comprehensive study of 10 leading open-weight RMs using validated psycholinguistic corpora, we show that RMs exhibit significant differences along multiple dimensions of human value as a function of their base model. Using the \"Big Two\" psychological axes, we show a robust preference of Llama RMs for \"agency\" and a corresponding robust preference of Gemma RMs for \"communion.\" This phenomenon holds even when the preference data and finetuning process are identical, and we trace it back to the logits of the respective instruction-tuned and pre-trained models. These log-probability differences themselves can be formulated as an implicit RM; we derive usable implicit reward scores and show that they exhibit the very same agency/communion difference. We run experiments training RMs with ablations for preference data source and quantity, which demonstrate that this effect is not only repeatable but surprisingly durable. Despite RMs being designed to represent human preferences, our evidence shows that their outputs are influenced by the pretrained LLMs on which they are based. This work underscores the importance of safety and alignment efforts at the pretraining stage, and makes clear that open-source developers' choice of base model is as much a consideration of values as of performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20845",
        "abs_url": "https://arxiv.org/abs/2601.20845",
        "pdf_url": "https://arxiv.org/pdf/2601.20845",
        "title": "PatchFormer: A Patch-Based Time Series Foundation Model with Hierarchical Masked Reconstruction and Cross-Domain Transfer Learning for Zero-Shot Multi-Horizon Forecasting",
        "authors": [
            "Olaf Yunus Laitinen Imanov",
            "Derya Umut Kulali",
            "Taner Yilmaz"
        ],
        "comments": "5 pages; 2 figures; 7 tables",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Time series forecasting is a fundamental problem with applications in climate, energy, healthcare, and finance. Many existing approaches require domain-specific feature engineering and substantial labeled data for each task. We introduce PatchFormer, a patch-based time series foundation model that uses hierarchical masked reconstruction for self-supervised pretraining and lightweight adapters for efficient transfer. PatchFormer segments time series into patches and learns multiscale temporal representations with learnable aggregation across temporal scales. Pretraining uses masked patch reconstruction with dynamic masking and objectives that encourage both local accuracy and global consistency, followed by cross-domain knowledge distillation. Experiments on 24 benchmark datasets spanning weather, energy, traffic, finance, and healthcare demonstrate state-of-the-art zero-shot multi-horizon forecasting, reducing mean squared error by 27.3 percent relative to strong baselines while requiring 94 percent less task-specific training data. The model exhibits near log-linear scaling with more pretraining data up to 100 billion points and processes length-512 sequences 3.8x faster than full-sequence transformers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20848",
        "abs_url": "https://arxiv.org/abs/2601.20848",
        "pdf_url": "https://arxiv.org/pdf/2601.20848",
        "title": "Post-Training Fairness Control: A Single-Train Framework for Dynamic Fairness in Recommendation",
        "authors": [
            "Weixin Chen",
            "Li Chen",
            "Yuhan Zhao"
        ],
        "comments": "Accepted to WWW 2026 Workshop on HCRS (Oral Presentation)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computers and Society (cs.CY); Information Retrieval (cs.IR)",
        "abstract": "Despite growing efforts to mitigate unfairness in recommender systems, existing fairness-aware methods typically fix the fairness requirement at training time and provide limited post-training flexibility. However, in real-world scenarios, diverse stakeholders may demand differing fairness requirements over time, so retraining for different fairness requirements becomes prohibitive. To address this limitation, we propose Cofair, a single-train framework that enables post-training fairness control in recommendation. Specifically, Cofair introduces a shared representation layer with fairness-conditioned adapter modules to produce user embeddings specialized for varied fairness levels, along with a user-level regularization term that guarantees user-wise monotonic fairness improvements across these levels. We theoretically establish that the adversarial objective of Cofair upper bounds demographic parity and the regularization term enforces progressive fairness at user level. Comprehensive experiments on multiple datasets and backbone models demonstrate that our framework provides dynamic fairness at different levels, delivering comparable or better fairness-accuracy curves than state-of-the-art baselines, without the need to retrain for each new fairness requirement. Our code is publicly available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20854",
        "abs_url": "https://arxiv.org/abs/2601.20854",
        "pdf_url": "https://arxiv.org/pdf/2601.20854",
        "title": "Exploring Transformer Placement in Variational Autoencoders for Tabular Data Generation",
        "authors": [
            "Aníbal Silva",
            "Moisés Santos",
            "André Restivo",
            "Carlos Soares"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Tabular data remains a challenging domain for generative models. In particular, the standard Variational Autoencoder (VAE) architecture, typically composed of multilayer perceptrons, struggles to model relationships between features, especially when handling mixed data types. In contrast, Transformers, through their attention mechanism, are better suited for capturing complex feature interactions. In this paper, we empirically investigate the impact of integrating Transformers into different components of a VAE. We conduct experiments on 57 datasets from the OpenML CC18 suite and draw two main conclusions. First, results indicate that positioning Transformers to leverage latent and decoder representations leads to a trade-off between fidelity and diversity. Second, we observe a high similarity between consecutive blocks of a Transformer in all components. In particular, in the decoder, the relationship between the input and output of a Transformer is approximately linear.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19906",
        "abs_url": "https://arxiv.org/abs/2601.19906",
        "pdf_url": "https://arxiv.org/pdf/2601.19906",
        "title": "GTAC: A Generative Transformer for Approximate Circuits",
        "authors": [
            "Jingxin Wang",
            "Shitong Guo",
            "Ruicheng Dai",
            "Wenhui Liang",
            "Ruogu Ding",
            "Xin Ning",
            "Weikang Qian"
        ],
        "comments": "",
        "subjects": "Hardware Architecture (cs.AR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Targeting error-tolerant applications, approximate circuits introduce controlled errors to significantly improve performance, power, and area (PPA) of circuits. In this work, we introduce GTAC, a novel generative Transformer-based model for producing approximate circuits. By leveraging principles of approximate computing and AI-driven EDA, our model innovatively integrates error thresholds into the design process. Experimental results show that compared with a state-of-the-art method, GTAC further reduces 6.4% area under the error rate constraint, while being 4.3x faster.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 87,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19908",
        "abs_url": "https://arxiv.org/abs/2601.19908",
        "pdf_url": "https://arxiv.org/pdf/2601.19908",
        "title": "CHIME: Chiplet-based Heterogeneous Near-Memory Acceleration for Edge Multimodal LLM Inference",
        "authors": [
            "Yanru Chen",
            "Runyang Tian",
            "Yue Pan",
            "Zheyu Li",
            "Weihong Xu",
            "Tajana Rosing"
        ],
        "comments": "",
        "subjects": "Hardware Architecture (cs.AR); Machine Learning (cs.LG)",
        "abstract": "The proliferation of large language models (LLMs) is accelerating the integration of multimodal assistants into edge devices, where inference is executed under stringent latency and energy constraints, often exacerbated by intermittent connectivity. These challenges become particularly acute in the context of multimodal LLMs (MLLMs), as high-dimensional visual inputs are transformed into extensive token sequences, thereby inflating the key-value (KV) cache and imposing substantial data movement overheads to the LLM backbone. To address these issues, we present CHIME, a chiplet-based heterogeneous near-memory acceleration for edge MLLMs inference. CHIME leverages the complementary strengths of integrated monolithic 3D (M3D) DRAM and RRAM chiplets: DRAM supplies low-latency bandwidth for attention, while RRAM offers dense, non-volatile storage for weights. This heterogeneous hardware is orchestrated by a co-designed mapping framework that executes fused kernels near data, minimizing cross-chiplet traffic to maximize effective bandwidth. On FastVLM (0.6B/1.7B) and MobileVLM (1.7B/3B), CHIME achieves up to 54x speedup and up to 246x better energy efficiency per inference as compared to the edge GPU NVIDIA Jetson Orin NX. It sustains 116.5-266.5 token/J compared to Jetson's 0.7-1.1 token/J. Furthermore, it delivers up to 69.2x higher throughput than the state-of-the-art PIM accelerator FACIL. Compared to the M3D DRAM-only design, CHIME's heterogeneous memory further improves energy efficiency by 7% and performance by 2.4x.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 88,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19920",
        "abs_url": "https://arxiv.org/abs/2601.19920",
        "pdf_url": "https://arxiv.org/pdf/2601.19920",
        "title": "PiC-BNN: A 128-kbit 65 nm Processing-in-CAM-Based End-to-End Binary Neural Network Accelerator",
        "authors": [
            "Yuval Harary",
            "Almog Sharoni",
            "Esteban Garzón",
            "Marco Lanuzza",
            "Adam Teman",
            "Leonid Yavits"
        ],
        "comments": "7 pages, 6 figures. Accepted to IEEE CCMCC 2025",
        "subjects": "Hardware Architecture (cs.AR); Machine Learning (cs.LG)",
        "abstract": "Binary Neural Networks (BNNs), where weights and activations are constrained to binary values (+1, -1), are a highly efficient alternative to traditional neural networks. Unfortunately, typical BNNs, while binarizing linear layers (matrix-vector multiplication), still implement other network layers (batch normalization, softmax, output layer, and sometimes the input layer of a convolutional neural network) in full precision. This limits the area and energy benefits and requires architectural support for full precision operations. We propose PiC-BNN, a true end-to-end binary in-approximate search (Hamming distance tolerant) Content Addressable Memory based BNN accelerator. PiC-BNN is designed and manufactured in a commercial 65nm process. PiC-BNN uses Hamming distance tolerance to apply the law of large numbers to enable accurate classification without implementing full precision operations. PiC-BNN achieves baseline software accuracy (95.2%) on the MNIST dataset and 93.5% on the Hand Gesture (HG) dataset, a throughput of 560K inferences/s, and presents a power efficiency of 703M inferences/s/W when implementing a binary MLP model for MNIST/HG dataset classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 89,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19933",
        "abs_url": "https://arxiv.org/abs/2601.19933",
        "pdf_url": "https://arxiv.org/pdf/2601.19933",
        "title": "Text-to-State Mapping for Non-Resolution Reasoning: The Contradiction-Preservation Principle",
        "authors": [
            "Kei Saito"
        ],
        "comments": "17 pages, 3 figures, 5 tables. Sequel to arXiv:2512.13478",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Non-Resolution Reasoning (NRR) provides a formal framework for maintaining semantic ambiguity rather than forcing premature interpretation collapse. While the foundational architecture establishes state spaces and operators for ambiguity-preserving computation, the critical question of how natural language maps to these mathematical structures remains open. This paper introduces the text-to-state mapping function {\\phi} that transforms linguistic input into superposition states within the NRR framework. We formalize the Contradiction-Preservation Principle, which requires that genuinely ambiguous expressions maintain non-zero entropy in their state representations, and develop extraction protocols using existing Large Language Models as interpretation generators. Empirical validation across 68 test sentences spanning lexical, structural, and pragmatic ambiguity demonstrates that our mapping achieves mean Shannon entropy H(S) = 1.087 bits for ambiguous inputs while baseline single-interpretation approaches yield H(S) = 0.000. The framework provides the missing algorithmic bridge between raw text and the formal state spaces on which NRR operators act, enabling architectural collapse deferment in language model inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 90,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19946",
        "abs_url": "https://arxiv.org/abs/2601.19946",
        "pdf_url": "https://arxiv.org/pdf/2601.19946",
        "title": "MK-SGC-SC: Multiple Kernel guided Sparse Graph Construction in Spectral Clustering for Unsupervised Speaker Diarization",
        "authors": [
            "Nikhil Raghav",
            "Avisek Gupta",
            "Swagatam Das",
            "Md Sahidullah"
        ],
        "comments": "5 pages",
        "subjects": "Audio and Speech Processing (eess.AS); Machine Learning (cs.LG); Sound (cs.SD)",
        "abstract": "Speaker diarization aims to segment audio recordings into regions corresponding to individual speakers. Although unsupervised speaker diarization is inherently challenging, the prospect of identifying speaker regions without pretraining or weak supervision motivates research on clustering techniques. In this work, we share the notable observation that measuring multiple kernel similarities of speaker embeddings to thereafter craft a sparse graph for spectral clustering in a principled manner is sufficient to achieve state-of-the-art performances in a fully unsupervised setting. Specifically, we consider four polynomial kernels and a degree one arccosine kernel to measure similarities in speaker embeddings, using which sparse graphs are constructed in a principled manner to emphasize local similarities. Experiments show the proposed approach excels in unsupervised speaker diarization over a variety of challenging environments in the DIHARD-III, AMI, and VoxConverse corpora. To encourage further research, our implementations are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 91,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19958",
        "abs_url": "https://arxiv.org/abs/2601.19958",
        "pdf_url": "https://arxiv.org/pdf/2601.19958",
        "title": "Deep Neural Networks as Iterated Function Systems and a Generalization Bound",
        "authors": [
            "Jonathan Vacher"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Probability (math.PR)",
        "abstract": "Deep neural networks (DNNs) achieve remarkable performance on a wide range of tasks, yet their mathematical analysis remains fragmented: stability and generalization are typically studied in disparate frameworks and on a case-by-case basis. Architecturally, DNNs rely on the recursive application of parametrized functions, a mechanism that can be unstable and difficult to train, making stability a primary concern. Even when training succeeds, there are few rigorous results on how well such models generalize beyond the observed data, especially in the generative setting. In this work, we leverage the theory of stochastic Iterated Function Systems (IFS) and show that two important deep architectures can be viewed as, or canonically associated with, place-dependent IFS. This connection allows us to import results from random dynamical systems to (i) establish the existence and uniqueness of invariant measures under suitable contractivity assumptions, and (ii) derive a Wasserstein generalization bound for generative modeling. The bound naturally leads to a new training objective that directly controls the collage-type approximation error between the data distribution and its image under the learned transfer operator. We illustrate the theory on a controlled 2D example and empirically evaluate the proposed objective on standard image datasets (MNIST, CelebA, CIFAR-10).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 92,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19966",
        "abs_url": "https://arxiv.org/abs/2601.19966",
        "pdf_url": "https://arxiv.org/pdf/2601.19966",
        "title": "Global Plane Waves From Local Gaussians: Periodic Charge Densities in a Blink",
        "authors": [
            "Jonas Elsborg",
            "Felix Ærtebjerg",
            "Luca Thiede",
            "Alán Aspuru-Guzik",
            "Tejs Vegge",
            "Arghya Bhowmik"
        ],
        "comments": "24 pages including appendix, 8 Figures, 5 tables",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Machine Learning (cs.LG); Chemical Physics (physics.chem-ph); Computational Physics (physics.comp-ph)",
        "abstract": "We introduce ELECTRAFI, a fast, end-to-end differentiable model for predicting periodic charge densities in crystalline materials. ELECTRAFI constructs anisotropic Gaussians in real space and exploits their closed-form Fourier transforms to analytically evaluate plane-wave coefficients via the Poisson summation formula. This formulation delegates non-local and periodic behavior to analytic transforms, enabling reconstruction of the full periodic charge density with a single inverse FFT. By avoiding explicit real-space grid probing, periodic image summation, and spherical harmonic expansions, ELECTRAFI matches or exceeds state-of-the-art accuracy across periodic benchmarks while being up to $633 \\times$ faster than the strongest competing method, reconstructing crystal charge densities in a fraction of a second. When used to initialize DFT calculations, ELECTRAFI reduces total DFT compute cost by up to ~20%, whereas slower charge density models negate savings due to high inference times. Our results show that accuracy and inference cost jointly determine end-to-end DFT speedups, and motivate our focus on efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 93,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19969",
        "abs_url": "https://arxiv.org/abs/2601.19969",
        "pdf_url": "https://arxiv.org/pdf/2601.19969",
        "title": "E2HiL: Entropy-Guided Sample Selection for Efficient Real-World Human-in-the-Loop Reinforcement Learning",
        "authors": [
            "Haoyuan Deng",
            "Yuanjiang Xue",
            "Haoyang Du",
            "Boyang Zhou",
            "Zhenyu Wu",
            "Ziwei Wang"
        ],
        "comments": "Project page: this https URL",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Human-in-the-loop guidance has emerged as an effective approach for enabling faster convergence in online reinforcement learning (RL) of complex real-world manipulation tasks. However, existing human-in-the-loop RL (HiL-RL) frameworks often suffer from low sample efficiency, requiring substantial human interventions to achieve convergence and thereby leading to high labor costs. To address this, we propose a sample-efficient real-world human-in-the-loop RL framework named \\method, which requires fewer human intervention by actively selecting informative samples. Specifically, stable reduction of policy entropy enables improved trade-off between exploration and exploitation with higher sample efficiency. We first build influence functions of different samples on the policy entropy, which is efficiently estimated by the covariance of action probabilities and soft advantages of policies. Then we select samples with moderate values of influence functions, where shortcut samples that induce sharp entropy drops and noisy samples with negligible effect are pruned. Extensive experiments on four real-world manipulation tasks demonstrate that \\method achieves a 42.1\\% higher success rate while requiring 10.1\\% fewer human interventions compared to the state-of-the-art HiL-RL method, validating its effectiveness. The project page providing code, videos, and mathematical formulations can be found at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 94,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19970",
        "abs_url": "https://arxiv.org/abs/2601.19970",
        "pdf_url": "https://arxiv.org/pdf/2601.19970",
        "title": "Benchmarking LLAMA Model Security Against OWASP Top 10 For LLM Applications",
        "authors": [
            "Nourin Shahin",
            "Izzat Alsmadi"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "As large language models (LLMs) move from research prototypes to enterprise systems, their security vulnerabilities pose serious risks to data privacy and system integrity. This study benchmarks various Llama model variants against the OWASP Top 10 for LLM Applications framework, evaluating threat detection accuracy, response safety, and computational overhead. Using the FABRIC testbed with NVIDIA A30 GPUs, we tested five standard Llama models and five Llama Guard variants on 100 adversarial prompts covering ten vulnerability categories. Our results reveal significant differences in security performance: the compact Llama-Guard-3-1B model achieved the highest detection rate of 76% with minimal latency (0.165s per test), whereas base models such as Llama-3.1-8B failed to detect threats (0% accuracy) despite longer inference times (0.754s). We observe an inverse relationship between model size and security effectiveness, suggesting that smaller, specialized models often outperform larger general-purpose ones in security tasks. Additionally, we provide an open-source benchmark dataset including adversarial prompts, threat labels, and attack metadata to support reproducible research in AI security, [1].",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 95,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.19979",
        "abs_url": "https://arxiv.org/abs/2601.19979",
        "pdf_url": "https://arxiv.org/pdf/2601.19979",
        "title": "Exploring the holographic entropy cone via reinforcement learning",
        "authors": [
            "Temple He",
            "Jaeha Lee",
            "Hirosi Ooguri"
        ],
        "comments": "38 pages, 10 figures, 2 tables",
        "subjects": "High Energy Physics - Theory (hep-th); Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "We develop a reinforcement learning algorithm to study the holographic entropy cone. Given a target entropy vector, our algorithm searches for a graph realization whose min-cut entropies match the target vector. If the target vector does not admit such a graph realization, it must lie outside the cone, in which case the algorithm finds a graph whose corresponding entropy vector most nearly approximates the target and allows us to probe the location of the facets. For the $\\sf N=3$ cone, we confirm that our algorithm successfully rediscovers monogamy of mutual information beginning with a target vector outside the holographic entropy cone. We then apply the algorithm to the $\\sf N=6$ cone, analyzing the 6 \"mystery\" extreme rays of the subadditivity cone from arXiv:2412.15364 that satisfy all known holographic entropy inequalities yet lacked graph realizations. We found realizations for 3 of them, proving they are genuine extreme rays of the holographic entropy cone, while providing evidence that the remaining 3 are not realizable, implying unknown holographic inequalities exist for $\\sf N=6$.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 96,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20034",
        "abs_url": "https://arxiv.org/abs/2601.20034",
        "pdf_url": "https://arxiv.org/pdf/2601.20034",
        "title": "The Sound of Noise: Leveraging the Inductive Bias of Pre-trained Audio Transformers for Glitch Identification in LIGO",
        "authors": [
            "Suyash Deshmukh",
            "Chayan Chatterjee",
            "Abigail Petulante",
            "Tabata Aira Ferreira",
            "Karan Jani"
        ],
        "comments": "",
        "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)",
        "abstract": "Transient noise artifacts, or glitches, fundamentally limit the sensitivity of gravitational-wave (GW) interferometers and can mimic true astrophysical signals, particularly the short-duration intermediate-mass black hole (IMBH) mergers. Current glitch classification methods, such as Gravity Spy, rely on supervised models trained from scratch using labeled datasets. These approaches suffer from a significant ``label bottleneck,\" requiring massive, expertly annotated datasets to achieve high accuracy and often struggling to generalize to new glitch morphologies or exotic GW signals encountered in observing runs. In this work, we present a novel cross-domain framework that treats GW strain data through the lens of audio processing. We utilize the Audio Spectrogram Transformer (AST), a model pre-trained on large-scale audio datasets, and adapt it to the GW domain. Instead of learning time-frequency features from scratch, our method exploits the strong inductive bias inherent in pre-trained audio models, transferring learned representations of natural sound to the characterization of detector noise and GW signals, including IMBHs. We validate this approach by analyzing strain data from the third (O3) and fourth (O4) observing runs of the LIGO detectors. We used t-Distributed Stochastic Neighbor Embedding (t-SNE), an unsupervised clustering technique, to visualize the AST-derived embeddings of signals and glitches, revealing well-separated groups that align closely with independently validated Gravity Spy glitch classes. Our results indicate that the inductive bias from audio pre-training allows superior feature extraction compared to traditional supervised techniques, offering a robust, data-efficient pathway for discovering new, anomalous transients, and classifying complex noise artifacts in the era of next-generation detectors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 97,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20047",
        "abs_url": "https://arxiv.org/abs/2601.20047",
        "pdf_url": "https://arxiv.org/pdf/2601.20047",
        "title": "Minimax Rates for Hyperbolic Hierarchical Learning",
        "authors": [
            "Divit Rawal",
            "Sriram Vishwanath"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We prove an exponential separation in sample complexity between Euclidean and hyperbolic representations for learning on hierarchical data under standard Lipschitz regularization. For depth-$R$ hierarchies with branching factor $m$, we first establish a geometric obstruction for Euclidean space: any bounded-radius embedding forces volumetric collapse, mapping exponentially many tree-distant points to nearby locations. This necessitates Lipschitz constants scaling as $\\exp(\\Omega(R))$ to realize even simple hierarchical targets, yielding exponential sample complexity under capacity control. We then show this obstruction vanishes in hyperbolic space: constant-distortion hyperbolic embeddings admit $O(1)$-Lipschitz realizability, enabling learning with $n = O(mR \\log m)$ samples. A matching $\\Omega(mR \\log m)$ lower bound via Fano's inequality establishes that hyperbolic representations achieve the information-theoretic optimum. We also show a geometry-independent bottleneck: any rank-$k$ prediction space captures only $O(k)$ canonical hierarchical contrasts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 98,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20052",
        "abs_url": "https://arxiv.org/abs/2601.20052",
        "pdf_url": "https://arxiv.org/pdf/2601.20052",
        "title": "Explainable deep learning reveals the physical mechanisms behind the turbulent kinetic energy equation",
        "authors": [
            "Francisco Alcántara-Ávila",
            "Andrés Cremades",
            "Sergio Hoyas",
            "Ricardo Vinuesa"
        ],
        "comments": "6 pages, 5 figures, 1 appendix",
        "subjects": "Fluid Dynamics (physics.flu-dyn); Machine Learning (cs.LG)",
        "abstract": "In this work, we investigate the physical mechanisms governing turbulent kinetic energy transport using explainable deep learning (XDL). An XDL model based on SHapley Additive exPlanations (SHAP) is used to identify and percolate high-importance structures for the evolution of the turbulent kinetic energy budget terms of a turbulent channel flow at a friction Reynolds number of $Re_\\tau = 125$. The results show that the important structures are predominantly located in the near-wall region and are more frequently associated with sweep-type events. In the viscous layer, the SHAP structures relevant for production and viscous diffusion are almost entirely contained within those relevant for dissipation, revealing a clear hierarchical organization of near-wall turbulence. In the outer layer, this hierarchical organization breaks down and only velocity-pressure-gradient correlation and turbulent transport SHAP structures remain, with a moderate spatial coincidence of approximately $60\\%$. Finally, we show that none of the coherent structures classically studied in turbulence are capable of representing the mechanisms behind the various terms of the turbulent kinetic energy budget throughout the channel. These results reveal dissipation as the dominant organizing mechanism of near-wall turbulence, constraining production and viscous diffusion within a single structural hierarchy that breaks down in the outer layer.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 99,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20076",
        "abs_url": "https://arxiv.org/abs/2601.20076",
        "pdf_url": "https://arxiv.org/pdf/2601.20076",
        "title": "Randomized Feasibility Methods for Constrained Optimization with Adaptive Step Sizes",
        "authors": [
            "Abhishek Chakraborty",
            "Angelia Nedić"
        ],
        "comments": "",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG)",
        "abstract": "We consider minimizing an objective function subject to constraints defined by the intersection of lower-level sets of convex functions. We study two cases: (i) strongly convex and Lipschitz-smooth objective function and (ii) convex but possibly nonsmooth objective function. To deal with the constraints that are not easy to project on, we use a randomized feasibility algorithm with Polyak steps and a random number of sampled constraints per iteration, while taking (sub)gradient steps to minimize the objective function. For case (i), we prove linear convergence in expectation of the objective function values to any prescribed tolerance using an adaptive stepsize. For case (ii), we develop a fully problem parameter-free and adaptive stepsize scheme that yields an $O(1/\\sqrt{T})$ worst-case rate in expectation. The infeasibility of the iterates decreases geometrically with the number of feasibility updates almost surely, while for the averaged iterates, we establish an expected lower bound on the function values relative to the optimal value that depends on the distribution for the random number of sampled constraints. For certain choices of sample-size growth, optimal rates are achieved. Finally, simulations on a Quadratically Constrained Quadratic Programming (QCQP) problem and Support Vector Machines (SVM) demonstrate the computational efficiency of our algorithm compared to other state-of-the-art methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 100,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20083",
        "abs_url": "https://arxiv.org/abs/2601.20083",
        "pdf_url": "https://arxiv.org/pdf/2601.20083",
        "title": "LLaTTE: Scaling Laws for Multi-Stage Sequence Modeling in Large-Scale Ads Recommendation",
        "authors": [
            "Lee Xiong",
            "Zhirong Chen",
            "Rahul Mayuranath",
            "Shangran Qiu",
            "Arda Ozdemir",
            "Lu Li",
            "Yang Hu",
            "Dave Li",
            "Jingtao Ren",
            "Howard Cheng",
            "Fabian Souto Herrera",
            "Ahmed Agiza",
            "Baruch Epshtein",
            "Anuj Aggarwal",
            "Julia Ulziisaikhan",
            "Chao Wang",
            "Dinesh Ramasamy",
            "Parshva Doshi",
            "Sri Reddy",
            "Arnold Overwijk"
        ],
        "comments": "Lee Xiong, Zhirong Chen, and Rahul Mayuranath contributed equally to this work",
        "subjects": "Information Retrieval (cs.IR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "We present LLaTTE (LLM-Style Latent Transformers for Temporal Events), a scalable transformer architecture for production ads recommendation. Through systematic experiments, we demonstrate that sequence modeling in recommendation systems follows predictable power-law scaling similar to LLMs. Crucially, we find that semantic features bend the scaling curve: they are a prerequisite for scaling, enabling the model to effectively utilize the capacity of deeper and longer architectures. To realize the benefits of continued scaling under strict latency constraints, we introduce a two-stage architecture that offloads the heavy computation of large, long-context models to an asynchronous upstream user model. We demonstrate that upstream improvements transfer predictably to downstream ranking tasks. Deployed as the largest user model at Meta, this multi-stage framework drives a 4.3\\% conversion uplift on Facebook Feed and Reels with minimal serving overhead, establishing a practical blueprint for harnessing scaling laws in industrial recommender systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 101,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20126",
        "abs_url": "https://arxiv.org/abs/2601.20126",
        "pdf_url": "https://arxiv.org/pdf/2601.20126",
        "title": "Rewarding Intellectual Humility Learning When Not To Answer In Large Language Models",
        "authors": [
            "Abha Jha",
            "Akanksha Mahajan",
            "Ashwath Vaithinathan Aravindan",
            "Praveen Saravanan",
            "Sai Sailaja Policharla",
            "Sonal Chaturbhuj Gehlot"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) often produce hallucinated or unverifiable content, undermining their reliability in factual domains. This work investigates Reinforcement Learning with Verifiable Rewards (RLVR) as a training paradigm that explicitly rewards abstention (\"I don't know\") alongside correctness to promote intellectual humility. We fine-tune and evaluate Granite-3.3-2B-Instruct and Qwen-3-4B-Instruct on the MedMCQA and Hendrycks Math benchmarks using a ternary reward structure ($-1$, r_abs, 1) under varying abstention reward structures. We further study the effect of combining RLVR with supervised fine-tuning strategies that teach abstention prior to reinforcement learning. Our results show that moderate abstention rewards (r_abs $\\approx -0.25$ to 0.3) consistently reduce incorrect responses without severe accuracy degradation on multiple-choice tasks, with larger models exhibiting greater robustness to abstention incentives. On open-ended question answering, we observe limitations due to insufficient exploration, which can be partially mitigated through supervised abstention training. Overall, these findings demonstrate the feasibility and flexibility of verifiable reward design as a practical approach for hallucination mitigation in language models. Reproducible code for our abstention training framework is available here this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 102,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20148",
        "abs_url": "https://arxiv.org/abs/2601.20148",
        "pdf_url": "https://arxiv.org/pdf/2601.20148",
        "title": "LogSieve: Task-Aware CI Log Reduction for Sustainable LLM-Based Analysis",
        "authors": [
            "Marcus Emmanuel Barnes",
            "Taher A. Ghaleb",
            "Safwat Hassan"
        ],
        "comments": "Preprint. Accepted for presentation at Mining Software Repositories (MSR'26), co-located ICSE 2026. The final version will appear in the ACM Digital Library as part of the MSR'26 conference proceedings",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Logs are essential for understanding Continuous Integration (CI) behavior, particularly for diagnosing build failures and performance regressions. Yet their growing volume and verbosity make both manual inspection and automated analysis increasingly costly, time-consuming, and environmentally costly. While prior work has explored log compression, anomaly detection, and LLM-based log analysis, most efforts target structured system logs rather than the unstructured, noisy, and verbose logs typical of CI workflows. We present LogSieve, a lightweight, RCA-aware and semantics-preserving log reduction technique that filters low-information lines while retaining content relevant to downstream reasoning. Evaluated on CI logs from 20 open-source Android projects using GitHub Actions, LogSieve achieves an average 42% reduction in lines and 40% reduction in tokens with minimal semantic loss. This pre-inference reduction lowers computational cost and can proportionally reduce energy use (and associated emissions) by decreasing the volume of data processed during LLM inference. Compared with structure-first baselines (LogZip and random-line removal), LogSieve preserves much higher semantic and categorical fidelity (Cosine = 0.93, GPTScore = 0.93, 80% exact-match accuracy). Embedding-based classifiers automate relevance detection with near-human accuracy (97%), enabling scalable and sustainable integration of semantics-aware filtering into CI workflows. LogSieve thus bridges log management and LLM reasoning, offering a practical path toward greener and more interpretable CI automation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 103,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20197",
        "abs_url": "https://arxiv.org/abs/2601.20197",
        "pdf_url": "https://arxiv.org/pdf/2601.20197",
        "title": "Bias-Reduced Estimation of Finite Mixtures: An Application to Latent Group Structures in Panel Data",
        "authors": [
            "Raphaël Langevin"
        ],
        "comments": "",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG); Econometrics (econ.EM); Computation (stat.CO)",
        "abstract": "Finite mixture models are widely used in econometric analyses to capture unobserved heterogeneity. This paper shows that maximum likelihood estimation of finite mixtures of parametric densities can suffer from substantial finite-sample bias in all parameters under mild regularity conditions. The bias arises from the influence of outliers in component densities with unbounded or large support and increases with the degree of overlap among mixture components. I show that maximizing the classification-mixture likelihood function, equipped with a consistent classifier, yields parameter estimates that are less biased than those obtained by standard maximum likelihood estimation (MLE). I then derive the asymptotic distribution of the resulting estimator and provide conditions under which oracle efficiency is achieved. Monte Carlo simulations show that conventional mixture MLE exhibits pronounced finite-sample bias, which diminishes as the sample size or the statistical distance between component densities tends to infinity. The simulations further show that the proposed estimation strategy generally outperforms standard MLE in finite samples in terms of both bias and mean squared errors under relatively weak assumptions. An empirical application to latent group panel structures using health administrative data shows that the proposed approach reduces out-of-sample prediction error by approximately 17.6% relative to the best results obtained from standard MLE procedures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 104,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20228",
        "abs_url": "https://arxiv.org/abs/2601.20228",
        "pdf_url": "https://arxiv.org/pdf/2601.20228",
        "title": "Quantum statistics from classical simulations via generative Gibbs sampling",
        "authors": [
            "Weizhou Wang",
            "Xuanxi Zhang",
            "Jonathan Weare",
            "Aaron R. Dinner"
        ],
        "comments": "12 pages, 9 figures",
        "subjects": "Chemical Physics (physics.chem-ph); Statistical Mechanics (cond-mat.stat-mech); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "Accurate simulation of nuclear quantum effects is essential for molecular modeling but expensive using path integral molecular dynamics (PIMD). We present GG-PI, a ring-polymer-based framework that combines generative modeling of the single-bead conditional density with Gibbs sampling to recover quantum statistics from classical simulation data. GG-PI uses inexpensive standard classical simulations or existing data for training and allows transfer across temperatures without retraining. On standard test systems, GG-PI significantly reduces wall clock time compared to PIMD. Our approach extends easily to a wide range of problems with similar Markov structure.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 105,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20229",
        "abs_url": "https://arxiv.org/abs/2601.20229",
        "pdf_url": "https://arxiv.org/pdf/2601.20229",
        "title": "Proactive SFC Provisioning with Forecast-Driven DRL in Data Centers",
        "authors": [
            "Parisa Fard Moshiri",
            "Poonam Lohan",
            "Burak Kantarci",
            "Emil Janulewicz"
        ],
        "comments": "6 pages, 3 figures, Accepted to IEEE International Conference on Communications (ICC) 2026",
        "subjects": "Networking and Internet Architecture (cs.NI); Machine Learning (cs.LG)",
        "abstract": "Service Function Chaining (SFC) requires efficient placement of Virtual Network Functions (VNFs) to satisfy diverse service requirements while maintaining high resource utilization in Data Centers (DCs). Conventional static resource allocation often leads to overprovisioning or underprovisioning due to the dynamic nature of traffic loads and application demands. To address this challenge, we propose a hybrid forecast-driven Deep reinforcement learning (DRL) framework that combines predictive intelligence with SFC provisioning. Specifically, we leverage DRL to generate datasets capturing DC resource utilization and service demands, which are then used to train deep learning forecasting models. Using Optuna-based hyperparameter optimization, the best-performing models, Spatio-Temporal Graph Neural Network, Temporal Graph Neural Network, and Long Short-Term Memory, are combined into an ensemble to enhance stability and accuracy. The ensemble predictions are integrated into the DC selection process, enabling proactive placement decisions that consider both current and future resource availability. Experimental results demonstrate that the proposed method not only sustains high acceptance ratios for resource-intensive services such as Cloud Gaming and VoIP but also significantly improves acceptance ratios for latency-critical categories such as Augmented Reality increases from 30% to 50%, while Industry 4.0 improves from 30% to 45%. Consequently, the prediction-based model achieves significantly lower E2E latencies of 20.5%, 23.8%, and 34.8% reductions for VoIP, Video Streaming, and Cloud Gaming, respectively. This strategy ensures more balanced resource allocation, and reduces contention.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 106,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20251",
        "abs_url": "https://arxiv.org/abs/2601.20251",
        "pdf_url": "https://arxiv.org/pdf/2601.20251",
        "title": "Efficient Evaluation of LLM Performance with Statistical Guarantees",
        "authors": [
            "Skyler Wu",
            "Yash Nair",
            "Emmanuel J. Candés"
        ],
        "comments": "24 pages, 10 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Exhaustively evaluating many large language models (LLMs) on a large suite of benchmarks is expensive. We cast benchmarking as finite-population inference and, under a fixed query budget, seek tight confidence intervals (CIs) for model accuracy with valid frequentist coverage. We propose Factorized Active Querying (FAQ), which (a) leverages historical information through a Bayesian factor model; (b) adaptively selects questions using a hybrid variance-reduction/active-learning sampling policy; and (c) maintains validity through Proactive Active Inference -- a finite-population extension of active inference (Zrnic & Candes, 2024) that enables direct question selection while preserving coverage. With negligible overhead cost, FAQ delivers up to $5\\times$ effective sample size gains over strong baselines on two benchmark suites, across varying historical-data missingness levels: this means that it matches the CI width of uniform sampling while using up to $5\\times$ fewer queries. We release our source code and our curated datasets to support reproducible evaluation and future research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 107,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20269",
        "abs_url": "https://arxiv.org/abs/2601.20269",
        "pdf_url": "https://arxiv.org/pdf/2601.20269",
        "title": "Empirical Likelihood-Based Fairness Auditing: Distribution-Free Certification and Flagging",
        "authors": [
            "Jie Tang",
            "Chuanlong Xie",
            "Xianli Zeng",
            "Lixing Zhu"
        ],
        "comments": "55 pages, 9 figures; Code available at: this https URL Author list is in alphabetical order by last names",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "Machine learning models in high-stakes applications, such as recidivism prediction and automated personnel selection, often exhibit systematic performance disparities across sensitive subpopulations, raising critical concerns regarding algorithmic bias. Fairness auditing addresses these risks through two primary functions: certification, which verifies adherence to fairness constraints; and flagging, which isolates specific demographic groups experiencing disparate treatment. However, existing auditing techniques are frequently limited by restrictive distributional assumptions or prohibitive computational overhead. We propose a novel empirical likelihood-based (EL) framework that constructs robust statistical measures for model performance disparities. Unlike traditional methods, our approach is non-parametric; the proposed disparity statistics follow asymptotically chi-square or mixed chi-square distributions, ensuring valid inference without assuming underlying data distributions. This framework uses a constrained optimization profile that admits stable numerical solutions, facilitating both large-scale certification and efficient subpopulation discovery. Empirically, the EL methods outperform bootstrap-based approaches, yielding coverage rates closer to nominal levels while reducing computational latency by several orders of magnitude. We demonstrate the practical utility of this framework on the COMPAS dataset, where it successfully flags intersectional biases, specifically identifying a significantly higher positive prediction rate for African-American males under 25 and a systemic under-prediction for Caucasian females relative to the population mean.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 108,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20283",
        "abs_url": "https://arxiv.org/abs/2601.20283",
        "pdf_url": "https://arxiv.org/pdf/2601.20283",
        "title": "One Word is Enough: Minimal Adversarial Perturbations for Neural Text Ranking",
        "authors": [
            "Tanmay Karmakar",
            "Sourav Saha",
            "Debapriyo Majumdar",
            "Surjyanee Halder"
        ],
        "comments": "To appear at ECIR 2026",
        "subjects": "Information Retrieval (cs.IR); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Neural ranking models (NRMs) achieve strong retrieval effectiveness, yet prior work has shown they are vulnerable to adversarial perturbations. We revisit this robustness question with a minimal, query-aware attack that promotes a target document by inserting or substituting a single, semantically aligned word - the query center. We study heuristic and gradient-guided variants, including a white-box method that identifies influential insertion points. On TREC-DL 2019/2020 with BERT and monoT5 re-rankers, our single-word attacks achieve up to 91% success while modifying fewer than two tokens per document on average, achieving competitive rank and score boosts with far fewer edits under a comparable white-box setup to ensure fair evaluation against PRADA. We also introduce new diagnostic metrics to analyze attack sensitivity beyond aggregate success rates. Our analysis reveals a Goldilocks zone in which mid-ranked documents are most vulnerable. These findings demonstrate practical risks and motivate future defenses for robust neural ranking.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 109,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20309",
        "abs_url": "https://arxiv.org/abs/2601.20309",
        "pdf_url": "https://arxiv.org/pdf/2601.20309",
        "title": "SuperInfer: SLO-Aware Rotary Scheduling and Memory Management for LLM Inference on Superchips",
        "authors": [
            "Jiahuan Yu",
            "Mingtao Hu",
            "Zichao Lin",
            "Minjia Zhang"
        ],
        "comments": "Accepted by MLSys '26",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large Language Model (LLM) serving faces a fundamental tension between stringent latency Service Level Objectives (SLOs) and limited GPU memory capacity. When high request rates exhaust the KV cache budget, existing LLM inference systems often suffer severe head-of-line (HOL) blocking. While prior work explored PCIe-based offloading, these approaches cannot sustain responsiveness under high request rates, often failing to meet tight Time-To-First-Token (TTFT) and Time-Between-Tokens (TBT) SLOs. We present SuperInfer, a high-performance LLM inference system designed for emerging Superchips (e.g., NVIDIA GH200) with tightly coupled GPU-CPU architecture via NVLink-C2C. SuperInfer introduces RotaSched, the first proactive, SLO-aware rotary scheduler that rotates requests to maintain responsiveness on Superchips, and DuplexKV, an optimized rotation engine that enables full-duplex transfer over NVLink-C2C. Evaluations on GH200 using various models and datasets show that SuperInfer improves TTFT SLO attainment rates by up to 74.7% while maintaining comparable TBT and throughput compared to state-of-the-art systems, demonstrating that SLO-aware scheduling and memory co-design unlocks the full potential of Superchips for responsive LLM serving.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 110,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20316",
        "abs_url": "https://arxiv.org/abs/2601.20316",
        "pdf_url": "https://arxiv.org/pdf/2601.20316",
        "title": "Less is More: Benchmarking LLM Based Recommendation Agents",
        "authors": [
            "Kargi Chauhan",
            "Mahalakshmi Venkateswarlu"
        ],
        "comments": "",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) are increasingly deployed for personalized product recommendations, with practitioners commonly assuming that longer user purchase histories lead to better predictions. We challenge this assumption through a systematic benchmark of four state of the art LLMs GPT-4o-mini, DeepSeek-V3, Qwen2.5-72B, and Gemini 2.5 Flash across context lengths ranging from 5 to 50 items using the REGEN dataset. Surprisingly, our experiments with 50 users in a within subject design reveal no significant quality improvement with increased context length. Quality scores remain flat across all conditions (0.17--0.23). Our findings have significant practical implications: practitioners can reduce inference costs by approximately 88\\% by using context (5--10 items) instead of longer histories (50 items), without sacrificing recommendation quality. We also analyze latency patterns across providers and find model specific behaviors that inform deployment decisions. This work challenges the existing ``more context is better'' paradigm and provides actionable guidelines for cost effective LLM based recommendation systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 111,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20330",
        "abs_url": "https://arxiv.org/abs/2601.20330",
        "pdf_url": "https://arxiv.org/pdf/2601.20330",
        "title": "PsychePass: Calibrating LLM Therapeutic Competence via Trajectory-Anchored Tournaments",
        "authors": [
            "Zhuang Chen",
            "Dazhen Wan",
            "Zhangkai Zheng",
            "Guanqun Bi",
            "Xiyao Xiao",
            "Binghang Li",
            "Minlie Huang"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "While large language models show promise in mental healthcare, evaluating their therapeutic competence remains challenging due to the unstructured and longitudinal nature of counseling. We argue that current evaluation paradigms suffer from an unanchored defect, leading to two forms of instability: process drift, where unsteered client simulation wanders away from specific counseling goals, and standard drift, where static pointwise scoring lacks the stability for reliable judgment. To address this, we introduce Ps, a unified framework that calibrates the therapeutic competence of LLMs via trajectory-anchored tournaments. We first anchor the interaction trajectory in simulation, where clients precisely control the fluid consultation process to probe multifaceted capabilities. We then anchor the battle trajectory in judgments through an efficient Swiss-system tournament, utilizing dynamic pairwise battles to yield robust Elo ratings. Beyond ranking, we demonstrate that tournament trajectories can be transformed into credible reward signals, enabling on-policy reinforcement learning to enhance LLMs' performance. Extensive experiments validate the effectiveness of PsychePass and its strong consistency with human expert judgments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 112,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20334",
        "abs_url": "https://arxiv.org/abs/2601.20334",
        "pdf_url": "https://arxiv.org/pdf/2601.20334",
        "title": "Demonstration-Free Robotic Control via LLM Agents",
        "authors": [
            "Brian Y. Tsui",
            "Alan Y. Fang",
            "Tiffany J. Hwu"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Robotic manipulation has increasingly adopted vision-language-action (VLA) models, which achieve strong performance but typically require task-specific demonstrations and fine-tuning, and often generalize poorly under domain shift. We investigate whether general-purpose large language model (LLM) agent frameworks, originally developed for software engineering, can serve as an alternative control paradigm for embodied manipulation. We introduce FAEA (Frontier Agent as Embodied Agent), which applies an LLM agent framework directly to embodied manipulation without modification. Using the same iterative reasoning that enables software agents to debug code, FAEA enables embodied agents to reason through manipulation strategies. We evaluate an unmodified frontier agent, Claude Agent SDK, across the LIBERO, ManiSkill3, and MetaWorld benchmarks. With privileged environment state access, FAEA achieves success rates of 84.9%, 85.7%, and 96%, respectively. This level of task success approaches that of VLA models trained with less than 100 demonstrations per task, without requiring demonstrations or fine-tuning. With one round of human feedback as an optional optimization, performance increases to 88.2% on LIBERO. This demonstration-free capability has immediate practical value: FAEA can autonomously explore novel scenarios in simulation and generate successful trajectories for training data augmentation in embodied learning. Our results indicate that general-purpose agents are sufficient for a class of manipulation tasks dominated by deliberative, task-level planning. This opens a path for robotics systems to leverage actively maintained agent infrastructure and benefit directly from ongoing advances in frontier models. Code is available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 113,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20336",
        "abs_url": "https://arxiv.org/abs/2601.20336",
        "pdf_url": "https://arxiv.org/pdf/2601.20336",
        "title": "Do Whitepaper Claims Predict Market Behavior? Evidence from Cryptocurrency Factor Analysis",
        "authors": [
            "Murad Farzulla"
        ],
        "comments": "35 pages, 8 figures, 10 tables. Code available at this https URL",
        "subjects": "Computational Finance (q-fin.CP); Machine Learning (cs.LG)",
        "abstract": "Cryptocurrency projects articulate value propositions through whitepapers, making claims about functionality and technical capabilities. This study investigates whether these narratives align with observed market behavior. We construct a pipeline combining zero-shot NLP classification (BART-MNLI) with CP tensor decomposition to compare three spaces: (1) a claims matrix from 24 whitepapers across 10 semantic categories, (2) market statistics for 49 assets over two years of hourly data, and (3) latent factors from tensor decomposition (rank 2, 92.45% variance explained). Using Procrustes rotation and Tucker's congruence coefficient, we test alignment across 23 common entities. Results show weak alignment: claims-statistics (phi=0.341, p=0.332), claims-factors (phi=0.077, p=0.747), and statistics-factors (phi=0.197, p<0.001). The statistics-factors significance validates our methodology, confirming the pipeline detects relationships when present. Inter-model validation with DeBERTa-v3 yields 32% exact agreement but 67% top-3 agreement. Cross-sectional analysis reveals heterogeneous contributions: NEAR, MKR, ATOM show positive alignment while ENS, UNI, Bitcoin diverge most. Excluding Bitcoin confirms results are not driven by market dominance. We interpret findings as weak alignment between whitepaper narratives and market factor structure. Limited power (n=23) precludes distinguishing weak from no alignment, but strong alignment (phi>=0.70) can be confidently rejected. Implications for narrative economics and investment analysis are discussed.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 114,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20339",
        "abs_url": "https://arxiv.org/abs/2601.20339",
        "pdf_url": "https://arxiv.org/pdf/2601.20339",
        "title": "Improving Diffusion Language Model Decoding through Joint Search in Generation Order and Token Space",
        "authors": [
            "Yangyi Shen",
            "Tianjian Feng",
            "Jiaqi Han",
            "Wen Wang",
            "Tianlang Chen",
            "Chunhua Shen",
            "Jure Leskovec",
            "Stefano Ermon"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Diffusion Language Models (DLMs) offer order-agnostic generation that can explore many possible decoding trajectories. However, current decoding methods commit to a single trajectory, limiting exploration in trajectory space. We introduce Order-Token Search to explore this space through jointly searching over generation order and token values. Its core is a likelihood estimator that scores denoising actions, enabling stable pruning and efficient exploration of diverse trajectories. Across mathematical reasoning and coding benchmarks, Order-Token Search consistently outperforms baselines on GSM8K, MATH500, Countdown, and HumanEval (3.1%, 3.8%, 7.9%, and 6.8% absolute over backbone), matching or surpassing diffu-GRPO post-trained d1-LLaDA. Our work establishes joint search as a key component for advancing decoding in DLMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 115,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20389",
        "abs_url": "https://arxiv.org/abs/2601.20389",
        "pdf_url": "https://arxiv.org/pdf/2601.20389",
        "title": "Graph-Structured Deep Learning Framework for Multi-task Contention Identification with High-dimensional Metrics",
        "authors": [
            "Xiao Yang",
            "Yinan Ni",
            "Yuqi Tang",
            "Zhimin Qiu",
            "Chen Wang",
            "Tingzhou Yuan"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "This study addresses the challenge of accurately identifying multi-task contention types in high-dimensional system environments and proposes a unified contention classification framework that integrates representation transformation, structural modeling, and a task decoupling mechanism. The method first constructs system state representations from high-dimensional metric sequences, applies nonlinear transformations to extract cross-dimensional dynamic features, and integrates multiple source information such as resource utilization, scheduling behavior, and task load variations within a shared representation space. It then introduces a graph-based modeling mechanism to capture latent dependencies among metrics, allowing the model to learn competitive propagation patterns and structural interference across resource links. On this basis, task-specific mapping structures are designed to model the differences among contention types and enhance the classifier's ability to distinguish multiple contention patterns. To achieve stable performance, the method employs an adaptive multi-task loss weighting strategy that balances shared feature learning with task-specific feature extraction and generates final contention predictions through a standardized inference process. Experiments conducted on a public system trace dataset demonstrate advantages in accuracy, recall, precision, and F1, and sensitivity analyses on batch size, training sample scale, and metric dimensionality further confirm the model's stability and applicability. The study shows that structured representations and multi-task classification based on high-dimensional metrics can significantly improve contention pattern recognition and offer a reliable technical approach for performance management in complex computing environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 116,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20399",
        "abs_url": "https://arxiv.org/abs/2601.20399",
        "pdf_url": "https://arxiv.org/pdf/2601.20399",
        "title": "Convergence Analysis of Randomized Subspace Normalized SGD under Heavy-Tailed Noise",
        "authors": [
            "Gaku Omiya",
            "Pierre-Louis Poirion",
            "Akiko Takeda"
        ],
        "comments": "41 pages",
        "subjects": "Optimization and Control (math.OC); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Randomized subspace methods reduce per-iteration cost; however, in nonconvex optimization, most analyses are expectation-based, and high-probability bounds remain scarce even under sub-Gaussian noise. We first prove that randomized subspace SGD (RS-SGD) admits a high-probability convergence bound under sub-Gaussian noise, achieving the same order of oracle complexity as prior in-expectation results. Motivated by the prevalence of heavy-tailed gradients in modern machine learning, we then propose randomized subspace normalized SGD (RS-NSGD), which integrates direction normalization into subspace updates. Assuming the noise has bounded $p$-th moments, we establish both in-expectation and high-probability convergence guarantees, and show that RS-NSGD can achieve better oracle complexity than full-dimensional normalized SGD.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 117,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20496",
        "abs_url": "https://arxiv.org/abs/2601.20496",
        "pdf_url": "https://arxiv.org/pdf/2601.20496",
        "title": "Physics-informed Blind Reconstruction of Dense Fields from Sparse Measurements using Neural Networks with a Differentiable Simulator",
        "authors": [
            "Ofek Aloni",
            "Barak Fishbain"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Generating dense physical fields from sparse measurements is a fundamental question in sampling, signal processing, and many other applications. State-of-the-art methods either use spatial statistics or rely on examples of dense fields in the training phase, which often are not available, and thus rely on synthetic data. Here, we present a reconstruction method that generates dense fields from sparse measurements, without assuming availability of the spatial statistics, nor of examples of the dense fields. This is made possible through the introduction of an automatically differentiable numerical simulator into the training phase of the method. The method is shown to have superior results over statistical and neural network based methods on a set of three standard problems from fluid mechanics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 118,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20533",
        "abs_url": "https://arxiv.org/abs/2601.20533",
        "pdf_url": "https://arxiv.org/pdf/2601.20533",
        "title": "Incorporating data drift to perform survival analysis on credit risk",
        "authors": [
            "Jianwei Peng",
            "Stefan Lessmann"
        ],
        "comments": "27 pages, 2 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Risk Management (q-fin.RM)",
        "abstract": "Survival analysis has become a standard approach for modelling time to default by time-varying covariates in credit risk. Unlike most existing methods that implicitly assume a stationary data-generating process, in practise, mortgage portfolios are exposed to various forms of data drift caused by changing borrower behaviour, macroeconomic conditions, policy regimes and so on. This study investigates the impact of data drift on survival-based credit risk models and proposes a dynamic joint modelling framework to improve robustness under non-stationary environments. The proposed model integrates a longitudinal behavioural marker derived from balance dynamics with a discrete-time hazard formulation, combined with landmark one-hot encoding and isotonic calibration. Three types of data drift (sudden, incremental and recurring) are simulated and analysed on mortgage loan datasets from Freddie Mac. Experiments and corresponding evidence show that the proposed landmark-based joint model consistently outperforms classical survival models, tree-based drift-adaptive learners and gradient boosting methods in terms of discrimination and calibration across all drift scenarios, which confirms the superiority of our model design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 119,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20589",
        "abs_url": "https://arxiv.org/abs/2601.20589",
        "pdf_url": "https://arxiv.org/pdf/2601.20589",
        "title": "Exact Graph Learning via Integer Programming",
        "authors": [
            "Lucas Kook",
            "Søren Wengel Mogensen"
        ],
        "comments": "",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG)",
        "abstract": "Learning the dependence structure among variables in complex systems is a central problem across medical, natural, and social sciences. These structures can be naturally represented by graphs, and the task of inferring such graphs from data is known as graph learning or as causal discovery if the graphs are given a causal interpretation. Existing approaches typically rely on restrictive assumptions about the data-generating process, employ greedy oracle algorithms, or solve approximate formulations of the graph learning problem. As a result, they are either sensitive to violations of central assumptions or fail to guarantee globally optimal solutions. We address these limitations by introducing a nonparametric graph learning framework based on nonparametric conditional independence testing and integer programming. We reformulate the graph learning problem as an integer-programming problem and prove that solving the integer-programming problem provides a globally optimal solution to the original graph learning problem. Our method leverages efficient encodings of graphical separation criteria, enabling the exact recovery of larger graphs than was previously feasible. We provide an implementation in the openly available R package 'glip' which supports learning (acyclic) directed (mixed) graphs and chain graphs. From the resulting output one can compute representations of the corresponding Markov equivalence classes or weak equivalence classes. Empirically, we demonstrate that our approach is faster than other existing exact graph learning procedures for a large fraction of instances and graphs of various sizes. GLIP also achieves state-of-the-art performance on simulated data and benchmark datasets across all aforementioned classes of graphs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 120,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20626",
        "abs_url": "https://arxiv.org/abs/2601.20626",
        "pdf_url": "https://arxiv.org/pdf/2601.20626",
        "title": "Trigger Optimization and Event Classification for Dark Matter Searches in the CYGNO Experiment Using Machine Learning",
        "authors": [
            "F. D. Amaro",
            "R. Antonietti",
            "E. Baracchini",
            "L. Benussi",
            "C. Capoccia",
            "M. Caponero",
            "L. G. M. de Carvalho",
            "G. Cavoto",
            "I. A. Costa",
            "A. Croce",
            "M. D'Astolfo",
            "G. D'Imperio",
            "G. Dho",
            "E. Di Marco",
            "J. M. F. dos Santos",
            "D. Fiorina",
            "F. Iacoangeli",
            "Z. Islam",
            "E. Kemp",
            "H. P. Lima Jr",
            "G. Maccarrone",
            "R. D. P. Mano",
            "D. J. G. Marques",
            "G. Mazzitelli",
            "P. Meloni",
            "A. Messina",
            "C. M. B. Monteiro",
            "R. A. Nobrega",
            "G. M. Oppedisano",
            "I. F. Pains",
            "E. Paoletti",
            "F. Petrucci",
            "S. Piacentini",
            "D. Pierluigi",
            "D. Pinci",
            "F. Renga",
            "A. Russo",
            "G. Saviano",
            "P. A. O. C. Silva",
            "N. J. Spooner",
            "R. Tesauro",
            "S. Tomassini",
            "D. Tozzi"
        ],
        "comments": "6 pages, 1 figure, 14th Young Researcher Meeting (YRM 2025)",
        "subjects": "Instrumentation and Detectors (physics.ins-det); Machine Learning (cs.LG); Data Analysis, Statistics and Probability (physics.data-an)",
        "abstract": "The CYGNO experiment employs an optical-readout Time Projection Chamber (TPC) to search for rare low-energy interactions using finely resolved scintillation images. While the optical readout provides rich topological information, it produces large, sparse megapixel images that challenge real-time triggering, data reduction, and background discrimination. We summarize two complementary machine-learning approaches developed within CYGNO. First, we present a fast and fully unsupervised strategy for online data reduction based on reconstruction-based anomaly detection. A convolutional autoencoder trained exclusively on pedestal images (i.e. frames acquired with GEM amplification disabled) learns the detector noise morphology and highlights particle-induced structures through localized reconstruction residuals, from which compact Regions of Interest (ROIs) are extracted. On real prototype data, the selected configuration retains (93.0 +/- 0.2)% of reconstructed signal intensity while discarding (97.8 +/- 0.1)% of the image area, with ~25 ms per-frame inference time on a consumer GPU. Second, we report a weakly supervised application of the Classification Without Labels (CWoLa) framework to data acquired with an Americium--Beryllium neutron source. Using only mixed AmBe and standard datasets (no event-level labels), a convolutional classifier learns to identify nuclear-recoil-like topologies. The achieved performance approaches the theoretical limit imposed by the mixture composition and isolates a high-score population with compact, approximately circular morphologies consistent with nuclear recoils.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 121,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20628",
        "abs_url": "https://arxiv.org/abs/2601.20628",
        "pdf_url": "https://arxiv.org/pdf/2601.20628",
        "title": "Sparse clustering via the Deterministic Information Bottleneck algorithm",
        "authors": [
            "Efthymios Costa",
            "Ioanna Papatsouma",
            "Angelos Markos"
        ],
        "comments": "Submitted to IFCS 2026 (8 pages total)",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Cluster analysis relates to the task of assigning objects into groups which ideally present some desirable characteristics. When a cluster structure is confined to a subset of the feature space, traditional clustering techniques face unprecedented challenges. We present an information-theoretic framework that overcomes the problems associated with sparse data, allowing for joint feature weighting and clustering. Our proposal constitutes a competitive alternative to existing clustering algorithms for sparse data, as demonstrated through simulations on synthetic data. The effectiveness of our method is established by an application on a real-world genomics data set.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 122,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20708",
        "abs_url": "https://arxiv.org/abs/2601.20708",
        "pdf_url": "https://arxiv.org/pdf/2601.20708",
        "title": "A scalable flow-based approach to mitigate topological freezing",
        "authors": [
            "Claudio Bonanno",
            "Andrea Bulgarelli",
            "Elia Cellini",
            "Alessandro Nada",
            "Dario Panfalone",
            "Davide Vadacchino",
            "Lorenzo Verzichelli"
        ],
        "comments": "1+9 pages, 3 figures, contribution to the 42nd International Symposium on Lattice Field Theory (Lattice 2025), 2-8 November 2025, Mumbai, India",
        "subjects": "High Energy Physics - Lattice (hep-lat); Statistical Mechanics (cond-mat.stat-mech); Machine Learning (cs.LG); High Energy Physics - Phenomenology (hep-ph)",
        "abstract": "As lattice gauge theories with non-trivial topological features are driven towards the continuum limit, standard Markov Chain Monte Carlo simulations suffer for topological freezing, i.e., a dramatic growth of autocorrelations in topological observables. A widely used strategy is the adoption of Open Boundary Conditions (OBC), which restores ergodic sampling of topology but at the price of breaking translation invariance and introducing unphysical boundary artifacts. In this contribution we summarize a scalable, exact flow-based strategy to remove them by transporting configurations from a prior with a OBC defect to a fully periodic ensemble, and apply it to 4d SU(3) Yang--Mills theory. The method is based on a Stochastic Normalizing Flow (SNF) that alternates non-equilibrium Monte Carlo updates with localized, gauge-equivariant defect coupling layers implemented via masked parametric stout smearing. Training is performed by minimizing the average dissipated work, equivalent to a Kullback--Leibler divergence between forward and reverse non-equilibrium path measures, to achieve more reversible trajectories and improved efficiency. We discuss the scaling with the number of degrees of freedom affected by the defect and show that defect SNFs achieve better performances than purely stochastic non-equilibrium methods at comparable cost. Finally, we validate the approach by reproducing reference results for the topological susceptibility.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 123,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20769",
        "abs_url": "https://arxiv.org/abs/2601.20769",
        "pdf_url": "https://arxiv.org/pdf/2601.20769",
        "title": "Leveraging Second-Order Curvature for Efficient Learned Image Compression: Theory and Empirical Evidence",
        "authors": [
            "Yichi Zhang",
            "Fengqing Zhu"
        ],
        "comments": "",
        "subjects": "Image and Video Processing (eess.IV); Machine Learning (cs.LG)",
        "abstract": "Training learned image compression (LIC) models entails navigating a challenging optimization landscape defined by the fundamental trade-off between rate and distortion. Standard first-order optimizers, such as SGD and Adam, struggle with \\emph{gradient conflicts} arising from competing objectives, leading to slow convergence and suboptimal rate-distortion performance. In this work, we demonstrate that a simple utilization of a second-order quasi-Newton optimizer, \\textbf{SOAP}, dramatically improves both training efficiency and final performance across diverse LICs. Our theoretical and empirical analyses reveal that Newton preconditioning inherently resolves the intra-step and inter-step update conflicts intrinsic to the R-D objective, facilitating faster, more stable convergence. Beyond acceleration, we uncover a critical deployability benefit: second-order trained models exhibit significantly fewer activation and latent outliers. This substantially enhances robustness to post-training quantization. Together, these results establish second-order optimization, achievable as a seamless drop-in replacement of the imported optimizer, as a powerful, practical tool for advancing the efficiency and real-world readiness of LICs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 124,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20771",
        "abs_url": "https://arxiv.org/abs/2601.20771",
        "pdf_url": "https://arxiv.org/pdf/2601.20771",
        "title": "Cross-Country Learning for National Infectious Disease Forecasting Using European Data",
        "authors": [
            "Zacharias Komodromos",
            "Kleanthis Malialis",
            "Artemis Kontou",
            "Panayiotis Kolios"
        ],
        "comments": "7 pages, 4 figures, 5 tables",
        "subjects": "Populations and Evolution (q-bio.PE); Machine Learning (cs.LG)",
        "abstract": "Accurate forecasting of infectious disease incidence is critical for public health planning and timely intervention. While most data-driven forecasting approaches rely primarily on historical data from a single country, such data are often limited in length and variability, restricting the performance of machine learning (ML) models. In this work, we investigate a cross-country learning approach for infectious disease forecasting, in which a single model is trained on time series data from multiple countries and evaluated on a country of interest. This setting enables the model to exploit shared epidemic dynamics across countries and to benefit from an enlarged training set. We examine this approach through a case study on COVID-19 case forecasting in Cyprus, using surveillance data from European countries. We evaluate multiple ML models and analyse the impact of the lookback window length and cross-country `data augmentation' on multi-step forecasting performance. Our results show that incorporating data from other countries can lead to consistent improvements over models trained solely on national data. Although the empirical focus is on Cyprus and COVID-19, the proposed framework and findings are applicable to infectious disease forecasting more broadly, particularly in settings with limited national historical data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 125,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20782",
        "abs_url": "https://arxiv.org/abs/2601.20782",
        "pdf_url": "https://arxiv.org/pdf/2601.20782",
        "title": "Neural Quantum States in Mixed Precision",
        "authors": [
            "Massimo Solinas",
            "Agnes Valenti",
            "Nawaf Bou-Rabee",
            "Roeland Wiersema"
        ],
        "comments": "22 pages, 12 figures",
        "subjects": "Quantum Physics (quant-ph); Strongly Correlated Electrons (cond-mat.str-el); Machine Learning (cs.LG)",
        "abstract": "Scientific computing has long relied on double precision (64-bit floating point) arithmetic to guarantee accuracy in simulations of real-world phenomena. However, the growing availability of hardware accelerators such as Graphics Processing Units (GPUs) has made low-precision formats attractive due to their superior performance, reduced memory footprint, and improved energy efficiency. In this work, we investigate the role of mixed-precision arithmetic in neural-network based Variational Monte Carlo (VMC), a widely used method for solving computationally otherwise intractable quantum many-body systems. We first derive general analytical bounds on the error introduced by reduced precision on Metropolis-Hastings MCMC, and then empirically validate these bounds on the use-case of VMC. We demonstrate that significant portions of the algorithm, in particular, sampling the quantum state, can be executed in half precision without loss of accuracy. More broadly, this work provides a theoretical framework to assess the applicability of mixed-precision arithmetic in machine-learning approaches that rely on MCMC sampling. In the context of VMC, we additionally demonstrate the practical effectiveness of mixed-precision strategies, enabling more scalable and energy-efficient simulations of quantum many-body systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 126,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20789",
        "abs_url": "https://arxiv.org/abs/2601.20789",
        "pdf_url": "https://arxiv.org/pdf/2601.20789",
        "title": "SERA: Soft-Verified Efficient Repository Agents",
        "authors": [
            "Ethan Shen",
            "Danny Tormoen",
            "Saurabh Shah",
            "Ali Farhadi",
            "Tim Dettmers"
        ],
        "comments": "21 main pages, 7 pages appendix",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG); Software Engineering (cs.SE)",
        "abstract": "Open-weight coding agents should hold a fundamental advantage over closed-source systems: they can be specialized to private codebases, encoding repository-specific information directly in their weights. Yet the cost and complexity of training has kept this advantage theoretical. We show it is now practical. We present Soft-Verified Efficient Repository Agents (SERA), an efficient method for training coding agents that enables the rapid and cheap creation of agents specialized to private codebases. Using only supervised finetuning (SFT), SERA achieves state-of-the-art results among fully open-source (open data, method, code) models while matching the performance of frontier open-weight models like Devstral-Small-2. Creating SERA models is 26x cheaper than reinforcement learning and 57x cheaper than previous synthetic data methods to reach equivalent performance. Our method, Soft Verified Generation (SVG), generates thousands of trajectories from a single code repository. Combined with cost-efficiency, this enables specialization to private codebases. Beyond repository specialization, we apply SVG to a larger corpus of codebases, generating over 200,000 synthetic trajectories. We use this dataset to provide detailed analysis of scaling laws, ablations, and confounding factors for training coding agents. Overall, we believe our work will greatly accelerate research on open coding agents and showcase the advantage of open-source models that can specialize to private codebases. We release SERA as the first model in Ai2's Open Coding Agents series, along with all our code, data, and Claude Code integration to support the research community.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 127,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20796",
        "abs_url": "https://arxiv.org/abs/2601.20796",
        "pdf_url": "https://arxiv.org/pdf/2601.20796",
        "title": "Dissecting Multimodal In-Context Learning: Modality Asymmetries and Circuit Dynamics in modern Transformers",
        "authors": [
            "Yiran Huang",
            "Karsten Roth",
            "Quentin Bouniot",
            "Wenjia Xu",
            "Zeynep Akata"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Transformer-based multimodal large language models often exhibit in-context learning (ICL) abilities. Motivated by this phenomenon, we ask: how do transformers learn to associate information across modalities from in-context examples? We investigate this question through controlled experiments on small transformers trained on synthetic classification tasks, enabling precise manipulation of data statistics and model architecture. We begin by revisiting core principles of unimodal ICL in modern transformers. While several prior findings replicate, we find that Rotary Position Embeddings (RoPE) increases the data complexity threshold for ICL. Extending to the multimodal setting reveals a fundamental learning asymmetry: when pretrained on high-diversity data from a primary modality, surprisingly low data complexity in the secondary modality suffices for multimodal ICL to emerge. Mechanistic analysis shows that both settings rely on an induction-style mechanism that copies labels from matching in-context exemplars; multimodal training refines and extends these circuits across modalities. Our findings provide a mechanistic foundation for understanding multimodal ICL in modern transformers and introduce a controlled testbed for future investigation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 128,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20810",
        "abs_url": "https://arxiv.org/abs/2601.20810",
        "pdf_url": "https://arxiv.org/pdf/2601.20810",
        "title": "Context-Augmented Code Generation Using Programming Knowledge Graphs",
        "authors": [
            "Shahd Seddik",
            "Fahd Seddik",
            "Iman Saberi",
            "Fatemeh Fard",
            "Minh Hieu Huynh",
            "Patanamon Thongtanunam"
        ],
        "comments": "",
        "subjects": "Software Engineering (cs.SE); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) excel at code generation but struggle with complex problems. Retrieval-Augmented Generation (RAG) mitigates this issue by integrating external knowledge, yet retrieval models often miss relevant context, and generation models hallucinate with irrelevant data. We propose Programming Knowledge Graph (PKG) for semantic representation and fine-grained retrieval of code and text. Our approach enhances retrieval precision through tree pruning and mitigates hallucinations via a re-ranking mechanism that integrates non-RAG solutions. Structuring external data into finer-grained nodes improves retrieval granularity. Evaluations on HumanEval and MBPP show up to 20% pass@1 accuracy gains and a 34% improvement over baselines on MBPP. Our findings demonstrate that our proposed PKG approach along with re-ranker effectively address complex problems while maintaining minimal negative impact on solutions that are already correct without RAG. The replication package is published at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 129,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20819",
        "abs_url": "https://arxiv.org/abs/2601.20819",
        "pdf_url": "https://arxiv.org/pdf/2601.20819",
        "title": "Demystifying Prediction Powered Inference",
        "authors": [
            "Yilin Song",
            "Dan M. Kluger",
            "Harsh Parikh",
            "Tian Gu"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Machine learning predictions are increasingly used to supplement incomplete or costly-to-measure outcomes in fields such as biomedical research, environmental science, and social science. However, treating predictions as ground truth introduces bias while ignoring them wastes valuable information. Prediction-Powered Inference (PPI) offers a principled framework that leverages predictions from large unlabeled datasets to improve statistical efficiency while maintaining valid inference through explicit bias correction using a smaller labeled subset. Despite its potential, the growing PPI variants and the subtle distinctions between them have made it challenging for practitioners to determine when and how to apply these methods responsibly. This paper demystifies PPI by synthesizing its theoretical foundations, methodological extensions, connections to existing statistics literature, and diagnostic tools into a unified practical workflow. Using the Mosaiks housing price data, we show that PPI variants produce tighter confidence intervals than complete-case analysis, but that double-dipping, i.e. reusing training data for inference, leads to anti-conservative confidence intervals and coverages. Under missing-not-at-random mechanisms, all methods, including classical inference using only labeled data, yield biased estimates. We provide a decision flowchart linking assumption violations to appropriate PPI variants, a summary table of selective methods, and practical diagnostic strategies for evaluating core assumptions. By framing PPI as a general recipe rather than a single estimator, this work bridges methodological innovation and applied practice, helping researchers responsibly integrate predictions into valid inference.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 130,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20830",
        "abs_url": "https://arxiv.org/abs/2601.20830",
        "pdf_url": "https://arxiv.org/pdf/2601.20830",
        "title": "VSCOUT: A Hybrid Variational Autoencoder Approach to Outlier Detection in High-Dimensional Retrospective Monitoring",
        "authors": [
            "Waldyn G. Martinez"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Computation (stat.CO)",
        "abstract": "Modern industrial and service processes generate high-dimensional, non-Gaussian, and contamination-prone data that challenge the foundational assumptions of classical Statistical Process Control (SPC). Heavy tails, multimodality, nonlinear dependencies, and sparse special-cause observations can distort baseline estimation, mask true anomalies, and prevent reliable identification of an in-control (IC) reference set. To address these challenges, we introduce VSCOUT, a distribution-free framework designed specifically for retrospective (Phase I) monitoring in high-dimensional settings. VSCOUT combines an Automatic Relevance Determination Variational Autoencoder (ARD-VAE) architecture with ensemble-based latent outlier filtering and changepoint detection. The ARD prior isolates the most informative latent dimensions, while the ensemble and changepoint filters identify pointwise and structural contamination within the determined latent space. A second-stage retraining step removes flagged observations and re-estimates the latent structure using only the retained inliers, mitigating masking and stabilizing the IC latent manifold. This two-stage refinement produces a clean and reliable IC baseline suitable for subsequent Phase II deployment. Extensive experiments across benchmark datasets demonstrate that VSCOUT achieves superior sensitivity to special-cause structure while maintaining controlled false alarms, outperforming classical SPC procedures, robust estimators, and modern machine-learning baselines. Its scalability, distributional flexibility, and resilience to complex contamination patterns position VSCOUT as a practical and effective method for retrospective modeling and anomaly detection in AI-enabled environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 131,
        "date": "2026-01-29",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-29?abs=True",
        "arxiv_id": "2601.20834",
        "abs_url": "https://arxiv.org/abs/2601.20834",
        "pdf_url": "https://arxiv.org/pdf/2601.20834",
        "title": "Linear representations in language models can change dramatically over a conversation",
        "authors": [
            "Andrew Kyle Lampinen",
            "Yuxuan Li",
            "Eghbal Hosseini",
            "Sangnie Bhardwaj",
            "Murray Shanahan"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Language model representations often contain linear directions that correspond to high-level concepts. Here, we study the dynamics of these representations: how representations evolve along these dimensions within the context of (simulated) conversations. We find that linear representations can change dramatically over a conversation; for example, information that is represented as factual at the beginning of a conversation can be represented as non-factual at the end and vice versa. These changes are content-dependent; while representations of conversation-relevant information may change, generic information is generally preserved. These changes are robust even for dimensions that disentangle factuality from more superficial response patterns, and occur across different model families and layers of the model. These representation changes do not require on-policy conversations; even replaying a conversation script written by an entirely different model can produce similar changes. However, adaptation is much weaker from simply having a sci-fi story in context that is framed more explicitly as such. We also show that steering along a representational direction can have dramatically different effects at different points in a conversation. These results are consistent with the idea that representations may evolve in response to the model playing a particular role that is cued by a conversation. Our findings may pose challenges for interpretability and steering -- in particular, they imply that it may be misleading to use static interpretations of features or directions, or probes that assume a particular range of features consistently corresponds to a particular ground-truth value. However, these types of representational dynamics also point to exciting new research directions for understanding how models adapt to context.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]