[
    {
        "order": 1,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09709",
        "abs_url": "https://arxiv.org/abs/2601.09709",
        "pdf_url": "https://arxiv.org/pdf/2601.09709",
        "title": "Social Determinants of Health Prediction for ICD-9 Code with Reasoning Models",
        "authors": [
            "Sharim Khan",
            "Paul Landes",
            "Adam Cross",
            "Jimeng Sun"
        ],
        "comments": "Published as part of Machine Learning for Health (ML4H) 2025 Findings Track",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL); Computers and Society (cs.CY)",
        "abstract": "Social Determinants of Health correlate with patient outcomes but are rarely captured in structured data. Recent attention has been given to automatically extracting these markers from clinical text to supplement diagnostic systems with knowledge of patients' social circumstances. Large language models demonstrate strong performance in identifying Social Determinants of Health labels from sentences. However, prediction in large admissions or longitudinal notes is challenging given long distance dependencies. In this paper, we explore hospital admission multi-label Social Determinants of Health ICD-9 code classification on the MIMIC-III dataset using reasoning models and traditional large language models. We exploit existing ICD-9 codes for prediction on admissions, which achieved an 89% F1. Our contributions include our findings, missing SDoH codes in 139 admissions, and code to reproduce the results.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09775",
        "abs_url": "https://arxiv.org/abs/2601.09775",
        "pdf_url": "https://arxiv.org/pdf/2601.09775",
        "title": "The Geometry of Thought: Disclosing the Transformer as a Tropical Polynomial Circuit",
        "authors": [
            "Faruk Alpay",
            "Bilge Senturk"
        ],
        "comments": "7 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "We prove that the Transformer self-attention mechanism in the high-confidence regime ($\\beta \\to \\infty$, where $\\beta$ is an inverse temperature) operates in the tropical semiring (max-plus algebra). In particular, we show that taking the tropical limit of the softmax attention converts it into a tropical matrix product. This reveals that the Transformer's forward pass is effectively executing a dynamic programming recurrence (specifically, a Bellman-Ford path-finding update) on a latent graph defined by token similarities. Our theoretical result provides a new geometric perspective for chain-of-thought reasoning: it emerges from an inherent shortest-path (or longest-path) algorithm being carried out within the network's computation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09776",
        "abs_url": "https://arxiv.org/abs/2601.09776",
        "pdf_url": "https://arxiv.org/pdf/2601.09776",
        "title": "TimeSAE: Sparse Decoding for Faithful Explanations of Black-Box Time Series Models",
        "authors": [
            "Khalid Oublal",
            "Quentin Bouniot",
            "Qi Gan",
            "Stephan Clémençon",
            "Zeynep Akata"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "As black box models and pretrained models gain traction in time series applications, understanding and explaining their predictions becomes increasingly vital, especially in high-stakes domains where interpretability and trust are essential. However, most of the existing methods involve only in-distribution explanation, and do not generalize outside the training support, which requires the learning capability of generalization. In this work, we aim to provide a framework to explain black-box models for time series data through the dual lenses of Sparse Autoencoders (SAEs) and causality. We show that many current explanation methods are sensitive to distributional shifts, limiting their effectiveness in real-world scenarios. Building on the concept of Sparse Autoencoder, we introduce TimeSAE, a framework for black-box model explanation. We conduct extensive evaluations of TimeSAE on both synthetic and real-world time series datasets, comparing it to leading baselines. The results, supported by both quantitative metrics and qualitative insights, show that TimeSAE provides more faithful and robust explanations. Our code is available in an easy-to-use library TimeSAE-Lib: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09809",
        "abs_url": "https://arxiv.org/abs/2601.09809",
        "pdf_url": "https://arxiv.org/pdf/2601.09809",
        "title": "QFed: Parameter-Compact Quantum-Classical Federated Learning",
        "authors": [
            "Samar Abdelghani",
            "Soumaya Cherkaoui"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "Organizations and enterprises across domains such as healthcare, finance, and scientific research are increasingly required to extract collective intelligence from distributed, siloed datasets while adhering to strict privacy, regulatory, and sovereignty requirements. Federated Learning (FL) enables collaborative model building without sharing sensitive raw data, but faces growing challenges posed by statistical heterogeneity, system diversity, and the computational burden from complex models. This study examines the potential of quantum-assisted federated learning, which could cut the number of parameters in classical models by polylogarithmic factors and thus lessen training overhead. Accordingly, we introduce QFed, a quantum-enabled federated learning framework aimed at boosting computational efficiency across edge device networks. We evaluate the proposed framework using the widely adopted FashionMNIST dataset. Experimental results show that QFed achieves a 77.6% reduction in the parameter count of a VGG-like model while maintaining an accuracy comparable to classical approaches in a scalable environment. These results point to the potential of leveraging quantum computing within a federated learning context to strengthen FL capabilities of edge devices.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09825",
        "abs_url": "https://arxiv.org/abs/2601.09825",
        "pdf_url": "https://arxiv.org/pdf/2601.09825",
        "title": "Eluder dimension: localise it!",
        "authors": [
            "Alireza Bakhtiari",
            "Alex Ayoub",
            "Samuel Robertson",
            "David Janz",
            "Csaba Szepesvári"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We establish a lower bound on the eluder dimension of generalised linear model classes, showing that standard eluder dimension-based analysis cannot lead to first-order regret bounds. To address this, we introduce a localisation method for the eluder dimension; our analysis immediately recovers and improves on classic results for Bernoulli bandits, and allows for the first genuine first-order bounds for finite-horizon reinforcement learning tasks with bounded cumulative returns.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09831",
        "abs_url": "https://arxiv.org/abs/2601.09831",
        "pdf_url": "https://arxiv.org/pdf/2601.09831",
        "title": "A New Convergence Analysis of Plug-and-Play Proximal Gradient Descent Under Prior Mismatch",
        "authors": [
            "Guixian Xu",
            "Jinglai Li",
            "Junqi Tang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "In this work, we provide a new convergence theory for plug-and-play proximal gradient descent (PnP-PGD) under prior mismatch where the denoiser is trained on a different data distribution to the inference task at hand. To the best of our knowledge, this is the first convergence proof of PnP-PGD under prior mismatch. Compared with the existing theoretical results for PnP algorithms, our new results removed the need for several restrictive and unverifiable assumptions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09865",
        "abs_url": "https://arxiv.org/abs/2601.09865",
        "pdf_url": "https://arxiv.org/pdf/2601.09865",
        "title": "Advancing Model Refinement: Muon-Optimized Distillation and Quantization for LLM Deployment",
        "authors": [
            "Jacob Sander",
            "Brian Jalaian",
            "Venkat R. Dasari"
        ],
        "comments": "12 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Large Language Models (LLMs) enable advanced natural language processing but face deployment challenges on resource-constrained edge devices due to high computational, memory, and energy demands. Optimizing these models requires addressing three key challenges: acquiring task-specific data, fine-tuning for performance, and compressing models to accelerate inference while reducing resource demands. We propose an integrated framework combining GPTQ-based quantization, low-rank adaptation (LoRA), and a specialized data distillation process to significantly reduce model size and complexity while preserving or enhancing task-specific performance. By leveraging data distillation, knowledge distillation via Kullback-Leibler divergence, Bayesian hyperparameter optimization, and the Muon optimizer, our pipeline achieves up to 2x memory compression (e.g., reducing a 6GB model to 3GB) and enables efficient inference for specialized tasks. Empirical results demonstrate superior performance on standard LLM benchmarks compared to GPTQ quantization alone, with the Muon optimizer notably enhancing fine-tuned models' resistance to accuracy decay during quantization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09926",
        "abs_url": "https://arxiv.org/abs/2601.09926",
        "pdf_url": "https://arxiv.org/pdf/2601.09926",
        "title": "The PROPER Approach to Proactivity: Benchmarking and Advancing Knowledge Gap Navigation",
        "authors": [
            "Kirandeep Kaur",
            "Vinayak Gupta",
            "Aditya Gupta",
            "Chirag Shah"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Most language-based assistants follow a reactive ask-and-respond paradigm, requiring users to explicitly state their needs. As a result, relevant but unexpressed needs often go unmet. Existing proactive agents attempt to address this gap either by eliciting further clarification, preserving this burden, or by extrapolating future needs from context, often leading to unnecessary or mistimed interventions. We introduce ProPer, Proactivity-driven Personalized agents, a novel two-agent architecture consisting of a Dimension Generating Agent (DGA) and a Response Generating Agent (RGA). DGA, a fine-tuned LLM agent, leverages explicit user data to generate multiple implicit dimensions (latent aspects relevant to the user's task but not considered by the user) or knowledge gaps. These dimensions are selectively filtered using a reranker based on quality, diversity, and task relevance. RGA then balances explicit and implicit dimensions to tailor personalized responses with timely and proactive interventions. We evaluate ProPer across multiple domains using a structured, gap-aware rubric that measures coverage, initiative appropriateness, and intent alignment. Our results show that ProPer improves quality scores and win rates across all domains, achieving up to 84% gains in single-turn evaluation and consistent dominance in multi-turn interactions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09946",
        "abs_url": "https://arxiv.org/abs/2601.09946",
        "pdf_url": "https://arxiv.org/pdf/2601.09946",
        "title": "Interpolation-Based Optimization for Enforcing lp-Norm Metric Differential Privacy in Continuous and Fine-Grained Domains",
        "authors": [
            "Chenxi Qiu"
        ],
        "comments": "USENIX Security 2026",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Metric Differential Privacy (mDP) generalizes Local Differential Privacy (LDP) by adapting privacy guarantees based on pairwise distances, enabling context-aware protection and improved utility. While existing optimization-based methods reduce utility loss effectively in coarse-grained domains, optimizing mDP in fine-grained or continuous settings remains challenging due to the computational cost of constructing dense perterubation matrices and satisfying pointwise constraints. In this paper, we propose an interpolation-based framework for optimizing lp-norm mDP in such domains. Our approach optimizes perturbation distributions at a sparse set of anchor points and interpolates distributions at non-anchor locations via log-convex combinations, which provably preserve mDP. To address privacy violations caused by naive interpolation in high-dimensional spaces, we decompose the interpolation process into a sequence of one-dimensional steps and derive a corrected formulation that enforces lp-norm mDP by design. We further explore joint optimization over perturbation distributions and privacy budget allocation across dimensions. Experiments on real-world location datasets demonstrate that our method offers rigorous privacy guarantees and competitive utility in fine-grained domains, outperforming baseline mechanisms. in high-dimensional spaces, we decompose the interpolation process into a sequence of one-dimensional steps and derive a corrected formulation that enforces lp-norm mDP by design. We further explore joint optimization over perturbation distributions and privacy budget allocation across dimensions. Experiments on real-world location datasets demonstrate that our method offers rigorous privacy guarantees and competitive utility in fine-grained domains, outperforming baseline mechanisms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09966",
        "abs_url": "https://arxiv.org/abs/2601.09966",
        "pdf_url": "https://arxiv.org/pdf/2601.09966",
        "title": "A Sustainable AI Economy Needs Data Deals That Work for Generators",
        "authors": [
            "Ruoxi Jia",
            "Luis Oala",
            "Wenjie Xiong",
            "Suqin Ge",
            "Jiachen T. Wang",
            "Feiyang Kang",
            "Dawn Song"
        ],
        "comments": "Published at NeurIPS 2025 (this https URL)",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Human-Computer Interaction (cs.HC)",
        "abstract": "We argue that the machine learning value chain is structurally unsustainable due to an economic data processing inequality: each state in the data cycle from inputs to model weights to synthetic outputs refines technical signal but strips economic equity from data generators. We show, by analyzing seventy-three public data deals, that the majority of value accrues to aggregators, with documented creator royalties rounding to zero and widespread opacity of deal terms. This is not just an economic welfare concern: as data and its derivatives become economic assets, the feedback loop that sustains current learning algorithms is at risk. We identify three structural faults - missing provenance, asymmetric bargaining power, and non-dynamic pricing - as the operational machinery of this inequality. In our analysis, we trace these problems along the machine learning value chain and propose an Equitable Data-Value Exchange (EDVEX) Framework to enable a minimal market that benefits all participants. Finally, we outline research directions where our community can make concrete contributions to data deals and contextualize our position with related and orthogonal viewpoints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09971",
        "abs_url": "https://arxiv.org/abs/2601.09971",
        "pdf_url": "https://arxiv.org/pdf/2601.09971",
        "title": "An Exploratory Study to Repurpose LLMs to a Unified Architecture for Time Series Classification",
        "authors": [
            "Hansen He",
            "Shuheng Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series classification (TSC) is a core machine learning problem with broad applications. Recently there has been growing interest in repurposing large language models (LLMs) for TSC, motivated by their strong reasoning and generalization ability. Prior work has primarily focused on alignment strategies that explicitly map time series data into the textual domain; however, the choice of time series encoder architecture remains underexplored. In this work, we conduct an exploratory study of hybrid architectures that combine specialized time series encoders with a frozen LLM backbone. We evaluate a diverse set of encoder families, including Inception, convolutional, residual, transformer-based, and multilayer perceptron architectures, among which the Inception model is the only encoder architecture that consistently yields positive performance gains when integrated with an LLM backbone. Overall, this study highlights the impact of time series encoder choice in hybrid LLM architectures and points to Inception-based models as a promising direction for future LLM-driven time series learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09979",
        "abs_url": "https://arxiv.org/abs/2601.09979",
        "pdf_url": "https://arxiv.org/pdf/2601.09979",
        "title": "In-Context Operator Learning on the Space of Probability Measures",
        "authors": [
            "Frank Cole",
            "Dixi Wang",
            "Yineng Chen",
            "Yulong Lu",
            "Rongjie Lai"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "We introduce \\emph{in-context operator learning on probability measure spaces} for optimal transport (OT). The goal is to learn a single solution operator that maps a pair of distributions to the OT map, using only few-shot samples from each distribution as a prompt and \\emph{without} gradient updates at inference. We parameterize the solution operator and develop scaling-law theory in two regimes. In the \\emph{nonparametric} setting, when tasks concentrate on a low-intrinsic-dimension manifold of source--target pairs, we establish generalization bounds that quantify how in-context accuracy scales with prompt size, intrinsic task dimension, and model capacity. In the \\emph{parametric} setting (e.g., Gaussian families), we give an explicit architecture that recovers the exact OT map in context and provide finite-sample excess-risk bounds. Our numerical experiments on synthetic transports and generative-modeling benchmarks validate the framework.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09985",
        "abs_url": "https://arxiv.org/abs/2601.09985",
        "pdf_url": "https://arxiv.org/pdf/2601.09985",
        "title": "FaTRQ: Tiered Residual Quantization for LLM Vector Search in Far-Memory-Aware ANNS Systems",
        "authors": [
            "Tianqi Zhang",
            "Flavio Ponzina",
            "Tajana Rosing"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Hardware Architecture (cs.AR); Information Retrieval (cs.IR)",
        "abstract": "Approximate Nearest-Neighbor Search (ANNS) is a key technique in retrieval-augmented generation (RAG), enabling rapid identification of the most relevant high-dimensional embeddings from massive vector databases. Modern ANNS engines accelerate this process using prebuilt indexes and store compressed vector-quantized representations in fast memory. However, they still rely on a costly second-pass refinement stage that reads full-precision vectors from slower storage like SSDs. For modern text and multimodal embeddings, these reads now dominate the latency of the entire query. We propose FaTRQ, a far-memory-aware refinement system using tiered memory that eliminates the need to fetch full vectors from storage. It introduces a progressive distance estimator that refines coarse scores using compact residuals streamed from far memory. Refinement stops early once a candidate is provably outside the top-k. To support this, we propose tiered residual quantization, which encodes residuals as ternary values stored efficiently in far memory. A custom accelerator is deployed in a CXL Type-2 device to perform low-latency refinement locally. Together, FaTRQ improves the storage efficiency by 2.4$\\times$ and improves the throughput by up to 9$ \\times$ than SOTA GPU ANNS system.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10007",
        "abs_url": "https://arxiv.org/abs/2601.10007",
        "pdf_url": "https://arxiv.org/pdf/2601.10007",
        "title": "Continuous-Depth Transformers with Learned Control Dynamics",
        "authors": [
            "Peter Jemley"
        ],
        "comments": "9 pages, 4 figures. Code available at: this https URL",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "We present a hybrid transformer architecture that replaces discrete middle layers with a continuous-depth Neural Ordinary Differential Equation (ODE) block, enabling inference-time control over generation attributes via a learned steering signal. Unlike standard transformers that process representations through fixed discrete layers, our approach treats depth as a continuous variable governed by a learned vector field $F_\\theta(H, \\tau, u)$, where $u$ is a low-dimensional control signal injected via explicit concatenation. We validate the architecture through four experiments: (1) gradient flow stability with zero exploding/vanishing gradient events, (2) semantic steering achieving 98\\%/88\\% accuracy for positive/negative sentiment control, (3) continuous interpolation validated by a negligible 0.068\\% trajectory divergence between fixed and adaptive solvers, and (4) efficiency benchmarking demonstrating latency parity with standard discrete baselines. Additionally, we show that adaptive ODE solvers reveal geometric structure in the learned dynamics: the control signal partitions the vector field into distinct dynamical regimes with different curvature characteristics. The adjoint method enables $O(1)$ memory training regardless of integration depth. Our results demonstrate that continuous-depth dynamics with learned control signals provide a viable, efficient mechanism for steerable language generation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10012",
        "abs_url": "https://arxiv.org/abs/2601.10012",
        "pdf_url": "https://arxiv.org/pdf/2601.10012",
        "title": "PID-Guided Partial Alignment for Multimodal Decentralized Federated Learning",
        "authors": [
            "Yanhang Shi",
            "Xiaoyu Wang",
            "Houwei Cao",
            "Jian Li",
            "Yong Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multimodal decentralized federated learning (DFL) is challenging because agents differ in available modalities and model architectures, yet must collaborate over peer-to-peer (P2P) networks without a central coordinator. Standard multimodal pipelines learn a single shared embedding across all modalities. In DFL, such a monolithic representation induces gradient misalignment between uni- and multimodal agents; as a result, it suppresses heterogeneous sharing and cross-modal interaction. We present PARSE, a multimodal DFL framework that operationalizes partial information decomposition (PID) in a server-free setting. Each agent performs feature fission to factorize its latent representation into redundant, unique, and synergistic slices. P2P knowledge sharing among heterogeneous agents is enabled by slice-level partial alignment: only semantically shareable branches are exchanged among agents that possess the corresponding modality. By removing the need for central coordination and gradient surgery, PARSE resolves uni-/multimodal gradient conflicts, thereby overcoming the multimodal DFL dilemma while remaining compatible with standard DFL constraints. Across benchmarks and agent mixes, PARSE yields consistent gains over task-, modality-, and hybrid-sharing DFL baselines. Ablations on fusion operators and split ratios, together with qualitative visualizations, further demonstrate the efficiency and robustness of the proposed design.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10015",
        "abs_url": "https://arxiv.org/abs/2601.10015",
        "pdf_url": "https://arxiv.org/pdf/2601.10015",
        "title": "CAFEDistill: Learning Personalized and Dynamic Models through Federated Early-Exit Network Distillation",
        "authors": [
            "Boyi Liu",
            "Zimu Zhou",
            "Yongxin Tong"
        ],
        "comments": "12 pages, conference",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Personalized Federated Learning (PFL) enables collaboratively model training on decentralized, heterogeneous data while tailoring them to each client's unique distribution. However, existing PFL methods produce static models with a fixed tradeoff between accuracy and efficiency, limiting their applicability in environments where inference requirements vary with contexts and resource availability. Early-exit networks (EENs) offer adaptive inference by attaching intermediate classifiers. Yet integrating them into PFL is challenging due to client-wise heterogeneity and depth-wise interference arising from conflicting exit objectives. Prior studies fail to resolve both conflicts simultaneously, leading to suboptimal performance. In this paper, we propose CAFEDistill, a Conflict-Aware Federated Exit Distillation framework that jointly addresses these conflicts and extends PFL to early-exit networks. Through a progressive, depth-prioritized student coordination mechanism, CAFEDistill mitigates interference among shallow and deep exits while allowing effective personalized knowledge transfer across clients. Furthermore, it reduces communication overhead via a client-decoupled formulation. Extensive evaluations show that CAFEDistill outperforms the state-of-the-arts, achieving higher accuracy and reducing inference costs by 30.79%-46.86%.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10019",
        "abs_url": "https://arxiv.org/abs/2601.10019",
        "pdf_url": "https://arxiv.org/pdf/2601.10019",
        "title": "Time Aggregation Features for XGBoost Models",
        "authors": [
            "Mykola Pinchuk"
        ],
        "comments": "17 pages, 18 tables and figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper studies time aggregation features for XGBoost models in click-through rate prediction. The setting is the Avazu click-through rate prediction dataset with strict out-of-time splits and a no-lookahead feature constraint. Features for hour H use only impressions from hours strictly before H. This paper compares a strong time-aware target encoding baseline to models augmented with entity history time aggregation under several window designs. Across two rolling-tail folds on a deterministic ten percent sample, a trailing window specification improves ROC AUC by about 0.0066 to 0.0082 and PR AUC by about 0.0084 to 0.0094 relative to target encoding alone. Within the time aggregation design grid, event count windows provide the only consistent improvement over trailing windows, and the gain is small. Gap windows and bucketized windows underperform simple trailing windows in this dataset and protocol. These results support a practical default of trailing windows, with an optional event count window when marginal ROC AUC gains matter.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10024",
        "abs_url": "https://arxiv.org/abs/2601.10024",
        "pdf_url": "https://arxiv.org/pdf/2601.10024",
        "title": "BPE: Behavioral Profiling Ensemble",
        "authors": [
            "Yanxin Liu",
            "Yunqi Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Ensemble learning is widely recognized as a pivotal strategy for pushing the boundaries of predictive performance. Traditional static ensemble methods, such as Stacking, typically assign weights by treating each base learner as a holistic entity, thereby overlooking the fact that individual models exhibit varying degrees of competence across different regions of the instance space. To address this limitation, Dynamic Ensemble Selection (DES) was introduced. However, both static and dynamic approaches predominantly rely on the divergence among different models as the basis for integration. This inter-model perspective neglects the intrinsic characteristics of the models themselves and necessitates a heavy reliance on validation sets for competence estimation. In this paper, we propose the Behavioral Profiling Ensemble (BPE) framework, which introduces a novel paradigm shift. Unlike traditional methods, BPE constructs a ``behavioral profile'' intrinsic to each model and derives integration weights based on the deviation between the model's response to a specific test instance and its established behavioral profile. Extensive experiments on both synthetic and real-world datasets demonstrate that the algorithm derived from the BPE framework achieves significant improvements over state-of-the-art ensemble baselines. These gains are evident not only in predictive accuracy but also in computational efficiency and storage resource utilization across various scenarios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10058",
        "abs_url": "https://arxiv.org/abs/2601.10058",
        "pdf_url": "https://arxiv.org/pdf/2601.10058",
        "title": "Unlabeled Data Can Provably Enhance In-Context Learning of Transformers",
        "authors": [
            "Renpu Liu",
            "Jing Yang"
        ],
        "comments": "Published as a conference paper at NeurIPS 2025",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) exhibit impressive in-context learning (ICL) capabilities, yet the quality of their predictions is fundamentally limited by the few costly labeled demonstrations that can fit into a prompt. Meanwhile, there exist vast and continuously growing amounts of unlabeled data that may be closely related to the ICL task. How to utilize such unlabeled data to provably enhance the performance of ICL thus becomes an emerging fundamental question. In this work, we propose a novel augmented ICL framework, in which the prompt includes a small set of labeled examples alongside a block of unlabeled inputs. We focus on the multi-class linear classification setting and demonstrate that, with chain-of-thought (CoT) prompting, a multi-layer transformer can effectively emulate an expectation-maximization (EM) algorithm. This enables the transformer to implicitly extract useful information from both labeled and unlabeled data, leading to provable improvements in ICL accuracy. Moreover, we show that such a transformer can be trained via teacher forcing, with its parameters converging to the desired solution at a linear rate. Experiments demonstrate that the augmented ICL framework consistently outperforms conventional few-shot ICL, providing empirical support for our theoretical findings. To the best of our knowledge, this is the first theoretical study on the impact of unlabeled data on the ICL performance of transformers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10067",
        "abs_url": "https://arxiv.org/abs/2601.10067",
        "pdf_url": "https://arxiv.org/pdf/2601.10067",
        "title": "Efficient Content-based Recommendation Model Training via Noise-aware Coreset Selection",
        "authors": [
            "Hung Vinh Tran",
            "Tong Chen",
            "Hechuan Wen",
            "Quoc Viet Hung Nguyen",
            "Bin Cui",
            "Hongzhi Yin"
        ],
        "comments": "WebConf 2026",
        "subjects": "Machine Learning (cs.LG); Information Retrieval (cs.IR)",
        "abstract": "Content-based recommendation systems (CRSs) utilize content features to predict user-item interactions, serving as essential tools for helping users navigate information-rich web services. However, ensuring the effectiveness of CRSs requires large-scale and even continuous model training to accommodate diverse user preferences, resulting in significant computational costs and resource demands. A promising approach to this challenge is coreset selection, which identifies a small but representative subset of data samples that preserves model quality while reducing training overhead. Yet, the selected coreset is vulnerable to the pervasive noise in user-item interactions, particularly when it is minimally sized. To this end, we propose Noise-aware Coreset Selection (NaCS), a specialized framework for CRSs. NaCS constructs coresets through submodular optimization based on training gradients, while simultaneously correcting noisy labels using a progressively trained model. Meanwhile, we refine the selected coreset by filtering out low-confidence samples through uncertainty quantification, thereby avoid training with unreliable interactions. Through extensive experiments, we show that NaCS produces higher-quality coresets for CRSs while achieving better efficiency than existing coreset selection techniques. Notably, NaCS recovers 93-95\\% of full-dataset training performance using merely 1\\% of the training data. The source code is available at \\href{this https URL}{this https URL}.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10079",
        "abs_url": "https://arxiv.org/abs/2601.10079",
        "pdf_url": "https://arxiv.org/pdf/2601.10079",
        "title": "Sparse-RL: Breaking the Memory Wall in LLM Reinforcement Learning via Stable Sparse Rollouts",
        "authors": [
            "Sijia Luo",
            "Xiaokang Zhang",
            "Yuxuan Hu",
            "Bohan Zhang",
            "Ke Wang",
            "Jinbo Su",
            "Mengshu Sun",
            "Lei Liang",
            "Jing Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "Reinforcement Learning (RL) has become essential for eliciting complex reasoning capabilities in Large Language Models (LLMs). However, the substantial memory overhead of storing Key-Value (KV) caches during long-horizon rollouts acts as a critical bottleneck, often prohibiting efficient training on limited hardware. While existing KV compression techniques offer a remedy for inference, directly applying them to RL training induces a severe policy mismatch, leading to catastrophic performance collapse. To address this, we introduce Sparse-RL empowers stable RL training under sparse rollouts. We show that instability arises from a fundamental policy mismatch among the dense old policy, the sparse sampler policy, and the learner policy. To mitigate this issue, Sparse-RL incorporates Sparsity-Aware Rejection Sampling and Importance-based Reweighting to correct the off-policy bias introduced by compression-induced information loss. Experimental results show that Sparse-RL reduces rollout overhead compared to dense baselines while preserving the performance. Furthermore, Sparse-RL inherently implements sparsity-aware training, significantly enhancing model robustness during sparse inference deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10084",
        "abs_url": "https://arxiv.org/abs/2601.10084",
        "pdf_url": "https://arxiv.org/pdf/2601.10084",
        "title": "Adaptive Label Error Detection: A Bayesian Approach to Mislabeled Data Detection",
        "authors": [
            "Zan Chaudhry",
            "Noam H. Rotenberg",
            "Brian Caffo",
            "Craig K. Jones",
            "Haris I. Sair"
        ],
        "comments": "10 pages, 5 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine learning classification systems are susceptible to poor performance when trained with incorrect ground truth labels, even when data is well-curated by expert annotators. As machine learning becomes more widespread, it is increasingly imperative to identify and correct mislabeling to develop more powerful models. In this work, we motivate and describe Adaptive Label Error Detection (ALED), a novel method of detecting mislabeling. ALED extracts an intermediate feature space from a deep convolutional neural network, denoises the features, models the reduced manifold of each class with a multidimensional Gaussian distribution, and performs a simple likelihood ratio test to identify mislabeled samples. We show that ALED has markedly increased sensitivity, without compromising precision, compared to established label error detection methods, on multiple medical imaging datasets. We demonstrate an example where fine-tuning a neural network on corrected data results in a 33.8% decrease in test set errors, providing strong benefits to end users. The ALED detector is deployed in the Python package statlab.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10089",
        "abs_url": "https://arxiv.org/abs/2601.10089",
        "pdf_url": "https://arxiv.org/pdf/2601.10089",
        "title": "Bayesian Meta-Analyses Could Be More: A Case Study in Trial of Labor After a Cesarean-section Outcomes and Complications",
        "authors": [
            "Ashley Klein",
            "Edward Raff",
            "Marcia DesJardin"
        ],
        "comments": "To appear in AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The meta-analysis's utility is dependent on previous studies having accurately captured the variables of interest, but in medical studies, a key decision variable that impacts a physician's decisions was not captured. This results in an unknown effect size and unreliable conclusions. A Bayesian approach may allow analysis to determine if the claim of a positive effect is still warranted, and we build a Bayesian approach to this common medical scenario. To demonstrate its utility, we assist professional OBGYNs in evaluating Trial of Labor After a Cesarean-section (TOLAC) situations where few interventions are available for patients and find the support needed for physicians to advance patient care.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10092",
        "abs_url": "https://arxiv.org/abs/2601.10092",
        "pdf_url": "https://arxiv.org/pdf/2601.10092",
        "title": "LeMoF: Level-guided Multimodal Fusion for Heterogeneous Clinical Data",
        "authors": [
            "Jongseok Kim",
            "Seongae Kang",
            "Jonghwan Shin",
            "Yuhan Lee",
            "Ohyun Jo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Multimodal clinical prediction is widely used to integrate heterogeneous data such as Electronic Health Records (EHR) and biosignals. However, existing methods tend to rely on static modality integration schemes and simple fusion strategies. As a result, they fail to fully exploit modality-specific representations. In this paper, we propose Level-guided Modal Fusion (LeMoF), a novel framework that selectively integrates level-guided representations within each modality. Each level refers to a representation extracted from a different layer of the encoder. LeMoF explicitly separates and learns global modality-level predictions from level-specific discriminative representations. This design enables LeMoF to achieve a balanced performance between prediction stability and discriminative capability even in heterogeneous clinical environments. Experiments on length of stay prediction using Intensive Care Unit (ICU) data demonstrate that LeMoF consistently outperforms existing state-of-the-art multimodal fusion techniques across various encoder configurations. We also confirmed that level-wise integration is a key factor in achieving robust predictive performance across various clinical conditions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10096",
        "abs_url": "https://arxiv.org/abs/2601.10096",
        "pdf_url": "https://arxiv.org/pdf/2601.10096",
        "title": "Multilingual-To-Multimodal (M2M): Unlocking New Languages with Monolingual Text",
        "authors": [
            "Piyush Singh Pasi"
        ],
        "comments": "EACL 2026 Findings accepted. Initial Draft of Camera-ready",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Multimodal models excel in English, supported by abundant image-text and audio-text data, but performance drops sharply for other languages due to limited multilingual multimodal resources. Existing solutions rely heavily on machine translation, while advances in multilingual text modeling remain underutilized. We introduce METAL, a lightweight alignment method that learns only a few linear layers using English text alone to map multilingual text embeddings into a multimodal space. Despite its simplicity, METAL matches baseline performance in English (94.9 percent Recall at 10) and achieves strong zero-shot transfer (89.5 percent Recall at 10 averaged across 11 languages, 10 unseen) on XTD text-to-image retrieval. Qualitative t-SNE visualizations show that multilingual embeddings align tightly with multimodal representations, while weight analysis reveals that the transformation reshapes embedding geometry rather than performing trivial rotations. Beyond image-text retrieval, METAL generalizes to audio-text retrieval and cross-lingual text-to-image generation. We release code and checkpoints at this https URL , as well as multilingual evaluation datasets including MSCOCO Multilingual 30K (this https URL ), AudioCaps Multilingual (this https URL ), and Clotho Multilingual (this https URL ), to facilitate further research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10141",
        "abs_url": "https://arxiv.org/abs/2601.10141",
        "pdf_url": "https://arxiv.org/pdf/2601.10141",
        "title": "Understanding and Preserving Safety in Fine-Tuned LLMs",
        "authors": [
            "Jiawen Zhang",
            "Yangfan Hu",
            "Kejia Chen",
            "Lipeng He",
            "Jiachen Ma",
            "Jian Lou",
            "Dan Li",
            "Jian Liu",
            "Xiaohu Yang",
            "Ruoxi Jia"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Fine-tuning is an essential and pervasive functionality for applying large language models (LLMs) to downstream tasks. However, it has the potential to substantially degrade safety alignment, e.g., by greatly increasing susceptibility to jailbreak attacks, even when the fine-tuning data is entirely harmless. Despite garnering growing attention in defense efforts during the fine-tuning stage, existing methods struggle with a persistent safety-utility dilemma: emphasizing safety compromises task performance, whereas prioritizing utility typically requires deep fine-tuning that inevitably leads to steep safety declination. In this work, we address this dilemma by shedding new light on the geometric interaction between safety- and utility-oriented gradients in safety-aligned LLMs. Through systematic empirical analysis, we uncover three key insights: (I) safety gradients lie in a low-rank subspace, while utility gradients span a broader high-dimensional space; (II) these subspaces are often negatively correlated, causing directional conflicts during fine-tuning; and (III) the dominant safety direction can be efficiently estimated from a single sample. Building upon these novel insights, we propose safety-preserving fine-tuning (SPF), a lightweight approach that explicitly removes gradient components conflicting with the low-rank safety subspace. Theoretically, we show that SPF guarantees utility convergence while bounding safety drift. Empirically, SPF consistently maintains downstream task performance and recovers nearly all pre-trained safety alignment, even under adversarial fine-tuning scenarios. Furthermore, SPF exhibits robust resistance to both deep fine-tuning and dynamic jailbreak attacks. Together, our findings provide new mechanistic understanding and practical guidance toward always-aligned LLM fine-tuning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10155",
        "abs_url": "https://arxiv.org/abs/2601.10155",
        "pdf_url": "https://arxiv.org/pdf/2601.10155",
        "title": "LOOKAT: Lookup-Optimized Key-Attention for Memory-Efficient Transformers",
        "authors": [
            "Aryan Karmore"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Compressing the KV cache is a required step to deploy large language models on edge devices. Current quantization methods compress storage but fail to reduce bandwidth as attention calculation requires dequantizing keys from INT4/INT8 to FP16 before use. We observe that attention scoring is mathematically equivalent to the inner product similarity search and we can apply some compression techniques from vector databases to compress KV-cache better. We propose LOOKAT, which applies product quantization and asymmetric distance computation, to transformer architecture by decomposing key vectors into subspaces, learning codebooks and computing attention tables via lookup tables. This transforms attention from memory-bound to compute-bound. LOOKAT achieves 64 $\\times$ compression at 95.7\\% output fidelity and 32 $\\times$ compression at 95.0\\% fidelity when tested on GPT-2. LOOKAT requires no architecture changes or training while maintaining rank correlation $\\rho > 0.95$. Theoretical analysis confirms that rank correlation degrades as $O(d_k/mK)$, with guarantees validated across sequence lengths up to 1024 tokens.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10176",
        "abs_url": "https://arxiv.org/abs/2601.10176",
        "pdf_url": "https://arxiv.org/pdf/2601.10176",
        "title": "CC-OR-Net: A Unified Framework for LTV Prediction through Structural Decoupling",
        "authors": [
            "Mingyu Zhao",
            "Haoran Bai",
            "Yu Tian",
            "Bing Zhu",
            "Hengliang Luo"
        ],
        "comments": "Accepted by WWW'26",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Customer Lifetime Value (LTV) prediction, a central problem in modern marketing, is characterized by a unique zero-inflated and long-tail data distribution. This distribution presents two fundamental challenges: (1) the vast majority of low-to-medium value users numerically overwhelm the small but critically important segment of high-value \"whale\" users, and (2) significant value heterogeneity exists even within the low-to-medium value user base. Common approaches either rely on rigid statistical assumptions or attempt to decouple ranking and regression using ordered buckets; however, they often enforce ordinality through loss-based constraints rather than inherent architectural design, failing to balance global accuracy with high-value precision. To address this gap, we propose \\textbf{C}onditional \\textbf{C}ascaded \\textbf{O}rdinal-\\textbf{R}esidual Networks \\textbf{(CC-OR-Net)}, a novel unified framework that achieves a more robust decoupling through \\textbf{structural decomposition}, where ranking is architecturally guaranteed. CC-OR-Net integrates three specialized components: a \\textit{structural ordinal decomposition module} for robust ranking, an \\textit{intra-bucket residual module} for fine-grained regression, and a \\textit{targeted high-value augmentation module} for precision on top-tier users. Evaluated on real-world datasets with over 300M users, CC-OR-Net achieves a superior trade-off across all key business metrics, outperforming state-of-the-art methods in creating a holistic and commercially valuable LTV prediction solution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10180",
        "abs_url": "https://arxiv.org/abs/2601.10180",
        "pdf_url": "https://arxiv.org/pdf/2601.10180",
        "title": "Bias in the Shadows: Explore Shortcuts in Encrypted Network Traffic Classification",
        "authors": [
            "Chuyi Wang",
            "Xiaohui Xie",
            "Tongze Wang",
            "Yong Cui"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "Pre-trained models operating directly on raw bytes have achieved promising performance in encrypted network traffic classification (NTC), but often suffer from shortcut learning-relying on spurious correlations that fail to generalize to real-world data. Existing solutions heavily rely on model-specific interpretation techniques, which lack adaptability and generality across different model architectures and deployment scenarios. In this paper, we propose BiasSeeker, the first semi-automated framework that is both model-agnostic and data-driven for detecting dataset-specific shortcut features in encrypted traffic. By performing statistical correlation analysis directly on raw binary traffic, BiasSeeker identifies spurious or environment-entangled features that may compromise generalization, independent of any classifier. To address the diverse nature of shortcut features, we introduce a systematic categorization and apply category-specific validation strategies that reduce bias while preserving meaningful information. We evaluate BiasSeeker on 19 public datasets across three NTC tasks. By emphasizing context-aware feature selection and dataset-specific diagnosis, BiasSeeker offers a novel perspective for understanding and addressing shortcut learning in encrypted network traffic classification, raising awareness that feature selection should be an intentional and scenario-sensitive step prior to model training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10181",
        "abs_url": "https://arxiv.org/abs/2601.10181",
        "pdf_url": "https://arxiv.org/pdf/2601.10181",
        "title": "Reinforcement Learning to Discover a NorthEast Monsoon Index for Monthly Rainfall Prediction in Thailand",
        "authors": [
            "Kiattikun Chobtham"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Earth and Planetary Astrophysics (astro-ph.EP)",
        "abstract": "Climate prediction is a challenge due to the intricate spatiotemporal patterns within Earth systems. Global climate indices, such as the El Niño Southern Oscillation, are standard input features for long-term rainfall prediction. However, a significant gap persists regarding local-scale indices capable of improving predictive accuracy in specific regions of Thailand. This paper introduces a novel NorthEast monsoon climate index calculated from sea surface temperature to reflect the climatology of the boreal winter monsoon. To optimise the calculated areas used for this index, a Deep Q-Network reinforcement learning agent explores and selects the most effective rectangles based on their correlation with seasonal rainfall. Rainfall stations were classified into 12 distinct clusters to distinguish rainfall patterns between southern and upper Thailand. Experimental results show that incorporating the optimised index into Long Short-Term Memory models significantly improves long-term monthly rainfall prediction skill in most cluster areas. This approach effectively reduces the Root Mean Square Error for 12-month-ahead forecasts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10199",
        "abs_url": "https://arxiv.org/abs/2601.10199",
        "pdf_url": "https://arxiv.org/pdf/2601.10199",
        "title": "Graph Regularized PCA",
        "authors": [
            "Antonio Briola",
            "Marwin Schmidt",
            "Fabio Caccioli",
            "Carlos Ros Perez",
            "James Singleton",
            "Christian Michler",
            "Tomaso Aste"
        ],
        "comments": "15 pages, 2 figures, 4 Tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "High-dimensional data often exhibit dependencies among variables that violate the isotropic-noise assumption under which principal component analysis (PCA) is optimal. For cases where the noise is not independent and identically distributed across features (i.e., the covariance is not spherical) we introduce Graph Regularized PCA (GR-PCA). It is a graph-based regularization of PCA that incorporates the dependency structure of the data features by learning a sparse precision graph and biasing loadings toward the low-frequency Fourier modes of the corresponding graph Laplacian. Consequently, high-frequency signals are suppressed, while graph-coherent low-frequency ones are preserved, yielding interpretable principal components aligned with conditional relationships. We evaluate GR-PCA on synthetic data spanning diverse graph topologies, signal-to-noise ratios, and sparsity levels. Compared to mainstream alternatives, it concentrates variance on the intended support, produces loadings with lower graph-Laplacian energy, and remains competitive in out-of-sample reconstruction. When high-frequency signals are present, the graph Laplacian penalty prevents overfitting, reducing the reconstruction accuracy but improving structural fidelity. The advantage over PCA is most pronounced when high-frequency signals are graph-correlated, whereas PCA remains competitive when such signals are nearly rotationally invariant. The procedure is simple to implement, modular with respect to the precision estimator, and scalable, providing a practical route to structure-aware dimensionality reduction that improves structural fidelity without sacrificing predictive performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10237",
        "abs_url": "https://arxiv.org/abs/2601.10237",
        "pdf_url": "https://arxiv.org/pdf/2601.10237",
        "title": "Fundamental Limitations of Favorable Privacy-Utility Guarantees for DP-SGD",
        "authors": [
            "Murat Bilgehan Ertan",
            "Marten van Dijk"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Cryptography and Security (cs.CR)",
        "abstract": "Differentially Private Stochastic Gradient Descent (DP-SGD) is the dominant paradigm for private training, but its fundamental limitations under worst-case adversarial privacy definitions remain poorly understood. We analyze DP-SGD in the $f$-differential privacy framework, which characterizes privacy via hypothesis-testing trade-off curves, and study shuffled sampling over a single epoch with $M$ gradient updates. We derive an explicit suboptimal upper bound on the achievable trade-off curve. This result induces a geometric lower bound on the separation $\\kappa$ which is the maximum distance between the mechanism's trade-off curve and the ideal random-guessing line. Because a large separation implies significant adversarial advantage, meaningful privacy requires small $\\kappa$. However, we prove that enforcing a small separation imposes a strict lower bound on the Gaussian noise multiplier $\\sigma$, which directly limits the achievable utility. In particular, under the standard worst-case adversarial model, shuffled DP-SGD must satisfy $\\sigma \\ge \\frac{1}{\\sqrt{2\\ln M}}$ $\\quad\\text{or}\\quad$ $\\kappa \\ge\\ \\frac{1}{\\sqrt{8}}\\!\\left(1-\\frac{1}{\\sqrt{4\\pi\\ln M}}\\right)$, and thus cannot simultaneously achieve strong privacy and high utility. Although this bound vanishes asymptotically as $M \\to \\infty$, the convergence is extremely slow: even for practically relevant numbers of updates the required noise magnitude remains substantial. We further show that the same limitation extends to Poisson subsampling up to constant factors. Our experiments confirm that the noise levels implied by this bound leads to significant accuracy degradation at realistic training settings, thus showing a critical bottleneck in DP-SGD under standard worst-case adversarial assumptions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10267",
        "abs_url": "https://arxiv.org/abs/2601.10267",
        "pdf_url": "https://arxiv.org/pdf/2601.10267",
        "title": "In-Context Source and Channel Coding",
        "authors": [
            "Ziqiong Wang",
            "Tianqi Ren",
            "Rongpeng Li",
            "Zhifeng Zhao",
            "Honggang Zhang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Separate Source-Channel Coding (SSCC) remains attractive for text transmission due to its modularity and compatibility with mature entropy coders and powerful channel codes. However, SSCC often suffers from a pronounced cliff effect in low Signal-to-Noise Ratio (SNR) regimes, where residual bit errors after channel decoding can catastrophically break lossless source decoding, especially for Arithmetic Coding (AC) driven by Large Language Models (LLMs). This paper proposes a receiver-side In-Context Decoding (ICD) framework that enhances SSCC robustness without modifying the transmitter. ICD leverages an Error Correction Code Transformer (ECCT) to obtain bit-wise reliability for the decoded information bits. Based on the context-consistent bitstream, ICD constructs a confidence-ranked candidate pool via reliability-guided bit flipping, samples a compact yet diverse subset of candidates, and applies an LLM-based arithmetic decoder to obtain both reconstructions and sequence-level log-likelihoods. A reliability-likelihood fusion rule then selects the final output. We further provide theoretical guarantees on the stability and convergence of the proposed sampling procedure. Extensive experiments over Additive White Gaussian Noise (AWGN) and Rayleigh fading channels demonstrate consistent gains compared with conventional SSCC baselines and representative Joint Source-Channel Coding (JSCC) schemes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10269",
        "abs_url": "https://arxiv.org/abs/2601.10269",
        "pdf_url": "https://arxiv.org/pdf/2601.10269",
        "title": "Early Fault Detection on CMAPSS with Unsupervised LSTM Autoencoders",
        "authors": [
            "P. Sánchez",
            "K. Reyes",
            "B. Radu",
            "E. Fernández"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper introduces an unsupervised health-monitoring framework for turbofan engines that does not require run-to-failure labels. First, operating-condition effects in NASA CMAPSS sensor streams are removed via regression-based normalisation; then a Long Short-Term Memory (LSTM) autoencoder is trained only on the healthy portion of each trajectory. Persistent reconstruction error, estimated using an adaptive data-driven threshold, triggers real-time alerts without hand-tuned rules. Benchmark results show high recall and low false-alarm rates across multiple operating regimes, demonstrating that the method can be deployed quickly, scale to diverse fleets, and serve as a complementary early-warning layer to Remaining Useful Life models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10282",
        "abs_url": "https://arxiv.org/abs/2601.10282",
        "pdf_url": "https://arxiv.org/pdf/2601.10282",
        "title": "SPIKE: Sparse Koopman Regularization for Physics-Informed Neural Networks",
        "authors": [
            "Jose Marie Antonio Minoza"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computational Engineering, Finance, and Science (cs.CE)",
        "abstract": "Physics-Informed Neural Networks (PINNs) provide a mesh-free approach for solving differential equations by embedding physical constraints into neural network training. However, PINNs tend to overfit within the training domain, leading to poor generalization when extrapolating beyond trained spatiotemporal regions. This work presents SPIKE (Sparse Physics-Informed Koopman-Enhanced), a framework that regularizes PINNs with continuous-time Koopman operators to learn parsimonious dynamics representations. By enforcing linear dynamics $dz/dt = Az$ in a learned observable space, both PIKE (without explicit sparsity) and SPIKE (with L1 regularization on $A$) learn sparse generator matrices, embodying the parsimony principle that complex dynamics admit low-dimensional structure. Experiments across parabolic, hyperbolic, dispersive, and stiff PDEs, including fluid dynamics (Navier-Stokes) and chaotic ODEs (Lorenz), demonstrate consistent improvements in temporal extrapolation, spatial generalization, and long-term prediction accuracy. The continuous-time formulation with matrix exponential integration provides unconditional stability for stiff systems while avoiding diagonal dominance issues inherent in discrete-time Koopman operators.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10312",
        "abs_url": "https://arxiv.org/abs/2601.10312",
        "pdf_url": "https://arxiv.org/pdf/2601.10312",
        "title": "We Need a More Robust Classifier: Dual Causal Learning Empowers Domain-Incremental Time Series Classification",
        "authors": [
            "Zhipeng Liu",
            "Peibo Duan",
            "Xuan Tang",
            "Haodong Jing",
            "Mingyang Geng",
            "Yongsheng Huang",
            "Jialu Xu",
            "Bin Zhang",
            "Binwu Wang"
        ],
        "comments": "This paper has been accepted for publication at ACM WWW 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The World Wide Web thrives on intelligent services that rely on accurate time series classification, which has recently witnessed significant progress driven by advances in deep learning. However, existing studies face challenges in domain incremental learning. In this paper, we propose a lightweight and robust dual-causal disentanglement framework (DualCD) to enhance the robustness of models under domain incremental scenarios, which can be seamlessly integrated into time series classification models. Specifically, DualCD first introduces a temporal feature disentanglement module to capture class-causal features and spurious features. The causal features can offer sufficient predictive power to support the classifier in domain incremental learning settings. To accurately capture these causal features, we further design a dual-causal intervention mechanism to eliminate the influence of both intra-class and inter-class confounding features. This mechanism constructs variant samples by combining the current class's causal features with intra-class spurious features and with causal features from other classes. The causal intervention loss encourages the model to accurately predict the labels of these variant samples based solely on the causal features. Extensive experiments on multiple datasets and models demonstrate that DualCD effectively improves performance in domain incremental scenarios. We summarize our rich experiments into a comprehensive benchmark to facilitate research in domain incremental time series classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10328",
        "abs_url": "https://arxiv.org/abs/2601.10328",
        "pdf_url": "https://arxiv.org/pdf/2601.10328",
        "title": "Meta Dynamic Graph for Traffic Flow Prediction",
        "authors": [
            "Yiqing Zou",
            "Hanning Yuan",
            "Qianyu Yang",
            "Ziqiang Yuan",
            "Shuliang Wang",
            "Sijie Ruan"
        ],
        "comments": "Accepted to AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Traffic flow prediction is a typical spatio-temporal prediction problem and has a wide range of applications. The core challenge lies in modeling the underlying complex spatio-temporal dependencies. Various methods have been proposed, and recent studies show that the modeling of dynamics is useful to meet the core challenge. While handling spatial dependencies and temporal dependencies using separate base model structures may hinder the modeling of spatio-temporal correlations, the modeling of dynamics can bridge this gap. Incorporating spatio-temporal heterogeneity also advances the main goal, since it can extend the parameter space and allow more flexibility. Despite these advances, two limitations persist: 1) the modeling of dynamics is often limited to the dynamics of spatial topology (e.g., adjacency matrix changes), which, however, can be extended to a broader scope; 2) the modeling of heterogeneity is often separated for spatial and temporal dimensions, but this gap can also be bridged by the modeling of dynamics. To address the above limitations, we propose a novel framework for traffic prediction, called Meta Dynamic Graph (MetaDG). MetaDG leverages dynamic graph structures of node representations to explicitly model spatio-temporal dynamics. This generates both dynamic adjacency matrices and meta-parameters, extending dynamic modeling beyond topology while unifying the capture of spatio-temporal heterogeneity into a single dimension. Extensive experiments on four real-world datasets validate the effectiveness of MetaDG.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10356",
        "abs_url": "https://arxiv.org/abs/2601.10356",
        "pdf_url": "https://arxiv.org/pdf/2601.10356",
        "title": "EvoMorph: Counterfactual Explanations for Continuous Time-Series Extrinsic Regression Applied to Photoplethysmography",
        "authors": [
            "Mesut Ceylan",
            "Alexis Tabin",
            "Patrick Langer",
            "Elgar Fleisch",
            "Filipe Barata"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Wearable devices enable continuous, population-scale monitoring of physiological signals, such as photoplethysmography (PPG), creating new opportunities for data-driven clinical assessment. Time-series extrinsic regression (TSER) models increasingly leverage PPG signals to estimate clinically relevant outcomes, including heart rate, respiratory rate, and oxygen saturation. For clinical reasoning and trust, however, single point estimates alone are insufficient: clinicians must also understand whether predictions are stable under physiologically plausible variations and to what extent realistic, attainable changes in physiological signals would meaningfully alter a model's prediction. Counterfactual explanations (CFE) address these \"what-if\" questions, yet existing time series CFE generation methods are largely restricted to classification, overlook waveform morphology, and often produce physiologically implausible signals, limiting their applicability to continuous biomedical time series. To address these limitations, we introduce EvoMorph, a multi-objective evolutionary framework for generating physiologically plausible and diverse CFE for TSER applications. EvoMorph optimizes morphology-aware objectives defined on interpretable signal descriptors and applies transformations to preserve the waveform structure. We evaluated EvoMorph on three PPG datasets (heart rate, respiratory rate, and oxygen saturation) against a nearest-unlike-neighbor baseline. In addition, in a case study, we evaluated EvoMorph as a tool for uncertainty quantification by relating counterfactual sensitivity to bootstrap-ensemble uncertainty and data-density measures. Overall, EvoMorph enables the generation of physiologically-aware counterfactuals for continuous biomedical signals and supports uncertainty-aware interpretability, advancing trustworthy model analysis for clinical time-series applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10358",
        "abs_url": "https://arxiv.org/abs/2601.10358",
        "pdf_url": "https://arxiv.org/pdf/2601.10358",
        "title": "PLGC: Pseudo-Labeled Graph Condensation",
        "authors": [
            "Jay Nandy",
            "Arnab Kumar Mondal",
            "Anuj Rathore",
            "Mahesh Chandran"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large graph datasets make training graph neural networks (GNNs) computationally costly. Graph condensation methods address this by generating small synthetic graphs that approximate the original data. However, existing approaches rely on clean, supervised labels, which limits their reliability when labels are scarce, noisy, or inconsistent. We propose Pseudo-Labeled Graph Condensation (PLGC), a self-supervised framework that constructs latent pseudo-labels from node embeddings and optimizes condensed graphs to match the original graph's structural and feature statistics -- without requiring ground-truth labels. PLGC offers three key contributions: (1) A diagnosis of why supervised condensation fails under label noise and distribution shift. (2) A label-free condensation method that jointly learns latent prototypes and node assignments. (3) Theoretical guarantees showing that pseudo-labels preserve latent structural statistics of the original graph and ensure accurate embedding alignment. Empirically, across node classification and link prediction tasks, PLGC achieves competitive performance with state-of-the-art supervised condensation methods on clean datasets and exhibits substantial robustness under label noise, often outperforming all baselines by a significant margin. Our findings highlight the practical and theoretical advantages of self-supervised graph condensation in noisy or weakly-labeled environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10403",
        "abs_url": "https://arxiv.org/abs/2601.10403",
        "pdf_url": "https://arxiv.org/pdf/2601.10403",
        "title": "Discrete Feynman-Kac Correctors",
        "authors": [
            "Mohsin Hasan",
            "Viktor Ohanesian",
            "Artem Gazizov",
            "Yoshua Bengio",
            "Alán Aspuru-Guzik",
            "Roberto Bondesan",
            "Marta Skreta",
            "Kirill Neklyudov"
        ],
        "comments": "Code: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Discrete diffusion models have recently emerged as a promising alternative to the autoregressive approach for generating discrete sequences. Sample generation via gradual denoising or demasking processes allows them to capture hierarchical non-sequential interdependencies in the data. These custom processes, however, do not assume a flexible control over the distribution of generated samples. We propose Discrete Feynman-Kac Correctors, a framework that allows for controlling the generated distribution of discrete masked diffusion models at inference time. We derive Sequential Monte Carlo (SMC) algorithms that, given a trained discrete diffusion model, control the temperature of the sampled distribution (i.e. perform annealing), sample from the product of marginals of several diffusion processes (e.g. differently conditioned processes), and sample from the product of the marginal with an external reward function, producing likely samples from the target distribution that also have high reward. Notably, our framework does not require any training of additional models or fine-tuning of the original model. We illustrate the utility of our framework in several applications including: efficient sampling from the annealed Boltzmann distribution of the Ising model, improving the performance of language models for code generation and amortized learning, as well as reward-tilted protein sequence generation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10407",
        "abs_url": "https://arxiv.org/abs/2601.10407",
        "pdf_url": "https://arxiv.org/pdf/2601.10407",
        "title": "CS-GBA: A Critical Sample-based Gradient-guided Backdoor Attack for Offline Reinforcement Learning",
        "authors": [
            "Yuanjie Zhao",
            "Junnan Qiu",
            "Yue Ding",
            "Jie Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Offline Reinforcement Learning (RL) enables policy optimization from static datasets but is inherently vulnerable to backdoor attacks. Existing attack strategies typically struggle against safety-constrained algorithms (e.g., CQL) due to inefficient random poisoning and the use of easily detectable Out-of-Distribution (OOD) triggers. In this paper, we propose CS-GBA (Critical Sample-based Gradient-guided Backdoor Attack), a novel framework designed to achieve high stealthiness and destructiveness under a strict budget. Leveraging the theoretical insight that samples with high Temporal Difference (TD) errors are pivotal for value function convergence, we introduce an adaptive Critical Sample Selection strategy that concentrates the attack budget on the most influential transitions. To evade OOD detection, we propose a Correlation-Breaking Trigger mechanism that exploits the physical mutual exclusivity of state features (e.g., 95th percentile boundaries) to remain statistically concealed. Furthermore, we replace the conventional label inversion with a Gradient-Guided Action Generation mechanism, which searches for worst-case actions within the data manifold using the victim Q-network's gradient. Empirical results on D4RL benchmarks demonstrate that our method significantly outperforms state-of-the-art baselines, achieving high attack success rates against representative safety-constrained algorithms with a minimal 5% poisoning budget, while maintaining the agent's performance in clean environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10418",
        "abs_url": "https://arxiv.org/abs/2601.10418",
        "pdf_url": "https://arxiv.org/pdf/2601.10418",
        "title": "Reinforcement Learning with Multi-Step Lookahead Information Via Adaptive Batching",
        "authors": [
            "Nadav Merlis"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study tabular reinforcement learning problems with multiple steps of lookahead information. Before acting, the learner observes $\\ell$ steps of future transition and reward realizations: the exact state the agent would reach and the rewards it would collect under any possible course of action. While it has been shown that such information can drastically boost the value, finding the optimal policy is NP-hard, and it is common to apply one of two tractable heuristics: processing the lookahead in chunks of predefined sizes ('fixed batching policies'), and model predictive control. We first illustrate the problems with these two approaches and propose utilizing the lookahead in adaptive (state-dependent) batches; we refer to such policies as adaptive batching policies (ABPs). We derive the optimal Bellman equations for these strategies and design an optimistic regret-minimizing algorithm that enables learning the optimal ABP when interacting with unknown environments. Our regret bounds are order-optimal up to a potential factor of the lookahead horizon $\\ell$, which can usually be considered a small constant.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10471",
        "abs_url": "https://arxiv.org/abs/2601.10471",
        "pdf_url": "https://arxiv.org/pdf/2601.10471",
        "title": "DeFlow: Decoupling Manifold Modeling and Value Maximization for Offline Policy Extraction",
        "authors": [
            "Zhancun Mu"
        ],
        "comments": "13 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present DeFlow, a decoupled offline RL framework that leverages flow matching to faithfully capture complex behavior manifolds. Optimizing generative policies is computationally prohibitive, typically necessitating backpropagation through ODE solvers. We address this by learning a lightweight refinement module within an explicit, data-derived trust region of the flow manifold, rather than sacrificing the iterative generation capability via single-step distillation. This way, we bypass solver differentiation and eliminate the need for balancing loss terms, ensuring stable improvement while fully preserving the flow's iterative expressivity. Empirically, DeFlow achieves superior performance on the challenging OGBench benchmark and demonstrates efficient offline-to-online adaptation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10491",
        "abs_url": "https://arxiv.org/abs/2601.10491",
        "pdf_url": "https://arxiv.org/pdf/2601.10491",
        "title": "Communication-Efficient Federated Learning by Exploiting Spatio-Temporal Correlations of Gradients",
        "authors": [
            "Shenlong Zheng",
            "Zhen Zhang",
            "Yuhui Deng",
            "Geyong Min",
            "Lin Cui"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Communication overhead is a critical challenge in federated learning, particularly in bandwidth-constrained networks. Although many methods have been proposed to reduce communication overhead, most focus solely on compressing individual gradients, overlooking the temporal correlations among them. Prior studies have shown that gradients exhibit spatial correlations, typically reflected in low-rank structures. Through empirical analysis, we further observe a strong temporal correlation between client gradients across adjacent rounds. Based on these observations, we propose GradESTC, a compression technique that exploits both spatial and temporal gradient correlations. GradESTC exploits spatial correlations to decompose each full gradient into a compact set of basis vectors and corresponding combination coefficients. By exploiting temporal correlations, only a small portion of the basis vectors need to be dynamically updated in each round. GradESTC significantly reduces communication overhead by transmitting lightweight combination coefficients and a limited number of updated basis vectors instead of the full gradients. Extensive experiments show that, upon reaching a target accuracy level near convergence, GradESTC reduces uplink communication by an average of 39.79% compared to the strongest baseline, while maintaining comparable convergence speed and final accuracy to uncompressed FedAvg. By effectively leveraging spatio-temporal gradient structures, GradESTC offers a practical and scalable solution for communication-efficient federated learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10519",
        "abs_url": "https://arxiv.org/abs/2601.10519",
        "pdf_url": "https://arxiv.org/pdf/2601.10519",
        "title": "Transformer-Based Cognitive Radio: Adaptive Modulation Strategies Using Transformer Models",
        "authors": [
            "Andrea Melis",
            "Andrea Piroddi",
            "Roberto Girau"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Cognitive Radio (CR) systems, which dynamically adapt to changing spectrum environments, could benefit significantly from advancements in machine learning technologies. These systems can be enhanced in terms of spectral efficiency, robustness, and security through innovative approaches such as the use of Transformer models. This work investigates the application of Transformer models, specifically the GPT-2 architecture, to generate novel modulation schemes for wireless communications. By training a GPT-2 model on a dataset of existing modulation formulas, new modulation schemes has been created. These generated schemes are then compared to traditional methods using key performance metrics such as Signal-to-Noise Ratio (SNR) and Power Spectrum Density (PSD). The results show that Transformer-generated modulation schemes can achieve performance comparable to, and in some cases outperforming, traditional methods. This demonstrates that advanced CR systems could greatly benefit from the implementation of Transformer models, leading to more efficient, robust, and secure communication systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10541",
        "abs_url": "https://arxiv.org/abs/2601.10541",
        "pdf_url": "https://arxiv.org/pdf/2601.10541",
        "title": "Mixtures of Transparent Local Models",
        "authors": [
            "Niffa Cheick Oumar Diaby",
            "Thierry Duchesne",
            "Mario Marchand"
        ],
        "comments": "44 pages, 32 figues",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The predominance of machine learning models in many spheres of human activity has led to a growing demand for their transparency. The transparency of models makes it possible to discern some factors, such as security or non-discrimination. In this paper, we propose a mixture of transparent local models as an alternative solution for designing interpretable (or transparent) models. Our approach is designed for the situations where a simple and transparent function is suitable for modeling the label of instances in some localities/regions of the input space, but may change abruptly as we move from one locality to another. Consequently, the proposed algorithm is to learn both the transparent labeling function and the locality of the input space where the labeling function achieves a small risk in its assigned locality. By using a new multi-predictor (and multi-locality) loss function, we established rigorous PAC-Bayesian risk bounds for the case of binary linear classification problem and that of linear regression. In both cases, synthetic data sets were used to illustrate how the learning algorithms work. The results obtained from real data sets highlight the competitiveness of our approach compared to other existing methods as well as certain opaque models. Keywords: PAC-Bayes, risk bounds, local models, transparent models, mixtures of local transparent models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10563",
        "abs_url": "https://arxiv.org/abs/2601.10563",
        "pdf_url": "https://arxiv.org/pdf/2601.10563",
        "title": "Kolmogorov Arnold Networks and Multi-Layer Perceptrons: A Paradigm Shift in Neural Modelling",
        "authors": [
            "Aradhya Gaonkar",
            "Nihal Jain",
            "Vignesh Chougule",
            "Nikhil Deshpande",
            "Sneha Varur",
            "Channabasappa Muttal"
        ],
        "comments": "13 pages, 8 figures, 2 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The research undertakes a comprehensive comparative analysis of Kolmogorov-Arnold Networks (KAN) and Multi-Layer Perceptrons (MLP), highlighting their effectiveness in solving essential computational challenges like nonlinear function approximation, time-series prediction, and multivariate classification. Rooted in Kolmogorov's representation theorem, KANs utilize adaptive spline-based activation functions and grid-based structures, providing a transformative approach compared to traditional neural network frameworks. Utilizing a variety of datasets spanning mathematical function estimation (quadratic and cubic) to practical uses like predicting daily temperatures and categorizing wines, the proposed research thoroughly assesses model performance via accuracy measures like Mean Squared Error (MSE) and computational expense assessed through Floating Point Operations (FLOPs). The results indicate that KANs reliably exceed MLPs in every benchmark, attaining higher predictive accuracy with significantly reduced computational costs. Such an outcome highlights their ability to maintain a balance between computational efficiency and accuracy, rendering them especially beneficial in resource-limited and real-time operational environments. By elucidating the architectural and functional distinctions between KANs and MLPs, the paper provides a systematic framework for selecting the most suitable neural architectures for specific tasks. Furthermore, the proposed study highlights the transformative capabilities of KANs in progressing intelligent systems, influencing their use in situations that require both interpretability and computational efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10583",
        "abs_url": "https://arxiv.org/abs/2601.10583",
        "pdf_url": "https://arxiv.org/pdf/2601.10583",
        "title": "Combinatorial Optimization Augmented Machine Learning",
        "authors": [
            "Maximilian Schiffer",
            "Heiko Hoppe",
            "Yue Su",
            "Louis Bouvier",
            "Axel Parmentier"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "Combinatorial optimization augmented machine learning (COAML) has recently emerged as a powerful paradigm for integrating predictive models with combinatorial decision-making. By embedding combinatorial optimization oracles into learning pipelines, COAML enables the construction of policies that are both data-driven and feasibility-preserving, bridging the traditions of machine learning, operations research, and stochastic optimization. This paper provides a comprehensive overview of the state of the art in COAML. We introduce a unifying framework for COAML pipelines, describe their methodological building blocks, and formalize their connection to empirical cost minimization. We then develop a taxonomy of problem settings based on the form of uncertainty and decision structure. Using this taxonomy, we review algorithmic approaches for static and dynamic problems, survey applications across domains such as scheduling, vehicle routing, stochastic programming, and reinforcement learning, and synthesize methodological contributions in terms of empirical cost minimization, imitation learning, and reinforcement learning. Finally, we identify key research frontiers. This survey aims to serve both as a tutorial introduction to the field and as a roadmap for future research at the interface of combinatorial optimization and machine learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10639",
        "abs_url": "https://arxiv.org/abs/2601.10639",
        "pdf_url": "https://arxiv.org/pdf/2601.10639",
        "title": "STEM: Scaling Transformers with Embedding Modules",
        "authors": [
            "Ranajoy Sadhukhan",
            "Sheng Cao",
            "Harry Dong",
            "Changsheng Zhao",
            "Attiano Purpura-Pontoniere",
            "Yuandong Tian",
            "Zechun Liu",
            "Beidi Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Fine-grained sparsity promises higher parametric capacity without proportional per-token compute, but often suffers from training instability, load balancing, and communication overhead. We introduce STEM (Scaling Transformers with Embedding Modules), a static, token-indexed approach that replaces the FFN up-projection with a layer-local embedding lookup while keeping the gate and down-projection dense. This removes runtime routing, enables CPU offload with asynchronous prefetch, and decouples capacity from both per-token FLOPs and cross-device communication. Empirically, STEM trains stably despite extreme sparsity. It improves downstream performance over dense baselines while reducing per-token FLOPs and parameter accesses (eliminating roughly one-third of FFN parameters). STEM learns embedding spaces with large angular spread which enhances its knowledge storage capacity. More interestingly, this enhanced knowledge capacity comes with better interpretability. The token-indexed nature of STEM embeddings allows simple ways to perform knowledge editing and knowledge injection in an interpretable manner without any intervention in the input text or additional computation. In addition, STEM strengthens long-context performance: as sequence length grows, more distinct parameters are activated, yielding practical test-time capacity scaling. Across 350M and 1B model scales, STEM delivers up to ~3--4% accuracy improvements overall, with notable gains on knowledge and reasoning-heavy benchmarks (ARC-Challenge, OpenBookQA, GSM8K, MMLU). Overall, STEM is an effective way of scaling parametric memory while providing better interpretability, better training stability and improved efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10673",
        "abs_url": "https://arxiv.org/abs/2601.10673",
        "pdf_url": "https://arxiv.org/pdf/2601.10673",
        "title": "Single-Stage Huffman Encoder for ML Compression",
        "authors": [
            "Aditya Agrawal",
            "Albert Magyar",
            "Hiteshwar Eswaraiah",
            "Patrick Sheridan",
            "Pradeep Janedula",
            "Ravi Krishnan Venkatesan",
            "Krishna Nair",
            "Ravi Iyer"
        ],
        "comments": "5 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Training and serving Large Language Models (LLMs) require partitioning data across multiple accelerators, where collective operations are frequently bottlenecked by network bandwidth. Lossless compression using Huffman codes is an effective way to alleviate the issue, however, its three-stage design requiring on-the-fly frequency analysis, codebook generation and transmission of codebook along with data introduces computational, latency and data overheads which are prohibitive for latency-sensitive scenarios such as die-to-die communication. This paper proposes a single-stage Huffman encoder that eliminates these overheads by using fixed codebooks derived from the average probability distribution of previous data batches. Through our analysis of the Gemma 2B model, we demonstrate that tensors exhibit high statistical similarity across layers and shards. Using this approach we achieve compression within 0.5% of per-shard Huffman coding and within 1% of the ideal Shannon compressibility, enabling efficient on-the-fly compression.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10684",
        "abs_url": "https://arxiv.org/abs/2601.10684",
        "pdf_url": "https://arxiv.org/pdf/2601.10684",
        "title": "On the origin of neural scaling laws: from random graphs to natural language",
        "authors": [
            "Maissam Barkeshli",
            "Alberto Alfarano",
            "Andrey Gromov"
        ],
        "comments": "33 pages",
        "subjects": "Machine Learning (cs.LG); Disordered Systems and Neural Networks (cond-mat.dis-nn); Artificial Intelligence (cs.AI); Machine Learning (stat.ML)",
        "abstract": "Scaling laws have played a major role in the modern AI revolution, providing practitioners predictive power over how the model performance will improve with increasing data, compute, and number of model parameters. This has spurred an intense interest in the origin of neural scaling laws, with a common suggestion being that they arise from power law structure already present in the data. In this paper we study scaling laws for transformers trained to predict random walks (bigrams) on graphs with tunable complexity. We demonstrate that this simplified setting already gives rise to neural scaling laws even in the absence of power law structure in the data correlations. We further consider dialing down the complexity of natural language systematically, by training on sequences sampled from increasingly simplified generative language models, from 4,2,1-layer transformer language models down to language bigrams, revealing a monotonic evolution of the scaling exponents. Our results also include scaling laws obtained from training on random walks on random graphs drawn from Erdös-Renyi and scale-free Barabási-Albert ensembles. Finally, we revisit conventional scaling laws for language modeling, demonstrating that several essential results can be reproduced using 2 layer transformers with context length of 50, provide a critical analysis of various fits used in prior literature, demonstrate an alternative method for obtaining compute optimal curves as compared with current practice in published literature, and provide preliminary evidence that maximal update parameterization may be more parameter efficient than standard parameterization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10690",
        "abs_url": "https://arxiv.org/abs/2601.10690",
        "pdf_url": "https://arxiv.org/pdf/2601.10690",
        "title": "Data-driven stochastic reduced-order modeling of parametrized dynamical systems",
        "authors": [
            "Andrew F. Ilersich",
            "Kevin Course",
            "Prasanth B. Nair"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Modeling complex dynamical systems under varying conditions is computationally intensive, often rendering high-fidelity simulations intractable. Although reduced-order models (ROMs) offer a promising solution, current methods often struggle with stochastic dynamics and fail to quantify prediction uncertainty, limiting their utility in robust decision-making contexts. To address these challenges, we introduce a data-driven framework for learning continuous-time stochastic ROMs that generalize across parameter spaces and forcing conditions. Our approach, based on amortized stochastic variational inference, leverages a reparametrization trick for Markov Gaussian processes to eliminate the need for computationally expensive forward solvers during training. This enables us to jointly learn a probabilistic autoencoder and stochastic differential equations governing the latent dynamics, at a computational cost that is independent of the dataset size and system stiffness. Additionally, our approach offers the flexibility of incorporating physics-informed priors if available. Numerical studies are presented for three challenging test problems, where we demonstrate excellent generalization to unseen parameter combinations and forcings, and significant efficiency gains compared to existing approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10701",
        "abs_url": "https://arxiv.org/abs/2601.10701",
        "pdf_url": "https://arxiv.org/pdf/2601.10701",
        "title": "Communication-Efficient and Privacy-Adaptable Mechanism -- a Federated Learning Scheme with Convergence Analysis",
        "authors": [
            "Chun Hei Michael Shiu",
            "Chih Wei Ling"
        ],
        "comments": "19 pages, 5 figures. This work is submitted in part to the 2026 IEEE International Symposium on Information Theory (ISIT). arXiv admin note: substantial text overlap with arXiv:2501.12046",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Federated learning enables multiple parties to jointly train learning models without sharing their own underlying data, offering a practical pathway to privacy-preserving collaboration under data-governance constraints. Continued study of federated learning is essential to address key challenges in it, including communication efficiency and privacy protection between parties. A recent line of work introduced a novel approach called the Communication-Efficient and Privacy-Adaptable Mechanism (CEPAM), which achieves both objectives simultaneously. CEPAM leverages the rejection-sampled universal quantizer (RSUQ), a randomized vector quantizer whose quantization error is equivalent to a prescribed noise, which can be tuned to customize privacy protection between parties. In this work, we theoretically analyze the privacy guarantees and convergence properties of CEPAM. Moreover, we assess CEPAM's utility performance through experimental evaluations, including convergence profiles compared with other baselines, and accuracy-privacy trade-offs between different parties.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10705",
        "abs_url": "https://arxiv.org/abs/2601.10705",
        "pdf_url": "https://arxiv.org/pdf/2601.10705",
        "title": "Distributed Perceptron under Bounded Staleness, Partial Participation, and Noisy Communication",
        "authors": [
            "Keval Jain",
            "Anant Raj",
            "Saurav Prakash",
            "Girish Varma"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We study a semi-asynchronous client-server perceptron trained via iterative parameter mixing (IPM-style averaging): clients run local perceptron updates and a server forms a global model by aggregating the updates that arrive in each communication round. The setting captures three system effects in federated and distributed deployments: (i) stale updates due to delayed model delivery and delayed application of client computations (two-sided version lag), (ii) partial participation (intermittent client availability), and (iii) imperfect communication on both downlink and uplink, modeled as effective zero-mean additive noise with bounded second moment. We introduce a server-side aggregation rule called staleness-bucket aggregation with padding that deterministically enforces a prescribed staleness profile over update ages without assuming any stochastic model for delays or participation. Under margin separability and bounded data radius, we prove a finite-horizon expected bound on the cumulative weighted number of perceptron mistakes over a given number of server rounds: the impact of delay appears only through the mean enforced staleness, whereas communication noise contributes an additional term that grows on the order of the square root of the horizon with the total noise energy. In the noiseless case, we show how a finite expected mistake budget yields an explicit finite-round stabilization bound under a mild fresh-participation condition.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10708",
        "abs_url": "https://arxiv.org/abs/2601.10708",
        "pdf_url": "https://arxiv.org/pdf/2601.10708",
        "title": "High-accuracy and dimension-free sampling with diffusions",
        "authors": [
            "Khashayar Gatmiry",
            "Sitan Chen",
            "Adil Salim"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "Diffusion models have shown remarkable empirical success in sampling from rich multi-modal distributions. Their inference relies on numerically solving a certain differential equation. This differential equation cannot be solved in closed form, and its resolution via discretization typically requires many small iterations to produce \\emph{high-quality} samples. More precisely, prior works have shown that the iteration complexity of discretization methods for diffusion models scales polynomially in the ambient dimension and the inverse accuracy $1/\\varepsilon$. In this work, we propose a new solver for diffusion models relying on a subtle interplay between low-degree approximation and the collocation method (Lee, Song, Vempala 2018), and we prove that its iteration complexity scales \\emph{polylogarithmically} in $1/\\varepsilon$, yielding the first ``high-accuracy'' guarantee for a diffusion-based sampler that only uses (approximate) access to the scores of the data distribution. In addition, our bound does not depend explicitly on the ambient dimension; more precisely, the dimension affects the complexity of our solver through the \\emph{effective radius} of the support of the target distribution only.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10715",
        "abs_url": "https://arxiv.org/abs/2601.10715",
        "pdf_url": "https://arxiv.org/pdf/2601.10715",
        "title": "DInf-Grid: A Neural Differential Equation Solver with Differentiable Feature Grids",
        "authors": [
            "Navami Kairanda",
            "Shanthika Naik",
            "Marc Habermann",
            "Avinash Sharma",
            "Christian Theobalt",
            "Vladislav Golyanik"
        ],
        "comments": "25 pages; 16 figures; project page: this https URL",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present a novel differentiable grid-based representation for efficiently solving differential equations (DEs). Widely used architectures for neural solvers, such as sinusoidal neural networks, are coordinate-based MLPs that are both computationally intensive and slow to train. Although grid-based alternatives for implicit representations (e.g., Instant-NGP and K-Planes) train faster by exploiting signal structure, their reliance on linear interpolation restricts their ability to compute higher-order derivatives, rendering them unsuitable for solving DEs. Our approach overcomes these limitations by combining the efficiency of feature grids with radial basis function interpolation, which is infinitely differentiable. To effectively capture high-frequency solutions and enable stable and faster computation of global gradients, we introduce a multi-resolution decomposition with co-located grids. Our proposed representation, DInf-Grid, is trained implicitly using the differential equations as loss functions, enabling accurate modelling of physical fields. We validate DInf-Grid on a variety of tasks, including the Poisson equation for image reconstruction, the Helmholtz equation for wave fields, and the Kirchhoff-Love boundary value problem for cloth simulation. Our results demonstrate a 5-20x speed-up over coordinate-based MLP-based methods, solving differential equations in seconds or minutes while maintaining comparable accuracy and compactness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09727",
        "abs_url": "https://arxiv.org/abs/2601.09727",
        "pdf_url": "https://arxiv.org/pdf/2601.09727",
        "title": "SciNets: Graph-Constrained Multi-Hop Reasoning for Scientific Literature Synthesis",
        "authors": [
            "Sauhard Dubey"
        ],
        "comments": "19 pages, 2 figures",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Cross-domain scientific synthesis requires connecting mechanistic explanations across fragmented literature, a capability that remains challenging for both retrieval-based systems and unconstrained language models. While recent work has applied large language models to scientific summarization and question answering, these approaches provide limited control over reasoning depth and structural grounding. We frame mechanistic synthesis as a graph-constrained multi-hop reasoning problem over literature-derived concept graphs. Given a scientific query and a compact, query-local corpus, SciNets constructs a directed concept graph and synthesizes mechanistic explanations by identifying multi-hop reasoning paths that connect concepts that rarely co-occur within individual papers. We systematically compare shortest-path reasoning, k-shortest paths with diversity constraints, stochastic random walks, and a retrieval-augmented language model baseline. Rather than evaluating correctness, which is often indeterminate when synthesizing connections across distributed sources, we introduce a behavioral framework that measures symbolic reasoning depth, mechanistic diversity, and grounding stability. Across machine learning, biology, and climate science tasks, explicit graph constraints enable controllable multi-hop reasoning while revealing a consistent trade-off: deeper and more diverse symbolic reasoning increases grounding instability, whereas shortest-path reasoning remains highly stable but structurally conservative. These findings provide a systematic behavioral characterization of the limits and capabilities of current graph-LLM integration for scientific synthesis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09749",
        "abs_url": "https://arxiv.org/abs/2601.09749",
        "pdf_url": "https://arxiv.org/pdf/2601.09749",
        "title": "R-LAM: Reproducibility-Constrained Large Action Models for Scientific Workflow Automation",
        "authors": [
            "Suriya Sureshkumar"
        ],
        "comments": "9 pages, 3 figures, 1 Table, 2 Artifacts",
        "subjects": "Software Engineering (cs.SE); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large Action Models (LAMs) extend large language models by enabling autonomous decision-making and tool execution, making them promising for automating scientific workflows. However, scientific workflows impose strict requirements on reproducibility, auditability, and deterministic execution, which are not satisfied by generic LLM-based agents. Unconstrained action generation can lead to silent state changes, non-deterministic executions, and irreproducible experimental results, limiting the applicability of LAMs in scientific settings. In this paper, we propose R-LAM, a reproducibility-constrained framework for applying Large Action Models to scientific workflow automation. R-LAM introduces structured action schemas, deterministic execution policies, and explicit provenance tracking to ensure that every action and intermediate artifact is auditable and replayable. The framework supports failure-aware execution loops and controlled workflow forking, enabling iterative experimentation without compromising reproducibility. We implement R-LAM as a lightweight Python framework and release it as an open-source PyPI package to facilitate reproducible research. An experimental evaluation of representative scientific workflows demonstrates that R-LAM improves reproducibility success rates and execution reliability compared to unconstrained LLM-based agents, while retaining adaptive control over workflow execution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09758",
        "abs_url": "https://arxiv.org/abs/2601.09758",
        "pdf_url": "https://arxiv.org/pdf/2601.09758",
        "title": "Detecting Batch Heterogeneity via Likelihood Clustering",
        "authors": [
            "Austin Talbot",
            "Yue Ke"
        ],
        "comments": "",
        "subjects": "Genomics (q-bio.GN); Machine Learning (cs.LG); Methodology (stat.ME); Machine Learning (stat.ML)",
        "abstract": "Batch effects represent a major confounder in genomic diagnostics. In copy number variant (CNV) detection from NGS, many algorithms compare read depth between test samples and a reference sample, assuming they are process-matched. When this assumption is violated, with causes ranging from reagent lot changes to multi-site processing, the reference becomes inappropriate, introducing false CNV calls or masking true pathogenic variants. Detecting such heterogeneity before downstream analysis is critical for reliable clinical interpretation. Existing batch effect detection methods either cluster samples based on raw features, risking conflation of biological signal with technical variation, or require known batch labels that are frequently unavailable. We introduce a method that addresses both limitations by clustering samples according to their Bayesian model evidence. The central insight is that evidence quantifies compatibility between data and model assumptions, technical artifacts violate assumptions and reduce evidence, whereas biological variation, including CNV status, is anticipated by the model and yields high evidence. This asymmetry provides a discriminative signal that separates batch effects from biology. We formalize heterogeneity detection as a likelihood ratio test for mixture structure in evidence space, using parametric bootstrap calibration to ensure conservative false positive rates. We validate our approach on synthetic data demonstrating proper Type I error control, three clinical targeted sequencing panels (liquid biopsy, BRCA, and thalassemia) exhibiting distinct batch effect mechanisms, and mouse electrophysiology recordings demonstrating cross-modality generalization. Our method achieves superior clustering accuracy compared to standard correlation-based and dimensionality-reduction approaches while maintaining the conservativeness required for clinical usage.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09848",
        "abs_url": "https://arxiv.org/abs/2601.09848",
        "pdf_url": "https://arxiv.org/pdf/2601.09848",
        "title": "Accelerated Regularized Wasserstein Proximal Sampling Algorithms",
        "authors": [
            "Hong Ye Tan",
            "Stanley Osher",
            "Wuchen Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Optimization and Control (math.OC); Computation (stat.CO)",
        "abstract": "We consider sampling from a Gibbs distribution by evolving a finite number of particles using a particular score estimator rather than Brownian motion. To accelerate the particles, we consider a second-order score-based ODE, similar to Nesterov acceleration. In contrast to traditional kernel density score estimation, we use the recently proposed regularized Wasserstein proximal method, yielding the Accelerated Regularized Wasserstein Proximal method (ARWP). We provide a detailed analysis of continuous- and discrete-time non-asymptotic and asymptotic mixing rates for Gaussian initial and target distributions, using techniques from Euclidean acceleration and accelerated information gradients. Compared with the kinetic Langevin sampling algorithm, the proposed algorithm exhibits a higher contraction rate in the asymptotic time regime. Numerical experiments are conducted across various low-dimensional experiments, including multi-modal Gaussian mixtures and ill-conditioned Rosenbrock distributions. ARWP exhibits structured and convergent particles, accelerated discrete-time mixing, and faster tail exploration than the non-accelerated regularized Wasserstein proximal method and kinetic Langevin methods. Additionally, ARWP particles exhibit better generalization properties for some non-log-concave Bayesian neural network tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09859",
        "abs_url": "https://arxiv.org/abs/2601.09859",
        "pdf_url": "https://arxiv.org/pdf/2601.09859",
        "title": "Breaking the Limits of Open-Weight CLIP: An Optimization Framework for Self-supervised Fine-tuning of CLIP",
        "authors": [
            "Anant Mehta",
            "Xiyuan Wei",
            "Xingyu Chen",
            "Tianbao Yang"
        ],
        "comments": "Submitted to ICLR 2026",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "CLIP has become a cornerstone of multimodal representation learning, yet improving its performance typically requires a prohibitively costly process of training from scratch on billions of samples. We ask a different question: Can we improve the performance of open-weight CLIP models across various downstream tasks using only existing self-supervised datasets? Unlike supervised fine-tuning, which adapts a pretrained model to a single downstream task, our setting seeks to improve general performance across various tasks. However, as both our experiments and prior studies reveal, simply applying standard training protocols starting from an open-weight CLIP model often fails, leading to performance degradation. In this paper, we introduce TuneCLIP, a self-supervised fine-tuning framework that overcomes the performance degradation. TuneCLIP has two key components: (1) a warm-up stage of recovering optimization statistics to reduce cold-start bias, inspired by theoretical analysis, and (2) a fine-tuning stage of optimizing a new contrastive loss to mitigate the penalization on false negative pairs. Our extensive experiments show that TuneCLIP consistently improves performance across model architectures and scales. Notably, it elevates leading open-weight models like SigLIP (ViT-B/16), achieving gains of up to +2.5% on ImageNet and related out-of-distribution benchmarks, and +1.2% on the highly competitive DataComp benchmark, setting a new strong baseline for efficient post-pretraining adaptation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09871",
        "abs_url": "https://arxiv.org/abs/2601.09871",
        "pdf_url": "https://arxiv.org/pdf/2601.09871",
        "title": "Epistemology gives a Future to Complementarity in Human-AI Interactions",
        "authors": [
            "Andrea Ferrario",
            "Alessandro Facchini",
            "Juan M. Durán"
        ],
        "comments": "Submitted to FAccT 2026",
        "subjects": "Artificial Intelligence (cs.AI); Human-Computer Interaction (cs.HC); Machine Learning (cs.LG)",
        "abstract": "Human-AI complementarity is the claim that a human supported by an AI system can outperform either alone in a decision-making process. Since its introduction in the human-AI interaction literature, it has gained traction by generalizing the reliance paradigm and by offering a more practical alternative to the contested construct of 'trust in AI.' Yet complementarity faces key theoretical challenges: it lacks precise theoretical anchoring, it is formalized just as a post hoc indicator of relative predictive accuracy, it remains silent about other desiderata of human-AI interactions and it abstracts away from the magnitude-cost profile of its performance gain. As a result, complementarity is difficult to obtain in empirical settings. In this work, we leverage epistemology to address these challenges by reframing complementarity within the discourse on justificatory AI. Drawing on computational reliabilism, we argue that historical instances of complementarity function as evidence that a given human-AI interaction is a reliable epistemic process for a given predictive task. Together with other reliability indicators assessing the alignment of the human-AI team with the epistemic standards and socio-technical practices, complementarity contributes to the degree of reliability of human-AI teams when generating predictions. This supports the practical reasoning of those affected by these outputs -- patients, managers, regulators, and others. In summary, our approach suggests that the role and value of complementarity lies not in providing a relative measure of predictive accuracy, but in helping calibrate decision-making to the reliability of AI-supported processes that increasingly shape everyday life.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09902",
        "abs_url": "https://arxiv.org/abs/2601.09902",
        "pdf_url": "https://arxiv.org/pdf/2601.09902",
        "title": "A Novel Contrastive Loss for Zero-Day Network Intrusion Detection",
        "authors": [
            "Jack Wilkie",
            "Hanan Hindy",
            "Craig Michie",
            "Christos Tachtatzis",
            "James Irvine",
            "Robert Atkinson"
        ],
        "comments": "Published in: IEEE Transactions on Network Service and Management (TNSM), 2026. Official version: this https URL Code: this https URL",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "Machine learning has achieved state-of-the-art results in network intrusion detection; however, its performance significantly degrades when confronted by a new attack class -- a zero-day attack. In simple terms, classical machine learning-based approaches are adept at identifying attack classes on which they have been previously trained, but struggle with those not included in their training data. One approach to addressing this shortcoming is to utilise anomaly detectors which train exclusively on benign data with the goal of generalising to all attack classes -- both known and zero-day. However, this comes at the expense of a prohibitively high false positive rate. This work proposes a novel contrastive loss function which is able to maintain the advantages of other contrastive learning-based approaches (robustness to imbalanced data) but can also generalise to zero-day attacks. Unlike anomaly detectors, this model learns the distributions of benign traffic using both benign and known malign samples, i.e. other well-known attack classes (not including the zero-day class), and consequently, achieves significant performance improvements. The proposed approach is experimentally verified on the Lycos2017 dataset where it achieves an AUROC improvement of .000065 and .060883 over previous models in known and zero-day attack detection, respectively. Finally, the proposed method is extended to open-set recognition achieving OpenAUC improvements of .170883 over existing approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.09980",
        "abs_url": "https://arxiv.org/abs/2601.09980",
        "pdf_url": "https://arxiv.org/pdf/2601.09980",
        "title": "Performance of AI agents based on reasoning language models on ALD process optimization tasks",
        "authors": [
            "Angel Yanguas-Gil"
        ],
        "comments": "",
        "subjects": "Materials Science (cond-mat.mtrl-sci); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "In this work we explore the performance and behavior of reasoning large language models to autonomously optimize atomic layer deposition (ALD) processes. In the ALD process optimization task, an agent built on top of a reasoning LLM has to find optimal dose times for an ALD precursor and a coreactant without any prior knowledge on the process, including whether it is actually self-limited. The agent is meant to interact iteratively with an ALD reactor in a fully unsupervised way. We evaluate this agent using a simple model of an ALD tool that incorporates ALD processes with different self-limited surface reaction pathways as well as a non self-limited component. Our results show that agents based on reasoning models like OpenAI's o3 and GPT5 consistently succeeded at completing this optimization task. However, we observed significant run-to-run variability due to the non deterministic nature of the model's response. In order to understand the logic followed by the reasoning model, the agent uses a two step process in which the model first generates an open response detailing the reasoning process. This response is then transformed into a structured output. An analysis of these reasoning traces showed that the logic of the model was sound and that its reasoning was based on the notions of self-limited process and saturation expected in the case of ALD. However, the agent can sometimes be misled by its own prior choices when exploring the optimization space.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10004",
        "abs_url": "https://arxiv.org/abs/2601.10004",
        "pdf_url": "https://arxiv.org/pdf/2601.10004",
        "title": "SoK: Privacy-aware LLM in Healthcare: Threat Model, Privacy Techniques, Challenges and Recommendations",
        "authors": [
            "Mohoshin Ara Tahera",
            "Karamveer Singh Sidhu",
            "Shuvalaxmi Dass",
            "Sajal Saha"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) are increasingly adopted in healthcare to support clinical decision-making, summarize electronic health records (EHRs), and enhance patient care. However, this integration introduces significant privacy and security challenges, driven by the sensitivity of clinical data and the high-stakes nature of medical workflows. These risks become even more pronounced across heterogeneous deployment environments, ranging from small on-premise hospital systems to regional health networks, each with unique resource limitations and regulatory demands. This Systematization of Knowledge (SoK) examines the evolving threat landscape across the three core LLM phases: Data preprocessing, Fine-tuning, and Inference within realistic healthcare settings. We present a detailed threat model that characterizes adversaries, capabilities, and attack surfaces at each phase, and we systematize how existing privacy-preserving techniques (PPTs) attempt to mitigate these vulnerabilities. While existing defenses show promise, our analysis identifies persistent limitations in securing sensitive clinical data across diverse operational tiers. We conclude with phase-aware recommendations and future research directions aimed at strengthening privacy guarantees for LLMs in regulated environments. This work provides a foundation for understanding the intersection of LLMs, threats, and privacy in healthcare, offering a roadmap toward more robust and clinically trustworthy AI systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10043",
        "abs_url": "https://arxiv.org/abs/2601.10043",
        "pdf_url": "https://arxiv.org/pdf/2601.10043",
        "title": "Instruction Finetuning LLaMA-3-8B Model Using LoRA for Financial Named Entity Recognition",
        "authors": [
            "Zhiming Lian"
        ],
        "comments": "",
        "subjects": "Computational Finance (q-fin.CP); Machine Learning (cs.LG)",
        "abstract": "Particularly, financial named-entity recognition (NER) is one of the many important approaches to translate unformatted reports and news into structured knowledge graphs. However, free, easy-to-use large language models (LLMs) often fail to differentiate organisations as people, or disregard an actual monetary amount entirely. This paper takes Meta's Llama 3 8B and applies it to financial NER by combining instruction fine-tuning and Low-Rank Adaptation (LoRA). Each annotated sentence is converted into an instruction-input-output triple, enabling the model to learn task descriptions while fine-tuning with small low-rank matrices instead of updating all weights. Using a corpus of 1,693 sentences, our method obtains a micro-F1 score of 0.894 compared with Qwen3-8B, Baichuan2-7B, T5, and BERT-Base. We present dataset statistics, describe training hyperparameters, and perform visualizations of entity density, learning curves, and evaluation metrics. Our results show that instruction tuning combined with parameter-efficient fine-tuning enables state-of-the-art performance on domain-sensitive NER.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10094",
        "abs_url": "https://arxiv.org/abs/2601.10094",
        "pdf_url": "https://arxiv.org/pdf/2601.10094",
        "title": "V-Zero: Self-Improving Multimodal Reasoning with Zero Annotation",
        "authors": [
            "Han Wang",
            "Yi Yang",
            "Jingyuan Hu",
            "Minfeng Zhu",
            "Wei Chen"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Recent advances in multimodal learning have significantly enhanced the reasoning capabilities of vision-language models (VLMs). However, state-of-the-art approaches rely heavily on large-scale human-annotated datasets, which are costly and time-consuming to acquire. To overcome this limitation, we introduce V-Zero, a general post-training framework that facilitates self-improvement using exclusively unlabeled images. V-Zero establishes a co-evolutionary loop by instantiating two distinct roles: a Questioner and a Solver. The Questioner learns to synthesize high-quality, challenging questions by leveraging a dual-track reasoning reward that contrasts intuitive guesses with reasoned results. The Solver is optimized using pseudo-labels derived from majority voting over its own sampled responses. Both roles are trained iteratively via Group Relative Policy Optimization (GRPO), driving a cycle of mutual enhancement. Remarkably, without a single human annotation, V-Zero achieves consistent performance gains on Qwen2.5-VL-7B-Instruct, improving visual mathematical reasoning by +1.7 and general vision-centric by +2.6, demonstrating the potential of self-improvement in multimodal systems. Code is available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10154",
        "abs_url": "https://arxiv.org/abs/2601.10154",
        "pdf_url": "https://arxiv.org/pdf/2601.10154",
        "title": "MHub.ai: A Simple, Standardized, and Reproducible Platform for AI Models in Medical Imaging",
        "authors": [
            "Leonard Nürnberg",
            "Dennis Bontempi",
            "Suraj Pai",
            "Curtis Lisle",
            "Steve Pieper",
            "Ron Kikinis",
            "Sil van de Leemput",
            "Rahul Soni",
            "Gowtham Murugesan",
            "Cosmin Ciausu",
            "Miriam Groeneveld",
            "Felix J. Dorfner",
            "Jue Jiang",
            "Aneesh Rangnekar",
            "Harini Veeraraghavan",
            "Joeran S. Bosma",
            "Keno Bressem",
            "Raymond Mak",
            "Andrey Fedorov",
            "Hugo JWL Aerts"
        ],
        "comments": "41 pages, 15 figures, 6 tables",
        "subjects": "Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV); Emerging Technologies (cs.ET); Machine Learning (cs.LG); Software Engineering (cs.SE)",
        "abstract": "Artificial intelligence (AI) has the potential to transform medical imaging by automating image analysis and accelerating clinical research. However, research and clinical use are limited by the wide variety of AI implementations and architectures, inconsistent documentation, and reproducibility issues. Here, we introduce this http URL, an open-source, container-based platform that standardizes access to AI models with minimal configuration, promoting accessibility and reproducibility in medical imaging. this http URL packages models from peer-reviewed publications into standardized containers that support direct processing of DICOM and other formats, provide a unified application interface, and embed structured metadata. Each model is accompanied by publicly available reference data that can be used to confirm model operation. this http URL includes an initial set of state-of-the-art segmentation, prediction, and feature extraction models for different modalities. The modular framework enables adaptation of any model and supports community contributions. We demonstrate the utility of the platform in a clinical use case through comparative evaluation of lung segmentation models. To further strengthen transparency and reproducibility, we publicly release the generated segmentations and evaluation metrics and provide interactive dashboards that allow readers to inspect individual cases and reproduce or extend our analysis. By simplifying model use, this http URL enables side-by-side benchmarking with identical execution commands and standardized outputs, and lowers the barrier to clinical translation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10245",
        "abs_url": "https://arxiv.org/abs/2601.10245",
        "pdf_url": "https://arxiv.org/pdf/2601.10245",
        "title": "TRIM: Hybrid Inference via Targeted Stepwise Routing in Multi-Step Reasoning Tasks",
        "authors": [
            "Vansh Kapoor",
            "Aman Gupta",
            "Hao Chen",
            "Anurag Beniwal",
            "Jing Huang",
            "Aviral Kumar"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Multi-step reasoning tasks like mathematical problem solving are vulnerable to cascading failures, where a single incorrect step leads to complete solution breakdown. Current LLM routing methods assign entire queries to one model, treating all reasoning steps as equal. We propose TRIM (Targeted routing in multi-step reasoning tasks), which routes only critical steps$\\unicode{x2013}$those likely to derail the solution$\\unicode{x2013}$to larger models while letting smaller models handle routine continuations. Our key insight is that targeted step-level interventions can fundamentally transform inference efficiency by confining expensive calls to precisely those steps where stronger models prevent cascading errors. TRIM operates at the step-level: it uses process reward models to identify erroneous steps and makes routing decisions based on step-level uncertainty and budget constraints. We develop several routing strategies within TRIM, ranging from a simple threshold-based policy to more expressive policies that reason about long-horizon accuracy-cost trade-offs and uncertainty in step-level correctness estimates. On MATH-500, even the simplest thresholding strategy surpasses prior routing methods with 5x higher cost efficiency, while more advanced policies match the strong, expensive model's performance using 80% fewer expensive model tokens. On harder benchmarks such as AIME, TRIM achieves up to 6x higher cost efficiency. All methods generalize effectively across math reasoning tasks, demonstrating that step-level difficulty represents fundamental characteristics of reasoning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10264",
        "abs_url": "https://arxiv.org/abs/2601.10264",
        "pdf_url": "https://arxiv.org/pdf/2601.10264",
        "title": "Sim2Real Deep Transfer for Per-Device CFO Calibration",
        "authors": [
            "Jingze Zheng",
            "Zhiguo Shi",
            "Shibo He",
            "Chaojie Gu"
        ],
        "comments": "Accepted by Globecom 2025",
        "subjects": "Signal Processing (eess.SP); Machine Learning (cs.LG)",
        "abstract": "Carrier Frequency Offset (CFO) estimation in Orthogonal Frequency Division Multiplexing (OFDM) systems faces significant performance degradation across heterogeneous software-defined radio (SDR) platforms due to uncalibrated hardware impairments. Existing deep neural network (DNN)-based approaches lack device-level adaptation, limiting their practical deployment. This paper proposes a Sim2Real transfer learning framework for per-device CFO calibration, combining simulation-driven pretraining with lightweight receiver adaptation. A backbone DNN is pre-trained on synthetic OFDM signals incorporating parametric hardware distortions (e.g., phase noise, IQ imbalance), enabling generalized feature learning without costly cross-device data collection. Subsequently, only the regression layers are fine-tuned using $1,000$ real frames per target device, preserving hardware-agnostic knowledge while adapting to device-specific impairments. Experiments across three SDR families (USRP B210, USRP N210, HackRF One) achieve $30\\times$ BER reduction compared to conventional CP-based methods under indoor multipath conditions. The framework bridges the simulation-to-reality gap for robust CFO estimation, enabling cost-effective deployment in heterogeneous wireless systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10321",
        "abs_url": "https://arxiv.org/abs/2601.10321",
        "pdf_url": "https://arxiv.org/pdf/2601.10321",
        "title": "An Efficient Long-Context Ranking Architecture With Calibrated LLM Distillation: Application to Person-Job Fit",
        "authors": [
            "Warren Jouanneau",
            "Emma Jouffroy",
            "Marc Palyart"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Information Retrieval (cs.IR); Machine Learning (cs.LG); Social and Information Networks (cs.SI)",
        "abstract": "Finding the most relevant person for a job proposal in real time is challenging, especially when resumes are long, structured, and multilingual. In this paper, we propose a re-ranking model based on a new generation of late cross-attention architecture, that decomposes both resumes and project briefs to efficiently handle long-context inputs with minimal computational overhead. To mitigate historical data biases, we use a generative large language model (LLM) as a teacher, generating fine-grained, semantically grounded supervision. This signal is distilled into our student model via an enriched distillation loss function. The resulting model produces skill-fit scores that enable consistent and interpretable person-job matching. Experiments on relevance, ranking, and calibration metrics demonstrate that our approach outperforms state-of-the-art baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10348",
        "abs_url": "https://arxiv.org/abs/2601.10348",
        "pdf_url": "https://arxiv.org/pdf/2601.10348",
        "title": "Training-Trajectory-Aware Token Selection",
        "authors": [
            "Zhanming Shen",
            "Jiaqi Hu",
            "Zeyu Qin",
            "Hao Chen",
            "Wentao Ye",
            "Zenan Huang",
            "Yihong Zhuang",
            "Guoshan Lu",
            "Junlin Zhou",
            "Junbo Zhao"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Efficient distillation is a key pathway for converting expensive reasoning capability into deployable efficiency, yet in the frontier regime where the student already has strong reasoning ability, naive continual distillation often yields limited gains or even degradation. We observe a characteristic training phenomenon: even as loss decreases monotonically, all performance metrics can drop sharply at almost the same bottleneck, before gradually recovering. We further uncover a token-level mechanism: confidence bifurcates into steadily increasing Imitation-Anchor Tokens that quickly anchor optimization and other yet-to-learn tokens whose confidence is suppressed until after the bottleneck. And the characteristic that these two types of tokens cannot coexist is the root cause of the failure in continual distillation. To this end, we propose Training-Trajectory-Aware Token Selection (T3S) to reconstruct the training objective at the token level, clearing the optimization path for yet-to-learn tokens. T3 yields consistent gains in both AR and dLLM settings: with only hundreds of examples, Qwen3-8B surpasses DeepSeek-R1 on competitive reasoning benchmarks, Qwen3-32B approaches Qwen3-235B, and T3-trained LLaDA-2.0-Mini exceeds its AR baseline, achieving state-of-the-art performance among all of 16B-scale no-think models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10453",
        "abs_url": "https://arxiv.org/abs/2601.10453",
        "pdf_url": "https://arxiv.org/pdf/2601.10453",
        "title": "Stable Differentiable Modal Synthesis for Learning Nonlinear Dynamics",
        "authors": [
            "Victor Zheleznov",
            "Stefan Bilbao",
            "Alec Wright",
            "Simon King"
        ],
        "comments": "Submitted to the Journal of Audio Engineering Society (December 2025)",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG); Audio and Speech Processing (eess.AS); Computational Physics (physics.comp-ph)",
        "abstract": "Modal methods are a long-standing approach to physical modelling synthesis. Extensions to nonlinear problems are possible, including the case of a high-amplitude vibration of a string. A modal decomposition leads to a densely coupled nonlinear system of ordinary differential equations. Recent work in scalar auxiliary variable techniques has enabled construction of explicit and stable numerical solvers for such classes of nonlinear systems. On the other hand, machine learning approaches (in particular neural ordinary differential equations) have been successful in modelling nonlinear systems automatically from data. In this work, we examine how scalar auxiliary variable techniques can be combined with neural ordinary differential equations to yield a stable differentiable model capable of learning nonlinear dynamics. The proposed approach leverages the analytical solution for linear vibration of system's modes so that physical parameters of a system remain easily accessible after the training without the need for a parameter encoder in the model architecture. As a proof of concept, we generate synthetic data for the nonlinear transverse vibration of a string and show that the model can be trained to reproduce the nonlinear dynamics of the system. Sound examples are presented.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10458",
        "abs_url": "https://arxiv.org/abs/2601.10458",
        "pdf_url": "https://arxiv.org/pdf/2601.10458",
        "title": "LangLasso: Interactive Cluster Descriptions through LLM Explanation",
        "authors": [
            "Raphael Buchmüller",
            "Dennis Collaris",
            "Linhao Meng",
            "Angelos Chatzimparmpas"
        ],
        "comments": "This manuscript is accepted for publication in VIS 2025 VISxGenAI Workshop",
        "subjects": "Human-Computer Interaction (cs.HC); Machine Learning (cs.LG); Computation (stat.CO)",
        "abstract": "Dimensionality reduction is a powerful technique for revealing structure and potential clusters in data. However, as the axes are complex, non-linear combinations of features, they often lack semantic interpretability. Existing visual analytics (VA) methods support cluster interpretation through feature comparison and interactive exploration, but they require technical expertise and intense human effort. We present \\textit{LangLasso}, a novel method that complements VA approaches through interactive, natural language descriptions of clusters using large language models (LLMs). It produces human-readable descriptions that make cluster interpretation accessible to non-experts and allow integration of external contextual knowledge beyond the dataset. We systematically evaluate the reliability of these explanations and demonstrate that \\langlasso provides an effective first step for engaging broader audiences in cluster interpretation. The tool is available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10479",
        "abs_url": "https://arxiv.org/abs/2601.10479",
        "pdf_url": "https://arxiv.org/pdf/2601.10479",
        "title": "H-EFT-VA: An Effective-Field-Theory Variational Ansatz with Provable Barren Plateau Avoidance",
        "authors": [
            "Eyad I.B Hamid"
        ],
        "comments": "7 pages, 5 figuers, Appendix",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG); Mathematical Physics (math-ph)",
        "abstract": "Variational Quantum Algorithms (VQAs) are critically threatened by the Barren Plateau (BP) phenomenon. In this work, we introduce the H-EFT Variational Ansatz (H-EFT-VA), an architecture inspired by Effective Field Theory (EFT). By enforcing a hierarchical \"UV-cutoff\" on initialization, we theoretically restrict the circuit's state exploration, preventing the formation of approximate unitary 2-designs. We provide a rigorous proof that this localization guarantees an inverse-polynomial lower bound on the gradient variance: $Var[\\partial \\theta] \\in \\Omega(1/poly(N))$. Crucially, unlike approaches that avoid BPs by limiting entanglement, we demonstrate that H-EFT-VA maintains volume-law entanglement and near-Haar purity, ensuring sufficient expressibility for complex quantum states. Extensive benchmarking across 16 experiments -- including Transverse Field Ising and Heisenberg XXZ models -- confirms a 109x improvement in energy convergence and a 10.7x increase in ground-state fidelity over standard Hardware-Efficient Ansatze (HEA), with a statistical significance of $p < 10^{-88}$.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10494",
        "abs_url": "https://arxiv.org/abs/2601.10494",
        "pdf_url": "https://arxiv.org/pdf/2601.10494",
        "title": "CROCS: A Two-Stage Clustering Framework for Behaviour-Centric Consumer Segmentation with Smart Meter Data",
        "authors": [
            "Luke W. Yerbury",
            "Ricardo J. G. B. Campello",
            "G. C. Livingston Jr",
            "Mark Goldsworthy",
            "Lachlan O'Neil"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "With grid operators confronting rising uncertainty from renewable integration and a broader push toward electrification, Demand-Side Management (DSM) -- particularly Demand Response (DR) -- has attracted significant attention as a cost-effective mechanism for balancing modern electricity systems. Unprecedented volumes of consumption data from a continuing global deployment of smart meters enable consumer segmentation based on real usage behaviours, promising to inform the design of more effective DSM and DR programs. However, existing clustering-based segmentation methods insufficiently reflect the behavioural diversity of consumers, often relying on rigid temporal alignment, and faltering in the presence of anomalies, missing data, or large-scale deployments. To address these challenges, we propose a novel two-stage clustering framework -- Clustered Representations Optimising Consumer Segmentation (CROCS). In the first stage, each consumer's daily load profiles are clustered independently to form a Representative Load Set (RLS), providing a compact summary of their typical diurnal consumption behaviours. In the second stage, consumers are clustered using the Weighted Sum of Minimum Distances (WSMD), a novel set-to-set measure that compares RLSs by accounting for both the prevalence and similarity of those behaviours. Finally, community detection on the WSMD-induced graph reveals higher-order prototypes that embody the shared diurnal behaviours defining consumer groups, enhancing the interpretability of the resulting clusters. Extensive experiments on both synthetic and real Australian smart meter datasets demonstrate that CROCS captures intra-consumer variability, uncovers both synchronous and asynchronous behavioural similarities, and remains robust to anomalies and missing data, while scaling efficiently through natural parallelisation. These results...",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10527",
        "abs_url": "https://arxiv.org/abs/2601.10527",
        "pdf_url": "https://arxiv.org/pdf/2601.10527",
        "title": "A Safety Report on GPT-5.2, Gemini 3 Pro, Qwen3-VL, Doubao 1.8, Grok 4.1 Fast, Nano Banana Pro, and Seedream 4.5",
        "authors": [
            "Xingjun Ma",
            "Yixu Wang",
            "Hengyuan Xu",
            "Yutao Wu",
            "Yifan Ding",
            "Yunhan Zhao",
            "Zilong Wang",
            "Jiabin Hua",
            "Ming Wen",
            "Jianan Liu",
            "Ranjie Duan",
            "Yifeng Gao",
            "Yingshui Tan",
            "Yunhao Chen",
            "Hui Xue",
            "Xin Wang",
            "Wei Cheng",
            "Jingjing Chen",
            "Zuxuan Wu",
            "Bo Li",
            "Yu-Gang Jiang"
        ],
        "comments": "42 pages, 24 figures",
        "subjects": "Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG)",
        "abstract": "The rapid evolution of Large Language Models (LLMs) and Multimodal Large Language Models (MLLMs) has produced substantial gains in reasoning, perception, and generative capability across language and vision. However, whether these advances yield commensurate improvements in safety remains unclear, in part due to fragmented evaluation practices limited to single modalities or threat models. In this report, we present an integrated safety evaluation of 7 frontier models: GPT-5.2, Gemini 3 Pro, Qwen3-VL, Doubao 1.8, Grok 4.1 Fast, Nano Banana Pro, and Seedream 4.5. We evaluate each model across language, vision-language, and image generation settings using a unified protocol that integrates benchmark evaluation, adversarial evaluation, multilingual evaluation, and compliance evaluation. Aggregating our evaluations into safety leaderboards and model safety profiles across multiple evaluation modes reveals a sharply heterogeneous safety landscape. While GPT-5.2 demonstrates consistently strong and balanced safety performance across evaluations, other models exhibit pronounced trade-offs among benchmark safety, adversarial alignment, multilingual generalization, and regulatory compliance. Both language and vision-language modalities show significant vulnerability under adversarial evaluation, with all models degrading substantially despite strong results on standard benchmarks. Text-to-image models achieve relatively stronger alignment in regulated visual risk categories, yet remain brittle under adversarial or semantically ambiguous prompts. Overall, these results show that safety in frontier models is inherently multidimensional--shaped by modality, language, and evaluation scheme, underscoring the need for standardized safety evaluations to accurately assess real-world risk and guide responsible model development and deployment.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10531",
        "abs_url": "https://arxiv.org/abs/2601.10531",
        "pdf_url": "https://arxiv.org/pdf/2601.10531",
        "title": "Coarsening Causal DAG Models",
        "authors": [
            "Francisco Madaleno",
            "Pratik Misra",
            "Alex Markham"
        ],
        "comments": "25 pages, 5 figures",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Combinatorics (math.CO)",
        "abstract": "Directed acyclic graphical (DAG) models are a powerful tool for representing causal relationships among jointly distributed random variables, especially concerning data from across different experimental settings. However, it is not always practical or desirable to estimate a causal model at the granularity of given features in a particular dataset. There is a growing body of research on causal abstraction to address such problems. We contribute to this line of research by (i) providing novel graphical identifiability results for practically-relevant interventional settings, (ii) proposing an efficient, provably consistent algorithm for directly learning abstract causal graphs from interventional data with unknown intervention targets, and (iii) uncovering theoretical insights about the lattice structure of the underlying search space, with connections to the field of causal discovery more generally. As proof of concept, we apply our algorithm on synthetic and real datasets with known ground truths, including measurements from a controlled physical system with interacting light intensity and polarization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10536",
        "abs_url": "https://arxiv.org/abs/2601.10536",
        "pdf_url": "https://arxiv.org/pdf/2601.10536",
        "title": "CoGen: Creation of Reusable UI Components in Figma via Textual Commands",
        "authors": [
            "Ishani Kanapathipillai",
            "Obhasha Priyankara"
        ],
        "comments": "8 pages, 6 figures, 11 tables",
        "subjects": "Human-Computer Interaction (cs.HC); Machine Learning (cs.LG)",
        "abstract": "The evolution of User Interface design has emphasized the need for efficient, reusable, and editable components to ensure an efficient design process. This research introduces CoGen, a system that uses machine learning techniques to generate reusable UI components directly in Figma, one of the most popular UI design tools. Addressing gaps in current systems, CoGen focuses on creating atomic components such as buttons, labels, and input fields using structured JSON and natural language prompts. The project integrates Figma API data extraction, Seq2Seq models, and fine-tuned T5 transformers for component generation. The key results demonstrate the efficiency of the T5 model in prompt generation, with an accuracy of 98% and a BLEU score of 0.2668, which ensures the mapping of JSON to descriptive prompts. For JSON creation, CoGen achieves a success rate of up to 100% in generating simple JSON outputs for specified component types.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10566",
        "abs_url": "https://arxiv.org/abs/2601.10566",
        "pdf_url": "https://arxiv.org/pdf/2601.10566",
        "title": "Representation-Aware Unlearning via Activation Signatures: From Suppression to Knowledge-Signature Erasure",
        "authors": [
            "Syed Naveed Mahmood",
            "Md. Rezaur Rahman Bhuiyan",
            "Tasfia Zaman",
            "Jareen Tasneem Khondaker",
            "Md. Sameer Sakib",
            "Nazia Tasnim",
            "Farig Sadeque"
        ],
        "comments": "16 pages, 4 figures",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Selective knowledge erasure from LLMs is critical for GDPR compliance and model safety, yet current unlearning methods conflate behavioral suppression with true knowledge removal, allowing latent capabilities to persist beneath surface-level refusals. In this work, we address this challenge by introducing Knowledge Immunization Framework (KIF), a representation-aware architecture that distinguishes genuine erasure from obfuscation by targeting internal activation signatures rather than surface outputs. Our approach combines dynamic suppression of subject-specific representations with parameter-efficient adaptation, enabling durable unlearning without full model retraining. KIF achieves near-oracle erasure (FQ approx 0.99 vs. 1.00) while preserving utility at oracle levels (MU = 0.62), effectively breaking the stability-erasure tradeoff that has constrained all prior work. We evaluate both standard foundation models (Llama and Mistral) and reasoning-prior models (Qwen and DeepSeek) across 3B to 14B parameters. Our observation shows that standard models exhibit scale-independent true erasure (<3% utility drift), while reasoning-prior models reveal fundamental architectural divergence. Our comprehensive dual-metric evaluation protocol, combining surface-level leakage with latent trace persistence, operationalizes the obfuscation - erasure distinction and enables the first systematic diagnosis of mechanism-level forgetting behavior across model families and scales.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 81,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10588",
        "abs_url": "https://arxiv.org/abs/2601.10588",
        "pdf_url": "https://arxiv.org/pdf/2601.10588",
        "title": "Searching for Quantum Effects in the Brain: A Bell-Type Test for Nonclassical Latent Representations in Autoencoders",
        "authors": [
            "I. K. Kominis",
            "C. Xie",
            "S. Li",
            "M. Skotiniotis",
            "G. P. Tsironis"
        ],
        "comments": "6 pages, 2 figures",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG); Biological Physics (physics.bio-ph)",
        "abstract": "Whether neural information processing is entirely classical or involves quantum-mechanical elements remains an open question. Here we propose a model-agnostic, information-theoretic test of nonclassicality that bypasses microscopic assumptions and instead probes the structure of neural representations themselves. Using autoencoders as a transparent model system, we introduce a Bell-type consistency test in latent space, and ask whether decoding statistics obtained under multiple readout contexts can be jointly explained by a single positive latent-variable distribution. By shifting the search for quantum-like signatures in neural systems from microscopic dynamics to experimentally testable constraints on information processing, this work opens a new route for probing the fundamental physics of neural computation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 82,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10628",
        "abs_url": "https://arxiv.org/abs/2601.10628",
        "pdf_url": "https://arxiv.org/pdf/2601.10628",
        "title": "Parametric RDT approach to computational gap of symmetric binary perceptron",
        "authors": [
            "Mihailo Stojnic"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Disordered Systems and Neural Networks (cond-mat.dis-nn); Information Theory (cs.IT); Machine Learning (cs.LG); Probability (math.PR)",
        "abstract": "We study potential presence of statistical-computational gaps (SCG) in symmetric binary perceptrons (SBP) via a parametric utilization of \\emph{fully lifted random duality theory} (fl-RDT) [96]. A structural change from decreasingly to arbitrarily ordered $c$-sequence (a key fl-RDT parametric component) is observed on the second lifting level and associated with \\emph{satisfiability} ($\\alpha_c$) -- \\emph{algorithmic} ($\\alpha_a$) constraints density threshold change thereby suggesting a potential existence of a nonzero computational gap $SCG=\\alpha_c-\\alpha_a$. The second level estimate is shown to match the theoretical $\\alpha_c$ whereas the $r\\rightarrow \\infty$ level one is proposed to correspond to $\\alpha_a$. For example, for the canonical SBP ($\\kappa=1$ margin) we obtain $\\alpha_c\\approx 1.8159$ on the second and $\\alpha_a\\approx 1.6021$ (with converging tendency towards $\\sim 1.59$ range) on the seventh level. Our propositions remarkably well concur with recent literature: (i) in [20] local entropy replica approach predicts $\\alpha_{LE}\\approx 1.58$ as the onset of clustering defragmentation (presumed driving force behind locally improving algorithms failures); (ii) in $\\alpha\\rightarrow 0$ regime we obtain on the third lifting level $\\kappa\\approx 1.2385\\sqrt{\\frac{\\alpha_a}{-\\log\\left ( \\alpha_a \\right ) }}$ which qualitatively matches overlap gap property (OGP) based predictions of [43] and identically matches local entropy based predictions of [24]; (iii) $c$-sequence ordering change phenomenology mirrors the one observed in asymmetric binary perceptron (ABP) in [98] and the negative Hopfield model in [100]; and (iv) as in [98,100], we here design a CLuP based algorithm whose practical performance closely matches proposed theoretical predictions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 83,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10630",
        "abs_url": "https://arxiv.org/abs/2601.10630",
        "pdf_url": "https://arxiv.org/pdf/2601.10630",
        "title": "Classification Imbalance as Transfer Learning",
        "authors": [
            "Eric Xia",
            "Jason M. Klusowski"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Classification imbalance arises when one class is much rarer than the other. We frame this setting as transfer learning under label (prior) shift between an imbalanced source distribution induced by the observed data and a balanced target distribution under which performance is evaluated. Within this framework, we study a family of oversampling procedures that augment the training data by generating synthetic samples from an estimated minority-class distribution to roughly balance the classes, among which the celebrated SMOTE algorithm is a canonical example. We show that the excess risk decomposes into the rate achievable under balanced training (as if the data had been drawn from the balanced target distribution) and an additional term, the cost of transfer, which quantifies the discrepancy between the estimated and true minority-class distributions. In particular, we show that the cost of transfer for SMOTE dominates that of bootstrapping (random oversampling) in moderately high dimensions, suggesting that we should expect bootstrapping to have better performance than SMOTE in general. We corroborate these findings with experimental evidence. More broadly, our results provide guidance for choosing among augmentation strategies for imbalanced classification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 84,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10641",
        "abs_url": "https://arxiv.org/abs/2601.10641",
        "pdf_url": "https://arxiv.org/pdf/2601.10641",
        "title": "Adjusted Similarity Measures and a Violation of Expectations",
        "authors": [
            "William L. Lippitt",
            "Edward J. Bedrick",
            "Nichole E. Carlson"
        ],
        "comments": "12 pages, 1 figure",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG); Statistics Theory (math.ST)",
        "abstract": "Adjusted similarity measures, such as Cohen's kappa for inter-rater reliability and the adjusted Rand index used to compare clustering algorithms, are a vital tool for comparing discrete labellings. These measures are intended to have the property of 0 expectation under a null distribution and maximum value 1 under maximal similarity to aid in interpretation. Measures are frequently adjusted with respect to the permutation distribution for historic and analytic reasons. There is currently renewed interest in considering other null models more appropriate for context, such as clustering ensembles permitting a random number of identified clusters. The purpose of this work is two -- fold: (1) to generalize the study of the adjustment operator to general null models and to a more general procedure which includes statistical standardization as a special case and (2) to identify sufficient conditions for the adjustment operator to produce the intended properties, where sufficient conditions are related to whether and how observed data are incorporated into null distributions. We demonstrate how violations of the sufficient conditions may lead to substantial breakdown, such as by producing a non-positive measure under traditional adjustment rather than one with mean 0, or by producing a measure which is deterministically 0 under statistical standardization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 85,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10657",
        "abs_url": "https://arxiv.org/abs/2601.10657",
        "pdf_url": "https://arxiv.org/pdf/2601.10657",
        "title": "PACEvolve: Enabling Long-Horizon Progress-Aware Consistent Evolution",
        "authors": [
            "Minghao Yan",
            "Bo Peng",
            "Benjamin Coleman",
            "Ziqi Chen",
            "Zhouhang Xie",
            "Zhankui He",
            "Noveen Sachdeva",
            "Isabella Ye",
            "Weili Wang",
            "Chi Wang",
            "Ed H. Chi",
            "Wang-Cheng Kang",
            "Derek Zhiyuan Cheng",
            "Beidou Wang"
        ],
        "comments": "",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) have emerged as powerful operators for evolutionary search, yet the design of efficient search scaffolds remains ad hoc. While promising, current LLM-in-the-loop systems lack a systematic approach to managing the evolutionary process. We identify three distinct failure modes: Context Pollution, where experiment history biases future candidate generation; Mode Collapse, where agents stagnate in local minima due to poor exploration-exploitation balance; and Weak Collaboration, where rigid crossover strategies fail to leverage parallel search trajectories effectively. We introduce Progress-Aware Consistent Evolution (PACEvolve), a framework designed to robustly govern the agent's context and search dynamics, to address these challenges. PACEvolve combines hierarchical context management (HCM) with pruning to address context pollution; momentum-based backtracking (MBB) to escape local minima; and a self-adaptive sampling policy that unifies backtracking and crossover for dynamic search coordination (CE), allowing agents to balance internal refinement with cross-trajectory collaboration. We demonstrate that PACEvolve provides a systematic path to consistent, long-horizon self-improvement, achieving state-of-the-art results on LLM-SR and KernelBench, while discovering solutions surpassing the record on Modded NanoGPT.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 86,
        "date": "2026-01-16",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-16?abs=True",
        "arxiv_id": "2601.10707",
        "abs_url": "https://arxiv.org/abs/2601.10707",
        "pdf_url": "https://arxiv.org/pdf/2601.10707",
        "title": "See Less, Drive Better: Generalizable End-to-End Autonomous Driving via Foundation Models Stochastic Patch Selection",
        "authors": [
            "Amir Mallak",
            "Erfan Aasi",
            "Shiva Sreeram",
            "Tsun-Hsuan Wang",
            "Daniela Rus",
            "Alaa Maalouf"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "Recent advances in end-to-end autonomous driving show that policies trained on patch-aligned features extracted from foundation models generalize better to Out-of-Distribution (OOD). We hypothesize that due to the self-attention mechanism, each patch feature implicitly embeds/contains information from all other patches, represented in a different way and intensity, making these descriptors highly redundant. We quantify redundancy in such (BLIP2) features via PCA and cross-patch similarity: $90$% of variance is captured by $17/64$ principal components, and strong inter-token correlations are pervasive. Training on such overlapping information leads the policy to overfit spurious correlations, hurting OOD robustness. We present Stochastic-Patch-Selection (SPS), a simple yet effective approach for learning policies that are more robust, generalizable, and efficient. For every frame, SPS randomly masks a fraction of patch descriptors, not feeding them to the policy model, while preserving the spatial layout of the remaining patches. Thus, the policy is provided with different stochastic but complete views of the (same) scene: every random subset of patches acts like a different, yet still sensible, coherent projection of the world. The policy thus bases its decisions on features that are invariant to which specific tokens survive. Extensive experiments confirm that across all OOD scenarios, our method outperforms the state of the art (SOTA), achieving a $6.2$% average improvement and up to $20.4$% in closed-loop simulations, while being $2.4\\times$ faster. We conduct ablations over masking rates and patch-feature reorganization, training and evaluating 9 systems, with 8 of them surpassing prior SOTA. Finally, we show that the same learned policy transfers to a physical, real-world car without any tuning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]