[
    {
        "order": 1,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00007",
        "abs_url": "https://arxiv.org/abs/2601.00007",
        "pdf_url": "https://arxiv.org/pdf/2601.00007",
        "title": "Yahtzee: Reinforcement Learning Techniques for Stochastic Combinatorial Games",
        "authors": [
            "Nicholas A. Pape"
        ],
        "comments": "20 pages, 19 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Yahtzee is a classic dice game with a stochastic, combinatorial structure and delayed rewards, making it an interesting mid-scale RL benchmark. While an optimal policy for solitaire Yahtzee can be computed using dynamic programming methods, multiplayer is intractable, motivating approximation methods. We formulate Yahtzee as a Markov Decision Process (MDP), and train self-play agents using various policy gradient methods: REINFORCE, Advantage Actor-Critic (A2C), and Proximal Policy Optimization (PPO), all using a multi-headed network with a shared trunk. We ablate feature and action encodings, architecture, return estimators, and entropy regularization to understand their impact on learning. Under a fixed training budget, REINFORCE and PPO prove sensitive to hyperparameters and fail to reach near-optimal performance, whereas A2C trains robustly across a range of settings. Our agent attains a median score of 241.78 points over 100,000 evaluation games, within 5.0\\% of the optimal DP score of 254.59, achieving the upper section bonus and Yahtzee at rates of 24.9\\% and 34.1\\%, respectively. All models struggle to learn the upper bonus strategy, overindexing on four-of-a-kind's, highlighting persistent long-horizon credit-assignment and exploration challenges.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00065",
        "abs_url": "https://arxiv.org/abs/2601.00065",
        "pdf_url": "https://arxiv.org/pdf/2601.00065",
        "title": "The Trojan in the Vocabulary: Stealthy Sabotage of LLM Composition",
        "authors": [
            "Xiaoze Liu",
            "Weichen Yu",
            "Matt Fredrikson",
            "Xiaoqian Wang",
            "Jing Gao"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL); Cryptography and Security (cs.CR)",
        "abstract": "The open-weight LLM ecosystem is increasingly defined by model composition techniques (such as weight merging, speculative decoding, and vocabulary expansion) that remix capabilities from diverse sources. A critical prerequisite for applying these methods across different model families is tokenizer transplant, which aligns incompatible vocabularies to a shared embedding space. We demonstrate that this essential interoperability step introduces a supply-chain vulnerability: we engineer a single \"breaker token\" that is functionally inert in a donor model yet reliably reconstructs into a high-salience malicious feature after transplant into a base model. By exploiting the geometry of coefficient reuse, our attack creates an asymmetric realizability gap that sabotages the base model's generation while leaving the donor's utility statistically indistinguishable from nominal behavior. We formalize this as a dual-objective optimization problem and instantiate the attack using a sparse solver. Empirically, the attack is training-free and achieves spectral mimicry to evade outlier detection, while demonstrating structural persistence against fine-tuning and weight merging, highlighting a hidden risk in the pipeline of modular AI composition. Code is available at this https URL",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00075",
        "abs_url": "https://arxiv.org/abs/2601.00075",
        "pdf_url": "https://arxiv.org/pdf/2601.00075",
        "title": "IMBWatch -- a Spatio-Temporal Graph Neural Network approach to detect Illicit Massage Business",
        "authors": [
            "Swetha Varadarajan",
            "Abhishek Ray",
            "Lumina Albert"
        ],
        "comments": "Submitted to AAAI AISI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Illicit Massage Businesses (IMBs) are a covert and persistent form of organized exploitation that operate under the facade of legitimate wellness services while facilitating human trafficking, sexual exploitation, and coerced labor. Detecting IMBs is difficult due to encoded digital advertisements, frequent changes in personnel and locations, and the reuse of shared infrastructure such as phone numbers and addresses. Traditional approaches, including community tips and regulatory inspections, are largely reactive and ineffective at revealing the broader operational networks traffickers rely on. To address these challenges, we introduce IMBWatch, a spatio-temporal graph neural network (ST-GNN) framework for large-scale IMB detection. IMBWatch constructs dynamic graphs from open-source intelligence, including scraped online advertisements, business license records, and crowdsourced reviews. Nodes represent heterogeneous entities such as businesses, aliases, phone numbers, and locations, while edges capture spatio-temporal and relational patterns, including co-location, repeated phone usage, and synchronized advertising. The framework combines graph convolutional operations with temporal attention mechanisms to model the evolution of IMB networks over time and space, capturing patterns such as intercity worker movement, burner phone rotation, and coordinated advertising surges. Experiments on real-world datasets from multiple U.S. cities show that IMBWatch outperforms baseline models, achieving higher accuracy and F1 scores. Beyond performance gains, IMBWatch offers improved interpretability, providing actionable insights to support proactive and targeted interventions. The framework is scalable, adaptable to other illicit domains, and released with anonymized data and open-source code to support reproducible research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00084",
        "abs_url": "https://arxiv.org/abs/2601.00084",
        "pdf_url": "https://arxiv.org/pdf/2601.00084",
        "title": "Exploration in the Limit",
        "authors": [
            "Brian M. Cho",
            "Nathan Kallus"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Statistics Theory (math.ST); Methodology (stat.ME)",
        "abstract": "In fixed-confidence best arm identification (BAI), the objective is to quickly identify the optimal option while controlling the probability of error below a desired threshold. Despite the plethora of BAI algorithms, existing methods typically fall short in practical settings, as stringent exact error control requires using loose tail inequalities and/or parametric restrictions. To overcome these limitations, we introduce a relaxed formulation that requires valid error control asymptotically with respect to a minimum sample size. This aligns with many real-world settings that often involve weak signals, high desired significance, and post-experiment inference requirements, all of which necessitate long horizons. This allows us to achieve tighter optimality, while better handling flexible nonparametric outcome distributions and fully leveraging individual-level contexts. We develop a novel asymptotic anytime-valid confidence sequences over arm indices, and we use it to design a new BAI algorithm for our asymptotic framework. Our method flexibly incorporates covariates for variance reduction and ensures approximate error control in fully nonparametric settings. Under mild convergence assumptions, we provide asymptotic bounds on the sample complexity and show the worst-case sample complexity of our approach matches the best-case sample complexity of Gaussian BAI under exact error guarantees and known variances. Experiments suggest our approach reduces average sample complexities while maintaining error control.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00088",
        "abs_url": "https://arxiv.org/abs/2601.00088",
        "pdf_url": "https://arxiv.org/pdf/2601.00088",
        "title": "Dynamic Bayesian Optimization Framework for Instruction Tuning in Partial Differential Equation Discovery",
        "authors": [
            "Junqi Qu",
            "Yan Zhang",
            "Shangqian Gao",
            "Shibo Li"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) show promise for equation discovery, yet their outputs are highly sensitive to prompt phrasing, a phenomenon we term instruction brittleness. Static prompts cannot adapt to the evolving state of a multi-step generation process, causing models to plateau at suboptimal solutions. To address this, we propose NeuroSymBO, which reframes prompt engineering as a sequential decision problem. Our method maintains a discrete library of reasoning strategies and uses Bayesian Optimization to select the optimal instruction at each step based on numerical feedback. Experiments on PDE discovery benchmarks show that adaptive instruction selection significantly outperforms fixed prompts, achieving higher recovery rates with more parsimonious solutions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00116",
        "abs_url": "https://arxiv.org/abs/2601.00116",
        "pdf_url": "https://arxiv.org/pdf/2601.00116",
        "title": "GRL-SNAM: Geometric Reinforcement Learning with Path Differential Hamiltonians for Simultaneous Navigation and Mapping in Unknown Environments",
        "authors": [
            "Aditya Sai Ellendula",
            "Yi Wang",
            "Minh Nguyen",
            "Chandrajit Bajaj"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Robotics (cs.RO)",
        "abstract": "We present GRL-SNAM, a geometric reinforcement learning framework for Simultaneous Navigation and Mapping(SNAM) in unknown environments. A SNAM problem is challenging as it needs to design hierarchical or joint policies of multiple agents that control the movement of a real-life robot towards the goal in mapless environment, i.e. an environment where the map of the environment is not available apriori, and needs to be acquired through sensors. The sensors are invoked from the path learner, i.e. navigator, through active query responses to sensory agents, and along the motion path. GRL-SNAM differs from preemptive navigation algorithms and other reinforcement learning methods by relying exclusively on local sensory observations without constructing a global map. Our approach formulates path navigation and mapping as a dynamic shortest path search and discovery process using controlled Hamiltonian optimization: sensory inputs are translated into local energy landscapes that encode reachability, obstacle barriers, and deformation constraints, while policies for sensing, planning, and reconfiguration evolve stagewise via updating Hamiltonians. A reduced Hamiltonian serves as an adaptive score function, updating kinetic/potential terms, embedding barrier constraints, and continuously refining trajectories as new local information arrives. We evaluate GRL-SNAM on two different 2D navigation tasks. Comparing against local reactive baselines and global policy learning references under identical stagewise sensing constraints, it preserves clearance, generalizes to unseen layouts, and demonstrates that Geometric RL learning via updating Hamiltonians enables high-quality navigation through minimal exploration via local energy refinement rather than extensive global mapping. The code is publicly available on \\href{this https URL}{Github}.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00151",
        "abs_url": "https://arxiv.org/abs/2601.00151",
        "pdf_url": "https://arxiv.org/pdf/2601.00151",
        "title": "Reinforcement Learning with Function Approximation for Non-Markov Processes",
        "authors": [
            "Ali Devran Kara"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Optimization and Control (math.OC)",
        "abstract": "We study reinforcement learning methods with linear function approximation under non-Markov state and cost processes. We first consider the policy evaluation method and show that the algorithm converges under suitable ergodicity conditions on the underlying non-Markov processes. Furthermore, we show that the limit corresponds to the fixed point of a joint operator composed of an orthogonal projection and the Bellman operator of an auxiliary \\emph{Markov} decision process. For Q-learning with linear function approximation, as in the Markov setting, convergence is not guaranteed in general. We show, however, that for the special case where the basis functions are chosen based on quantization maps, the convergence can be shown under similar ergodicity conditions. Finally, we apply our results to partially observed Markov decision processes, where finite-memory variables are used as state representations, and we derive explicit error bounds for the limits of the resulting learning algorithms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00152",
        "abs_url": "https://arxiv.org/abs/2601.00152",
        "pdf_url": "https://arxiv.org/pdf/2601.00152",
        "title": "The Weather Paradox: Why Precipitation Fails to Predict Traffic Accident Severity in Large-Scale US Data",
        "authors": [
            "Yann Bellec",
            "Rohan Kaman",
            "Siwen Cui",
            "Aarav Agrawal",
            "Calvin Chen"
        ],
        "comments": "11 pages, 8 figures, 0 tables. Preprint, machine learning analysis of 500,000 US traffic accidents",
        "subjects": "Machine Learning (cs.LG); Applications (stat.AP)",
        "abstract": "This study investigates the predictive capacity of environmental, temporal, and spatial factors on traffic accident severity in the United States. Using a dataset of 500,000 U.S. traffic accidents spanning 2016-2023, we trained an XGBoost classifier optimized through randomized search cross-validation and adjusted for class imbalance via class weighting. The final model achieves an overall accuracy of 78%, with strong performance on the majority class (Severity 2), attaining 87% precision and recall. Feature importance analysis reveals that time of day, geographic location, and weather-related variables, including visibility, temperature, and wind speed, rank among the strongest predictors of accident severity. However, contrary to initial hypotheses, precipitation and visibility demonstrate limited predictive power, potentially reflecting behavioral adaptation by drivers under overtly hazardous conditions. The dataset's predominance of mid-level severity accidents constrains the model's capacity to learn meaningful patterns for extreme cases, highlighting the need for alternative sampling strategies, enhanced feature engineering, and integration of external datasets. These findings contribute to evidence-based traffic management and suggest future directions for severity prediction research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00167",
        "abs_url": "https://arxiv.org/abs/2601.00167",
        "pdf_url": "https://arxiv.org/pdf/2601.00167",
        "title": "Online Finetuning Decision Transformers with Pure RL Gradients",
        "authors": [
            "Junkai Luo",
            "Yinglun Zhu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Decision Transformers (DTs) have emerged as a powerful framework for sequential decision making by formulating offline reinforcement learning (RL) as a sequence modeling problem. However, extending DTs to online settings with pure RL gradients remains largely unexplored, as existing approaches continue to rely heavily on supervised sequence-modeling objectives during online finetuning. We identify hindsight return relabeling -- a standard component in online DTs -- as a critical obstacle to RL-based finetuning: while beneficial for supervised learning, it is fundamentally incompatible with importance sampling-based RL algorithms such as GRPO, leading to unstable training. Building on this insight, we propose new algorithms that enable online finetuning of Decision Transformers using pure reinforcement learning gradients. We adapt GRPO to DTs and introduce several key modifications, including sub-trajectory optimization for improved credit assignment, sequence-level likelihood objectives for enhanced stability and efficiency, and active sampling to encourage exploration in uncertain regions. Through extensive experiments, we demonstrate that our methods outperform existing online DT baselines and achieve new state-of-the-art performance across multiple benchmarks, highlighting the effectiveness of pure-RL-based online finetuning for Decision Transformers.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00172",
        "abs_url": "https://arxiv.org/abs/2601.00172",
        "pdf_url": "https://arxiv.org/pdf/2601.00172",
        "title": "Sequential Reservoir Computing for Efficient High-Dimensional Spatiotemporal Forecasting",
        "authors": [
            "Ata Akbari Asanjan",
            "Filip Wudarski",
            "Daniel O'Connor",
            "Shaun Geaney",
            "Elena Strbac",
            "P. Aaron Lott",
            "Davide Venturelli"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Forecasting high-dimensional spatiotemporal systems remains computationally challenging for recurrent neural networks (RNNs) and long short-term memory (LSTM) models due to gradient-based training and memory bottlenecks. Reservoir Computing (RC) mitigates these challenges by replacing backpropagation with fixed recurrent layers and a convex readout optimization, yet conventional RC architectures still scale poorly with input dimensionality. We introduce a Sequential Reservoir Computing (Sequential RC) architecture that decomposes a large reservoir into a series of smaller, interconnected reservoirs. This design reduces memory and computational costs while preserving long-term temporal dependencies. Using both low-dimensional chaotic systems (Lorenz63) and high-dimensional physical simulations (2D vorticity and shallow-water equations), Sequential RC achieves 15-25% longer valid forecast horizons, 20-30% lower error metrics (SSIM, RMSE), and up to three orders of magnitude lower training cost compared to LSTM and standard RNN baselines. The results demonstrate that Sequential RC maintains the simplicity and efficiency of conventional RC while achieving superior scalability for high-dimensional dynamical systems. This approach provides a practical path toward real-time, energy-efficient forecasting in scientific and engineering applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00175",
        "abs_url": "https://arxiv.org/abs/2601.00175",
        "pdf_url": "https://arxiv.org/pdf/2601.00175",
        "title": "Early Prediction of Liver Cirrhosis Up to Three Years in Advance: A Machine Learning Study Benchmarking Against the FIB-4 Score",
        "authors": [
            "Zhuqi Miao",
            "Sujan Ravi",
            "Abdulaziz Ahmed"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Objective: Develop and evaluate machine learning (ML) models for predicting incident liver cirrhosis one, two, and three years prior to diagnosis using routinely collected electronic health record (EHR) data, and to benchmark their performance against the FIB-4 score. Methods: We conducted a retrospective cohort study using de-identified EHR data from a large academic health system. Patients with fatty liver disease were identified and categorized into cirrhosis and non-cirrhosis cohorts based on ICD-9/10 codes. Prediction scenarios were constructed using observation and prediction windows to emulate real-world clinical use. Demographics, diagnoses, laboratory results, vital signs, and comorbidity indices were aggregated from the observation window. XGBoost models were trained for 1-, 2-, and 3-year prediction horizons and evaluated on held-out test sets. Model performance was compared with FIB-4 using area under the receiver operating characteristic curve (AUC). Results: Final cohorts included 3,043 patients for the 1-year prediction, 1,981 for the 2-year prediction, and 1,470 for the 3-year prediction. Across all prediction windows, ML models consistently outperformed FIB-4. The XGBoost models achieved AUCs of 0.81, 0.73, and 0.69 for 1-, 2-, and 3-year predictions, respectively, compared with 0.71, 0.63, and 0.57 for FIB-4. Performance gains persisted with longer prediction horizons, indicating improved early risk discrimination. Conclusions: Machine learning models leveraging routine EHR data substantially outperform the traditional FIB-4 score for early prediction of liver cirrhosis. These models enable earlier and more accurate risk stratification and can be integrated into clinical workflows as automated decision-support tools to support proactive cirrhosis prevention and management.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00186",
        "abs_url": "https://arxiv.org/abs/2601.00186",
        "pdf_url": "https://arxiv.org/pdf/2601.00186",
        "title": "Reinforcement-Learned Unequal Error Protection for Quantized Semantic Embeddings",
        "authors": [
            "Moirangthem Tiken Singh",
            "Adnan Arif"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Information Retrieval (cs.IR); Networking and Internet Architecture (cs.NI)",
        "abstract": "This paper tackles the pressing challenge of preserving semantic meaning in communication systems constrained by limited bandwidth. We introduce a novel reinforcement learning framework that achieves per-dimension unequal error protection via adaptive repetition coding. Central to our approach is a composite semantic distortion metric that balances global embedding similarity with entity-level preservation, empowering the reinforcement learning agent to allocate protection in a context-aware manner. Experiments show statistically significant gains over uniform protection, achieving 6.8% higher chrF scores and 9.3% better entity preservation at 1 dB SNR. The key innovation of our framework is the demonstration that simple, intelligently allocated repetition coding enables fine-grained semantic protection -- an advantage unattainable with conventional codes such as LDPC or Reed-Solomon. Our findings challenge traditional channel coding paradigms by establishing that code structure must align with semantic granularity. This approach is particularly suited to edge computing and IoT scenarios, where bandwidth is scarce, but semantic fidelity is critical, providing a practical pathway for next-generation semantic-aware networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00192",
        "abs_url": "https://arxiv.org/abs/2601.00192",
        "pdf_url": "https://arxiv.org/pdf/2601.00192",
        "title": "Optimized Hybrid Feature Engineering for Resource-Efficient Arrhythmia Detection in ECG Signals: An Optimization Framework",
        "authors": [
            "Moirangthem Tiken Singh",
            "Manibhushan Yaikhom"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "Cardiovascular diseases, particularly arrhythmias, remain a leading global cause of mortality, necessitating continuous monitoring via the Internet of Medical Things (IoMT). However, state-of-the-art deep learning approaches often impose prohibitive computational overheads, rendering them unsuitable for resource-constrained edge devices. This study proposes a resource-efficient, data-centric framework that prioritizes feature engineering over complexity. Our optimized pipeline makes the complex, high-dimensional arrhythmia data linearly separable. This is achieved by integrating time-frequency wavelet decompositions with graph-theoretic structural descriptors, such as PageRank centrality. This hybrid feature space, combining wavelet decompositions and graph-theoretic descriptors, is then refined using mutual information and recursive elimination, enabling interpretable, ultra-lightweight linear classifiers. Validation on the MIT-BIH and INCART datasets yields 98.44% diagnostic accuracy with an 8.54 KB model footprint. The system achieves 0.46 $\\mu$s classification inference latency within a 52 ms per-beat pipeline, ensuring real-time operation. These outcomes provide an order-of-magnitude efficiency gain over compressed models, such as KD-Light (25 KB, 96.32% accuracy), advancing battery-less cardiac sensors.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00218",
        "abs_url": "https://arxiv.org/abs/2601.00218",
        "pdf_url": "https://arxiv.org/pdf/2601.00218",
        "title": "Unknown Aware AI-Generated Content Attribution",
        "authors": [
            "Ellie Thieu",
            "Jifan Zhang",
            "Haoyue Bai"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The rapid advancement of photorealistic generative models has made it increasingly important to attribute the origin of synthetic content, moving beyond binary real or fake detection toward identifying the specific model that produced a given image. We study the problem of distinguishing outputs from a target generative model (e.g., OpenAI Dalle 3) from other sources, including real images and images generated by a wide range of alternative models. Using CLIP features and a simple linear classifier, shown to be effective in prior work, we establish a strong baseline for target generator attribution using only limited labeled data from the target model and a small number of known generators. However, this baseline struggles to generalize to harder, unseen, and newly released generators. To address this limitation, we propose a constrained optimization approach that leverages unlabeled wild data, consisting of images collected from the Internet that may include real images, outputs from unknown generators, or even samples from the target model itself. The proposed method encourages wild samples to be classified as non target while explicitly constraining performance on labeled data to remain high. Experimental results show that incorporating wild data substantially improves attribution performance on challenging unseen generators, demonstrating that unlabeled data from the wild can be effectively exploited to enhance AI generated content attribution in open world settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00229",
        "abs_url": "https://arxiv.org/abs/2601.00229",
        "pdf_url": "https://arxiv.org/pdf/2601.00229",
        "title": "Robust Graph Fine-Tuning with Adversarial Graph Prompting",
        "authors": [
            "Ziyan Zhang",
            "Bo Jiang",
            "Jin Tang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Parameter-Efficient Fine-Tuning (PEFT) method has emerged as a dominant paradigm for adapting pre-trained GNN models to downstream tasks. However, existing PEFT methods usually exhibit significant vulnerability to various noise and attacks on graph topology and node attributes/features. To address this issue, for the first time, we propose integrating adversarial learning into graph prompting and develop a novel Adversarial Graph Prompting (AGP) framework to achieve robust graph fine-tuning. Our AGP has two key aspects. First, we propose the general problem formulation of AGP as a min-max optimization problem and develop an alternating optimization scheme to solve it. For inner maximization, we propose Joint Projected Gradient Descent (JointPGD) algorithm to generate strong adversarial noise. For outer minimization, we employ a simple yet effective module to learn the optimal node prompts to counteract the adversarial noise. Second, we demonstrate that the proposed AGP can theoretically address both graph topology and node noise. This confirms the versatility and robustness of our AGP fine-tuning method across various graph noise. Note that, the proposed AGP is a general method that can be integrated with various pre-trained GNN models to enhance their robustness on the downstream tasks. Extensive experiments on multiple benchmark tasks validate the robustness and effectiveness of AGP method compared to state-of-the-art methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00276",
        "abs_url": "https://arxiv.org/abs/2601.00276",
        "pdf_url": "https://arxiv.org/pdf/2601.00276",
        "title": "Task-Driven Kernel Flows: Label Rank Compression and Laplacian Spectral Filtering",
        "authors": [
            "Hongxi Li",
            "Chunlin Huang"
        ],
        "comments": "47 pages;3 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We present a theory of feature learning in wide L2-regularized networks showing that supervised learning is inherently compressive. We derive a kernel ODE that predicts a \"water-filling\" spectral evolution and prove that for any stable steady state, the kernel rank is bounded by the number of classes ($C$). We further demonstrate that SGD noise is similarly low-rank ($O(C)$), confining dynamics to the task-relevant subspace. This framework unifies the deterministic and stochastic views of alignment and contrasts the low-rank nature of supervised learning with the high-rank, expansive representations of self-supervision.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00309",
        "abs_url": "https://arxiv.org/abs/2601.00309",
        "pdf_url": "https://arxiv.org/pdf/2601.00309",
        "title": "Can Optimal Transport Improve Federated Inverse Reinforcement Learning?",
        "authors": [
            "David Millard",
            "Ali Baheri"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "In robotics and multi-agent systems, fleets of autonomous agents often operate in subtly different environments while pursuing a common high-level objective. Directly pooling their data to learn a shared reward function is typically impractical due to differences in dynamics, privacy constraints, and limited communication bandwidth. This paper introduces an optimal transport-based approach to federated inverse reinforcement learning (IRL). Each client first performs lightweight Maximum Entropy IRL locally, adhering to its computational and privacy limitations. The resulting reward functions are then fused via a Wasserstein barycenter, which considers their underlying geometric structure. We further prove that this barycentric fusion yields a more faithful global reward estimate than conventional parameter averaging methods in federated learning. Overall, this work provides a principled and communication-efficient framework for deriving a shared reward that generalizes across heterogeneous agents and environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00318",
        "abs_url": "https://arxiv.org/abs/2601.00318",
        "pdf_url": "https://arxiv.org/pdf/2601.00318",
        "title": "Quantum King-Ring Domination in Chess: A QAOA Approach",
        "authors": [
            "Gerhard Stenzel",
            "Michael Kölle",
            "Tobias Rohe",
            "Julian Hager",
            "Leo Sünkel",
            "Maximilian Zorn",
            "Claudia Linnhoff-Popien"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantum Physics (quant-ph)",
        "abstract": "The Quantum Approximate Optimization Algorithm (QAOA) is extensively benchmarked on synthetic random instances such as MaxCut, TSP, and SAT problems, but these lack semantic structure and human interpretability, offering limited insight into performance on real-world problems with meaningful constraints. We introduce Quantum King-Ring Domination (QKRD), a NISQ-scale benchmark derived from chess tactical positions that provides 5,000 structured instances with one-hot constraints, spatial locality, and 10--40 qubit scale. The benchmark pairs human-interpretable coverage metrics with intrinsic validation against classical heuristics, enabling algorithmic conclusions without external oracles. Using QKRD, we systematically evaluate QAOA design choices and find that constraint-preserving mixers (XY, domain-wall) converge approximately 13 steps faster than standard mixers (p<10^{-7}, d\\approx0.5) while eliminating penalty tuning, warm-start strategies reduce convergence by 45 steps (p<10^{-127}, d=3.35) with energy improvements exceeding d=8, and Conditional Value-at-Risk (CVaR) optimization yields an informative negative result with worse energy (p<10^{-40}, d=1.21) and no coverage benefit. Intrinsic validation shows QAOA outperforms greedy heuristics by 12.6\\% and random selection by 80.1\\%. Our results demonstrate that structured benchmarks reveal advantages of problem-informed QAOA techniques obscured in random instances. We release all code, data, and experimental artifacts for reproducible NISQ algorithm research.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00335",
        "abs_url": "https://arxiv.org/abs/2601.00335",
        "pdf_url": "https://arxiv.org/pdf/2601.00335",
        "title": "Smart Fault Detection in Nanosatellite Electrical Power System",
        "authors": [
            "Alireza Rezaee",
            "Niloofar Nobahari",
            "Amin Asgarifar",
            "Farshid Hajati"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper presents a new detection method of faults at Nanosatellites' electrical power without an Attitude Determination Control Subsystem (ADCS) at the LEO orbit. Each part of this system is at risk of fault due to pressure tolerance, launcher pressure, and environmental circumstances. Common faults are line to line fault and open circuit for the photovoltaic subsystem, short circuit and open circuit IGBT at DC to DC converter, and regulator fault of the ground battery. The system is simulated without fault based on a neural network using solar radiation and solar panel's surface temperature as input data and current and load as outputs. Finally, using the neural network classifier, different faults are diagnosed by pattern and type of fault. For fault classification, other machine learning methods are also used, such as PCA classification, decision tree, and KNN.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00391",
        "abs_url": "https://arxiv.org/abs/2601.00391",
        "pdf_url": "https://arxiv.org/pdf/2601.00391",
        "title": "Real-Time Human Detection for Aerial Captured Video Sequences via Deep Models",
        "authors": [
            "Nouar AlDahoul",
            "Aznul Qalid Md Sabri",
            "Ali Mohammed Mansoor"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Human detection in videos plays an important role in various real-life applications. Most traditional approaches depend on utilizing handcrafted features, which are problem-dependent and optimal for specific tasks. Moreover, they are highly susceptible to dynamical events such as illumination changes, camera jitter, and variations in object sizes. On the other hand, the proposed feature learning approaches are cheaper and easier because highly abstract and discriminative features can be produced automatically without the need of expert knowledge. In this paper, we utilize automatic feature learning methods, which combine optical flow and three different deep models (i.e., supervised convolutional neural network (S-CNN), pretrained CNN feature extractor, and hierarchical extreme learning machine) for human detection in videos captured using a nonstatic camera on an aerial platform with varying altitudes. The models are trained and tested on the publicly available and highly challenging UCF-ARG aerial dataset. The comparison between these models in terms of training, testing accuracy, and learning speed is analyzed. The performance evaluation considers five human actions (digging, waving, throwing, walking, and running). Experimental results demonstrated that the proposed methods are successful for the human detection task. The pretrained CNN produces an average accuracy of 98.09%. S-CNN produces an average accuracy of 95.6% with softmax and 91.7% with Support Vector Machines (SVM). H-ELM has an average accuracy of 95.9%. Using a normal Central Processing Unit (CPU), H-ELM's training time takes 445 seconds. Learning in S-CNN takes 770 seconds with a high-performance Graphical Processing Unit (GPU).",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00423",
        "abs_url": "https://arxiv.org/abs/2601.00423",
        "pdf_url": "https://arxiv.org/pdf/2601.00423",
        "title": "E-GRPO: High Entropy Steps Drive Effective Reinforcement Learning for Flow Models",
        "authors": [
            "Shengjun Zhang",
            "Zhang Zhang",
            "Chensheng Dai",
            "Yueqi Duan"
        ],
        "comments": "Code: this https URL",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV)",
        "abstract": "Recent reinforcement learning has enhanced the flow matching models on human preference alignment. While stochastic sampling enables the exploration of denoising directions, existing methods which optimize over multiple denoising steps suffer from sparse and ambiguous reward signals. We observe that the high entropy steps enable more efficient and effective exploration while the low entropy steps result in undistinguished roll-outs. To this end, we propose E-GRPO, an entropy aware Group Relative Policy Optimization to increase the entropy of SDE sampling steps. Since the integration of stochastic differential equations suffer from ambiguous reward signals due to stochasticity from multiple steps, we specifically merge consecutive low entropy steps to formulate one high entropy step for SDE sampling, while applying ODE sampling on other steps. Building upon this, we introduce multi-step group normalized advantage, which computes group-relative advantages within samples sharing the same consolidated SDE denoising step. Experimental results on different reward settings have demonstrated the effectiveness of our methods.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00428",
        "abs_url": "https://arxiv.org/abs/2601.00428",
        "pdf_url": "https://arxiv.org/pdf/2601.00428",
        "title": "A Comparative Analysis of Interpretable Machine Learning Methods",
        "authors": [
            "Mattia Billa",
            "Giovanni Orlandi",
            "Veronica Guidetti",
            "Federica Mandreoli"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In recent years, Machine Learning (ML) has seen widespread adoption across a broad range of sectors, including high-stakes domains such as healthcare, finance, and law. This growing reliance has raised increasing concerns regarding model interpretability and accountability, particularly as legal and regulatory frameworks place tighter constraints on using black-box models in critical applications. Although interpretable ML has attracted substantial attention, systematic evaluations of inherently interpretable models, especially for tabular data, remain relatively scarce and often focus primarily on aggregated performance outcomes. To address this gap, we present a large-scale comparative evaluation of 16 inherently interpretable methods, ranging from classical linear models and decision trees to more recent approaches such as Explainable Boosting Machines (EBMs), Symbolic Regression (SR), and Generalized Optimal Sparse Decision Trees (GOSDT). Our study spans 216 real-world tabular datasets and goes beyond aggregate rankings by stratifying performance according to structural dataset characteristics, including dimensionality, sample size, linearity, and class imbalance. In addition, we assess training time and robustness under controlled distributional shifts. Our results reveal clear performance hierarchies, especially for regression tasks, where EBMs consistently achieve strong predictive accuracy. At the same time, we show that performance is highly context-dependent: SR and Interpretable Generalized Additive Neural Networks (IGANNs) perform particularly well in non-linear regimes, while GOSDT models exhibit pronounced sensitivity to class imbalance. Overall, these findings provide practical guidance for practitioners seeking a balance between interpretability and predictive performance, and contribute to a deeper empirical understanding of interpretable modeling for tabular data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00446",
        "abs_url": "https://arxiv.org/abs/2601.00446",
        "pdf_url": "https://arxiv.org/pdf/2601.00446",
        "title": "A Comparative Study of Adaptation Strategies for Time Series Foundation Models in Anomaly Detection",
        "authors": [
            "Miseon Park",
            "Kijung Yoon"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Time series anomaly detection is essential for the reliable operation of complex systems, but most existing methods require extensive task-specific training. We explore whether time series foundation models (TSFMs), pretrained on large heterogeneous data, can serve as universal backbones for anomaly detection. Through systematic experiments across multiple benchmarks, we compare zero-shot inference, full model adaptation, and parameter-efficient fine-tuning (PEFT) strategies. Our results demonstrate that TSFMs outperform task-specific baselines, achieving notable gains in AUC-PR and VUS-PR, particularly under severe class imbalance. Moreover, PEFT methods such as LoRA, OFT, and HRA not only reduce computational cost but also match or surpass full fine-tuning in most cases, indicating that TSFMs can be efficiently adapted for anomaly detection, even when pretrained for forecasting. These findings position TSFMs as promising general-purpose models for scalable and efficient time series anomaly detection.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00451",
        "abs_url": "https://arxiv.org/abs/2601.00451",
        "pdf_url": "https://arxiv.org/pdf/2601.00451",
        "title": "Controllable Concept Bottleneck Models",
        "authors": [
            "Hongbin Lin",
            "Chenyang Ren",
            "Juangui Xu",
            "Zhengyu Hu",
            "Cheng-Long Wang",
            "Yao Shu",
            "Hui Xiong",
            "Jingfeng Zhang",
            "Di Wang",
            "Lijie Hu"
        ],
        "comments": "arXiv admin note: substantial text overlap with arXiv:2405.15476",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Concept Bottleneck Models (CBMs) have garnered much attention for their ability to elucidate the prediction process through a human-understandable concept layer. However, most previous studies focused on static scenarios where the data and concepts are assumed to be fixed and clean. In real-world applications, deployed models require continuous maintenance: we often need to remove erroneous or sensitive data (unlearning), correct mislabeled concepts, or incorporate newly acquired samples (incremental learning) to adapt to evolving environments. Thus, deriving efficient editable CBMs without retraining from scratch remains a significant challenge, particularly in large-scale applications. To address these challenges, we propose Controllable Concept Bottleneck Models (CCBMs). Specifically, CCBMs support three granularities of model editing: concept-label-level, concept-level, and data-level, the latter of which encompasses both data removal and data addition. CCBMs enjoy mathematically rigorous closed-form approximations derived from influence functions that obviate the need for retraining. Experimental results demonstrate the efficiency and adaptability of our CCBMs, affirming their practical value in enabling dynamic and trustworthy CBMs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00452",
        "abs_url": "https://arxiv.org/abs/2601.00452",
        "pdf_url": "https://arxiv.org/pdf/2601.00452",
        "title": "Imitation from Observations with Trajectory-Level Generative Embeddings",
        "authors": [
            "Yongtao Qu",
            "Shangzhe Li",
            "Weitong Zhang"
        ],
        "comments": "24 pages, 6 figures, 7 tables",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We consider the offline imitation learning from observations (LfO) where the expert demonstrations are scarce and the available offline suboptimal data are far from the expert behavior. Many existing distribution-matching approaches struggle in this regime because they impose strict support constraints and rely on brittle one-step models, making it hard to extract useful signal from imperfect data. To tackle this challenge, we propose TGE, a trajectory-level generative embedding for offline LfO that constructs a dense, smooth surrogate reward by estimating expert state density in the latent space of a temporal diffusion model trained on offline trajectory data. By leveraging the smooth geometry of the learned diffusion embedding, TGE captures long-horizon temporal dynamics and effectively bridges the gap between disjoint supports, ensuring a robust learning signal even when offline data is distributionally distinct from the expert. Empirically, the proposed approach consistently matches or outperforms prior offline LfO methods across a range of D4RL locomotion and manipulation benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00457",
        "abs_url": "https://arxiv.org/abs/2601.00457",
        "pdf_url": "https://arxiv.org/pdf/2601.00457",
        "title": "Geometric Regularization in Mixture-of-Experts: The Disconnect Between Weights and Activations",
        "authors": [
            "Hyunjun Kim"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Mixture-of-Experts (MoE) models achieve efficiency through sparse activation, but the role of geometric regularization in expert specialization remains unclear. We apply orthogonality loss to enforce expert diversity and find it fails on multiple fronts: it does not reduce weight-space overlap (MSO actually increases by up to 114%), activation-space overlap remains high (~0.6) regardless of regularization, and effects on performance are inconsistent -- marginal improvement on WikiText-103 (-0.9%), slight degradation on TinyStories (+0.9%), and highly variable results on PTB (std > 1.0). Our analysis across 7 regularization strengths reveals no significant correlation (r = -0.293, p = 0.523) between weight and activation orthogonality. These findings demonstrate that weight-space regularization neither achieves its geometric goal nor reliably improves performance, making it unsuitable for MoE diversity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00459",
        "abs_url": "https://arxiv.org/abs/2601.00459",
        "pdf_url": "https://arxiv.org/pdf/2601.00459",
        "title": "Detecting Spike Wave Discharges (SWD) using 1-dimensional Residual UNet",
        "authors": [
            "Saurav Sengupta",
            "Scott Kilianski",
            "Suchetha Sharma",
            "Sakina Lashkeri",
            "Ashley McHugh",
            "Mark Beenhakker",
            "Donald E. Brown"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "The manual labeling of events in electroencephalography (EEG) records is time-consuming. This is especially true when EEG recordings are taken continuously over weeks to months. Therefore, a method to automatically label pertinent EEG events reduces the manual workload. Spike wave discharges (SWD), which are the electrographic hallmark of absence seizures, are EEG events that are often labeled manually. While some previous studies have utilized machine learning to automatically segment and classify EEG signals like SWDs, they can be improved. Here we compare the performance of 14 machine learning classifiers on our own manually annotated dataset of 961 hours of EEG recordings from C3H/HeJ mice, including 22,637 labeled SWDs. We find that a 1D UNet performs best for labeling SWDs in this dataset. We also improve the 1D UNet by augmenting our training data and determine that scaling showed the greatest benefit of all augmentation procedures applied. We then compare the 1D UNet with data augmentation, AugUNet1D, against a recently published time- and frequency-based algorithmic approach called \"Twin Peaks\". AugUNet1D showed superior performance and detected events with more similar features to the SWDs labeled manually. AugUNet1D, pretrained on our manually annotated data or untrained, is made public for others users.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00461",
        "abs_url": "https://arxiv.org/abs/2601.00461",
        "pdf_url": "https://arxiv.org/pdf/2601.00461",
        "title": "Laplacian Kernelized Bandit",
        "authors": [
            "Shuang Wu",
            "Arash A. Amini"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "We study multi-user contextual bandits where users are related by a graph and their reward functions exhibit both non-linear behavior and graph homophily. We introduce a principled joint penalty for the collection of user reward functions $\\{f_u\\}$, combining a graph smoothness term based on RKHS distances with an individual roughness penalty. Our central contribution is proving that this penalty is equivalent to the squared norm within a single, unified \\emph{multi-user RKHS}. We explicitly derive its reproducing kernel, which elegantly fuses the graph Laplacian with the base arm kernel. This unification allows us to reframe the problem as learning a single ''lifted'' function, enabling the design of principled algorithms, \\texttt{LK-GP-UCB} and \\texttt{LK-GP-TS}, that leverage Gaussian Process posteriors over this new kernel for exploration. We provide high-probability regret bounds that scale with an \\emph{effective dimension} of the multi-user kernel, replacing dependencies on user count or ambient dimension. Empirically, our methods outperform strong linear and non-graph-aware baselines in non-linear settings and remain competitive even when the true rewards are linear. Our work delivers a unified, theoretically grounded, and practical framework that bridges Laplacian regularization with kernelized bandits for structured exploration.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00513",
        "abs_url": "https://arxiv.org/abs/2601.00513",
        "pdf_url": "https://arxiv.org/pdf/2601.00513",
        "title": "When Small Models Are Right for Wrong Reasons: Process Verification for Trustworthy Agents",
        "authors": [
            "Laksh Advani"
        ],
        "comments": "Accepted to Trustagent workshop AAAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Deploying small language models (7-9B parameters) as autonomous agents requires trust in their reasoning, not just their outputs. We reveal a critical reliability crisis: 50-69\\% of correct answers from these models contain fundamentally flawed reasoning -- a ``Right-for-Wrong-Reasons'' phenomenon invisible to standard accuracy metrics. Through analysis of 10,734 reasoning traces across three models and diverse tasks, we introduce the Reasoning Integrity Score (RIS), a process-based metric validated with substantial inter-rater agreement ($\\kappa=0.657$). Conventional practices are challenged by our findings: while retrieval-augmented generation (RAG) significantly improves reasoning integrity (Cohen's $d=0.23$--$0.93$), meta-cognitive interventions like self-critique often harm performance ($d=-0.14$ to $-0.33$) in small models on the evaluated tasks. Mechanistic analysis reveals RAG succeeds by grounding calculations in external evidence, reducing errors by 7.6\\%, while meta-cognition amplifies confusion without sufficient model capacity. To enable deployment, verification capabilities are distilled into a neural classifier achieving 0.86 F1-score with 100$\\times$ speedup. These results underscore the necessity of process-based verification for trustworthy agents: accuracy alone is dangerously insufficient when models can be right for entirely wrong reasons.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00516",
        "abs_url": "https://arxiv.org/abs/2601.00516",
        "pdf_url": "https://arxiv.org/pdf/2601.00516",
        "title": "Trajectory Guard -- A Lightweight, Sequence-Aware Model for Real-Time Anomaly Detection in Agentic AI",
        "authors": [
            "Laksh Advani"
        ],
        "comments": "Accepted to AAAI Trustagent 2026",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Autonomous LLM agents generate multi-step action plans that can fail due to contextual misalignment or structural incoherence. Existing anomaly detection methods are ill-suited for this challenge: mean-pooling embeddings dilutes anomalous steps, while contrastive-only approaches ignore sequential structure. Standard unsupervised methods on pre-trained embeddings achieve F1-scores no higher than 0.69. We introduce Trajectory Guard, a Siamese Recurrent Autoencoder with a hybrid loss function that jointly learns task-trajectory alignment via contrastive learning and sequential validity via reconstruction. This dual objective enables unified detection of both \"wrong plan for this task\" and \"malformed plan structure.\" On benchmarks spanning synthetic perturbations and real-world failures from security audits (RAS-Eval) and multi-agent systems (Who\\&When), we achieve F1-scores of 0.88-0.94 on balanced sets and recall of 0.86-0.92 on imbalanced external benchmarks. At 32 ms inference latency, our approach runs 17-27$\\times$ faster than LLM Judge baselines, enabling real-time safety verification in production deployments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00519",
        "abs_url": "https://arxiv.org/abs/2601.00519",
        "pdf_url": "https://arxiv.org/pdf/2601.00519",
        "title": "A Sparse-Attention Deep Learning Model Integrating Heterogeneous Multimodal Features for Parkinson's Disease Severity Profiling",
        "authors": [
            "Dristi Datta",
            "Tanmoy Debnath",
            "Minh Chau",
            "Manoranjan Paul",
            "Gourab Adhikary",
            "Md Geaur Rahman"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Characterising the heterogeneous presentation of Parkinson's disease (PD) requires integrating biological and clinical markers within a unified predictive framework. While multimodal data provide complementary information, many existing computational models struggle with interpretability, class imbalance, or effective fusion of high-dimensional imaging and tabular clinical features. To address these limitations, we propose the Class-Weighted Sparse-Attention Fusion Network (SAFN), an interpretable deep learning framework for robust multimodal profiling. SAFN integrates MRI cortical thickness, MRI volumetric measures, clinical assessments, and demographic variables using modality-specific encoders and a symmetric cross-attention mechanism that captures nonlinear interactions between imaging and clinical representations. A sparsity-constrained attention-gating fusion layer dynamically prioritises informative modalities, while a class-balanced focal loss (beta = 0.999, gamma = 1.5) mitigates dataset imbalance without synthetic oversampling. Evaluated on 703 participants (570 PD, 133 healthy controls) from the Parkinson's Progression Markers Initiative using subject-wise five-fold cross-validation, SAFN achieves an accuracy of 0.98 plus or minus 0.02 and a PR-AUC of 1.00 plus or minus 0.00, outperforming established machine learning and deep learning baselines. Interpretability analysis shows a clinically coherent decision process, with approximately 60 percent of predictive weight assigned to clinical assessments, consistent with Movement Disorder Society diagnostic principles. SAFN provides a reproducible and transparent multimodal modelling paradigm for computational profiling of neurodegenerative disease.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00526",
        "abs_url": "https://arxiv.org/abs/2601.00526",
        "pdf_url": "https://arxiv.org/pdf/2601.00526",
        "title": "Federated Customization of Large Models: Approaches, Experiments, and Insights",
        "authors": [
            "Yuchuan Ye",
            "Ming Ding",
            "Youjia Chen",
            "Peng Cheng",
            "Dusit Niyato"
        ],
        "comments": "8 pages, 1 figure",
        "subjects": "Machine Learning (cs.LG); Distributed, Parallel, and Cluster Computing (cs.DC)",
        "abstract": "In this article, we explore federated customization of large models and highlight the key challenges it poses within the federated learning framework. We review several popular large model customization techniques, including full fine-tuning, efficient fine-tuning, prompt engineering, prefix-tuning, knowledge distillation, and retrieval-augmented generation. Then, we discuss how these techniques can be implemented within the federated learning framework. Moreover, we conduct experiments on federated prefix-tuning, which, to the best of our knowledge, is the first trial to apply prefix-tuning in the federated learning setting. The conducted experiments validate its feasibility with performance close to centralized approaches. Further comparison with three other federated customization methods demonstrated its competitive performance, satisfactory efficiency, and consistent robustness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00527",
        "abs_url": "https://arxiv.org/abs/2601.00527",
        "pdf_url": "https://arxiv.org/pdf/2601.00527",
        "title": "Cloud-Native Generative AI for Automated Planogram Synthesis: A Diffusion Model Approach for Multi-Store Retail Optimization",
        "authors": [
            "Ravi Teja Pagidoju",
            "Shriya Agarwal"
        ],
        "comments": "International Conference on Software Engineering and Data Engineering : Springer Nature",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Planogram creation is a significant challenge for retail, requiring an average of 30 hours per complex layout. This paper introduces a cloud-native architecture using diffusion models to automatically generate store-specific planograms. Unlike conventional optimization methods that reorganize existing layouts, our system learns from successful shelf arrangements across multiple retail locations to create new planogram configurations. The architecture combines cloud-based model training via AWS with edge deployment for real-time inference. The diffusion model integrates retail-specific constraints through a modified loss function. Simulation-based analysis demonstrates the system reduces planogram design time by 98.3% (from 30 to 0.5 hours) while achieving 94.4% constraint satisfaction. Economic analysis reveals a 97.5% reduction in creation expenses with a 4.4-month break-even period. The cloud-native architecture scales linearly, supporting up to 10,000 concurrent store requests. This work demonstrates the viability of generative AI for automated retail space optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00554",
        "abs_url": "https://arxiv.org/abs/2601.00554",
        "pdf_url": "https://arxiv.org/pdf/2601.00554",
        "title": "Entropy Production in Machine Learning Under Fokker-Planck Probability Flow",
        "authors": [
            "Lennon Shikhman"
        ],
        "comments": "10 pages, 3 figures. Submitted for journal review",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine learning models deployed in nonstationary environments experience performance degradation due to data drift. While many drift detection heuristics exist, most lack a principled dynamical interpretation and provide limited guidance on how retraining frequency should be balanced against operational cost. In this work, we propose an entropy--based retraining framework grounded in nonequilibrium stochastic dynamics. Modeling deployment--time data drift as probability flow governed by a Fokker--Planck equation, we quantify model--data mismatch using a time--evolving Kullback--Leibler divergence. We show that the time derivative of this mismatch admits an entropy--balance decomposition featuring a nonnegative entropy production term driven by probability currents. This interpretation motivates entropy--triggered retraining as a label--free intervention strategy that responds to accumulated mismatch rather than delayed performance collapse. In a controlled nonstationary classification experiment, entropy--triggered retraining achieves predictive performance comparable to high--frequency retraining while reducing retraining events by an order of magnitude relative to daily and label--based policies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00577",
        "abs_url": "https://arxiv.org/abs/2601.00577",
        "pdf_url": "https://arxiv.org/pdf/2601.00577",
        "title": "Adversarial Samples Are Not Created Equal",
        "authors": [
            "Jennifer Crawford",
            "Amol Khanna",
            "Fred Lu",
            "Amy R. Wagoner",
            "Stella Biderman",
            "Andre T. Nguyen",
            "Edward Raff"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Over the past decade, numerous theories have been proposed to explain the widespread vulnerability of deep neural networks to adversarial evasion attacks. Among these, the theory of non-robust features proposed by Ilyas et al. has been widely accepted, showing that brittle but predictive features of the data distribution can be directly exploited by attackers. However, this theory overlooks adversarial samples that do not directly utilize these features. In this work, we advocate that these two kinds of samples - those which use use brittle but predictive features and those that do not - comprise two types of adversarial weaknesses and should be differentiated when evaluating adversarial robustness. For this purpose, we propose an ensemble-based metric to measure the manipulation of non-robust features by adversarial perturbations and use this metric to analyze the makeup of adversarial samples generated by attackers. This new perspective also allows us to re-examine multiple phenomena, including the impact of sharpness-aware minimization on adversarial robustness and the robustness gap observed between adversarially training and standard training on robust datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00583",
        "abs_url": "https://arxiv.org/abs/2601.00583",
        "pdf_url": "https://arxiv.org/pdf/2601.00583",
        "title": "HFedMoE: Resource-aware Heterogeneous Federated Learning with Mixture-of-Experts",
        "authors": [
            "Zihan Fang",
            "Zheng Lin",
            "Senkang Hu",
            "Yanan Ma",
            "Yihang Tao",
            "Yiqin Deng",
            "Xianhao Chen",
            "Yuguang Fang"
        ],
        "comments": "14 pages, 16 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Networking and Internet Architecture (cs.NI)",
        "abstract": "While federated learning (FL) enables fine-tuning of large language models (LLMs) without compromising data privacy, the substantial size of an LLM renders on-device training impractical for resource-constrained clients, such as mobile devices. Thus, Mixture-of-Experts (MoE) models have emerged as a computation-efficient solution, which activates only a sparse subset of experts during model training to reduce computing burden without sacrificing performance. Though integrating MoE into FL fine-tuning holds significant potential, it still encounters three key challenges: i) selecting appropriate experts for clients remains challenging due to the lack of a reliable metric to measure each expert's impact on local fine-tuning performance, ii) the heterogeneous computing resources across clients severely hinder MoE-based LLM fine-tuning, as dynamic expert activations across diverse input samples can overwhelm resource-constrained devices, and iii) client-specific expert subsets and routing preference undermine global aggregation, where misaligned expert updates and inconsistent gating networks in troduce destructive interference. To address these challenges, we propose HFedMoE, a heterogeneous MoE-based FL fine-tuning framework that customizes a subset of experts to each client for computation-efficient LLM fine-tuning. Specifically, HFedMoE identifies the expert importance based on its contributions to fine-tuning performance, and then adaptively selects a subset of experts from an information bottleneck perspective to align with each client' s computing budget. A sparsity-aware model aggregation strategy is also designed to aggregate the actively fine-tuned experts and gating parameters with importance weighted contributions. Extensive experiments demonstrate that HFedMoE outperforms state-of-the-art benchmarks in training accuracy and convergence speed.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00604",
        "abs_url": "https://arxiv.org/abs/2601.00604",
        "pdf_url": "https://arxiv.org/pdf/2601.00604",
        "title": "Cycling Race Time Prediction: A Personalized Machine Learning Approach Using Route Topology and Training Load",
        "authors": [
            "Francisco Aguilera Moreno"
        ],
        "comments": "14 pages, 22 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Predicting cycling duration for a given route is essential for training planning and event preparation. Existing solutions rely on physics-based models that require extensive parameterization, including aerodynamic drag coefficients and real-time wind forecasts, parameters impractical for most amateur cyclists. This work presents a machine learning approach that predicts ride duration using route topology features combined with the athlete's current fitness state derived from training load metrics. The model learns athlete-specific performance patterns from historical data, substituting complex physical measurements with historical performance proxies. We evaluate the approach using a single-athlete dataset (N=96 rides) in an N-of-1 study design. After rigorous feature engineering to eliminate data leakage, we find that Lasso regression with Topology + Fitness features achieves MAE=6.60 minutes and R2=0.922. Notably, integrating fitness metrics (CTL, ATL) reduces error by 14% compared to topology alone (MAE=7.66 min), demonstrating that physiological state meaningfully constrains performance even in self-paced efforts. Progressive checkpoint predictions enable dynamic race planning as route difficulty becomes apparent.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00607",
        "abs_url": "https://arxiv.org/abs/2601.00607",
        "pdf_url": "https://arxiv.org/pdf/2601.00607",
        "title": "Traffic-Aware Optimal Taxi Placement Using Graph Neural Network-Based Reinforcement Learning",
        "authors": [
            "Sonia Khetarpaul",
            "P Y Sharan"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "In the context of smart city transportation, efficient matching of taxi supply with passenger demand requires real-time integration of urban traffic network data and mobility patterns. Conventional taxi hotspot prediction models often rely solely on historical demand, overlooking dynamic influences such as traffic congestion, road incidents, and public events. This paper presents a traffic-aware, graph-based reinforcement learning (RL) framework for optimal taxi placement in metropolitan environments. The urban road network is modeled as a graph where intersections represent nodes, road segments serve as edges, and node attributes capture historical demand, event proximity, and real-time congestion scores obtained from live traffic APIs. Graph Neural Network (GNN) embeddings are employed to encode spatial-temporal dependencies within the traffic network, which are then used by a Q-learning agent to recommend optimal taxi hotspots. The reward mechanism jointly optimizes passenger waiting time, driver travel distance, and congestion avoidance. Experiments on a simulated Delhi taxi dataset, generated using real geospatial boundaries and historic ride-hailing request patterns, demonstrate that the proposed model reduced passenger waiting time by about 56% and reduced travel distance by 38% compared to baseline stochastic selection. The proposed approach is adaptable to multi-modal transport systems and can be integrated into smart city platforms for real-time urban mobility optimization.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00624",
        "abs_url": "https://arxiv.org/abs/2601.00624",
        "pdf_url": "https://arxiv.org/pdf/2601.00624",
        "title": "Do Chatbot LLMs Talk Too Much? The YapBench Benchmark",
        "authors": [
            "Vadim Borisov",
            "Michael Gröger",
            "Mina Mikhael",
            "Richard H. Schreiber"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) such as ChatGPT, Claude, and Gemini increasingly act as general-purpose copilots, yet they often respond with unnecessary length on simple requests, adding redundant explanations, hedging, or boilerplate that increases cognitive load and inflates token-based inference cost. Prior work suggests that preference-based post-training and LLM-judged evaluations can induce systematic length bias, where longer answers are rewarded even at comparable quality. We introduce YapBench, a lightweight benchmark for quantifying user-visible over-generation on brevity-ideal prompts. Each item consists of a single-turn prompt, a curated minimal-sufficient baseline answer, and a category label. Our primary metric, YapScore, measures excess response length beyond the baseline in characters, enabling comparisons across models without relying on any specific tokenizer. We summarize model performance via the YapIndex, a uniformly weighted average of category-level median YapScores. YapBench contains over three hundred English prompts spanning three common brevity-ideal settings: (A) minimal or ambiguous inputs where the ideal behavior is a short clarification, (B) closed-form factual questions with short stable answers, and (C) one-line coding tasks where a single command or snippet suffices. Evaluating 76 assistant LLMs, we observe an order-of-magnitude spread in median excess length and distinct category-specific failure modes, including vacuum-filling on ambiguous inputs and explanation or formatting overhead on one-line technical requests. We release the benchmark and maintain a live leaderboard for tracking verbosity behavior over time.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00655",
        "abs_url": "https://arxiv.org/abs/2601.00655",
        "pdf_url": "https://arxiv.org/pdf/2601.00655",
        "title": "Interpretability-Guided Bi-objective Optimization: Aligning Accuracy and Explainability",
        "authors": [
            "Kasra Fouladi",
            "Hamta Rahmani"
        ],
        "comments": "10 pages",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "This paper introduces Interpretability-Guided Bi-objective Optimization (IGBO), a framework that trains interpretable models by incorporating structured domain knowledge via a bi-objective formulation. IGBO encodes feature importance hierarchies as a Directed Acyclic Graph (DAG) and uses Temporal Integrated Gradients (TIG) to measure feature importance. To address the Out-of-Distribution (OOD) problem in TIG computation, we propose an Optimal Path Oracle that learns data-manifold-aware integration paths. Theoretical analysis proves convergence properties and robustness to mini-batch noise, while empirical results on time-series data demonstrate IGBO's effectiveness in enforcing DAG constraints with minimal accuracy loss, outperforming standard regularization baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00677",
        "abs_url": "https://arxiv.org/abs/2601.00677",
        "pdf_url": "https://arxiv.org/pdf/2601.00677",
        "title": "IRPO: Scaling the Bradley-Terry Model via Reinforcement Learning",
        "authors": [
            "Haonan Song",
            "Qingchen Xie",
            "Huan Zhu",
            "Feng Xiao",
            "Luxi Xing",
            "Fuzhen Li",
            "Liu Kang",
            "Feng Jiang",
            "Zhiyong Zheng",
            "Fan Yang"
        ],
        "comments": "14 pages, 4 figures",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Generative Reward Models (GRMs) have attracted considerable research interest in reward modeling due to their interpretability, inference-time scalability, and potential for refinement through reinforcement learning (RL). However, widely used pairwise GRMs create a computational bottleneck when integrated with RL algorithms such as Group Relative Policy Optimization (GRPO). This bottleneck arises from two factors: (i) the O(n^2) time complexity of pairwise comparisons required to obtain relative scores, and (ii) the computational overhead of repeated sampling or additional chain-of-thought (CoT) reasoning to improve performance. To address the first factor, we propose Intergroup Relative Preference Optimization (IRPO), a novel RL framework that incorporates the well-established Bradley-Terry model into GRPO. By generating a pointwise score for each response, IRPO enables efficient evaluation of arbitrarily many candidates during RL training while preserving interpretability and fine-grained reward signals. Experimental results demonstrate that IRPO achieves state-of-the-art (SOTA) performance among pointwise GRMs across multiple benchmarks, with performance comparable to that of current leading pairwise GRMs. Furthermore, we show that IRPO significantly outperforms pairwise GRMs in post-training evaluations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00691",
        "abs_url": "https://arxiv.org/abs/2601.00691",
        "pdf_url": "https://arxiv.org/pdf/2601.00691",
        "title": "TeleDoCTR: Domain-Specific and Contextual Troubleshooting for Telecommunications",
        "authors": [
            "Mohamed Trabelsi",
            "Huseyin Uzunalioglu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL); Information Retrieval (cs.IR)",
        "abstract": "Ticket troubleshooting refers to the process of analyzing and resolving problems that are reported through a ticketing system. In large organizations offering a wide range of services, this task is highly complex due to the diversity of submitted tickets and the need for specialized domain knowledge. In particular, troubleshooting in telecommunications (telecom) is a very time-consuming task as it requires experts to interpret ticket content, consult documentation, and search historical records to identify appropriate resolutions. This human-intensive approach not only delays issue resolution but also hinders overall operational efficiency. To enhance the effectiveness and efficiency of ticket troubleshooting in telecom, we propose TeleDoCTR, a novel telecom-related, domain-specific, and contextual troubleshooting system tailored for end-to-end ticket resolution in telecom. TeleDoCTR integrates both domain-specific ranking and generative models to automate key steps of the troubleshooting workflow which are: routing tickets to the appropriate expert team responsible for resolving the ticket (classification task), retrieving contextually and semantically similar historical tickets (retrieval task), and generating a detailed fault analysis report outlining the issue, root cause, and potential solutions (generation task). We evaluate TeleDoCTR on a real-world dataset from a telecom infrastructure and demonstrate that it achieves superior performance over existing state-of-the-art methods, significantly enhancing the accuracy and efficiency of the troubleshooting process.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00693",
        "abs_url": "https://arxiv.org/abs/2601.00693",
        "pdf_url": "https://arxiv.org/pdf/2601.00693",
        "title": "ARISE: Adaptive Reinforcement Integrated with Swarm Exploration",
        "authors": [
            "Rajiv Chaitanya M",
            "D R Ramesh Babu"
        ],
        "comments": "12 pages. Accepted for presentation at WCSC 2026",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Effective exploration remains a key challenge in RL, especially with non-stationary rewards or high-dimensional policies. We introduce ARISE, a lightweight framework that enhances reinforcement learning by augmenting standard policy-gradient methods with a compact swarm-based exploration layer. ARISE blends policy actions with particle-driven proposals, where each particle represents a candidate policy trajectory sampled in the action space, and modulates exploration adaptively using reward-variance cues. While easy benchmarks exhibit only slight improvements (e.g., +0.7% on CartPole-v1), ARISE yields substantial gains on more challenging tasks, including +46% on LunarLander-v3 and +22% on Hopper-v4, while preserving stability on Walker2d and Ant. Under non-stationary reward shifts, ARISE provides marked robustness advantages, outperforming PPO by +75 points on CartPole and improving LunarLander accordingly. Ablation studies confirm that both the swarm component and the adaptive mechanism contribute to the performance. Overall, ARISE offers a simple, architecture-agnostic route to more exploratory and resilient RL agents without altering core algorithmic structures.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00696",
        "abs_url": "https://arxiv.org/abs/2601.00696",
        "pdf_url": "https://arxiv.org/pdf/2601.00696",
        "title": "Bayesian Inverse Games with High-Dimensional Multi-Modal Observations",
        "authors": [
            "Yash Jain",
            "Xinjie Liu",
            "Lasse Peters",
            "David Fridovich-Keil",
            "Ufuk Topcu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computer Science and Game Theory (cs.GT); Robotics (cs.RO)",
        "abstract": "Many multi-agent interaction scenarios can be naturally modeled as noncooperative games, where each agent's decisions depend on others' future actions. However, deploying game-theoretic planners for autonomous decision-making requires a specification of all agents' objectives. To circumvent this practical difficulty, recent work develops maximum likelihood techniques for solving inverse games that can identify unknown agent objectives from interaction data. Unfortunately, these methods only infer point estimates and do not quantify estimator uncertainty; correspondingly, downstream planning decisions can overconfidently commit to unsafe actions. We present an approximate Bayesian inference approach for solving the inverse game problem, which can incorporate observation data from multiple modalities and be used to generate samples from the Bayesian posterior over the hidden agent objectives given limited sensor observations in real time. Concretely, the proposed Bayesian inverse game framework trains a structured variational autoencoder with an embedded differentiable Nash game solver on interaction datasets and does not require labels of agents' true objectives. Extensive experiments show that our framework successfully learns prior and posterior distributions, improves inference quality over maximum likelihood estimation-based inverse game approaches, and enables safer downstream decision-making without sacrificing efficiency. When trajectory information is uninformative or unavailable, multimodal inference further reduces uncertainty by exploiting additional observation modalities.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00698",
        "abs_url": "https://arxiv.org/abs/2601.00698",
        "pdf_url": "https://arxiv.org/pdf/2601.00698",
        "title": "BSAT: B-Spline Adaptive Tokenizer for Long-Term Time Series Forecasting",
        "authors": [
            "Maximilian Reinwardt",
            "Michael Eichelbeck",
            "Matthias Althoff"
        ],
        "comments": "20 pages, 7 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Long-term time series forecasting using transformers is hampered by the quadratic complexity of self-attention and the rigidity of uniform patching, which may be misaligned with the data's semantic structure. In this paper, we introduce the \\textit{B-Spline Adaptive Tokenizer (BSAT)}, a novel, parameter-free method that adaptively segments a time series by fitting it with B-splines. BSAT algorithmically places tokens in high-curvature regions and represents each variable-length basis function as a fixed-size token, composed of its coefficient and position. Further, we propose a hybrid positional encoding that combines a additive learnable positional encoding with Rotary Positional Embedding featuring a layer-wise learnable base: L-RoPE. This allows each layer to attend to different temporal dependencies. Our experiments on several public benchmarks show that our model is competitive with strong performance at high compression rates. This makes it particularly well-suited for use cases with strong memory constraints.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00728",
        "abs_url": "https://arxiv.org/abs/2601.00728",
        "pdf_url": "https://arxiv.org/pdf/2601.00728",
        "title": "Precision Autotuning for Linear Solvers via Contextual Bandit-Based RL",
        "authors": [
            "Erin Carson",
            "Xinye Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "We propose a reinforcement learning (RL) framework for adaptive precision tuning of linear solvers, and can be extended to general algorithms. The framework is formulated as a contextual bandit problem and solved using incremental action-value estimation with a discretized state space to select optimal precision configurations for computational steps, balancing precision and computational efficiency. To verify its effectiveness, we apply the framework to iterative refinement for solving linear systems $Ax = b$. In this application, our approach dynamically chooses precisions based on calculated features from the system. In detail, a Q-table maps discretized features (e.g., approximate condition number and matrix norm)to actions (chosen precision configurations for specific steps), optimized via an epsilon-greedy strategy to maximize a multi-objective reward balancing accuracy and computational cost. Empirical results demonstrate effective precision selection, reducing computational cost while maintaining accuracy comparable to double-precision baselines. The framework generalizes to diverse out-of-sample data and offers insight into utilizing RL precision selection for other numerical algorithms, advancing mixed-precision numerical methods in scientific computing. To the best of our knowledge, this is the first work on precision autotuning with RL and verified on unseen datasets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00747",
        "abs_url": "https://arxiv.org/abs/2601.00747",
        "pdf_url": "https://arxiv.org/pdf/2601.00747",
        "title": "The Reasoning-Creativity Trade-off: Toward Creativity-Driven Problem Solving",
        "authors": [
            "Max Ruiz Luyten",
            "Mihaela van der Schaar"
        ],
        "comments": "56 pages, 9 figures, submitted to Twenty-Ninth Annual Conference on Artificial Intelligence and Statistics",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "State-of-the-art large language model (LLM) pipelines rely on bootstrapped reasoning loops: sampling diverse chains of thought and reinforcing the highest-scoring ones, mainly optimizing correctness. We analyze how this design choice is sensitive to the collapse of the model's distribution over reasoning paths, slashing semantic entropy and undermining creative problem-solving. To analyze this failure, we introduce Distributional Creative Reasoning (DCR), a unified variational objective that casts training as gradient flow through probability measures on solution traces. STaR, GRPO, and DPO, as well as entropy bonuses, and other methods, all constitute special cases of the same loss. The framework delivers three core results: (i) the diversity decay theorem, describing how correctness-based objectives lead to distinct modes of diversity decay for STaR, GRPO, and DPO; (ii) designs that ensure convergence to a stable and diverse policy, effectively preventing collapse; and (iii) simple, actionable recipes to achieve this in practice. DCR thus offers the first principled recipe for LLMs that remain both correct and creative.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00748",
        "abs_url": "https://arxiv.org/abs/2601.00748",
        "pdf_url": "https://arxiv.org/pdf/2601.00748",
        "title": "A Machine Learning Framework for Off Ball Defensive Role and Performance Evaluation in Football",
        "authors": [
            "Sean Groom",
            "Shuo Wang",
            "Francisco Belo",
            "Axl Rice",
            "Liam Anderson"
        ],
        "comments": "40 pages, 16 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Evaluating off-ball defensive performance in football is challenging, as traditional metrics do not capture the nuanced coordinated movements that limit opponent action selection and success probabilities. Although widely used possession value models excel at appraising on-ball actions, their application to defense remains limited. Existing counterfactual methods, such as ghosting models, help extend these analyses but often rely on simulating \"average\" behavior that lacks tactical context. To address this, we introduce a covariate-dependent Hidden Markov Model (CDHMM) tailored to corner kicks, a highly structured aspect of football games. Our label-free model infers time-resolved man-marking and zonal assignments directly from player tracking data. We leverage these assignments to propose a novel framework for defensive credit attribution and a role-conditioned ghosting method for counterfactual analysis of off-ball defensive performance. We show how these contributions provide a interpretable evaluation of defensive contributions against context-aware baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00756",
        "abs_url": "https://arxiv.org/abs/2601.00756",
        "pdf_url": "https://arxiv.org/pdf/2601.00756",
        "title": "Memory Bank Compression for Continual Adaptation of Large Language Models",
        "authors": [
            "Thomas Katraouras",
            "Dimitrios Rafailidis"
        ],
        "comments": "Accepted to the 41st ACM/SIGAPP Symposium on Applied Computing (SAC '26)",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Large Language Models (LLMs) have become a mainstay for many everyday applications. However, as data evolve their knowledge quickly becomes outdated. Continual learning aims to update LLMs with new information without erasing previously acquired knowledge. Although methods such as full fine-tuning can incorporate new data, they are computationally expensive and prone to catastrophic forgetting, where prior knowledge is overwritten. Memory-augmented approaches address this by equipping LLMs with a memory bank, that is an external memory module which stores information for future use. However, these methods face a critical limitation, in particular, the memory bank constantly grows in the real-world scenario when large-scale data streams arrive. In this paper, we propose MBC, a model that compresses the memory bank through a codebook optimization strategy during online adaptation learning. To ensure stable learning, we also introduce an online resetting mechanism that prevents codebook collapse. In addition, we employ Key-Value Low-Rank Adaptation in the attention layers of the LLM, enabling efficient utilization of the compressed memory representations. Experiments with benchmark question-answering datasets demonstrate that MBC reduces the memory bank size to 0.3% when compared against the most competitive baseline, while maintaining high retention accuracy during online adaptation learning. Our code is publicly available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00781",
        "abs_url": "https://arxiv.org/abs/2601.00781",
        "pdf_url": "https://arxiv.org/pdf/2601.00781",
        "title": "Categorical Reparameterization with Denoising Diffusion models",
        "authors": [
            "Samson Gourevitch",
            "Alain Durmus",
            "Eric Moulines",
            "Jimmy Olsson",
            "Yazid Janati"
        ],
        "comments": "working paper",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Gradient-based optimization with categorical variables typically relies on score-function estimators, which are unbiased but noisy, or on continuous relaxations that replace the discrete distribution with a smooth surrogate admitting a pathwise (reparameterized) gradient, at the cost of optimizing a biased, temperature-dependent objective. In this paper, we extend this family of relaxations by introducing a diffusion-based soft reparameterization for categorical distributions. For these distributions, the denoiser under a Gaussian noising process admits a closed form and can be computed efficiently, yielding a training-free diffusion sampler through which we can backpropagate. Our experiments show that the proposed reparameterization trick yields competitive or improved optimization performance on various benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00791",
        "abs_url": "https://arxiv.org/abs/2601.00791",
        "pdf_url": "https://arxiv.org/pdf/2601.00791",
        "title": "Geometry of Reason: Spectral Signatures of Valid Mathematical Reasoning",
        "authors": [
            "Valentin Noël"
        ],
        "comments": "58 pages, 19 figures, Under Review",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Logic in Computer Science (cs.LO)",
        "abstract": "We present a training-free method for detecting valid mathematical reasoning in large language models through spectral analysis of attention patterns. By treating attention matrices as adjacency matrices of dynamic graphs over tokens, we extract four interpretable spectral diagnostics, the Fiedler value (algebraic connectivity), high-frequency energy ratio (HFER), graph signal smoothness, and spectral entropy, that exhibit statistically significant differences between valid and invalid mathematical proofs. Experiments across seven transformer models from four independent architectural families (Meta Llama, Alibaba Qwen, Microsoft Phi, and Mistral AI) demonstrate that this spectral signature produces effect sizes up to Cohen's $d = 3.30$ ($p < 10^{-116}$), enabling 85.0--95.6\\% classification accuracy under rigorous evaluation, with calibrated thresholds reaching 93--95\\% on the full dataset. The method requires no training data, fine-tuning, or learned classifiers: a single threshold on a spectral metric suffices for high accuracy. Through systematic label correction, we discover that the spectral method detects logical coherence rather than compiler acceptance, identifying mathematically valid proofs that formal verifiers reject due to technical failures. We further identify an architectural dependency: Mistral-7B's Sliding Window Attention shifts the discriminative signal from HFER to late-layer Smoothness ($d = 2.09$, $p_{\\text{MW}} = 1.16 \\times 10^{-48}$), revealing that attention mechanism design affects which spectral features capture reasoning validity. These findings establish spectral graph analysis as a principled framework for reasoning verification with immediate applications to hallucination detection and AI safety monitoring.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2505.16037",
        "abs_url": "https://arxiv.org/abs/2505.16037",
        "pdf_url": "https://arxiv.org/pdf/2505.16037",
        "title": "Causal LLM Routing: End-to-End Regret Minimization from Observational Data",
        "authors": [
            "Asterios Tsiourvas",
            "Wei Sun",
            "Georgia Perakis"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Machine Learning (cs.LG); Optimization and Control (math.OC); Machine Learning (stat.ML)",
        "abstract": "LLM routing aims to select the most appropriate model for each query, balancing competing performance metrics such as accuracy and cost across a pool of language models. Prior approaches typically adopt a decoupled strategy, where the metrics are first predicted and the model is then selected based on these estimates. This setup is prone to compounding errors and often relies on full-feedback data, where each query is evaluated by all candidate models, which is costly to obtain and maintain in practice. In contrast, we learn from observational data, which records only the outcome of the model actually deployed. We propose a causal end-to-end framework that learns routing policies by minimizing decision-making regret from observational data. To enable efficient optimization, we introduce two theoretically grounded surrogate objectives: a classification-based upper bound, and a softmax-weighted regret approximation shown to recover the optimal policy at convergence. We further extend our framework to handle heterogeneous cost preferences via an interval-conditioned architecture. Experiments on public benchmarks show that our method outperforms existing baselines, achieving state-of-the-art performance across different embedding models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00012",
        "abs_url": "https://arxiv.org/abs/2601.00012",
        "pdf_url": "https://arxiv.org/pdf/2601.00012",
        "title": "Neural Brain Fields: A NeRF-Inspired Approach for Generating Nonexistent EEG Electrodes",
        "authors": [
            "Shahar Ain Kedem",
            "Itamar Zimerman",
            "Eliya Nachmani"
        ],
        "comments": "",
        "subjects": "Signal Processing (eess.SP); Artificial Intelligence (cs.AI); Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Audio and Speech Processing (eess.AS)",
        "abstract": "Electroencephalography (EEG) data present unique modeling challenges because recordings vary in length, exhibit very low signal to noise ratios, differ significantly across participants, drift over time within sessions, and are rarely available in large and clean datasets. Consequently, developing deep learning methods that can effectively process EEG signals remains an open and important research problem. To tackle this problem, this work presents a new method inspired by Neural Radiance Fields (NeRF). In computer vision, NeRF techniques train a neural network to memorize the appearance of a 3D scene and then uses its learned parameters to render and edit the scene from any viewpoint. We draw an analogy between the discrete images captured from different viewpoints used to learn a continuous 3D scene in NeRF, and EEG electrodes positioned at different locations on the scalp, which are used to infer the underlying representation of continuous neural activity. Building on this connection, we show that a neural network can be trained on a single EEG sample in a NeRF style manner to produce a fixed size and informative weight vector that encodes the entire signal. Moreover, via this representation we can render the EEG signal at previously unseen time steps and spatial electrode positions. We demonstrate that this approach enables continuous visualization of brain activity at any desired resolution, including ultra high resolution, and reconstruction of raw EEG signals. Finally, our empirical analysis shows that this method can effectively simulate nonexistent electrodes data in EEG recordings, allowing the reconstructed signal to be fed into standard EEG processing networks to improve performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00014",
        "abs_url": "https://arxiv.org/abs/2601.00014",
        "pdf_url": "https://arxiv.org/pdf/2601.00014",
        "title": "Modeling Day-Long ECG Signals to Predict Heart Failure Risk with Explainable AI",
        "authors": [
            "Eran Zvuloni",
            "Ronit Almog",
            "Michael Glikson",
            "Shany Brimer Biton",
            "Ilan Green",
            "Izhar Laufer",
            "Offer Amir",
            "Joachim A. Behar"
        ],
        "comments": "",
        "subjects": "Signal Processing (eess.SP); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Heart failure (HF) affects 11.8% of adults aged 65 and older, reducing quality of life and longevity. Preventing HF can reduce morbidity and mortality. We hypothesized that artificial intelligence (AI) applied to 24-hour single-lead electrocardiogram (ECG) data could predict the risk of HF within five years. To research this, the Technion-Leumit Holter ECG (TLHE) dataset, including 69,663 recordings from 47,729 patients, collected over 20 years was used. Our deep learning model, DeepHHF, trained on 24-hour ECG recordings, achieved an area under the receiver operating characteristic curve of 0.80 that outperformed a model using 30-second segments and a clinical score. High-risk individuals identified by DeepHHF had a two-fold chance of hospitalization or death incidents. Explainability analysis showed DeepHHF focused on arrhythmias and heart abnormalities, with key attention between 8 AM and 3 PM. This study highlights the feasibility of deep learning to model 24-hour continuous ECG data, capturing paroxysmal events and circadian variations essential for reliable risk prediction. Artificial intelligence applied to single-lead Holter ECG is non-invasive, inexpensive, and widely accessible, making it a promising tool for HF risk prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00023",
        "abs_url": "https://arxiv.org/abs/2601.00023",
        "pdf_url": "https://arxiv.org/pdf/2601.00023",
        "title": "A multi-algorithm approach for operational human resources workload balancing in a last mile urban delivery system",
        "authors": [
            "Luis M. Moreno-Saavedra",
            "Silvia Jimenez-Fernandez",
            "Antonio Portilla-Figueras",
            "David Casillas-Perez",
            "Sancho Salcedo-Sanz"
        ],
        "comments": "",
        "subjects": "Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Efficient workload assignment to the workforce is critical in last-mile package delivery systems. In this context, traditional methods of assigning package deliveries to workers based on geographical proximity can be inefficient and surely guide to an unbalanced workload distribution among delivery workers. In this paper, we look at the problem of operational human resources workload balancing in last-mile urban package delivery systems. The idea is to consider the effort workload to optimize the system, i.e., the optimization process is now focused on improving the delivery time, so that the workload balancing is complete among all the staff. This process should correct significant decompensations in workload among delivery workers in a given zone. Specifically, we propose a multi-algorithm approach to tackle this problem. The proposed approach takes as input a set of delivery points and a defined number of workers, and then assigns packages to workers, in such a way that it ensures that each worker completes a similar amount of work per day. The proposed algorithms use a combination of distance and workload considerations to optimize the allocation of packages to workers. In this sense, the distance between the delivery points and the location of each worker is also taken into account. The proposed multi-algorithm methodology includes different versions of k-means, evolutionary approaches, recursive assignments based on k-means initialization with different problem encodings, and a hybrid evolutionary ensemble algorithm. We have illustrated the performance of the proposed approach in a real-world problem in an urban last-mile package delivery workforce operating at Azuqueca de Henares, Spain.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00038",
        "abs_url": "https://arxiv.org/abs/2601.00038",
        "pdf_url": "https://arxiv.org/pdf/2601.00038",
        "title": "Active learning for data-driven reduced models of parametric differential systems with Bayesian operator inference",
        "authors": [
            "Shane A. McQuarrie",
            "Mengwu Guo",
            "Anirban Chaudhuri"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Computational Engineering, Finance, and Science (cs.CE); Machine Learning (cs.LG); Numerical Analysis (math.NA)",
        "abstract": "This work develops an active learning framework to intelligently enrich data-driven reduced-order models (ROMs) of parametric dynamical systems, which can serve as the foundation of virtual assets in a digital twin. Data-driven ROMs are explainable, computationally efficient scientific machine learning models that aim to preserve the underlying physics of complex dynamical simulations. Since the quality of data-driven ROMs is sensitive to the quality of the limited training data, we seek to identify training parameters for which using the associated training data results in the best possible parametric ROM. Our approach uses the operator inference methodology, a regression-based strategy which can be tailored to particular parametric structure for a large class of problems. We establish a probabilistic version of parametric operator inference, casting the learning problem as a Bayesian linear regression. Prediction uncertainties stemming from the resulting probabilistic ROM solutions are used to design a sequential adaptive sampling scheme to select new training parameter vectors that promote ROM stability and accuracy globally in the parameter domain. We conduct numerical experiments for several nonlinear parametric systems of partial differential equations and compare the results to ROMs trained on random parameter samples. The results demonstrate that the proposed adaptive sampling strategy consistently yields more stable and accurate ROMs than random sampling does under the same computational budget.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00042",
        "abs_url": "https://arxiv.org/abs/2601.00042",
        "pdf_url": "https://arxiv.org/pdf/2601.00042",
        "title": "Large Empirical Case Study: Go-Explore adapted for AI Red Team Testing",
        "authors": [
            "Manish Bhatt",
            "Adrian Wood",
            "Idan Habler",
            "Ammar Al-Kahfah"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Production LLM agents with tool-using capabilities require security testing despite their safety training. We adapt Go-Explore to evaluate GPT-4o-mini across 28 experimental runs spanning six research questions. We find that random-seed variance dominates algorithmic parameters, yielding an 8x spread in outcomes; single-seed comparisons are unreliable, while multi-seed averaging materially reduces variance in our setup. Reward shaping consistently harms performance, causing exploration collapse in 94% of runs or producing 18 false positives with zero verified attacks. In our environment, simple state signatures outperform complex ones. For comprehensive security testing, ensembles provide attack-type diversity, whereas single agents optimize coverage within a given attack type. Overall, these results suggest that seed variance and targeted domain knowledge can outweigh algorithmic sophistication when testing safety-trained models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00045",
        "abs_url": "https://arxiv.org/abs/2601.00045",
        "pdf_url": "https://arxiv.org/pdf/2601.00045",
        "title": "Group Cross-Correlations with Faintly Constrained Filters",
        "authors": [
            "Benedikt Fluhr"
        ],
        "comments": "25 pages + 9 pages appendices, 1 figure, comments welcome",
        "subjects": "Dynamical Systems (math.DS); Machine Learning (cs.LG); Group Theory (math.GR)",
        "abstract": "We provide a notion of group cross-correlations, where the associated filter is not as tightly constrained as in the previous literature. This resolves an incompatibility previous constraints have for group actions with non-compact stabilizers. Moreover, we generalize previous results to group actions that are not necessarily transitive, and we weaken the common assumption of unimodularity.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00081",
        "abs_url": "https://arxiv.org/abs/2601.00081",
        "pdf_url": "https://arxiv.org/pdf/2601.00081",
        "title": "Cuffless, calibration-free hemodynamic monitoring with physics-informed machine learning models",
        "authors": [
            "Henry Crandall",
            "Tyler Schuessler",
            "Filip Bělík",
            "Albert Fabregas",
            "Barry M. Stults",
            "Alexandra Boyadzhiev",
            "Huanan Zhang",
            "Jim S. Wu",
            "Aylin R. Rodan",
            "Stephen P. Juraschek",
            "Ramakrishna Mukkamala",
            "Alfred K. Cheung",
            "Stavros G. Drakos",
            "Christel Hohenegger",
            "Braxton Osting",
            "Benjamin Sanchez"
        ],
        "comments": "225 pages, Number of Main Figures 4, Number of Extended Data Tables 4, Number of Extended Data Figures 5, Number of Supplementary Figures 34, Number of Supplementary Tables 11, Number of Supplementary Videos 11, Supplementary Statistical Table 1 (Supplementary Table 12)",
        "subjects": "Medical Physics (physics.med-ph); Machine Learning (cs.LG)",
        "abstract": "Wearable technologies have the potential to transform ambulatory and at-home hemodynamic monitoring by providing continuous assessments of cardiovascular health metrics and guiding clinical management. However, existing cuffless wearable devices for blood pressure (BP) monitoring often rely on methods lacking theoretical foundations, such as pulse wave analysis or pulse arrival time, making them vulnerable to physiological and experimental confounders that undermine their accuracy and clinical utility. Here, we developed a smartwatch device with real-time electrical bioimpedance (BioZ) sensing for cuffless hemodynamic monitoring. We elucidate the biophysical relationship between BioZ and BP via a multiscale analytical and computational modeling framework, and identify physiological, anatomical, and experimental parameters that influence the pulsatile BioZ signal at the wrist. A signal-tagged physics-informed neural network incorporating fluid dynamics principles enables calibration-free estimation of BP and radial and axial blood velocity. We successfully tested our approach with healthy individuals at rest and after physical activity including physical and autonomic challenges, and with patients with hypertension and cardiovascular disease in outpatient and intensive care settings. Our findings demonstrate the feasibility of BioZ technology for cuffless BP and blood velocity monitoring, addressing critical limitations of existing cuffless technologies.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00087",
        "abs_url": "https://arxiv.org/abs/2601.00087",
        "pdf_url": "https://arxiv.org/pdf/2601.00087",
        "title": "Reinforcement learning with timed constraints for robotics motion planning",
        "authors": [
            "Zhaoan Wang",
            "Junchao Li",
            "Mahdi Mohammad",
            "Shaoping Xiao"
        ],
        "comments": "",
        "subjects": "Robotics (cs.RO); Machine Learning (cs.LG)",
        "abstract": "Robotic systems operating in dynamic and uncertain environments increasingly require planners that satisfy complex task sequences while adhering to strict temporal constraints. Metric Interval Temporal Logic (MITL) offers a formal and expressive framework for specifying such time-bounded requirements; however, integrating MITL with reinforcement learning (RL) remains challenging due to stochastic dynamics and partial observability. This paper presents a unified automata-based RL framework for synthesizing policies in both Markov Decision Processes (MDPs) and Partially Observable Markov Decision Processes (POMDPs) under MITL specifications. MITL formulas are translated into Timed Limit-Deterministic Generalized Büchi Automata (Timed-LDGBA) and synchronized with the underlying decision process to construct product timed models suitable for Q-learning. A simple yet expressive reward structure enforces temporal correctness while allowing additional performance objectives. The approach is validated in three simulation studies: a $5 \\times 5$ grid-world formulated as an MDP, a $10 \\times 10$ grid-world formulated as a POMDP, and an office-like service-robot scenario. Results demonstrate that the proposed framework consistently learns policies that satisfy strict time-bounded requirements under stochastic transitions, scales to larger state spaces, and remains effective in partially observable environments, highlighting its potential for reliable robotic planning in time-critical and uncertain settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00146",
        "abs_url": "https://arxiv.org/abs/2601.00146",
        "pdf_url": "https://arxiv.org/pdf/2601.00146",
        "title": "Combining datasets with different ground truths using Low-Rank Adaptation to generalize image-based CNN models for photometric redshift prediction",
        "authors": [
            "Vikram Seenivasan",
            "Srinath Saikrishnan",
            "Andrew Lizarraga",
            "Jonathan Soriano",
            "Bernie Boscoe",
            "Tuan Do"
        ],
        "comments": "11 pages, 7 figures, 3 tables, Accepted to the Conference on Neural Information Processing Systems (NeurIPS), Machine Learning and the Physical Sciences (ML4PS) Workshop 2025",
        "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); Machine Learning (cs.LG)",
        "abstract": "In this work, we demonstrate how Low-Rank Adaptation (LoRA) can be used to combine different galaxy imaging datasets to improve redshift estimation with CNN models for cosmology. LoRA is an established technique for large language models that adds adapter networks to adjust model weights and biases to efficiently fine-tune large base models without retraining. We train a base model using a photometric redshift ground truth dataset, which contains broad galaxy types but is less accurate. We then fine-tune using LoRA on a spectroscopic redshift ground truth dataset. These redshifts are more accurate but limited to bright galaxies and take orders of magnitude more time to obtain, so are less available for large surveys. Ideally, the combination of the two datasets would yield more accurate models that generalize well. The LoRA model performs better than a traditional transfer learning method, with $\\sim2.5\\times$ less bias and $\\sim$2.2$\\times$ less scatter. Retraining the model on a combined dataset yields a model that generalizes better than LoRA but at a cost of greater computation time. Our work shows that LoRA is useful for fine-tuning regression models in astrophysics by providing a middle ground between full retraining and no retraining. LoRA shows potential in allowing us to leverage existing pretrained astrophysical models, especially for data sparse tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00197",
        "abs_url": "https://arxiv.org/abs/2601.00197",
        "pdf_url": "https://arxiv.org/pdf/2601.00197",
        "title": "StockBot 2.0: Vanilla LSTMs Outperform Transformer-based Forecasting for Stock Prices",
        "authors": [
            "Shaswat Mohanty"
        ],
        "comments": "14 pages, 5 figures",
        "subjects": "Computational Engineering, Finance, and Science (cs.CE); Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Accurate forecasting of financial markets remains a long-standing challenge due to complex temporal and often latent dependencies, non-linear dynamics, and high volatility. Building on our earlier recurrent neural network framework, we present an enhanced StockBot architecture that systematically evaluates modern attention-based, convolutional, and recurrent time-series forecasting models within a unified experimental setting. While attention-based and transformer-inspired models offer increased modeling flexibility, extensive empirical evaluation reveals that a carefully constructed vanilla LSTM consistently achieves superior predictive accuracy and more stable buy/sell decision-making when trained under a common set of default hyperparameters. These results highlight the robustness and data efficiency of recurrent sequence models for financial time-series forecasting, particularly in the absence of extensive hyperparameter tuning or the availability of sufficient data when discretized to single-day intervals. Additionally, these results underscore the importance of architectural inductive bias in data-limited market prediction tasks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00200",
        "abs_url": "https://arxiv.org/abs/2601.00200",
        "pdf_url": "https://arxiv.org/pdf/2601.00200",
        "title": "Detecting Unobserved Confounders: A Kernelized Regression Approach",
        "authors": [
            "Yikai Chen",
            "Yunxin Mao",
            "Chunyuan Zheng",
            "Hao Zou",
            "Shanzhi Gu",
            "Shixuan Liu",
            "Yang Shi",
            "Wenjing Yang",
            "Kun Kuang",
            "Haotian Wang"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "Detecting unobserved confounders is crucial for reliable causal inference in observational studies. Existing methods require either linearity assumptions or multiple heterogeneous environments, limiting applicability to nonlinear single-environment settings. To bridge this gap, we propose Kernel Regression Confounder Detection (KRCD), a novel method for detecting unobserved confounding in nonlinear observational data under single-environment conditions. KRCD leverages reproducing kernel Hilbert spaces to model complex dependencies. By comparing standard and higherorder kernel regressions, we derive a test statistic whose significant deviation from zero indicates unobserved confounding. Theoretically, we prove two key results: First, in infinite samples, regression coefficients coincide if and only if no unobserved confounders exist. Second, finite-sample differences converge to zero-mean Gaussian distributions with tractable variance. Extensive experiments on synthetic benchmarks and the Twins dataset demonstrate that KRCD not only outperforms existing baselines but also achieves superior computational efficiency.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00242",
        "abs_url": "https://arxiv.org/abs/2601.00242",
        "pdf_url": "https://arxiv.org/pdf/2601.00242",
        "title": "Neural Minimum Weight Perfect Matching for Quantum Error Codes",
        "authors": [
            "Yotam Peled",
            "David Zenati",
            "Eliya Nachmani"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Artificial Intelligence (cs.AI); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "Realizing the full potential of quantum computation requires Quantum Error Correction (QEC). QEC reduces error rates by encoding logical information across redundant physical qubits, enabling errors to be detected and corrected. A common decoder used for this task is Minimum Weight Perfect Matching (MWPM) a graph-based algorithm that relies on edge weights to identify the most likely error chains. In this work, we propose a data-driven decoder named Neural Minimum Weight Perfect Matching (NMWPM). Our decoder utilizes a hybrid architecture that integrates Graph Neural Networks (GNNs) to extract local syndrome features and Transformers to capture long-range global dependencies, which are then used to predict dynamic edge weights for the MWPM decoder. To facilitate training through the non-differentiable MWPM algorithm, we formulate a novel proxy loss function that enables end-to-end optimization. Our findings demonstrate significant performance reduction in the Logical Error Rate (LER) over standard baselines, highlighting the advantage of hybrid decoders that combine the predictive capabilities of neural networks with the algorithmic structure of classical matching.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00245",
        "abs_url": "https://arxiv.org/abs/2601.00245",
        "pdf_url": "https://arxiv.org/pdf/2601.00245",
        "title": "Modern Neuromorphic AI: From Intra-Token to Inter-Token Processing",
        "authors": [
            "Osvaldo Simeone"
        ],
        "comments": "",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "The rapid growth of artificial intelligence (AI) has brought novel data processing and generative capabilities but also escalating energy requirements. This challenge motivates renewed interest in neuromorphic computing principles, which promise brain-like efficiency through discrete and sparse activations, recurrent dynamics, and non-linear feedback. In fact, modern AI architectures increasingly embody neuromorphic principles through heavily quantized activations, state-space dynamics, and sparse attention mechanisms. This paper elaborates on the connections between neuromorphic models, state-space models, and transformer architectures through the lens of the distinction between intra-token processing and inter-token processing. Most early work on neuromorphic AI was based on spiking neural networks (SNNs) for intra-token processing, i.e., for transformations involving multiple channels, or features, of the same vector input, such as the pixels of an image. In contrast, more recent research has explored how neuromorphic principles can be leveraged to design efficient inter-token processing methods, which selectively combine different information elements depending on their contextual relevance. Implementing associative memorization mechanisms, these approaches leverage state-space dynamics or sparse self-attention. Along with a systematic presentation of modern neuromorphic AI models through the lens of intra-token and inter-token processing, training methodologies for neuromorphic AI models are also reviewed. These range from surrogate gradients leveraging parallel convolutional processing to local learning rules based on reinforcement learning mechanisms.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00270",
        "abs_url": "https://arxiv.org/abs/2601.00270",
        "pdf_url": "https://arxiv.org/pdf/2601.00270",
        "title": "Rectifying Adversarial Examples Using Their Vulnerabilities",
        "authors": [
            "Fumiya Morimoto",
            "Ryuto Morita",
            "Satoshi Ono"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Deep neural network-based classifiers are prone to errors when processing adversarial examples (AEs). AEs are minimally perturbed input data undetectable to humans posing significant risks to security-dependent applications. Hence, extensive research has been undertaken to develop defense mechanisms that mitigate their threats. Most existing methods primarily focus on discriminating AEs based on the input sample features, emphasizing AE detection without addressing the correct sample categorization before an attack. While some tasks may only require mere rejection on detected AEs, others necessitate identifying the correct original input category such as traffic sign recognition in autonomous driving. The objective of this study is to propose a method for rectifying AEs to estimate the correct labels of their original inputs. Our method is based on re-attacking AEs to move them beyond the decision boundary for accurate label prediction, effectively addressing the issue of rectifying minimally perceptible AEs created using white-box attack methods. However, challenge remains with respect to effectively rectifying AEs produced by black-box attacks at a distance from the boundary, or those misclassified into low-confidence categories by targeted attacks. By adopting a straightforward approach of only considering AEs as inputs, the proposed method can address diverse attacks while avoiding the requirement of parameter adjustments or preliminary training. Results demonstrate that the proposed method exhibits consistent performance in rectifying AEs generated via various attack methods, including targeted and black-box attacks. Moreover, it outperforms conventional rectification and input transformation methods in terms of stability against various attacks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00342",
        "abs_url": "https://arxiv.org/abs/2601.00342",
        "pdf_url": "https://arxiv.org/pdf/2601.00342",
        "title": "Solving nonlinear subsonic compressible flow in infinite domain via multi-stage neural networks",
        "authors": [
            "Xuehui Qian",
            "Hongkai Tao",
            "Yongji Wang"
        ],
        "comments": "24 pages, 9 figures",
        "subjects": "Fluid Dynamics (physics.flu-dyn); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "In aerodynamics, accurately modeling subsonic compressible flow over airfoils is critical for aircraft design. However, solving the governing nonlinear perturbation velocity potential equation presents computational challenges. Traditional approaches often rely on linearized equations or finite, truncated domains, which introduce non-negligible errors and limit applicability in real-world scenarios. In this study, we propose a novel framework utilizing Physics-Informed Neural Networks (PINNs) to solve the full nonlinear compressible potential equation in an unbounded (infinite) domain. We address the unbounded-domain and convergence challenges inherent in standard PINNs by incorporating a coordinate transformation and embedding physical asymptotic constraints directly into the network architecture. Furthermore, we employ a Multi-Stage PINN (MS-PINN) approach to iteratively minimize residuals, achieving solution accuracy approaching machine precision. We validate this framework by simulating flow over circular and elliptical geometries, comparing our results against traditional finite-domain and linearized solutions. Our findings quantify the noticeable discrepancies introduced by domain truncation and linearization, particularly at higher Mach numbers, and demonstrate that this new framework is a robust, high-fidelity tool for computational fluid dynamics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00361",
        "abs_url": "https://arxiv.org/abs/2601.00361",
        "pdf_url": "https://arxiv.org/pdf/2601.00361",
        "title": "Deterministic Coreset for Lp Subspace",
        "authors": [
            "Rachit Chhaya",
            "Anirban Dasgupta",
            "Dan Feldman",
            "Supratim Shit"
        ],
        "comments": "",
        "subjects": "Data Structures and Algorithms (cs.DS); Machine Learning (cs.LG)",
        "abstract": "We introduce the first iterative algorithm for constructing a $\\varepsilon$-coreset that guarantees deterministic $\\ell_p$ subspace embedding for any $p \\in [1,\\infty)$ and any $\\varepsilon > 0$. For a given full rank matrix $\\mathbf{X} \\in \\mathbb{R}^{n \\times d}$ where $n \\gg d$, $\\mathbf{X}' \\in \\mathbb{R}^{m \\times d}$ is an $(\\varepsilon,\\ell_p)$-subspace embedding of $\\mathbf{X}$, if for every $\\mathbf{q} \\in \\mathbb{R}^d$, $(1-\\varepsilon)\\|\\mathbf{Xq}\\|_{p}^{p} \\leq \\|\\mathbf{X'q}\\|_{p}^{p} \\leq (1+\\varepsilon)\\|\\mathbf{Xq}\\|_{p}^{p}$. Specifically, in this paper, $\\mathbf{X}'$ is a weighted subset of rows of $\\mathbf{X}$ which is commonly known in the literature as a coreset. In every iteration, the algorithm ensures that the loss on the maintained set is upper and lower bounded by the loss on the original dataset with appropriate scalings. So, unlike typical coreset guarantees, due to bounded loss, our coreset gives a deterministic guarantee for the $\\ell_p$ subspace embedding. For an error parameter $\\varepsilon$, our algorithm takes $O(\\mathrm{poly}(n,d,\\varepsilon^{-1}))$ time and returns a deterministic $\\varepsilon$-coreset, for $\\ell_p$ subspace embedding whose size is $O\\left(\\frac{d^{\\max\\{1,p/2\\}}}{\\varepsilon^{2}}\\right)$. Here, we remove the $\\log$ factors in the coreset size, which had been a long-standing open problem. Our coresets are optimal as they are tight with the lower bound. As an application, our coreset can also be used for approximately solving the $\\ell_p$ regression problem in a deterministic manner.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00384",
        "abs_url": "https://arxiv.org/abs/2601.00384",
        "pdf_url": "https://arxiv.org/pdf/2601.00384",
        "title": "Engineering Attack Vectors and Detecting Anomalies in Additive Manufacturing",
        "authors": [
            "Md Mahbub Hasan",
            "Marcus Sternhagen",
            "Krishna Chandra Roy"
        ],
        "comments": "This paper has been accepted to EAI SmartSP 2025. This is the preprint version",
        "subjects": "Cryptography and Security (cs.CR); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Additive manufacturing (AM) is rapidly integrating into critical sectors such as aerospace, automotive, and healthcare. However, this cyber-physical convergence introduces new attack surfaces, especially at the interface between computer-aided design (CAD) and machine execution layers. In this work, we investigate targeted cyberattacks on two widely used fused deposition modeling (FDM) systems, Creality's flagship model K1 Max, and Ender 3. Our threat model is a multi-layered Man-in-the-Middle (MitM) intrusion, where the adversary intercepts and manipulates G-code files during upload from the user interface to the printer firmware. The MitM intrusion chain enables several stealthy sabotage scenarios. These attacks remain undetectable by conventional slicer software or runtime interfaces, resulting in structurally defective yet externally plausible printed parts. To counter these stealthy threats, we propose an unsupervised Intrusion Detection System (IDS) that analyzes structured machine logs generated during live printing. Our defense mechanism uses a frozen Transformer-based encoder (a BERT variant) to extract semantic representations of system behavior, followed by a contrastively trained projection head that learns anomaly-sensitive embeddings. Later, a clustering-based approach and a self-attention autoencoder are used for classification. Experimental results demonstrate that our approach effectively distinguishes between benign and compromised executions.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00389",
        "abs_url": "https://arxiv.org/abs/2601.00389",
        "pdf_url": "https://arxiv.org/pdf/2601.00389",
        "title": "NOS-Gate: Queue-Aware Streaming IDS for Consumer Gateways under Timing-Controlled Evasion",
        "authors": [
            "Muhammad Bilal",
            "Omer Tariq",
            "Hasan Ahmed"
        ],
        "comments": "9 pages, 3 figures, 4 tables",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG); Networking and Internet Architecture (cs.NI)",
        "abstract": "Timing and burst patterns can leak through encryption, and an adaptive adversary can exploit them. This undermines metadata-only detection in a stand-alone consumer gateway. Therefore, consumer gateways need streaming intrusion detection on encrypted traffic using metadata only, under tight CPU and latency budgets. We present a streaming IDS for stand-alone gateways that instantiates a lightweight two-state unit derived from Network-Optimised Spiking (NOS) dynamics per flow, named NOS-Gate. NOS-Gate scores fixed-length windows of metadata features and, under a $K$-of-$M$ persistence rule, triggers a reversible mitigation that temporarily reduces the flow's weight under weighted fair queueing (WFQ). We evaluate NOS-Gate under timing-controlled evasion using an executable 'worlds' benchmark that specifies benign device processes, auditable attacker budgets, contention structure, and packet-level WFQ replay to quantify queue impact. All methods are calibrated label-free via burn-in quantile thresholding. Across multiple reproducible worlds and malicious episodes, at an achieved $0.1%$ false-positive operating point, NOS-Gate attains 0.952 incident recall versus 0.857 for the best baseline in these runs. Under gating, it reduces p99.9 queueing delay and p99.9 collateral delay with a mean scoring cost of ~ 2.09 {\\mu}s per flow-window on CPU.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00397",
        "abs_url": "https://arxiv.org/abs/2601.00397",
        "pdf_url": "https://arxiv.org/pdf/2601.00397",
        "title": "Revati: Transparent GPU-Free Time-Warp Emulation for LLM Serving",
        "authors": [
            "Amey Agrawal",
            "Mayank Yadav",
            "Sukrit Kumar",
            "Anirudha Agrawal",
            "Garv Ghai",
            "Souradeep Bera",
            "Elton Pinto",
            "Sirish Gambhira",
            "Mohammad Adain",
            "Kasra Sohrab",
            "Chus Antonanzas",
            "Alexey Tumanov"
        ],
        "comments": "",
        "subjects": "Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "Deploying LLMs efficiently requires testing hundreds of serving configurations, but evaluating each one on a GPU cluster takes hours and costs thousands of dollars. Discrete-event simulators are faster and cheaper, but they require re-implementing the serving system's control logic -- a burden that compounds as frameworks evolve. We present Revati, a time-warp emulator that enables performance modeling by directly executing real serving system code at simulation-like speed. The system intercepts CUDA API calls to virtualize device management, allowing serving frameworks to run without physical GPUs. Instead of executing GPU kernels, it performs time jumps -- fast-forwarding virtual time by predicted kernel durations. We propose a coordination protocol that synchronizes these jumps across distributed processes while preserving causality. On vLLM and SGLang, Revati achieves less than 5% prediction error across multiple models and parallelism configurations, while running 5-17x faster than real GPU execution.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00418",
        "abs_url": "https://arxiv.org/abs/2601.00418",
        "pdf_url": "https://arxiv.org/pdf/2601.00418",
        "title": "Secure, Verifiable, and Scalable Multi-Client Data Sharing via Consensus-Based Privacy-Preserving Data Distribution",
        "authors": [
            "Prajwal Panth",
            "Sahaj Raj Malla"
        ],
        "comments": "Preprint. Under review",
        "subjects": "Cryptography and Security (cs.CR); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG)",
        "abstract": "We propose the Consensus-Based Privacy-Preserving Data Distribution (CPPDD) framework, a lightweight and post-setup autonomous protocol for secure multi-client data aggregation. The framework enforces unanimous-release confidentiality through a dual-layer protection mechanism that combines per-client affine masking with priority-driven sequential consensus locking. Decentralized integrity is verified via step (sigma_S) and data (sigma_D) checksums, facilitating autonomous malicious deviation detection and atomic abort without requiring persistent coordination. The design supports scalar, vector, and matrix payloads with O(N*D) computation and communication complexity, optional edge-server offloading, and resistance to collusion under N-1 corruptions. Formal analysis proves correctness, Consensus-Dependent Integrity and Fairness (CDIF) with overwhelming-probability abort on deviation, and IND-CPA security assuming a pseudorandom function family. Empirical evaluations on MNIST-derived vectors demonstrate linear scalability up to N = 500 with sub-millisecond per-client computation times. The framework achieves 100% malicious deviation detection, exact data recovery, and three-to-four orders of magnitude lower FLOPs compared to MPC and HE baselines. CPPDD enables atomic collaboration in secure voting, consortium federated learning, blockchain escrows, and geo-information capacity building, addressing critical gaps in scalability, trust minimization, and verifiable multi-party computation for regulated and resource-constrained environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00488",
        "abs_url": "https://arxiv.org/abs/2601.00488",
        "pdf_url": "https://arxiv.org/pdf/2601.00488",
        "title": "Noise-Aware Named Entity Recognition for Historical VET Documents",
        "authors": [
            "Alexander M. Esser",
            "Jens Dörpinghaus"
        ],
        "comments": "This is an extended, non-peer-reviewed version of the paper presented at VISAPP 2026",
        "subjects": "Computation and Language (cs.CL); Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "This paper addresses Named Entity Recognition (NER) in the domain of Vocational Education and Training (VET), focusing on historical, digitized documents that suffer from OCR-induced noise. We propose a robust NER approach leveraging Noise-Aware Training (NAT) with synthetically injected OCR errors, transfer learning, and multi-stage fine-tuning. Three complementary strategies, training on noisy, clean, and artificial data, are systematically compared. Our method is one of the first to recognize multiple entity types in VET documents. It is applied to German documents but transferable to arbitrary languages. Experimental results demonstrate that domain-specific and noise-aware fine-tuning substantially increases robustness and accuracy under noisy conditions. We provide publicly available code for reproducible noise-aware NER in domain-specific contexts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00503",
        "abs_url": "https://arxiv.org/abs/2601.00503",
        "pdf_url": "https://arxiv.org/pdf/2601.00503",
        "title": "Interpretable Machine Learning for Quantum-Informed Property Predictions in Artificial Sensing Materials",
        "authors": [
            "Li Chen",
            "Leonardo Medrano Sandonas",
            "Shirong Huang",
            "Alexander Croy",
            "Gianaurelio Cuniberti"
        ],
        "comments": "18 pages, 6 figures, 1 table",
        "subjects": "Chemical Physics (physics.chem-ph); Machine Learning (cs.LG)",
        "abstract": "Digital sensing faces challenges in developing sustainable methods to extend the applicability of customized e-noses to complex body odor volatilome (BOV). To address this challenge, we developed MORE-ML, a computational framework that integrates quantum-mechanical (QM) property data of e-nose molecular building blocks with machine learning (ML) methods to predict sensing-relevant properties. Within this framework, we expanded our previous dataset, MORE-Q, to MORE-QX by sampling a larger conformational space of interactions between BOV molecules and mucin-derived receptors. This dataset provides extensive electronic binding features (BFs) computed upon BOV adsorption. Analysis of MORE-QX property space revealed weak correlations between QM properties of building blocks and resulting BFs. Leveraging this observation, we defined electronic descriptors of building blocks as inputs for tree-based ML models to predict BFs. Benchmarking showed CatBoost models outperform alternatives, especially in transferability to unseen compounds. Explainable AI methods further highlighted which QM properties most influence BF predictions. Collectively, MORE-ML combines QM insights with ML to provide mechanistic understanding and rational design principles for molecular receptors in BOV sensing. This approach establishes a foundation for advancing artificial sensing materials capable of analyzing complex odor mixtures, bridging the gap between molecular-level computations and practical e-nose applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00509",
        "abs_url": "https://arxiv.org/abs/2601.00509",
        "pdf_url": "https://arxiv.org/pdf/2601.00509",
        "title": "Improving LLM-Assisted Secure Code Generation through Retrieval-Augmented-Generation and Multi-Tool Feedback",
        "authors": [
            "Vidyut Sriram",
            "Sawan Pandita",
            "Achintya Lakshmanan",
            "Aneesh Shamraj",
            "Suman Saha"
        ],
        "comments": "",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Large Language Models (LLMs) can generate code but often introduce security vulnerabilities, logical inconsistencies, and compilation errors. Prior work demonstrates that LLMs benefit substantially from structured feedback, static analysis, retrieval augmentation, and execution-based refinement. We propose a retrieval-augmented, multi-tool repair workflow in which a single code-generating LLM iteratively refines its outputs using compiler diagnostics, CodeQL security scanning, and KLEE symbolic execution. A lightweight embedding model is used for semantic retrieval of previously successful repairs, providing security-focused examples that guide generation. Evaluated on a combined dataset of 3,242 programs generated by DeepSeek-Coder-1.3B and CodeLlama-7B, the system demonstrates significant improvements in robustness. For DeepSeek, security vulnerabilities were reduced by 96%. For the larger CodeLlama model, the critical security defect rate was decreased from 58.55% to 22.19%, highlighting the efficacy of tool-assisted self-repair even on \"stubborn\" models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00517",
        "abs_url": "https://arxiv.org/abs/2601.00517",
        "pdf_url": "https://arxiv.org/pdf/2601.00517",
        "title": "Generative Conditional Missing Imputation Networks",
        "authors": [
            "George Sun",
            "Yi-Hui Zhou"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "In this study, we introduce a sophisticated generative conditional strategy designed to impute missing values within datasets, an area of considerable importance in statistical analysis. Specifically, we initially elucidate the theoretical underpinnings of the Generative Conditional Missing Imputation Networks (GCMI), demonstrating its robust properties in the context of the Missing Completely at Random (MCAR) and the Missing at Random (MAR) mechanisms. Subsequently, we enhance the robustness and accuracy of GCMI by integrating a multiple imputation framework using a chained equations approach. This innovation serves to bolster model stability and improve imputation performance significantly. Finally, through a series of meticulous simulations and empirical assessments utilizing benchmark datasets, we establish the superior efficacy of our proposed methods when juxtaposed with other leading imputation techniques currently available. This comprehensive evaluation not only underscores the practicality of GCMI but also affirms its potential as a leading-edge tool in the field of statistical data analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 77,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00581",
        "abs_url": "https://arxiv.org/abs/2601.00581",
        "pdf_url": "https://arxiv.org/pdf/2601.00581",
        "title": "AceFF: A State-of-the-Art Machine Learning Potential for Small Molecules",
        "authors": [
            "Stephen E. Farr",
            "Stefan Doerr",
            "Antonio Mirarchi",
            "Francesc Sabanes Zariquiey",
            "Gianni De Fabritiis"
        ],
        "comments": "",
        "subjects": "Chemical Physics (physics.chem-ph); Machine Learning (cs.LG)",
        "abstract": "We introduce AceFF, a pre-trained machine learning interatomic potential (MLIP) optimized for small molecule drug discovery. While MLIPs have emerged as efficient alternatives to Density Functional Theory (DFT), generalizability across diverse chemical spaces remains difficult. AceFF addresses this via a refined TensorNet2 architecture trained on a comprehensive dataset of drug-like compounds. This approach yields a force field that balances high-throughput inference speed with DFT-level accuracy. AceFF fully supports the essential medicinal chemistry elements (H, B, C, N, O, F, Si, P, S, Cl, Br, I) and is explicitly trained to handle charged states. Validation against rigorous benchmarks, including complex torsional energy scans, molecular dynamics trajectories, batched minimizations, and forces and anergy accuracy demonstrates that AceFF establishes a new state-of-the-art for organic molecules. The AceFF-2 model weights and inference code are available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 78,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00668",
        "abs_url": "https://arxiv.org/abs/2601.00668",
        "pdf_url": "https://arxiv.org/pdf/2601.00668",
        "title": "Three factor delay learning rules for spiking neural networks",
        "authors": [
            "Luke Vassallo",
            "Nima Taherinejad"
        ],
        "comments": "7 pages, 5 figures",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Machine Learning (cs.LG)",
        "abstract": "Spiking Neural Networks (SNNs) are dynamical systems that operate on spatiotemporal data, yet their learnable parameters are often limited to synaptic weights, contributing little to temporal pattern recognition. Learnable parameters that delay spike times can improve classification performance in temporal tasks, but existing methods rely on large networks and offline learning, making them unsuitable for real-time operation in resource-constrained environments. In this paper, we introduce synaptic and axonal delays to leaky integrate and fire (LIF)-based feedforward and recurrent SNNs, and propose three-factor learning rules to simultaneously learn delay parameters online. We employ a smooth Gaussian surrogate to approximate spike derivatives exclusively for the eligibility trace calculation, and together with a top-down error signal determine parameter updates. Our experiments show that incorporating delays improves accuracy by up to 20% over a weights-only baseline, and for networks with similar parameter counts, jointly learning weights and delays yields up to 14% higher accuracy. On the SHD speech recognition dataset, our method achieves similar accuracy to offline backpropagation-based approaches. Compared to state-of-the-art methods, it reduces model size by 6.6x and inference latency by 67%, with only a 2.4% drop in classification accuracy. Our findings benefit the design of power and area-constrained neuromorphic processors by enabling on-device learning and lowering memory requirements.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 79,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00672",
        "abs_url": "https://arxiv.org/abs/2601.00672",
        "pdf_url": "https://arxiv.org/pdf/2601.00672",
        "title": "Sparse FEONet: A Low-Cost, Memory-Efficient Operator Network via Finite-Element Local Sparsity for Parametric PDEs",
        "authors": [
            "Seungchan Ko",
            "Jiyeon Kim",
            "Dongwook Shin"
        ],
        "comments": "",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "In this paper, we study the finite element operator network (FEONet), an operator-learning method for parametric problems, originally introduced in J. Y. Lee, S. Ko, and Y. Hong, Finite Element Operator Network for Solving Elliptic-Type Parametric PDEs, SIAM J. Sci. Comput., 47(2), C501-C528, 2025. FEONet realizes the parameter-to-solution map on a finite element space and admits a training procedure that does not require training data, while exhibiting high accuracy and robustness across a broad class of problems. However, its computational cost increases and accuracy may deteriorate as the number of elements grows, posing notable challenges for large-scale problems. In this paper, we propose a new sparse network architecture motivated by the structure of the finite elements to address this issue. Throughout extensive numerical experiments, we show that the proposed sparse network achieves substantial improvements in computational cost and efficiency while maintaining comparable accuracy. We also establish theoretical results demonstrating that the sparse architecture can approximate the target operator effectively and provide a stability analysis ensuring reliable training and prediction.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 80,
        "date": "2026-01-05",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-05?abs=True",
        "arxiv_id": "2601.00689",
        "abs_url": "https://arxiv.org/abs/2601.00689",
        "pdf_url": "https://arxiv.org/pdf/2601.00689",
        "title": "Cost Optimization in Production Line Using Genetic Algorithm",
        "authors": [
            "Alireza Rezaee"
        ],
        "comments": "",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Machine Learning (cs.LG)",
        "abstract": "This paper presents a genetic algorithm (GA) approach to cost-optimal task scheduling in a production line. The system consists of a set of serial processing tasks, each with a given duration, unit execution cost, and precedence constraints, which must be assigned to an unlimited number of stations subject to a per-station duration bound. The objective is to minimize the total production cost, modeled as a station-wise function of task costs and the duration bound, while strictly satisfying all prerequisite and capacity constraints. Two chromosome encoding strategies are investigated: a station-based representation implemented using the JGAP library with SuperGene validity checks, and a task-based representation in which genes encode station assignments directly. For each encoding, standard GA operators (crossover, mutation, selection, and replacement) are adapted to preserve feasibility and drive the population toward lower-cost schedules. Experimental results on three classes of precedence structures-tightly coupled, loosely coupled, and uncoupled-demonstrate that the task-based encoding yields smoother convergence and more reliable cost minimization than the station-based encoding, particularly when the number of valid schedules is large. The study highlights the advantages of GA over gradient-based and analytical methods for combinatorial scheduling problems, especially in the presence of complex constraints and non-differentiable cost landscapes.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]