[
    {
        "order": 1,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02433",
        "abs_url": "https://arxiv.org/abs/2601.02433",
        "pdf_url": "https://arxiv.org/pdf/2601.02433",
        "title": "Physical Transformer",
        "authors": [
            "Tao Xu",
            "Zhixin Hu",
            "Li Luo",
            "Momiao Xiong"
        ],
        "comments": "38 pages, 2 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Digital AI systems spanning large language models, vision models, and generative architectures that operate primarily in symbolic, linguistic, or pixel domains. They have achieved striking progress, but almost all of this progress lives in virtual spaces. These systems transform embeddings and tokens, yet do not themselves touch the world and rarely admit a physical interpretation. In this work we propose a physical transformer that couples modern transformer style computation with geometric representation and physical dynamics. At the micro level, attention heads, and feed-forward blocks are modeled as interacting spins governed by effective Hamiltonians plus non-Hamiltonian bath terms. At the meso level, their aggregated state evolves on a learned Neural Differential Manifold (NDM) under Hamiltonian flows and Hamilton, Jacobi, Bellman (HJB) optimal control, discretized by symplectic layers that approximately preserve geometric and energetic invariants. At the macro level, the model maintains a generative semantic workspace and a two-dimensional information-phase portrait that tracks uncertainty and information gain over a reasoning trajectory. Within this hierarchy, reasoning tasks are formulated as controlled information flows on the manifold, with solutions corresponding to low cost trajectories that satisfy geometric, energetic, and workspace-consistency constraints. On simple toy problems involving numerical integration and dynamical systems, the physical transformer outperforms naive baselines in stability and long-horizon accuracy, highlighting the benefits of respecting underlying geometric and Hamiltonian structure. More broadly, the framework suggests a path toward physical AI that unify digital reasoning with physically grounded manifolds, opening a route to more interpretable and potentially unified models of reasoning, control, and interaction with the real world.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 2,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02451",
        "abs_url": "https://arxiv.org/abs/2601.02451",
        "pdf_url": "https://arxiv.org/pdf/2601.02451",
        "title": "mHC-GNN: Manifold-Constrained Hyper-Connections for Graph Neural Networks",
        "authors": [
            "Subhankar Mishra"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "Graph Neural Networks (GNNs) suffer from over-smoothing in deep architectures and expressiveness bounded by the 1-Weisfeiler-Leman (1-WL) test. We adapt Manifold-Constrained Hyper-Connections (\\mhc)~\\citep{xie2025mhc}, recently proposed for Transformers, to graph neural networks. Our method, mHC-GNN, expands node representations across $n$ parallel streams and constrains stream-mixing matrices to the Birkhoff polytope via Sinkhorn-Knopp normalization. We prove that mHC-GNN exhibits exponentially slower over-smoothing (rate $(1-\\gamma)^{L/n}$ vs.\\ $(1-\\gamma)^L$) and can distinguish graphs beyond 1-WL. Experiments on 10 datasets with 4 GNN architectures show consistent improvements. Depth experiments from 2 to 128 layers reveal that standard GNNs collapse to near-random performance beyond 16 layers, while mHC-GNN maintains over 74\\% accuracy even at 128 layers, with improvements exceeding 50 percentage points at extreme depths. Ablations confirm that the manifold constraint is essential: removing it causes up to 82\\% performance degradation. Code is available at \\href{this https URL}{this https URL}",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 3,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02499",
        "abs_url": "https://arxiv.org/abs/2601.02499",
        "pdf_url": "https://arxiv.org/pdf/2601.02499",
        "title": "Polynomial Convergence of Riemannian Diffusion Models",
        "authors": [
            "Xingyu Xu",
            "Ziyi Zhang",
            "Yorie Nakahira",
            "Guannan Qu",
            "Yuejie Chi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Diffusion models have demonstrated remarkable empirical success in the recent years and are considered one of the state-of-the-art generative models in modern AI. These models consist of a forward process, which gradually diffuses the data distribution to a noise distribution spanning the whole space, and a backward process, which inverts this transformation to recover the data distribution from noise. Most of the existing literature assumes that the underlying space is Euclidean. However, in many practical applications, the data are constrained to lie on a submanifold of Euclidean space. Addressing this setting, De Bortoli et al. (2022) introduced Riemannian diffusion models and proved that using an exponentially small step size yields a small sampling error in the Wasserstein distance, provided the data distribution is smooth and strictly positive, and the score estimate is $L_\\infty$-accurate. In this paper, we greatly strengthen this theory by establishing that, under $L_2$-accurate score estimate, a {\\em polynomially small stepsize} suffices to guarantee small sampling error in the total variation distance, without requiring smoothness or positivity of the data distribution. Our analysis only requires mild and standard curvature assumptions on the underlying manifold. The main ingredients in our analysis are Li-Yau estimate for the log-gradient of heat kernel, and Minakshisundaram-Pleijel parametrix expansion of the perturbed heat equation. Our approach opens the door to a sharper analysis of diffusion models on non-Euclidean spaces.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 4,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02509",
        "abs_url": "https://arxiv.org/abs/2601.02509",
        "pdf_url": "https://arxiv.org/pdf/2601.02509",
        "title": "hdlib 2.0: Extending Machine Learning Capabilities of Vector-Symbolic Architectures",
        "authors": [
            "Fabio Cumbo",
            "Kabir Dhillon",
            "Daniel Blankenberg"
        ],
        "comments": "7 pages, 1 figure",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Following the initial publication of hdlib, a Python library for designing Vector-Symbolic Architectures (VSA), we introduce a major extension that significantly enhances its machine learning capabilities. VSA, also known as Hyperdimensional Computing, is a computing paradigm that represents and processes information using high-dimensional vectors. While the first version of hdlib established a robust foundation for creating and manipulating these vectors, this update addresses the growing need for more advanced, data-driven modeling within the VSA framework. Here, we present four extensions: significant enhancements to the existing supervised classification model also enabling feature selection, and a new regression model for predicting continuous variables, a clustering model for unsupervised learning, and a graph-based learning model. Furthermore, we propose the first implementation ever of Quantum Hyperdimensional Computing with quantum-powered arithmetic operations and a new Quantum Machine Learning model for supervised learning. hdlib remains open-source and available on GitHub at this https URL under the MIT license, and distributed through the Python Package Index (pip install hdlib) and Conda (conda install -c conda-forge hdlib). Documentation and examples of these new features are available on the official Wiki at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 5,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02511",
        "abs_url": "https://arxiv.org/abs/2601.02511",
        "pdf_url": "https://arxiv.org/pdf/2601.02511",
        "title": "LLM-Enhanced Reinforcement Learning for Time Series Anomaly Detection",
        "authors": [
            "Bahareh Golchin",
            "Banafsheh Rekabdar",
            "Danielle Justo"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Detecting anomalies in time series data is crucial for finance, healthcare, sensor networks, and industrial monitoring applications. However, time series anomaly detection often suffers from sparse labels, complex temporal patterns, and costly expert annotation. We propose a unified framework that integrates Large Language Model (LLM)-based potential functions for reward shaping with Reinforcement Learning (RL), Variational Autoencoder (VAE)-enhanced dynamic reward scaling, and active learning with label propagation. An LSTM-based RL agent leverages LLM-derived semantic rewards to guide exploration, while VAE reconstruction errors add unsupervised anomaly signals. Active learning selects the most uncertain samples, and label propagation efficiently expands labeled data. Evaluations on Yahoo-A1 and SMD benchmarks demonstrate that our method achieves state-of-the-art detection accuracy under limited labeling budgets and operates effectively in data-constrained settings. This study highlights the promise of combining LLMs with RL and advanced unsupervised techniques for robust, scalable anomaly detection in real-world applications.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 6,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02530",
        "abs_url": "https://arxiv.org/abs/2601.02530",
        "pdf_url": "https://arxiv.org/pdf/2601.02530",
        "title": "Multi-scale Graph Autoregressive Modeling: Molecular Property Prediction via Next Token Prediction",
        "authors": [
            "Zhuoyang Jiang",
            "Yaosen Min",
            "Peiran Jin",
            "Lei Chen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Quantitative Methods (q-bio.QM)",
        "abstract": "We present Connection-Aware Motif Sequencing (CamS), a graph-to-sequence representation that enables decoder-only Transformers to learn molecular graphs via standard next-token prediction (NTP). For molecular property prediction, SMILES-based NTP scales well but lacks explicit topology, whereas graph-native masked modeling captures connectivity but risks disrupting the pivotal chemical details (e.g., activity cliffs). CamS bridges this gap by serializing molecular graphs into structure-rich causal sequences. CamS first mines data-driven connection-aware motifs. It then serializes motifs via scaffold-rooted breadth-first search (BFS) to establish a stable core-to-periphery order. Crucially, CamS enables hierarchical modeling by concatenating sequences from fine to coarse motif scales, allowing the model to condition global scaffolds on dense, uncorrupted local structural evidence. We instantiate CamS-LLaMA by pre-training a vanilla LLaMA backbone on CamS sequences. It achieves state-of-the-art performance on MoleculeNet and the activity-cliff benchmark MoleculeACE, outperforming both SMILES-based language models and strong graph baselines. Interpretability analysis confirms that our multi-scale causal serialization effectively drives attention toward cliff-determining differences.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 7,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02562",
        "abs_url": "https://arxiv.org/abs/2601.02562",
        "pdf_url": "https://arxiv.org/pdf/2601.02562",
        "title": "CutisAI: Deep Learning Framework for Automated Dermatology and Cancer Screening",
        "authors": [
            "Rohit Kaushik",
            "Eva Kaushik"
        ],
        "comments": "10 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG); Image and Video Processing (eess.IV)",
        "abstract": "The rapid growth of dermatological imaging and mobile diagnostic tools calls for systems that not only demonstrate empirical performance but also provide strong theoretical guarantees. Deep learning models have shown high predictive accuracy; however, they are often criticized for lacking well, calibrated uncertainty estimates without which these models are hardly deployable in a clinical setting. To this end, we present the Conformal Bayesian Dermatological Classifier (CBDC), a well, founded framework that combines Statistical Learning Theory, Topological Data Analysis (TDA), and Bayesian Conformal Inference. CBDC offers distribution, dependent generalization bounds that reflect dermatological variability, proves a topological stability theorem that guarantees the invariance of convolutional neural network embeddings under photometric and morphological perturbations and provides finite conformal coverage guarantees for trustworthy uncertainty quantification. Through exhaustive experiments on the HAM10000, PH2, and ISIC 2020 datasets, we show that CBDC not only attains classification accuracy but also generates calibrated predictions that are interpretable from a clinical perspective. This research constitutes a theoretical and practical leap for deep dermatological diagnostics, thereby opening the machine learning theory clinical applicability interface.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 8,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02581",
        "abs_url": "https://arxiv.org/abs/2601.02581",
        "pdf_url": "https://arxiv.org/pdf/2601.02581",
        "title": "Threat Detection in Social Media Networks Using Machine Learning Based Network Analysis",
        "authors": [
            "Aditi Sanjay Agrawal"
        ],
        "comments": "11 Pages, 6 figures",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "The accelerated development of social media websites has posed intricate security issues in cyberspace, where these sites have increasingly become victims of criminal activities including attempts to intrude into them, abnormal traffic patterns, and organized attacks. The conventional rule-based security systems are not always scalable and dynamic to meet such a threat. This paper introduces a threat detection framework based on machine learning that can be used to classify malicious behavior in the social media network environment based on the nature of network traffic. Exploiting a rich network traffic dataset, the massive preprocessing and exploratory data analysis is conducted to overcome the problem of data imbalance, feature inconsistency, and noise. A model of artificial neural network (ANN) is then created to acquire intricate, non-linear tendencies of malicious actions. The proposed model is tested on conventional performance metrics, such as accuracy, accuracy, recall, F1-score, and ROC-AUC, and shows good detection and high levels of strength. The findings suggest that neural network-based solutions have the potential to be used effectively to identify the latent threat dynamics within the context of a large-scale social media network and that they can be employed to complement the existing intrusion detection system and better to conduct proactive cybersecurity operations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 9,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02636",
        "abs_url": "https://arxiv.org/abs/2601.02636",
        "pdf_url": "https://arxiv.org/pdf/2601.02636",
        "title": "Credit Assignment via Neural Manifold Noise Correlation",
        "authors": [
            "Byungwoo Kang",
            "Maceo Richards",
            "Bernardo Sabatini"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Neurons and Cognition (q-bio.NC)",
        "abstract": "Credit assignment--how changes in individual neurons and synapses affect a network's output--is central to learning in brains and machines. Noise correlation, which estimates gradients by correlating perturbations of activity with changes in output, provides a biologically plausible solution to credit assignment but scales poorly as accurately estimating the Jacobian requires that the number of perturbations scale with network size. Moreover, isotropic noise conflicts with neurobiological observations that neural activity lies on a low-dimensional manifold. To address these drawbacks, we propose neural manifold noise correlation (NMNC), which performs credit assignment using perturbations restricted to the neural manifold. We show theoretically and empirically that the Jacobian row space aligns with the neural manifold in trained networks, and that manifold dimensionality scales slowly with network size. NMNC substantially improves performance and sample efficiency over vanilla noise correlation in convolutional networks trained on CIFAR-10, ImageNet-scale models, and recurrent networks. NMNC also yields representations more similar to the primate visual system than vanilla noise correlation. These findings offer a mechanistic hypothesis for how biological circuits could support credit assignment, and suggest that biologically inspired constraints may enable, rather than limit, effective learning at scale.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 10,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02648",
        "abs_url": "https://arxiv.org/abs/2601.02648",
        "pdf_url": "https://arxiv.org/pdf/2601.02648",
        "title": "Prioritized Replay for RL Post-training",
        "authors": [
            "Mehdi Fatemi"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computation and Language (cs.CL)",
        "abstract": "We introduce a problem-level prioritization framework for RL post-training of large language models. Building on insights from prioritized replay in deep RL, as well as prior observations that rollouts with intermediate success rates tend to produce stronger learning signals under methods such as GRPO, our approach selects problems according to a simple, model-driven priority score derived from empirical success statistics. In contrast to conventional curriculum strategies that emphasize easier tasks early in training, the resulting schedule naturally focuses training on problems that are neither consistently solved nor consistently failed, while deprioritizing those that contribute little gradient information. The method yields a continuously adapting and automatic prioritization process that requires no predefined difficulty tiers, auxiliary predictors, or external labels. We further introduce lightweight mechanisms for practical deployment, including heap-based prioritized sampling and periodic retesting of solved and unsolved problems to mitigate starvation and forgetting. Overall, the approach offers a principled and scalable alternative to manually designed curricula while aligning data selection directly with the dynamics of GRPO-based post-training.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 11,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02662",
        "abs_url": "https://arxiv.org/abs/2601.02662",
        "pdf_url": "https://arxiv.org/pdf/2601.02662",
        "title": "When Prompting Meets Spiking: Graph Sparse Prompting via Spiking Graph Prompt Learning",
        "authors": [
            "Bo Jiang",
            "Weijun Zhao",
            "Beibei Wang",
            "Jin Tang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Graph Prompt Feature (GPF) learning has been widely used in adapting pre-trained GNN model on the downstream task. GPFs first introduce some prompt atoms and then learns the optimal prompt vector for each graph node using the linear combination of prompt atoms. However, existing GPFs generally conduct prompting over node's all feature dimensions which is obviously redundant and also be sensitive to node feature noise. To overcome this issue, for the first time, this paper proposes learning sparse graph prompts by leveraging the spiking neuron mechanism, termed Spiking Graph Prompt Feature (SpikingGPF). Our approach is motivated by the observation that spiking neuron can perform inexpensive information processing and produce sparse outputs which naturally fits the task of our graph sparse prompting. Specifically, SpikingGPF has two main aspects. First, it learns a sparse prompt vector for each node by exploiting a spiking neuron architecture, enabling prompting on selective node features. This yields a more compact and lightweight prompting design while also improving robustness against node noise. Second, SpikingGPF introduces a novel prompt representation learning model based on sparse representation theory, i.e., it represents each node prompt as a sparse combination of prompt atoms. This encourages a more compact representation and also facilitates efficient computation. Extensive experiments on several benchmarks demonstrate the effectiveness and robustness of SpikingGPF.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 12,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02668",
        "abs_url": "https://arxiv.org/abs/2601.02668",
        "pdf_url": "https://arxiv.org/pdf/2601.02668",
        "title": "MAFS: Multi-head Attention Feature Selection for High-Dimensional Data via Deep Fusion of Filter Methods",
        "authors": [
            "Xiaoyan Sun",
            "Qingyu Meng",
            "Yalu Wen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Methodology (stat.ME)",
        "abstract": "Feature selection is essential for high-dimensional biomedical data, enabling stronger predictive performance, reduced computational cost, and improved interpretability in precision medicine applications. Existing approaches face notable challenges. Filter methods are highly scalable but cannot capture complex relationships or eliminate redundancy. Deep learning-based approaches can model nonlinear patterns but often lack stability, interpretability, and efficiency at scale. Single-head attention improves interpretability but is limited in capturing multi-level dependencies and remains sensitive to initialization, reducing reproducibility. Most existing methods rarely combine statistical interpretability with the representational power of deep learning, particularly in ultra-high-dimensional settings. Here, we introduce MAFS (Multi-head Attention-based Feature Selection), a hybrid framework that integrates statistical priors with deep learning capabilities. MAFS begins with filter-based priors for stable initialization and guide learning. It then uses multi-head attention to examine features from multiple perspectives in parallel, capturing complex nonlinear relationships and interactions. Finally, a reordering module consolidates outputs across attention heads, resolving conflicts and minimizing information loss to generate robust and consistent feature rankings. This design combines statistical guidance with deep modeling capacity, yielding interpretable importance scores while maximizing retention of informative signals. Across simulated and real-world datasets, including cancer gene expression and Alzheimer's disease data, MAFS consistently achieves superior coverage and stability compared with existing filter-based and deep learning-based alternatives, offering a scalable, interpretable, and robust solution for feature selection in high-dimensional biomedical data.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 13,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02677",
        "abs_url": "https://arxiv.org/abs/2601.02677",
        "pdf_url": "https://arxiv.org/pdf/2601.02677",
        "title": "Uni-FinLLM: A Unified Multimodal Large Language Model with Modular Task Heads for Micro-Level Stock Prediction and Macro-Level Systemic Risk Assessment",
        "authors": [
            "Gongao Zhang",
            "Haijiang Zeng",
            "Lu Jiang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Risk Management (q-fin.RM); Statistical Finance (q-fin.ST)",
        "abstract": "Financial institutions and regulators require systems that integrate heterogeneous data to assess risks from stock fluctuations to systemic vulnerabilities. Existing approaches often treat these tasks in isolation, failing to capture cross-scale dependencies. We propose Uni-FinLLM, a unified multimodal large language model that uses a shared Transformer backbone and modular task heads to jointly process financial text, numerical time series, fundamentals, and visual data. Through cross-modal attention and multi-task optimization, it learns a coherent representation for micro-, meso-, and macro-level predictions. Evaluated on stock forecasting, credit-risk assessment, and systemic-risk detection, Uni-FinLLM significantly outperforms baselines. It raises stock directional accuracy to 67.4% (from 61.7%), credit-risk accuracy to 84.1% (from 79.6%), and macro early-warning accuracy to 82.3%. Results validate that a unified multimodal LLM can jointly model asset behavior and systemic vulnerabilities, offering a scalable decision-support engine for finance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 14,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02706",
        "abs_url": "https://arxiv.org/abs/2601.02706",
        "pdf_url": "https://arxiv.org/pdf/2601.02706",
        "title": "Scaling Laws of Machine Learning for Optimal Power Flow",
        "authors": [
            "Xinyi Liu",
            "Xuan He",
            "Yize Chen"
        ],
        "comments": "5 pages",
        "subjects": "Machine Learning (cs.LG); Systems and Control (eess.SY)",
        "abstract": "Optimal power flow (OPF) is one of the fundamental tasks for power system operations. While machine learning (ML) approaches such as deep neural networks (DNNs) have been widely studied to enhance OPF solution speed and performance, their practical deployment faces two critical scaling questions: What is the minimum training data volume required for reliable results? How should ML models' complexity balance accuracy with real-time computational limits? Existing studies evaluate discrete scenarios without quantifying these scaling relationships, leading to trial-and-error-based ML development in real-world applications. This work presents the first systematic scaling study for ML-based OPF across two dimensions: data scale (0.1K-40K training samples) and compute scale (multiple NN architectures with varying FLOPs). Our results reveal consistent power-law relationships on both DNNs and physics-informed NNs (PINNs) between each resource dimension and three core performance metrics: prediction error (MAE), constraint violations and speed. We find that for ACOPF, the accuracy metric scales with dataset size and training compute. These scaling laws enable predictable and principled ML pipeline design for OPF. We further identify the divergence between prediction accuracy and constraint feasibility and characterize the compute-optimal frontier. This work provides quantitative guidance for ML-OPF design and deployments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 15,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02728",
        "abs_url": "https://arxiv.org/abs/2601.02728",
        "pdf_url": "https://arxiv.org/pdf/2601.02728",
        "title": "CRoPE: Efficient Parametrization of Rotary Positional Embedding",
        "authors": [
            "Beicheng Lou",
            "Zifei Xu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Rotary positional embedding has become the state-of-the-art approach to encode position information in transformer-based models. While it is often succinctly expressed in complex linear algebra, we note that the actual implementation of $Q/K/V$-projections is not equivalent to a complex linear transformation. We argue that complex linear transformation is a more natural parametrization and saves near 50\\% parameters within the attention block. We show empirically that removing such redundancy has negligible impact on the model performance both in sample and out of sample. Our modification achieves more efficient parameter usage, as well as a cleaner interpretation of the representation space.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 16,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02735",
        "abs_url": "https://arxiv.org/abs/2601.02735",
        "pdf_url": "https://arxiv.org/pdf/2601.02735",
        "title": "Scalable Tree Ensemble Proximities in Python",
        "authors": [
            "Adrien Aumon",
            "Guy Wolf",
            "Kevin R. Moon",
            "Jake S. Rhodes"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Data Structures and Algorithms (cs.DS); Performance (cs.PF)",
        "abstract": "Tree ensemble methods such as Random Forests naturally induce supervised similarity measures through their decision tree structure, but existing implementations of proximities derived from tree ensembles typically suffer from quadratic time or memory complexity, limiting their scalability. In this work, we introduce a general framework for efficient proximity computation by defining a family of Separable Weighted Leaf-Collision Proximities. We show that any proximity measure in this family admits an exact sparse matrix factorization, restricting computation to leaf-level collisions and avoiding explicit pairwise comparisons. This formulation enables low-memory, scalable proximity computation using sparse linear algebra in Python. Empirical benchmarks demonstrate substantial runtime and memory improvements over traditional approaches, allowing tree ensemble proximities to scale efficiently to datasets with hundreds of thousands of samples on standard CPU hardware.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 17,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02790",
        "abs_url": "https://arxiv.org/abs/2601.02790",
        "pdf_url": "https://arxiv.org/pdf/2601.02790",
        "title": "RadioDiff-Flux: Efficient Radio Map Construction via Generative Denoise Diffusion Model Trajectory Midpoint Reuse",
        "authors": [
            "Xiucheng Wang",
            "Peilin Zheng",
            "Honggang Jia",
            "Nan Cheng",
            "Ruijin Sun",
            "Conghao Zhou",
            "Xuemin Shen"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Signal Processing (eess.SP)",
        "abstract": "Accurate radio map (RM) construction is essential to enabling environment-aware and adaptive wireless communication. However, in future 6G scenarios characterized by high-speed network entities and fast-changing environments, it is very challenging to meet real-time requirements. Although generative diffusion models (DMs) can achieve state-of-the-art accuracy with second-level delay, their iterative nature leads to prohibitive inference latency in delay-sensitive scenarios. In this paper, by uncovering a key structural property of diffusion processes: the latent midpoints remain highly consistent across semantically similar scenes, we propose RadioDiff-Flux, a novel two-stage latent diffusion framework that decouples static environmental modeling from dynamic refinement, enabling the reuse of precomputed midpoints to bypass redundant denoising. In particular, the first stage generates a coarse latent representation using only static scene features, which can be cached and shared across similar scenarios. The second stage adapts this representation to dynamic conditions and transmitter locations using a pre-trained model, thereby avoiding repeated early-stage computation. The proposed RadioDiff-Flux significantly reduces inference time while preserving fidelity. Experiment results show that RadioDiff-Flux can achieve up to 50 acceleration with less than 0.15% accuracy loss, demonstrating its practical utility for fast, scalable RM generation in future 6G networks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 18,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02799",
        "abs_url": "https://arxiv.org/abs/2601.02799",
        "pdf_url": "https://arxiv.org/pdf/2601.02799",
        "title": "Stratified Hazard Sampling: Minimal-Variance Event Scheduling for CTMC/DTMC Discrete Diffusion and Flow Models",
        "authors": [
            "Seunghwan Jang",
            "SooJean Han"
        ],
        "comments": "Work in progress. Feedback welcome",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "CTMC/DTMC-based discrete generative models, including uniform-noise discrete diffusion (e.g., D3PM/CTDD) and discrete flow matching, enable non-autoregressive sequence generation by repeatedly replacing tokens through a time-inhomogeneous Markov process. Inference is typically implemented with step-based simulation: each token decides to jump via independent Bernoulli (or categorical) draws at every discretization step. Under uniform-noise initialization, where self-correction requires multiple edits per position, these independent decisions induce substantial variance in both the number and timing of edits, leading to characteristic failure modes such as under-editing (residual noise) or over-editing (cascading unnecessary substitutions), decreasing reproducibility. We propose Stratified Hazard Sampling (SHS), a drop-in and hyperparameter-free inference principle for any sampler that admits a stay-vs.-replace decomposition. SHS models per-token edits as events driven by cumulative hazard (CTMC) or cumulative jump mass (DTMC) and places events by stratifying this cumulative quantity: with a single random phase per position, a token jumps whenever its accumulated hazard crosses unit-spaced thresholds. This preserves the expected number of jumps while achieving the minimum possible variance among unbiased integer estimators (bounded by 1/4), without altering per-jump destination sampling and thus retaining multimodality. We also introduce a phase-allocation variant for blacklist-style lexical constraints that prioritizes early edits at high-risk positions to mitigate late-masking artifacts.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 19,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02856",
        "abs_url": "https://arxiv.org/abs/2601.02856",
        "pdf_url": "https://arxiv.org/pdf/2601.02856",
        "title": "Electricity Price Forecasting: Bridging Linear Models, Neural Networks and Online Learning",
        "authors": [
            "Btissame El Mahtout",
            "Florian Ziel"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Precise day-ahead forecasts for electricity prices are crucial to ensure efficient portfolio management, support strategic decision-making for power plant operations, enable efficient battery storage optimization, and facilitate demand response planning. However, developing an accurate prediction model is highly challenging in an uncertain and volatile market environment. For instance, although linear models generally exhibit competitive performance in predicting electricity prices with minimal computational requirements, they fail to capture relevant nonlinear relationships. Nonlinear models, on the other hand, can improve forecasting accuracy with a surge in computational costs. We propose a novel multivariate neural network approach that combines linear and nonlinear feed-forward neural structures. Unlike previous hybrid models, our approach integrates online learning and forecast combination for efficient training and accuracy improvement. It also incorporates all relevant characteristics, particularly the fundamental relationships arising from wind and solar generation, electricity demand patterns, related energy fuel and carbon markets, in addition to autoregressive dynamics and calendar effects. Compared to the current state-of-the-art benchmark models, the proposed forecasting method significantly reduces computational cost while delivering superior forecasting accuracy (12-13% RMSE and 15-18% MAE reductions). Our results are derived from a six-year forecasting study conducted on major European electricity markets.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 20,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02870",
        "abs_url": "https://arxiv.org/abs/2601.02870",
        "pdf_url": "https://arxiv.org/pdf/2601.02870",
        "title": "Quantum-Enhanced Neural Contextual Bandit Algorithms",
        "authors": [
            "Yuqi Huang",
            "Vincent Y. F Tan",
            "Sharu Theresa Jose"
        ],
        "comments": "30 pages, under review",
        "subjects": "Machine Learning (cs.LG); Information Theory (cs.IT); Quantum Physics (quant-ph)",
        "abstract": "Stochastic contextual bandits are fundamental for sequential decision-making but pose significant challenges for existing neural network-based algorithms, particularly when scaling to quantum neural networks (QNNs) due to issues such as massive over-parameterization, computational instability, and the barren plateau phenomenon. This paper introduces the Quantum Neural Tangent Kernel-Upper Confidence Bound (QNTK-UCB) algorithm, a novel algorithm that leverages the Quantum Neural Tangent Kernel (QNTK) to address these limitations. By freezing the QNN at a random initialization and utilizing its static QNTK as a kernel for ridge regression, QNTK-UCB bypasses the unstable training dynamics inherent in explicit parameterized quantum circuit training while fully exploiting the unique quantum inductive bias. For a time horizon $T$ and $K$ actions, our theoretical analysis reveals a significantly improved parameter scaling of $\\Omega((TK)^3)$ for QNTK-UCB, a substantial reduction compared to $\\Omega((TK)^8)$ required by classical NeuralUCB algorithms for similar regret guarantees. Empirical evaluations on non-linear synthetic benchmarks and quantum-native variational quantum eigensolver tasks demonstrate QNTK-UCB's superior sample efficiency in low-data regimes. This work highlights how the inherent properties of QNTK provide implicit regularization and a sharper spectral decay, paving the way for achieving ``quantum advantage'' in online learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 21,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02884",
        "abs_url": "https://arxiv.org/abs/2601.02884",
        "pdf_url": "https://arxiv.org/pdf/2601.02884",
        "title": "Domain Generalization for Time Series: Enhancing Drilling Regression Models for Stick-Slip Index Prediction",
        "authors": [
            "Hana Yahia",
            "Bruno Figliuzzi",
            "Florent Di Meglio",
            "Laurent Gerbaud",
            "Stephane Menand",
            "Mohamed Mahjoub"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "This paper provides a comprehensive comparison of domain generalization techniques applied to time series data within a drilling context, focusing on the prediction of a continuous Stick-Slip Index (SSI), a critical metric for assessing torsional downhole vibrations at the drill bit. The study aims to develop a robust regression model that can generalize across domains by training on 60 second labeled sequences of 1 Hz surface drilling data to predict the SSI. The model is tested in wells that are different from those used during training. To fine-tune the model architecture, a grid search approach is employed to optimize key hyperparameters. A comparative analysis of the Adversarial Domain Generalization (ADG), Invariant Risk Minimization (IRM) and baseline models is presented, along with an evaluation of the effectiveness of transfer learning (TL) in improving model performance. The ADG and IRM models achieve performance improvements of 10% and 8%, respectively, over the baseline model. Most importantly, severe events are detected 60% of the time, against 20% for the baseline model. Overall, the results indicate that both ADG and IRM models surpass the baseline, with the ADG model exhibiting a slight advantage over the IRM model. Additionally, applying TL to a pre-trained model further improves performance. Our findings demonstrate the potential of domain generalization approaches in drilling applications, with ADG emerging as the most effective approach.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 22,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02888",
        "abs_url": "https://arxiv.org/abs/2601.02888",
        "pdf_url": "https://arxiv.org/pdf/2601.02888",
        "title": "RPIQ: Residual-Projected Multi-Collaboration Closed-Loop and Single Instance Quantization for Visually Impaired Assistance",
        "authors": [
            "Xuanyu Wang",
            "Haisen Su",
            "Jingtao Zhang",
            "Xiangxiang Wang",
            "Yongbin Yu",
            "Manping Fan",
            "Bo Gong",
            "Siqi Chen",
            "Mingsheng Cao",
            "Liyong Ren"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Visually impaired users face significant challenges in daily information access and real-time environmental perception, and there is an urgent need for intelligent assistive systems with accurate recognition capabilities. Although large-scale models provide effective solutions for perception and reasoning, their practical deployment on assistive devices is severely constrained by excessive memory consumption and high inference costs. Moreover, existing quantization strategies often ignore inter-block error accumulation, leading to degraded model stability. To address these challenges, this study proposes a novel quantization framework -- Residual-Projected Multi-Collaboration Closed-Loop and Single Instance Quantization(RPIQ), whose quantization process adopts a multi-collaborative closed-loop compensation scheme based on Single Instance Calibration and Gauss-Seidel Iterative Quantization. Experiments on various types of large-scale models, including language models such as OPT, Qwen, and LLaMA, as well as vision-language models such as CogVLM2, demonstrate that RPIQ can compress models to 4-bit representation while significantly reducing peak memory consumption (approximately 60%-75% reduction compared to original full-precision models). The method maintains performance highly close to full-precision models across multiple language and visual tasks, and exhibits excellent recognition and reasoning capabilities in key applications such as text understanding and visual question answering in complex scenarios. While verifying the effectiveness of RPIQ for deployment in real assistive systems, this study also advances the computational efficiency and reliability of large models, enabling them to provide visually impaired users with the required information accurately and rapidly.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 23,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02896",
        "abs_url": "https://arxiv.org/abs/2601.02896",
        "pdf_url": "https://arxiv.org/pdf/2601.02896",
        "title": "Bridging Mechanistic Interpretability and Prompt Engineering with Gradient Ascent for Interpretable Persona Control",
        "authors": [
            "Harshvardhan Saini",
            "Yiming Tang",
            "Dianbo Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Controlling emergent behavioral personas (e.g., sycophancy, hallucination) in Large Language Models (LLMs) is critical for AI safety, yet remains a persistent challenge. Existing solutions face a dilemma: manual prompt engineering is intuitive but unscalable and imprecise, while automatic optimization methods are effective but operate as \"black boxes\" with no interpretable connection to model internals. We propose a novel framework that adapts gradient ascent to LLMs, enabling targeted prompt discovery. In specific, we propose two methods, RESGA and SAEGA, that both optimize randomly initialized prompts to achieve better aligned representation with an identified persona direction. We introduce fluent gradient ascent to control the fluency of discovered persona steering prompts. We demonstrate RESGA and SAEGA's effectiveness across Llama 3.1, Qwen 2.5, and Gemma 3 for steering three different personas,sycophancy, hallucination, and myopic reward. Crucially, on sycophancy, our automatically discovered prompts achieve significant improvement (49.90% compared with 79.24%). By grounding prompt discovery in mechanistically meaningful features, our method offers a new paradigm for controllable and interpretable behavior modification.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 24,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02915",
        "abs_url": "https://arxiv.org/abs/2601.02915",
        "pdf_url": "https://arxiv.org/pdf/2601.02915",
        "title": "ChemBART: A Pre-trained BART Model Assisting Organic Chemistry Analysis",
        "authors": [
            "Kenan Li",
            "Yijian Zhang",
            "Jin Wang",
            "Haipeng Gan",
            "Zeying Sun",
            "Xiaoguang Lei",
            "Hao Dong"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent advances in large language models (LLMs) have demonstrated transformative potential across diverse fields. While LLMs have been applied to molecular simplified molecular input line entry system (SMILES) in computer-aided synthesis planning (CASP), existing methodologies typically address single tasks, such as precursor prediction. We introduce ChemBART, a SMILES-based LLM pre-trained on chemical reactions, which enables a unified model for multiple downstream chemical tasks--achieving the paradigm of \"one model, one pre-training, multiple tasks.\" By leveraging outputs from a mask-filling pre-training task on reaction expressions, ChemBART effectively solves a variety of chemical problems, including precursor/reagent generation, temperature-yield regression, molecular property classification, and optimizing the policy and value functions within a reinforcement learning framework, integrated with Monte Carlo tree search for multi-step synthesis route design. Unlike single-molecule pre-trained LLMs constrained to specific applications, ChemBART addresses broader chemical challenges and integrates them for comprehensive synthesis planning. Crucially, ChemBART-designed multi-step synthesis routes and reaction conditions directly inspired wet-lab validation, which confirmed shorter pathways with ~30% yield improvement over literature benchmarks. Our work validates the power of reaction-focused pre-training and showcases the broad utility of ChemBART in advancing the complete synthesis planning cycle.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 25,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02943",
        "abs_url": "https://arxiv.org/abs/2601.02943",
        "pdf_url": "https://arxiv.org/pdf/2601.02943",
        "title": "MixTTE: Multi-Level Mixture-of-Experts for Scalable and Adaptive Travel Time Estimation",
        "authors": [
            "Wenzhao Jiang",
            "Jindong Han",
            "Ruiqian Han",
            "Hao Liu"
        ],
        "comments": "Accepted to KDD 2026",
        "subjects": "Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "Accurate Travel Time Estimation (TTE) is critical for ride-hailing platforms, where errors directly impact user experience and operational efficiency. While existing production systems excel at holistic route-level dependency modeling, they struggle to capture city-scale traffic dynamics and long-tail scenarios, leading to unreliable predictions in large urban networks. In this paper, we propose \\model, a scalable and adaptive framework that synergistically integrates link-level modeling with industrial route-level TTE systems. Specifically, we propose a spatio-temporal external attention module to capture global traffic dynamic dependencies across million-scale road networks efficiently. Moreover, we construct a stabilized graph mixture-of-experts network to handle heterogeneous traffic patterns while maintaining inference efficiency. Furthermore, an asynchronous incremental learning strategy is tailored to enable real-time and stable adaptation to dynamic traffic distribution shifts. Experiments on real-world datasets validate MixTTE significantly reduces prediction errors compared to seven baselines. MixTTE has been deployed in DiDi, substantially improving the accuracy and stability of the TTE service.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 26,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02998",
        "abs_url": "https://arxiv.org/abs/2601.02998",
        "pdf_url": "https://arxiv.org/pdf/2601.02998",
        "title": "Multi-Distribution Robust Conformal Prediction",
        "authors": [
            "Yuqi Yang",
            "Ying Jin"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Methodology (stat.ME); Machine Learning (stat.ML)",
        "abstract": "In many fairness and distribution robustness problems, one has access to labeled data from multiple source distributions yet the test data may come from an arbitrary member or a mixture of them. We study the problem of constructing a conformal prediction set that is uniformly valid across multiple, heterogeneous distributions, in the sense that no matter which distribution the test point is from, the coverage of the prediction set is guaranteed to exceed a pre-specified level. We first propose a max-p aggregation scheme that delivers finite-sample, multi-distribution coverage given any conformity scores associated with each distribution. Upon studying several efficiency optimization programs subject to uniform coverage, we prove the optimality and tightness of our aggregation scheme, and propose a general algorithm to learn conformity scores that lead to efficient prediction sets after the aggregation under standard conditions. We discuss how our framework relates to group-wise distributionally robust optimization, sub-population shift, fairness, and multi-source learning. In synthetic and real-data experiments, our method delivers valid worst-case coverage across multiple distributions while greatly reducing the set size compared with naively applying max-p aggregation to single-source conformity scores, and can be comparable in size to single-source prediction sets with popular, standard conformity scores.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 27,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03032",
        "abs_url": "https://arxiv.org/abs/2601.03032",
        "pdf_url": "https://arxiv.org/pdf/2601.03032",
        "title": "Causal Manifold Fairness: Enforcing Geometric Invariance in Representation Learning",
        "authors": [
            "Vidhi Rathore"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Computers and Society (cs.CY)",
        "abstract": "Fairness in machine learning is increasingly critical, yet standard approaches often treat data as static points in a high-dimensional space, ignoring the underlying generative structure. We posit that sensitive attributes (e.g., race, gender) do not merely shift data distributions but causally warp the geometry of the data manifold itself. To address this, we introduce Causal Manifold Fairness (CMF), a novel framework that bridges causal inference and geometric deep learning. CMF learns a latent representation where the local Riemannian geometry, defined by the metric tensor and curvature, remains invariant under counterfactual interventions on sensitive attributes. By enforcing constraints on the Jacobian and Hessian of the decoder, CMF ensures that the rules of the latent space (distances and shapes) are preserved across demographic groups. We validate CMF on synthetic Structural Causal Models (SCMs), demonstrating that it effectively disentangles sensitive geometric warping while preserving task utility, offering a rigorous quantification of the fairness-utility trade-off via geometric metrics.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 28,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03047",
        "abs_url": "https://arxiv.org/abs/2601.03047",
        "pdf_url": "https://arxiv.org/pdf/2601.03047",
        "title": "When the Coffee Feature Activates on Coffins: An Analysis of Feature Extraction and Steering for Mechanistic Interpretability",
        "authors": [
            "Raphael Ronge",
            "Markus Maier",
            "Frederick Eberhardt"
        ],
        "comments": "33 pages (65 with appendix), 1 figure",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Recent work by Anthropic on Mechanistic interpretability claims to understand and control Large Language Models by extracting human-interpretable features from their neural activation patterns using sparse autoencoders (SAEs). If successful, this approach offers one of the most promising routes for human oversight in AI safety. We conduct an initial stress-test of these claims by replicating their main results with open-source SAEs for Llama 3.1. While we successfully reproduce basic feature extraction and steering capabilities, our investigation suggests that major caution is warranted regarding the generalizability of these claims. We find that feature steering exhibits substantial fragility, with sensitivity to layer selection, steering magnitude, and context. We observe non-standard activation behavior and demonstrate the difficulty to distinguish thematically similar features from one another. While SAE-based interpretability produces compelling demonstrations in selected cases, current methods often fall short of the systematic reliability required for safety-critical applications. This suggests a necessary shift in focus from prioritizing interpretability of internal representations toward reliable prediction and control of model output. Our work contributes to a more nuanced understanding of what mechanistic interpretability has achieved and highlights fundamental challenges for AI safety that remain unresolved.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 29,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03085",
        "abs_url": "https://arxiv.org/abs/2601.03085",
        "pdf_url": "https://arxiv.org/pdf/2601.03085",
        "title": "Real-Time Adaptive Anomaly Detection in Industrial IoT Environments",
        "authors": [
            "Mahsa Raeiszadeh",
            "Amin Ebrahimzadeh",
            "Roch H. Glitho",
            "Johan Eker",
            "Raquel A. F. Mini"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "To ensure reliability and service availability, next-generation networks are expected to rely on automated anomaly detection systems powered by advanced machine learning methods with the capability of handling multi-dimensional data. Such multi-dimensional, heterogeneous data occurs mostly in today's industrial Internet of Things (IIoT), where real-time detection of anomalies is critical to prevent impending failures and resolve them in a timely manner. However, existing anomaly detection methods often fall short of effectively coping with the complexity and dynamism of multi-dimensional data streams in IIoT. In this paper, we propose an adaptive method for detecting anomalies in IIoT streaming data utilizing a multi-source prediction model and concept drift adaptation. The proposed anomaly detection algorithm merges a prediction model into a novel drift adaptation method resulting in accurate and efficient anomaly detection that exhibits improved scalability. Our trace-driven evaluations indicate that the proposed method outperforms the state-of-the-art anomaly detection methods by achieving up to an 89.71% accuracy (in terms of Area under the Curve (AUC)) while meeting the given efficiency and scalability requirements.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 30,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03087",
        "abs_url": "https://arxiv.org/abs/2601.03087",
        "pdf_url": "https://arxiv.org/pdf/2601.03087",
        "title": "Audit Me If You Can: Query-Efficient Active Fairness Auditing of Black-Box LLMs",
        "authors": [
            "David Hartmann",
            "Lena Pohlmann",
            "Lelia Hanslik",
            "Noah Gieing",
            "Bettina Berendt",
            "Pieter Delobelle"
        ],
        "comments": "Submitted to ACL ARR 2026",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL); Computers and Society (cs.CY)",
        "abstract": "Large Language Models (LLMs) exhibit systematic biases across demographic groups. Auditing is proposed as an accountability tool for black-box LLM applications, but suffers from resource-intensive query access. We conceptualise auditing as uncertainty estimation over a target fairness metric and introduce BAFA, the Bounded Active Fairness Auditor for query-efficient auditing of black-box LLMs. BAFA maintains a version space of surrogate models consistent with queried scores and computes uncertainty intervals for fairness metrics (e.g., $\\Delta$ AUC) via constrained empirical risk minimisation. Active query selection narrows these intervals to reduce estimation error. We evaluate BAFA on two standard fairness dataset case studies: \\textsc{CivilComments} and \\textsc{Bias-in-Bios}, comparing against stratified sampling, power sampling, and ablations. BAFA achieves target error thresholds with up to 40$\\times$ fewer queries than stratified sampling (e.g., 144 vs 5,956 queries at $\\varepsilon=0.02$ for \\textsc{CivilComments}) for tight thresholds, demonstrates substantially better performance over time, and shows lower variance across runs. These results suggest that active sampling can reduce resources needed for independent fairness auditing with LLMs, supporting continuous model evaluations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 31,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03093",
        "abs_url": "https://arxiv.org/abs/2601.03093",
        "pdf_url": "https://arxiv.org/pdf/2601.03093",
        "title": "ATLAS: Adaptive Test-Time Latent Steering with External Verifiers for Enhancing LLMs Reasoning",
        "authors": [
            "Tuc Nguyen",
            "Thai Le"
        ],
        "comments": "12 pages, 3 figures",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "Recent work on activation and latent steering has demonstrated that modifying internal representations can effectively guide large language models (LLMs) toward improved reasoning and efficiency without additional training. However, most existing approaches rely on fixed steering policies and static intervention strengths, which limit their robustness across problem instances and often result in over- or under-steering. We propose Adaptive Test-time Latent Steering, called (ATLAS), a task- specific framework that dynamically controls steering decisions at inference time using an external, lightweight latent verifier. Given intermediate hidden states, the verifier predicts the quality of ongoing reasoning and adaptively selects whether and how strongly to apply steering, enabling per-example and per-step adjustment with minimal overhead. To our knowledge, ATLAS is the first method to integrate learned latent verification into test-time steering for enhancing LLMs reasoning. Experiments on multiple mathematical reasoning benchmarks show that ATLAS consistently outperforms both vanilla decoding and fixed steering baselines, achieving higher accuracy while substantially reducing test-time token usage. These results demonstrate that verifier-guided latent adaptation provides an effective and scalable mechanism for controlling reasoning efficiency without sacrificing solution quality. All source code will be publicly available.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 32,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03098",
        "abs_url": "https://arxiv.org/abs/2601.03098",
        "pdf_url": "https://arxiv.org/pdf/2601.03098",
        "title": "From Muscle to Text with MyoText: sEMG to Text via Finger Classification and Transformer-Based Decoding",
        "authors": [
            "Meghna Roy Chowdhury",
            "Shreyas Sen",
            "Yi Ding"
        ],
        "comments": "25 pages, 11 tables, 11 figures",
        "subjects": "Machine Learning (cs.LG); Neural and Evolutionary Computing (cs.NE)",
        "abstract": "Surface electromyography (sEMG) provides a direct neural interface for decoding muscle activity and offers a promising foundation for keyboard-free text input in wearable and mixed-reality systems. Previous sEMG-to-text studies mainly focused on recognizing letters directly from sEMG signals, forming an important first step toward translating muscle activity into text. Building on this foundation, we present MyoText, a hierarchical framework that decodes sEMG signals to text through physiologically grounded intermediate stages. MyoText first classifies finger activations from multichannel sEMG using a CNN-BiLSTM-Attention model, applies ergonomic typing priors to infer letters, and reconstructs full sentences with a fine-tuned T5 transformer. This modular design mirrors the natural hierarchy of typing, linking muscle intent to language output and reducing the search space for decoding. Evaluated on 30 users from the emg2qwerty dataset, MyoText outperforms baselines by achieving 85.4% finger-classification accuracy, 5.4% character error rate (CER), and 6.5% word error rate (WER). Beyond accuracy gains, this methodology establishes a principled pathway from neuromuscular signals to text, providing a blueprint for virtual and augmented-reality typing interfaces that operate entirely without physical keyboards. By integrating ergonomic structure with transformer-based linguistic reasoning, MyoText advances the feasibility of seamless, wearable neural input for future ubiquitous computing environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 33,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03099",
        "abs_url": "https://arxiv.org/abs/2601.03099",
        "pdf_url": "https://arxiv.org/pdf/2601.03099",
        "title": "Time-Aware Synthetic Control",
        "authors": [
            "Saeyoung Rho",
            "Cyrus Illick",
            "Samhitha Narasipura",
            "Alberto Abadie",
            "Daniel Hsu",
            "Vishal Misra"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Econometrics (econ.EM); Machine Learning (stat.ML)",
        "abstract": "The synthetic control (SC) framework is widely used for observational causal inference with time-series panel data. SC has been successful in diverse applications, but existing methods typically treat the ordering of pre-intervention time indices interchangeable. This invariance means they may not fully take advantage of temporal structure when strong trends are present. We propose Time-Aware Synthetic Control (TASC), which employs a state-space model with a constant trend while preserving a low-rank structure of the signal. TASC uses the Kalman filter and Rauch-Tung-Striebel smoother: it first fits a generative time-series model with expectation-maximization and then performs counterfactual inference. We evaluate TASC on both simulated and real-world datasets, including policy evaluation and sports prediction. Our results suggest that TASC offers advantages in settings with strong temporal trends and high levels of observation noise.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 34,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03111",
        "abs_url": "https://arxiv.org/abs/2601.03111",
        "pdf_url": "https://arxiv.org/pdf/2601.03111",
        "title": "One Sample to Rule Them All: Extreme Data Efficiency in RL Scaling",
        "authors": [
            "Yiyuan Li",
            "Zhen Huang",
            "Yanan Wu",
            "Weixun Wang",
            "Xuefeng Li",
            "Yijia Luo",
            "Wenbo Su",
            "Bo Zheng",
            "Pengfei Liu"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Computation and Language (cs.CL)",
        "abstract": "The reasoning ability of large language models (LLMs) can be unleashed with reinforcement learning (RL) (OpenAI, 2024; DeepSeek-AI et al., 2025a; Zeng et al., 2025). The success of existing RL attempts in LLMs usually relies on high-quality samples of thousands or beyond. In this paper, we challenge fundamental assumptions about data requirements in RL for LLMs by demonstrating the remarkable effectiveness of one-shot learning. Specifically, we introduce polymath learning, a framework for designing one training sample that elicits multidisciplinary impact. We present three key findings: (1) A single, strategically selected math reasoning sample can produce significant performance improvements across multiple domains, including physics, chemistry, and biology with RL; (2) The math skills salient to reasoning suggest the characteristics of the optimal polymath sample; and (3) An engineered synthetic sample that integrates multidiscipline elements outperforms training with individual samples that naturally occur. Our approach achieves superior performance to training with larger datasets across various reasoning benchmarks, demonstrating that sample quality and design, rather than quantity, may be the key to unlock enhanced reasoning capabilities in language models. Our results suggest a shift, dubbed as sample engineering, toward precision engineering of training samples rather than simply increasing data volume.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 35,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03149",
        "abs_url": "https://arxiv.org/abs/2601.03149",
        "pdf_url": "https://arxiv.org/pdf/2601.03149",
        "title": "PersonaLedger: Generating Realistic Financial Transactions with Persona Conditioned LLMs and Rule Grounded Feedback",
        "authors": [
            "Dehao Yuan",
            "Tyler Farnan",
            "Stefan Tesliuc",
            "Doron L Bergman",
            "Yulun Wu",
            "Xiaoyu Liu",
            "Minghui Liu",
            "James Montgomery",
            "Nam H Nguyen",
            "C. Bayan Bruss",
            "Furong Huang"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Strict privacy regulations limit access to real transaction data, slowing open research in financial AI. Synthetic data can bridge this gap, but existing generators do not jointly achieve behavioral diversity and logical groundedness. Rule-driven simulators rely on hand-crafted workflows and shallow stochasticity, which miss the richness of human behavior. Learning-based generators such as GANs capture correlations yet often violate hard financial constraints and still require training on private data. We introduce PersonaLedger, a generation engine that uses a large language model conditioned on rich user personas to produce diverse transaction streams, coupled with an expert configurable programmatic engine that maintains correctness. The LLM and engine interact in a closed loop: after each event, the engine updates the user state, enforces financial rules, and returns a context aware \"nextprompt\" that guides the LLM toward feasible next actions. With this engine, we create a public dataset of 30 million transactions from 23,000 users and a benchmark suite with two tasks, illiquidity classification and identity theft segmentation. PersonaLedger offers a realistic, privacy preserving resource that supports rigorous evaluation of forecasting and anomaly detection models. PersonaLedger offers the community a rich, realistic, and privacy preserving resource -- complete with code, rules, and generation logs -- to accelerate innovation in financial AI and enable rigorous, reproducible evaluation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 36,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03159",
        "abs_url": "https://arxiv.org/abs/2601.03159",
        "pdf_url": "https://arxiv.org/pdf/2601.03159",
        "title": "Rapid Augmentations for Time Series (RATS): A High-Performance Library for Time Series Augmentation",
        "authors": [
            "Wadie Skaf",
            "Felix Kern",
            "Aryamaan Basu Roy",
            "Tejas Pradhan",
            "Roman Kalkreuth",
            "Holger Hoos"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI); Performance (cs.PF)",
        "abstract": "Time series augmentation is critical for training robust deep learning models, particularly in domains where labelled data is scarce and expensive to obtain. However, existing augmentation libraries for time series, mainly written in Python, suffer from performance bottlenecks, where running time grows exponentially as dataset sizes increase -- an aspect limiting their applicability in large-scale, production-grade systems. We introduce RATS (Rapid Augmentations for Time Series), a high-performance library for time series augmentation written in Rust with Python bindings (RATSpy). RATS implements multiple augmentation methods spanning basic transformations, frequency-domain operations and time warping techniques, all accessible through a unified pipeline interface with built-in parallelisation. Comprehensive benchmarking of RATSpy versus a commonly used library (tasug) on 143 datasets demonstrates that RATSpy achieves an average speedup of 74.5\\% over tsaug (up to 94.8\\% on large datasets), with up to 47.9\\% less peak memory usage.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 37,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03162",
        "abs_url": "https://arxiv.org/abs/2601.03162",
        "pdf_url": "https://arxiv.org/pdf/2601.03162",
        "title": "On the Convergence Behavior of Preconditioned Gradient Descent Toward the Rich Learning Regime",
        "authors": [
            "Shuai Jiang",
            "Alexey Voronin",
            "Eric Cyr",
            "Ben Southworth"
        ],
        "comments": "21 pages, 13 figures,",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Spectral bias, the tendency of neural networks to learn low frequencies first, can be both a blessing and a curse. While it enhances the generalization capabilities by suppressing high-frequency noise, it can be a limitation in scientific tasks that require capturing fine-scale structures. The delayed generalization phenomenon known as grokking is another barrier to rapid training of neural networks. Grokking has been hypothesized to arise as learning transitions from the NTK to the feature-rich regime. This paper explores the impact of preconditioned gradient descent (PGD), such as Gauss-Newton, on spectral bias and grokking phenomena. We demonstrate through theoretical and empirical results how PGD can mitigate issues associated with spectral bias. Additionally, building on the rich learning regime grokking hypothesis, we study how PGD can be used to reduce delays associated with grokking. Our conjecture is that PGD, without the impediment of spectral bias, enables uniform exploration of the parameter space in the NTK regime. Our experimental results confirm this prediction, providing strong evidence that grokking represents a transitional behavior between the lazy regime characterized by the NTK and the rich regime. These findings deepen our understanding of the interplay between optimization dynamics, spectral bias, and the phases of neural network learning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 38,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03166",
        "abs_url": "https://arxiv.org/abs/2601.03166",
        "pdf_url": "https://arxiv.org/pdf/2601.03166",
        "title": "Dynamic Hyperparameter Importance for Efficient Multi-Objective Optimization",
        "authors": [
            "Daphne Theodorakopoulos",
            "Marcel Wever",
            "Marius Lindauer"
        ],
        "comments": "Submitted to IJCAI 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Choosing a suitable ML model is a complex task that can depend on several objectives, e.g., accuracy, model size, fairness, inference time, or energy consumption. In practice, this requires trading off multiple, often competing, objectives through multi-objective optimization (MOO). However, existing MOO methods typically treat all hyperparameters as equally important, overlooking that hyperparameter importance (HPI) can vary significantly depending on the trade-off between objectives. We propose a novel dynamic optimization approach that prioritizes the most influential hyperparameters based on varying objective trade-offs during the search process, which accelerates empirical convergence and leads to better solutions. Building on prior work on HPI for MOO post-analysis, we now integrate HPI, calculated with HyperSHAP, into the optimization. For this, we leverage the objective weightings naturally produced by the MOO algorithm ParEGO and adapt the configuration space by fixing the unimportant hyperparameters, allowing the search to focus on the important ones. Eventually, we validate our method with diverse tasks from PyMOO and YAHPO-Gym. Empirical results demonstrate improvements in convergence speed and Pareto front quality compared to baselines.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 39,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03173",
        "abs_url": "https://arxiv.org/abs/2601.03173",
        "pdf_url": "https://arxiv.org/pdf/2601.03173",
        "title": "Predicting Time Pressure of Powered Two-Wheeler Riders for Proactive Safety Interventions",
        "authors": [
            "Sumit S. Shevtekar",
            "Chandresh K. Maurya",
            "Gourab Sil",
            "Subasish Das"
        ],
        "comments": "13 pages, 8 figures",
        "subjects": "Machine Learning (cs.LG); Human-Computer Interaction (cs.HC)",
        "abstract": "Time pressure critically influences risky maneuvers and crash proneness among powered two-wheeler riders, yet its prediction remains underexplored in intelligent transportation systems. We present a large-scale dataset of 129,000+ labeled multivariate time-series sequences from 153 rides by 51 participants under No, Low, and High Time Pressure conditions. Each sequence captures 63 features spanning vehicle kinematics, control inputs, behavioral violations, and environmental context. Our empirical analysis shows High Time Pressure induces 48% higher speeds, 36.4% greater speed variability, 58% more risky turns at intersections, 36% more sudden braking, and 50% higher rear brake forces versus No Time Pressure. To benchmark this dataset, we propose MotoTimePressure, a deep learning model combining convolutional preprocessing, dual-stage temporal attention, and Squeeze-and-Excitation feature recalibration, achieving 91.53% accuracy and 98.93% ROC AUC, outperforming eight baselines. Since time pressure cannot be directly measured in real time, we demonstrate its utility in collision prediction and threshold determination. Using MTPS-predicted time pressure as features, improves Informer-based collision risk accuracy from 91.25% to 93.51%, approaching oracle performance (93.72%). Thresholded time pressure states capture rider cognitive stress and enable proactive ITS interventions, including adaptive alerts, haptic feedback, V2I signaling, and speed guidance, supporting safer two-wheeler mobility under the Safe System Approach.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 40,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03184",
        "abs_url": "https://arxiv.org/abs/2601.03184",
        "pdf_url": "https://arxiv.org/pdf/2601.03184",
        "title": "Decentralized Autoregressive Generation",
        "authors": [
            "Stepan Maschan",
            "Haoxuan Qu",
            "Jun Liu"
        ],
        "comments": "Work in progress",
        "subjects": "Machine Learning (cs.LG); Artificial Intelligence (cs.AI)",
        "abstract": "We present a theoretical analysis of decentralization of autoregressive generation. We define the Decentralized Discrete Flow Matching objective, by expressing probability generating velocity as a linear combination of expert flows. We also conduct experiments demonstrat- ing the equivalence between decentralized and centralized training settings for multimodal language models across diverse set of benchmarks. Specifically, we compare two distinct paradigms: LLaVA and InternVL 2.5-1B, which uses a fixed CLIP vision encoder and per- forms full-parameter fine-tuning (ViT+MLP+LLM) during the instruction tuning stage.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 41,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03195",
        "abs_url": "https://arxiv.org/abs/2601.03195",
        "pdf_url": "https://arxiv.org/pdf/2601.03195",
        "title": "Sparse Knowledge Distillation: A Mathematical Framework for Probability-Domain Temperature Scaling and Multi-Stage Compression",
        "authors": [
            "Aaron R. Flouro",
            "Shawn P. Chadwick"
        ],
        "comments": "Machine learning theory. Develops an axiomatic, operator-agnostic framework for probability-domain knowledge distillation, including bias--variance analysis of sparse students, homotopy-based multi-stage pruning, $O(1/n)$ convergence guarantees, and equivalence classes of probability-domain softening operators. Theoretical analysis only",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "We develop a unified theoretical framework for sparse knowledge distillation based on probability-domain softening operators. While the equivalence $p^{1/T} \\propto \\mathrm{softmax}(z/T)$ is well known, our contribution is an operator-level analytical framework built on this foundation rather than the equivalence itself. The framework comprises four core components: (i) operator-agnostic bias--variance decompositions that characterize when sparse students outperform dense teachers, (ii) a homotopy path formalization of multi-stage pruning in function space explaining why iterative compression succeeds where one-shot pruning fails, (iii) convergence guarantees establishing $O(1/n)$ rates for $n$-stage distillation with explicit parameter dependence, and (iv) equivalence class characterizations identifying distinct probability-domain operators that yield identical student models under capacity constraints. We introduce an axiomatic definition of probability-domain softening operators based on ranking preservation, continuity, entropy monotonicity, identity, and boundary behavior, and show that multiple non-equivalent operator families satisfy these axioms. All learning-theoretic guarantees are shown to hold uniformly across this operator class, independent of implementation details. These results provide theoretical grounding for black-box teacher distillation, partial-access settings such as top-$k$ truncation and text-only outputs, and privacy-preserving model compression.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 42,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03198",
        "abs_url": "https://arxiv.org/abs/2601.03198",
        "pdf_url": "https://arxiv.org/pdf/2601.03198",
        "title": "Empowering Reliable Visual-Centric Instruction Following in MLLMs",
        "authors": [
            "Weilei He",
            "Feng Ju",
            "Zhiyuan Fan",
            "Rui Min",
            "Minhao Cheng",
            "Yi R. Fung"
        ],
        "comments": "Submitted to ARR Jan",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Evaluating the instruction-following (IF) capabilities of Multimodal Large Language Models (MLLMs) is essential for rigorously assessing how faithfully model outputs adhere to user-specified intentions. Nevertheless, existing benchmarks for evaluating MLLMs' instruction-following capability primarily focus on verbal instructions in the textual modality. These limitations hinder a thorough analysis of instruction-following capabilities, as they overlook the implicit constraints embedded in the semantically rich visual modality. To address this gap, we introduce VC-IFEval, a new benchmark accompanied by a systematically constructed dataset that evaluates MLLMs' instruction-following ability under multimodal settings. Our benchmark systematically incorporates vision-dependent constraints into instruction design, enabling a more rigorous and fine-grained assessment of how well MLLMs align their outputs with both visual input and textual instructions. Furthermore, by fine-tuning MLLMs on our dataset, we achieve substantial gains in visual instruction-following accuracy and adherence. Through extensive evaluation across representative MLLMs, we provide new insights into the strengths and limitations of current models.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 43,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03213",
        "abs_url": "https://arxiv.org/abs/2601.03213",
        "pdf_url": "https://arxiv.org/pdf/2601.03213",
        "title": "Critic-Guided Reinforcement Unlearning in Text-to-Image Diffusion",
        "authors": [
            "Mykola Vysotskyi",
            "Zahar Kohut",
            "Mariia Shpir",
            "Taras Rumezhak",
            "Volodymyr Karpiv"
        ],
        "comments": "Preprint. Under review at ICLR 2026",
        "subjects": "Machine Learning (cs.LG)",
        "abstract": "Machine unlearning in text-to-image diffusion models aims to remove targeted concepts while preserving overall utility. Prior diffusion unlearning methods typically rely on supervised weight edits or global penalties; reinforcement-learning (RL) approaches, while flexible, often optimize sparse end-of-trajectory rewards, yielding high-variance updates and weak credit assignment. We present a general RL framework for diffusion unlearning that treats denoising as a sequential decision process and introduces a timestep-aware critic with noisy-step rewards. Concretely, we train a CLIP-based reward predictor on noisy latents and use its per-step signal to compute advantage estimates for policy-gradient updates of the reverse diffusion kernel. Our algorithm is simple to implement, supports off-policy reuse, and plugs into standard text-to-image backbones. Across multiple concepts, the method achieves better or comparable forgetting to strong baselines while maintaining image quality and benign prompt fidelity; ablations show that (i) per-step critics and (ii) noisy-conditioned rewards are key to stability and effectiveness. We release code and evaluation scripts to facilitate reproducibility and future research on RL-based diffusion unlearning.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 44,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03220",
        "abs_url": "https://arxiv.org/abs/2601.03220",
        "pdf_url": "https://arxiv.org/pdf/2601.03220",
        "title": "From Entropy to Epiplexity: Rethinking Information for Computationally Bounded Intelligence",
        "authors": [
            "Marc Finzi",
            "Shikai Qiu",
            "Yiding Jiang",
            "Pavel Izmailov",
            "J. Zico Kolter",
            "Andrew Gordon Wilson"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Can we learn more from data than existed in the generating process itself? Can new and useful information be constructed from merely applying deterministic transformations to existing data? Can the learnable content in data be evaluated without considering a downstream task? On these questions, Shannon information and Kolmogorov complexity come up nearly empty-handed, in part because they assume observers with unlimited computational capacity and fail to target the useful information content. In this work, we identify and exemplify three seeming paradoxes in information theory: (1) information cannot be increased by deterministic transformations; (2) information is independent of the order of data; (3) likelihood modeling is merely distribution matching. To shed light on the tension between these results and modern practice, and to quantify the value of data, we introduce epiplexity, a formalization of information capturing what computationally bounded observers can learn from data. Epiplexity captures the structural content in data while excluding time-bounded entropy, the random unpredictable content exemplified by pseudorandom number generators and chaotic dynamical systems. With these concepts, we demonstrate how information can be created with computation, how it depends on the ordering of the data, and how likelihood modeling can produce more complex programs than present in the data generating process itself. We also present practical procedures to estimate epiplexity which we show capture differences across data sources, track with downstream performance, and highlight dataset interventions that improve out-of-distribution generalization. In contrast to principles of model selection, epiplexity provides a theoretical foundation for data selection, guiding how to select, generate, or transform data for learning systems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 45,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03237",
        "abs_url": "https://arxiv.org/abs/2601.03237",
        "pdf_url": "https://arxiv.org/pdf/2601.03237",
        "title": "PET-TURTLE: Deep Unsupervised Support Vector Machines for Imbalanced Data Clusters",
        "authors": [
            "Javier Salazar Cavazos"
        ],
        "comments": "",
        "subjects": "Machine Learning (cs.LG); Image and Video Processing (eess.IV); Machine Learning (stat.ML)",
        "abstract": "Foundation vision, audio, and language models enable zero-shot performance on downstream tasks via their latent representations. Recently, unsupervised learning of data group structure with deep learning methods has gained popularity. TURTLE, a state of the art deep clustering algorithm, uncovers data labeling without supervision by alternating label and hyperplane updates, maximizing the hyperplane margin, in a similar fashion to support vector machines (SVMs). However, TURTLE assumes clusters are balanced; when data is imbalanced, it yields non-ideal hyperplanes that cause higher clustering error. We propose PET-TURTLE, which generalizes the cost function to handle imbalanced data distributions by a power law prior. Additionally, by introducing sparse logits in the labeling process, PET-TURTLE optimizes a simpler search space that in turn improves accuracy for balanced datasets. Experiments on synthetic and real data show that PET-TURTLE improves accuracy for imbalanced sources, prevents over-prediction of minority clusters, and enhances overall clustering.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 46,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02367",
        "abs_url": "https://arxiv.org/abs/2601.02367",
        "pdf_url": "https://arxiv.org/pdf/2601.02367",
        "title": "Cross-Platform Digital Discourse Analysis of the Israel-Hamas Conflict: Sentiment, Topics, and Event Dynamics",
        "authors": [
            "Despoina Antonakaki",
            "Sotiris Ioannidis"
        ],
        "comments": "",
        "subjects": "Computers and Society (cs.CY); Artificial Intelligence (cs.AI); Computation and Language (cs.CL); Information Retrieval (cs.IR); Machine Learning (cs.LG); Social and Information Networks (cs.SI)",
        "abstract": "The Israeli-Palestinian conflict remains one of the most polarizing geopolitical issues, with the October 2023 escalation intensifying online debate. Social media platforms, particularly Telegram, have become central to real-time news sharing, advocacy, and propaganda. In this study, we analyze Telegram, Twitter/X, and Reddit to examine how conflict narratives are produced, amplified, and contested across different digital spheres. Building on our previous work on Telegram discourse during the 2023 escalation, we extend the analysis longitudinally and cross-platform using an updated dataset spanning October 2023 to mid-2025. The corpus includes more than 187,000 Telegram messages, 2.1 million Reddit comments, and curated Twitter/X posts. We combine Latent Dirichlet Allocation (LDA), BERTopic, and transformer-based sentiment and emotion models to identify dominant themes, emotional dynamics, and propaganda strategies. Telegram channels provide unfiltered, high-intensity documentation of events; Twitter/X amplifies frames to global audiences; and Reddit hosts more reflective and deliberative discussions. Our findings reveal persistent negative sentiment, strong coupling between humanitarian framing and solidarity expressions, and platform-specific pathways for the diffusion of pro-Palestinian and pro-Israeli narratives. This paper offers three contributions: (1) a multi-platform, FAIR-compliant dataset on the Israel-Hamas war, (2) an integrated pipeline combining topic modeling, sentiment and emotion analysis, and spam filtering for large-scale conflict discourse, and (3) empirical insights into how platform affordances and affective publics shape the evolution of digital conflict communication.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 47,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02401",
        "abs_url": "https://arxiv.org/abs/2601.02401",
        "pdf_url": "https://arxiv.org/pdf/2601.02401",
        "title": "Spiking Heterogeneous Graph Attention Networks",
        "authors": [
            "Buqing Cao",
            "Qian Peng",
            "Xiang Xie",
            "Liang Chen",
            "Min Shi",
            "Jianxun Liu"
        ],
        "comments": "This paper has been accepted by AAAI 2026",
        "subjects": "Neural and Evolutionary Computing (cs.NE); Machine Learning (cs.LG); Social and Information Networks (cs.SI)",
        "abstract": "Real-world graphs or networks are usually heterogeneous, involving multiple types of nodes and relationships. Heterogeneous graph neural networks (HGNNs) can effectively handle these diverse nodes and edges, capturing heterogeneous information within the graph, thus exhibiting outstanding performance. However, most methods of HGNNs usually involve complex structural designs, leading to problems such as high memory usage, long inference time, and extensive consumption of computing resources. These limitations pose certain challenges for the practical application of HGNNs, especially for resource-constrained devices. To mitigate this issue, we propose the Spiking Heterogeneous Graph Attention Networks (SpikingHAN), which incorporates the brain-inspired and energy-saving properties of Spiking Neural Networks (SNNs) into heterogeneous graph learning to reduce the computing cost without compromising the performance. Specifically, SpikingHAN aggregates metapath-based neighbor information using a single-layer graph convolution with shared parameters. It then employs a semantic-level attention mechanism to capture the importance of different meta-paths and performs semantic aggregation. Finally, it encodes the heterogeneous information into a spike sequence through SNNs, simulating bioinformatic processing to derive a binarized 1-bit representation of the heterogeneous graph. Comprehensive experimental results from three real-world heterogeneous graph datasets show that SpikingHAN delivers competitive node classification performance. It achieves this with fewer parameters, quicker inference, reduced memory usage, and lower energy consumption. Code is available at this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 48,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02427",
        "abs_url": "https://arxiv.org/abs/2601.02427",
        "pdf_url": "https://arxiv.org/pdf/2601.02427",
        "title": "NitroGen: An Open Foundation Model for Generalist Gaming Agents",
        "authors": [
            "Loc Magne",
            "Anas Awadalla",
            "Guanzhi Wang",
            "Yinzhen Xu",
            "Joshua Belofsky",
            "Fengyuan Hu",
            "Joohwan Kim",
            "Ludwig Schmidt",
            "Georgia Gkioxari",
            "Jan Kautz",
            "Yisong Yue",
            "Yejin Choi",
            "Yuke Zhu",
            "Linxi \"Jim\" Fan"
        ],
        "comments": "16 pages, 7 figures",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "We introduce NitroGen, a vision-action foundation model for generalist gaming agents that is trained on 40,000 hours of gameplay videos across more than 1,000 games. We incorporate three key ingredients: 1) an internet-scale video-action dataset constructed by automatically extracting player actions from publicly available gameplay videos, 2) a multi-game benchmark environment that can measure cross-game generalization, and 3) a unified vision-action model trained with large-scale behavior cloning. NitroGen exhibits strong competence across diverse domains, including combat encounters in 3D action games, high-precision control in 2D platformers, and exploration in procedurally generated worlds. It transfers effectively to unseen games, achieving up to 52% relative improvement in task success rates over models trained from scratch. We release the dataset, evaluation suite, and model weights to advance research on generalist embodied agents.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 49,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02432",
        "abs_url": "https://arxiv.org/abs/2601.02432",
        "pdf_url": "https://arxiv.org/pdf/2601.02432",
        "title": "Quantifying Quanvolutional Neural Networks Robustness for Speech in Healthcare Applications",
        "authors": [
            "Ha Tran",
            "Bipasha Kashyap",
            "Pubudu N. Pathirana"
        ],
        "comments": "",
        "subjects": "Sound (cs.SD); Machine Learning (cs.LG); Audio and Speech Processing (eess.AS)",
        "abstract": "Speech-based machine learning systems are sensitive to noise, complicating reliable deployment in emotion recognition and voice pathology detection. We evaluate the robustness of a hybrid quantum machine learning model, quanvolutional neural networks (QNNs) against classical convolutional neural networks (CNNs) under four acoustic corruptions (Gaussian noise, pitch shift, temporal shift, and speed variation) in a clean-train/corrupted-test regime. Using AVFAD (voice pathology) and TESS (speech emotion), we compare three QNN models (Random, Basic, Strongly) to a simple CNN baseline (CNN-Base), ResNet-18 and VGG-16 using accuracy and corruption metrics (CE, mCE, RCE, RmCE), and analyze architectural factors (circuit complexity or depth, convergence) alongside per-emotion robustness. QNNs generally outperform the CNN-Base under pitch shift, temporal shift, and speed variation (up to 22% lower CE/RCE at severe temporal shift), while the CNN-Base remains more resilient to Gaussian noise. Among quantum circuits, QNN-Basic achieves the best overall robustness on AVFAD, and QNN-Random performs strongest on TESS. Emotion-wise, fear is most robust (80-90% accuracy under severe corruptions), neutral can collapse under strong Gaussian noise (5.5% accuracy), and happy is most vulnerable to pitch, temporal, and speed distortions. QNNs also converge up to six times faster than the CNN-Base. To our knowledge, this is a systematic study of QNN robustness for speech under common non-adversarial acoustic corruptions, indicating that shallow entangling quantum front-ends can improve noise resilience while sensitivity to additive noise remains a challenge.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 50,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02437",
        "abs_url": "https://arxiv.org/abs/2601.02437",
        "pdf_url": "https://arxiv.org/pdf/2601.02437",
        "title": "TAP-ViTs: Task-Adaptive Pruning for On-Device Deployment of Vision Transformers",
        "authors": [
            "Zhibo Wang",
            "Zuoyuan Zhang",
            "Xiaoyi Pang",
            "Qile Zhang",
            "Xuanyi Hao",
            "Shuguo Zhuo",
            "Peng Sun"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Vision Transformers (ViTs) have demonstrated strong performance across a wide range of vision tasks, yet their substantial computational and memory demands hinder efficient deployment on resource-constrained mobile and edge devices. Pruning has emerged as a promising direction for reducing ViT complexity. However, existing approaches either (i) produce a single pruned model shared across all devices, ignoring device heterogeneity, or (ii) rely on fine-tuning with device-local data, which is often infeasible due to limited on-device resources and strict privacy constraints. As a result, current methods fall short of enabling task-customized ViT pruning in privacy-preserving mobile computing settings. This paper introduces TAP-ViTs, a novel task-adaptive pruning framework that generates device-specific pruned ViT models without requiring access to any raw local data. Specifically, to infer device-level task characteristics under privacy constraints, we propose a Gaussian Mixture Model (GMM)-based metric dataset construction mechanism. Each device fits a lightweight GMM to approximate its private data distribution and uploads only the GMM parameters. Using these parameters, the cloud selects distribution-consistent samples from public data to construct a task-representative metric dataset for each device. Based on this proxy dataset, we further develop a dual-granularity importance evaluation-based pruning strategy that jointly measures composite neuron importance and adaptive layer importance, enabling fine-grained, task-aware pruning tailored to each device's computational budget. Extensive experiments across multiple ViT backbones and datasets demonstrate that TAP-ViTs consistently outperforms state-of-the-art pruning methods under comparable compression ratios.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 51,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02444",
        "abs_url": "https://arxiv.org/abs/2601.02444",
        "pdf_url": "https://arxiv.org/pdf/2601.02444",
        "title": "VocalBridge: Latent Diffusion-Bridge Purification for Defeating Perturbation-Based Voiceprint Defenses",
        "authors": [
            "Maryam Abbasihafshejani",
            "AHM Nazmus Sakib",
            "Murtuza Jadliwala"
        ],
        "comments": "",
        "subjects": "Sound (cs.SD); Artificial Intelligence (cs.AI); Cryptography and Security (cs.CR); Machine Learning (cs.LG); Audio and Speech Processing (eess.AS)",
        "abstract": "The rapid advancement of speech synthesis technologies, including text-to-speech (TTS) and voice conversion (VC), has intensified security and privacy concerns related to voice cloning. Recent defenses attempt to prevent unauthorized cloning by embedding protective perturbations into speech to obscure speaker identity while maintaining intelligibility. However, adversaries can apply advanced purification techniques to remove these perturbations, recover authentic acoustic characteristics, and regenerate cloneable voices. Despite the growing realism of such attacks, the robustness of existing defenses under adaptive purification remains insufficiently studied. Most existing purification methods are designed to counter adversarial noise in automatic speech recognition (ASR) systems rather than speaker verification or voice cloning pipelines. As a result, they fail to suppress the fine-grained acoustic cues that define speaker identity and are often ineffective against speaker verification attacks (SVA). To address these limitations, we propose Diffusion-Bridge (VocalBridge), a purification framework that learns a latent mapping from perturbed to clean speech in the EnCodec latent space. Using a time-conditioned 1D U-Net with a cosine noise schedule, the model enables efficient, transcript-free purification while preserving speaker-discriminative structure. We further introduce a Whisper-guided phoneme variant that incorporates lightweight temporal guidance without requiring ground-truth transcripts. Experimental results show that our approach consistently outperforms existing purification methods in recovering cloneable voices from protected speech. Our findings demonstrate the fragility of current perturbation-based defenses and highlight the need for more robust protection mechanisms against evolving voice-cloning and speaker verification threats.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 52,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02492",
        "abs_url": "https://arxiv.org/abs/2601.02492",
        "pdf_url": "https://arxiv.org/pdf/2601.02492",
        "title": "Variational (Energy-Based) Spectral Learning: A Machine Learning Framework for Solving Partial Differential Equations",
        "authors": [
            "M. M. Hammad"
        ],
        "comments": "",
        "subjects": "Numerical Analysis (math.NA); Machine Learning (cs.LG)",
        "abstract": "We introduce variational spectral learning (VSL), a machine learning framework for solving partial differential equations (PDEs) that operates directly in the coefficient space of spectral expansions. VSL offers a principled bridge between variational PDE theory, spectral discretization, and contemporary machine learning practice. The core idea is to recast a given PDE \\[ \\mathcal{L}u = f \\quad \\text{in} \\quad Q=\\Omega\\times(0,T), \\] together with boundary and initial conditions, into differentiable space--time energies built from strong-form least-squares residuals and weak (Galerkin) formulations. The solution is represented as a finite spectral expansion \\[ u_N(x,t)=\\sum_{n=1}^{N} c_n\\,\\phi_n(x,t), \\] where $\\phi_n$ are tensor-product Chebyshev bases in space and time, with Dirichlet-satisfying spatial modes enforcing homogeneous boundary conditions analytically. This yields a compact linear parameterization in the coefficient vector $\\mathbf{c}$, while all PDE complexity is absorbed into the variational energy. We show how to construct strong-form and weak-form space-time functionals, augment them with initial-condition and Tikhonov regularization terms, and minimize the resulting objective with gradient-based optimization. In practice, VSL is implemented in TensorFlow using automatic differentiation and Keras cosine-decay-with-restarts learning-rate schedules, enabling robust optimization of moderately sized coefficient vectors. Numerical experiments on benchmark elliptic and parabolic problems, including one- and two-dimensional Poisson, diffusion, and Burgers-type equations, demonstrate that VSL attains accuracy comparable to classical spectral collocation with Crank-Nicolson time stepping, while providing a differentiable objective suitable for modern optimization tooling.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 53,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02523",
        "abs_url": "https://arxiv.org/abs/2601.02523",
        "pdf_url": "https://arxiv.org/pdf/2601.02523",
        "title": "First Provably Optimal Asynchronous SGD for Homogeneous and Heterogeneous Data",
        "authors": [
            "Artavazd Maranjyan"
        ],
        "comments": "PhD thesis",
        "subjects": "Optimization and Control (math.OC); Distributed, Parallel, and Cluster Computing (cs.DC); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Artificial intelligence has advanced rapidly through large neural networks trained on massive datasets using thousands of GPUs or TPUs. Such training can occupy entire data centers for weeks and requires enormous computational and energy resources. Yet the optimization algorithms behind these runs have not kept pace. Most large scale training still relies on synchronous methods, where workers must wait for the slowest device, wasting compute and amplifying the effects of hardware and network variability. Removing synchronization seems like a simple fix, but asynchrony introduces staleness, meaning updates computed on outdated models. This makes analysis difficult, especially when delays arise from system level randomness rather than algorithmic choices. As a result, the time complexity of asynchronous methods remains poorly understood. This dissertation develops a rigorous framework for asynchronous first order stochastic optimization, focusing on the core challenge of heterogeneous worker speeds. Within this framework, we show that with proper design, asynchronous SGD can achieve optimal time complexity, matching guarantees previously known only for synchronous methods. Our first contribution, Ringmaster ASGD, attains optimal time complexity in the homogeneous data setting by selectively discarding stale updates. The second, Ringleader ASGD, extends optimality to heterogeneous data, common in federated learning, using a structured gradient table mechanism. Finally, ATA improves resource efficiency by learning worker compute time distributions and allocating tasks adaptively, achieving near optimal wall clock time with less computation. Together, these results establish asynchronous optimization as a theoretically sound and practically efficient foundation for distributed learning, showing that coordination without synchronization can be both feasible and optimal.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 54,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02563",
        "abs_url": "https://arxiv.org/abs/2601.02563",
        "pdf_url": "https://arxiv.org/pdf/2601.02563",
        "title": "Compressed code: the hidden effects of quantization and distillation on programming tokens",
        "authors": [
            "Viacheslav Siniaev",
            "Iaroslav Chelombitko",
            "Aleksey Komissarov"
        ],
        "comments": "18 pages, 1 figure and 6 tables",
        "subjects": "Software Engineering (cs.SE); Computation and Language (cs.CL); Machine Learning (cs.LG); Programming Languages (cs.PL)",
        "abstract": "Large Language Models (LLMs) have demonstrated exceptional code generation capabilities, yet their token-level mechanisms remain underexplored, particularly in compressed models. Through systematic analysis of programming language token representations, we characterize how programming languages are encoded in LLM tokenizers by analyzing their vocabulary distribution and keyword coverage patterns. We introduce a novel cold-start probability analysis method that provides insights into model behavior without requiring explicit prompts. Additionally, we present a comprehensive evaluation of how different model optimization techniques - including quantization, distillation, model scaling, and task-specific fine-tuning - affect token-level representations and code generation quality. Our experiments, supported by comprehensive probability distribution analysis and evaluation metrics, reveal critical insights into token-level behavior and provide empirically-validated guidelines for maintaining code generation quality under various optimization constraints. These findings advance both theoretical understanding of LLM code generation and practical implementation of optimized models in production environments.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 55,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02602",
        "abs_url": "https://arxiv.org/abs/2601.02602",
        "pdf_url": "https://arxiv.org/pdf/2601.02602",
        "title": "SWaRL: Safeguard Code Watermarking via Reinforcement Learning",
        "authors": [
            "Neusha Javidnia",
            "Ruisi Zhang",
            "Ashish Kundu",
            "Farinaz Koushanfar"
        ],
        "comments": "Under review",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "We present SWaRL, a robust and fidelity-preserving watermarking framework designed to protect the intellectual property of code LLM owners by embedding unique and verifiable signatures in the generated output. Existing approaches rely on manually crafted transformation rules to preserve watermarked code functionality or manipulate token-generation probabilities at inference time, which are prone to compilation errors. To address these challenges, SWaRL employs a reinforcement learning-based co-training framework that uses compiler feedback for functional correctness and a jointly trained confidential verifier as a reward signal to maintain watermark detectability. Furthermore, SWaRL employs low-rank adaptation (LoRA) during fine-tuning, allowing the learned watermark information to be transferable across model updates. Extensive experiments show that SWaRL achieves higher watermark detection accuracy compared to prior methods while fully maintaining watermarked code functionality. The LoRA-based signature embedding steers the base model to generate and solve code in a watermark-specific manner without significant computational overhead. Moreover, SWaRL exhibits strong resilience against refactoring and adversarial transformation attacks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 56,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02656",
        "abs_url": "https://arxiv.org/abs/2601.02656",
        "pdf_url": "https://arxiv.org/pdf/2601.02656",
        "title": "Statistical Inference for Fuzzy Clustering",
        "authors": [
            "Qiuyi Wu",
            "Zihan Zhu",
            "Anru R. Zhang"
        ],
        "comments": "",
        "subjects": "Methodology (stat.ME); Machine Learning (cs.LG)",
        "abstract": "Clustering is a central tool in biomedical research for discovering heterogeneous patient subpopulations, where group boundaries are often diffuse rather than sharply separated. Traditional methods produce hard partitions, whereas soft clustering methods such as fuzzy $c$-means (FCM) allow mixed memberships and better capture uncertainty and gradual transitions. Despite the widespread use of FCM, principled statistical inference for fuzzy clustering remains limited. We develop a new framework for weighted fuzzy $c$-means (WFCM) for settings with potential cluster size imbalance. Cluster-specific weights rebalance the classical FCM criterion so that smaller clusters are not overwhelmed by dominant groups, and the weighted objective induces a normalized density model with scale parameter $\\sigma$ and fuzziness parameter $m$. Estimation is performed via a blockwise majorize--minimize (MM) procedure that alternates closed-form membership and centroid updates with likelihood-based updates of $(\\sigma,\\bw)$. The intractable normalizing constant is approximated by importance sampling using a data-adaptive Gaussian mixture proposal. We further provide likelihood ratio tests for comparing cluster centers and bootstrap-based confidence intervals. We establish consistency and asymptotic normality of the maximum likelihood estimator, validate the method through simulations, and illustrate it using single-cell RNA-seq and Alzheimer disease Neuroimaging Initiative (ADNI) data. These applications demonstrate stable uncertainty quantification and biologically meaningful soft memberships, ranging from well-separated cell populations under imbalance to a graded AD versus non-AD continuum consistent with disease progression.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 57,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02659",
        "abs_url": "https://arxiv.org/abs/2601.02659",
        "pdf_url": "https://arxiv.org/pdf/2601.02659",
        "title": "Empirical Comparison of Encoder-Based Language Models and Feature-Based Supervised Machine Learning Approaches to Automated Scoring of Long Essays",
        "authors": [
            "Kuo Wang",
            "Haowei Hua",
            "Pengfei Yan",
            "Hong Jiao",
            "Dan Song"
        ],
        "comments": "22 pages, 5 figures, 3 tables, presented at National Council on Measurement in Education 2025",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Long context may impose challenges for encoder-only language models in text processing, specifically for automated scoring of essays. This study trained several commonly used encoder-based language models for automated scoring of long essays. The performance of these trained models was evaluated and compared with the ensemble models built upon the base language models with a token limit of 512?. The experimented models include BERT-based models (BERT, RoBERTa, DistilBERT, and DeBERTa), ensemble models integrating embeddings from multiple encoder models, and ensemble models of feature-based supervised machine learning models, including Gradient-Boosted Decision Trees, eXtreme Gradient Boosting, and Light Gradient Boosting Machine. We trained, validated, and tested each model on a dataset of 17,307 essays, with an 80%/10%/10% split, and evaluated model performance using Quadratic Weighted Kappa. This study revealed that an ensemble-of-embeddings model that combines multiple pre-trained language model representations with gradient-boosting classifier as the ensemble model significantly outperforms individual language models at scoring long essays.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 58,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02680",
        "abs_url": "https://arxiv.org/abs/2601.02680",
        "pdf_url": "https://arxiv.org/pdf/2601.02680",
        "title": "Adversarial Contrastive Learning for LLM Quantization Attacks",
        "authors": [
            "Dinghong Song",
            "Zhiwei Xu",
            "Hai Wan",
            "Xibin Zhao",
            "Pengfei Su",
            "Dong Li"
        ],
        "comments": "14 pages, 5 figures",
        "subjects": "Cryptography and Security (cs.CR); Machine Learning (cs.LG)",
        "abstract": "Model quantization is critical for deploying large language models (LLMs) on resource-constrained hardware, yet recent work has revealed severe security risks that benign LLMs in full precision may exhibit malicious behaviors after quantization. In this paper, we propose Adversarial Contrastive Learning (ACL), a novel gradient-based quantization attack that achieves superior attack effectiveness by explicitly maximizing the gap between benign and harmful responses probabilities. ACL formulates the attack objective as a triplet-based contrastive loss, and integrates it with a projected gradient descent two-stage distributed fine-tuning strategy to ensure stable and efficient optimization. Extensive experiments demonstrate ACL's remarkable effectiveness, achieving attack success rates of 86.00% for over-refusal, 97.69% for jailbreak, and 92.40% for advertisement injection, substantially outperforming state-of-the-art methods by up to 44.67%, 18.84%, and 50.80%, respectively.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 59,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02694",
        "abs_url": "https://arxiv.org/abs/2601.02694",
        "pdf_url": "https://arxiv.org/pdf/2601.02694",
        "title": "Which Deep Learner? A Systematic Evaluation of Advanced Deep Forecasting Models Accuracy and Efficiency for Network Traffic Prediction",
        "authors": [
            "Eilaf MA Babai",
            "Aalaa MA Babai",
            "Koji Okamura"
        ],
        "comments": "19 pages, 13 figures",
        "subjects": "Networking and Internet Architecture (cs.NI); Machine Learning (cs.LG)",
        "abstract": "Network traffic prediction is essential for automating modern network management. It is a difficult time series forecasting (TSF) problem that has been addressed by Deep Learning (DL) models due to their ability to capture complex patterns. Advances in forecasting, from sophisticated transformer architectures to simple linear models, have improved performance across diverse prediction tasks. However, given the variability of network traffic across network environments and traffic series timescales, it is essential to identify effective deployment choices and modeling directions for network traffic prediction. This study systematically identify and evaluates twelve advanced TSF models -including transformer-based and traditional DL approaches, each with unique advantages for network traffic prediction- against three statistical baselines on four real traffic datasets, across multiple time scales and horizons, assessing performance, robustness to anomalies, data gaps, external factors, data efficiency, and resource efficiency in terms of time, memory, and energy. Results highlight performance regimes, efficiency thresholds, and promising architectures that balance accuracy and efficiency, demonstrating robustness to traffic challenges and suggesting new directions beyond traditional RNNs.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 60,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02769",
        "abs_url": "https://arxiv.org/abs/2601.02769",
        "pdf_url": "https://arxiv.org/pdf/2601.02769",
        "title": "Fast Conformal Prediction using Conditional Interquantile Intervals",
        "authors": [
            "Naixin Guo",
            "Rui Luo",
            "Zhixin Zhou"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG)",
        "abstract": "We introduce Conformal Interquantile Regression (CIR), a conformal regression method that efficiently constructs near-minimal prediction intervals with guaranteed coverage. CIR leverages black-box machine learning models to estimate outcome distributions through interquantile ranges, transforming these estimates into compact prediction intervals while achieving approximate conditional coverage. We further propose CIR+ (Conditional Interquantile Regression with More Comparison), which enhances CIR by incorporating a width-based selection rule for interquantile intervals. This refinement yields narrower prediction intervals while maintaining comparable coverage, though at the cost of slightly increased computational time. Both methods address key limitations of existing distributional conformal prediction approaches: they handle skewed distributions more effectively than Conformalized Quantile Regression, and they achieve substantially higher computational efficiency than Conformal Histogram Regression by eliminating the need for histogram construction. Extensive experiments on synthetic and real-world datasets demonstrate that our methods optimally balance predictive accuracy and computational efficiency compared to existing approaches.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 61,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02807",
        "abs_url": "https://arxiv.org/abs/2601.02807",
        "pdf_url": "https://arxiv.org/pdf/2601.02807",
        "title": "COFFEE: COdesign Framework for Feature Enriched Embeddings in Ads-Ranking Systems",
        "authors": [
            "Sohini Roychowdhury",
            "Doris Wang",
            "Qian Ge",
            "Joy Mu",
            "Srihari Reddy"
        ],
        "comments": "4 pages, 5 figures, 1 table",
        "subjects": "Information Retrieval (cs.IR); Machine Learning (cs.LG)",
        "abstract": "Diverse and enriched data sources are essential for commercial ads-recommendation models to accurately assess user interest both before and after engagement with content. While extended user-engagement histories can improve the prediction of user interests, it is equally important to embed activity sequences from multiple sources to ensure freshness of user and ad-representations, following scaling law principles. In this paper, we present a novel three-dimensional framework for enhancing user-ad representations without increasing model inference or serving complexity. The first dimension examines the impact of incorporating diverse event sources, the second considers the benefits of longer user histories, and the third focuses on enriching data with additional event attributes and multi-modal embeddings. We assess the return on investment (ROI) of our source enrichment framework by comparing organic user engagement sources, such as content viewing, with ad-impression sources. The proposed method can boost the area under curve (AUC) and the slope of scaling curves for ad-impression sources by 1.56 to 2 times compared to organic usage sources even for short online-sequence lengths of 100 to 10K. Additionally, click-through rate (CTR) prediction improves by 0.56% AUC over the baseline production ad-recommendation system when using enriched ad-impression event sources, leading to improved sequence scaling resolutions for longer and offline user-ad representations.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 62,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02882",
        "abs_url": "https://arxiv.org/abs/2601.02882",
        "pdf_url": "https://arxiv.org/pdf/2601.02882",
        "title": "STIPP: Space-time in situ postprocessing over the French Alps using proper scoring rules",
        "authors": [
            "David Landry",
            "Isabelle Gouttevin",
            "Hugo Merizen",
            "Claire Monteleoni",
            "Anastase Charantonis"
        ],
        "comments": "17 pages, 11 figures",
        "subjects": "Atmospheric and Oceanic Physics (physics.ao-ph); Machine Learning (cs.LG)",
        "abstract": "We propose Space-time in situ postprocessing (STIPP), a machine learning model that generates spatio-temporally consistent weather forecasts for a network of station locations. Gridded forecasts from classical numerical weather prediction or data-driven models often lack the necessary precision due to unresolved local effects. Typical statistical postprocessing methods correct these biases, but often degrade spatio-temporal correlation structures in doing so. Recent works based on generative modeling successfully improve spatial correlation structures but have to forecast every lead time independently. In contrast, STIPP makes joint spatio-temporal forecasts which have increased accuracy for surface temperature, wind, relative humidity and precipitation when compared to baseline methods. It makes hourly ensemble predictions given only a six-hourly deterministic forecast, blending the boundaries of postprocessing and temporal interpolation. By leveraging a multivariate proper scoring rule for training, STIPP contributes to ongoing work data-driven atmospheric models supervised only with distribution marginals.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 63,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02890",
        "abs_url": "https://arxiv.org/abs/2601.02890",
        "pdf_url": "https://arxiv.org/pdf/2601.02890",
        "title": "Enhanced 3D Gravity Inversion Using ResU-Net with Density Logging Constraints: A Dual-Phase Training Approach",
        "authors": [
            "Siyuan Dong",
            "Jinghuai Gao",
            "Shuai Zhou",
            "Baohai Wu",
            "Hongfa Jia"
        ],
        "comments": "",
        "subjects": "Geophysics (physics.geo-ph); Machine Learning (cs.LG)",
        "abstract": "Gravity exploration has become an important geophysical method due to its low cost and high efficiency. With the rise of artificial intelligence, data-driven gravity inversion methods based on deep learning (DL) possess physical property recovery capabilities that conventional regularization methods lack. However, existing DL methods suffer from insufficient prior information constraints, which leads to inversion models with large data fitting errors and unreliable results. Moreover, the inversion results lack constraints and matching from other exploration methods, leading to results that may contradict known geological conditions. In this study, we propose a novel approach that integrates prior density well logging information to address the above issues. First, we introduce a depth weighting function to the neural network (NN) and train it in the weighted density parameter domain. The NN, under the constraint of the weighted forward operator, demonstrates improved inversion performance, with the resulting inversion model exhibiting smaller data fitting errors. Next, we divide the entire network training into two phases: first training a large pre-trained network Net-I, and then using the density logging information as the constraint to get the optimized fine-tuning network Net-II. Through testing and comparison in synthetic models and Bishop Model, the inversion quality of our method has significantly improved compared to the unconstrained data-driven DL inversion method. Additionally, we also conduct a comparison and discussion between our method and both the conventional focusing inversion (FI) method and its well logging constrained variant. Finally, we apply this method to the measured data from the San Nicolas mining area in Mexico, comparing and analyzing it with two recent gravity inversion methods based on DL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 64,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02911",
        "abs_url": "https://arxiv.org/abs/2601.02911",
        "pdf_url": "https://arxiv.org/pdf/2601.02911",
        "title": "Image, Word and Thought: A More Challenging Language Task for the Iterated Learning Model",
        "authors": [
            "Hyoyeon Lee",
            "Seth Bullock",
            "Conor Houghton"
        ],
        "comments": "This is an extended version of a paper accepted for EvoLang2026, it includes additional details of the numerical experiments",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG); Multiagent Systems (cs.MA)",
        "abstract": "The iterated learning model simulates the transmission of language from generation to generation in order to explore how the constraints imposed by language transmission facilitate the emergence of language structure. Despite each modelled language learner starting from a blank slate, the presence of a bottleneck limiting the number of utterances to which the learner is exposed can lead to the emergence of language that lacks ambiguity, is governed by grammatical rules, and is consistent over successive generations, that is, one that is expressive, compositional and stable. The recent introduction of a more computationally tractable and ecologically valid semi supervised iterated learning model, combining supervised and unsupervised learning within an autoencoder architecture, has enabled exploration of language transmission dynamics for much larger meaning-signal spaces. Here, for the first time, the model has been successfully applied to a language learning task involving the communication of much more complex meanings: seven-segment display images. Agents in this model are able to learn and transmit a language that is expressive: distinct codes are employed for all 128 glyphs; compositional: signal components consistently map to meaning components, and stable: the language does not change from generation to generation.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 65,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02970",
        "abs_url": "https://arxiv.org/abs/2601.02970",
        "pdf_url": "https://arxiv.org/pdf/2601.02970",
        "title": "Reliability-Aware Adaptive Self-Consistency for Efficient Sampling in LLM Reasoning",
        "authors": [
            "Junseok Kim",
            "Nakyeong Yang",
            "Kyungmin Min",
            "Kyomin Jung"
        ],
        "comments": "15 pages, 8 figures",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Self-Consistency improves reasoning reliability through multi-sample aggregation, but incurs substantial inference cost. Adaptive self-consistency methods mitigate this issue by adjusting the sampling budget; however, they rely on count-based stopping rules that treat all responses equally, often leading to unnecessary sampling. We propose Reliability-Aware Adaptive Self-Consistency (ReASC), which addresses this limitation by reframing adaptive sampling from response counting to evidence sufficiency, leveraging response-level confidence for principled information aggregation. ReASC operates in two stages: a single-sample decision stage that resolves instances confidently answerable from a single response, and a reliability-aware accumulation stage that aggregates responses by jointly leveraging their frequency and confidence. Across five models and four datasets, ReASC consistently achieves the best accuracy-cost trade-off compared to existing baselines, yielding improved inference efficiency across model scales from 3B to 27B parameters. As a concrete example, ReASC reduces inference cost by up to 70\\% relative to self-consistency while preserving accuracy on GSM8K using Gemma-3-4B-it.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 66,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.02994",
        "abs_url": "https://arxiv.org/abs/2601.02994",
        "pdf_url": "https://arxiv.org/pdf/2601.02994",
        "title": "Learning to Act Robustly with View-Invariant Latent Actions",
        "authors": [
            "Youngjoon Jeong",
            "Junha Chun",
            "Taesup Kim"
        ],
        "comments": "Website: this https URL",
        "subjects": "Robotics (cs.RO); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Vision-based robotic policies often struggle with even minor viewpoint changes, underscoring the need for view-invariant visual representations. This challenge becomes more pronounced in real-world settings, where viewpoint variability is unavoidable and can significantly disrupt policy performance. Existing methods typically learn invariance from multi-view observations at the scene level, but such approaches rely on visual appearance and fail to incorporate the physical dynamics essential for robust generalization. We propose View-Invariant Latent Action (VILA), which models a latent action capturing transition patterns across trajectories to learn view-invariant representations grounded in physical dynamics. VILA aligns these latent actions across viewpoints using an action-guided objective based on ground-truth action sequences. Experiments in both simulation and the real world show that VILA-based policies generalize effectively to unseen viewpoints and transfer well to new tasks, establishing VILA as a strong pretraining framework that improves robustness and downstream learning performance.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 67,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03030",
        "abs_url": "https://arxiv.org/abs/2601.03030",
        "pdf_url": "https://arxiv.org/pdf/2601.03030",
        "title": "Flow Matching and Diffusion Models via PointNet for Generating Fluid Fields on Irregular Geometries",
        "authors": [
            "Ali Kashefi"
        ],
        "comments": "",
        "subjects": "Computer Vision and Pattern Recognition (cs.CV); Machine Learning (cs.LG); Computational Physics (physics.comp-ph)",
        "abstract": "We present two novel generative geometric deep learning frameworks, termed Flow Matching PointNet and Diffusion PointNet, for predicting fluid flow variables on irregular geometries by incorporating PointNet into flow matching and diffusion models, respectively. In these frameworks, a reverse generative process reconstructs physical fields from standard Gaussian noise conditioned on unseen geometries. The proposed approaches operate directly on point-cloud representations of computational domains (e.g., grid vertices of finite-volume meshes) and therefore avoid the limitations of pixelation used to project geometries onto uniform lattices. In contrast to graph neural network-based diffusion models, Flow Matching PointNet and Diffusion PointNet do not exhibit high-frequency noise artifacts in the predicted fields. Moreover, unlike such approaches, which require auxiliary intermediate networks to condition geometry, the proposed frameworks rely solely on PointNet, resulting in a simple and unified architecture. The performance of the proposed frameworks is evaluated on steady incompressible flow past a cylinder, using a geometric dataset constructed by varying the cylinder's cross-sectional shape and orientation across samples. The results demonstrate that Flow Matching PointNet and Diffusion PointNet achieve more accurate predictions of velocity and pressure fields, as well as lift and drag forces, and exhibit greater robustness to incomplete geometries compared to a vanilla PointNet with the same number of trainable parameters.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 68,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03043",
        "abs_url": "https://arxiv.org/abs/2601.03043",
        "pdf_url": "https://arxiv.org/pdf/2601.03043",
        "title": "Lil: Less is Less When Applying Post-Training Sparse-Attention Algorithms in Long-Decode Stage",
        "authors": [
            "Junhao Hu",
            "Fangze Li",
            "Mingtao Xu",
            "Feifan Meng",
            "Shiju Zhao",
            "Tiancheng Hu",
            "Ting Peng",
            "Anmin Liu",
            "Wenrui Huang",
            "Chenxu Liu",
            "Ziyue Hua",
            "Tao Xie"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large language models (LLMs) demonstrate strong capabilities across a wide range of complex tasks and are increasingly deployed at scale, placing significant demands on inference efficiency. Prior work typically decomposes inference into prefill and decode stages, with the decode stage dominating total latency. To reduce time and memory complexity in the decode stage, a line of work introduces sparse-attention algorithms. In this paper, we show, both empirically and theoretically, that sparse attention can paradoxically increase end-to-end complexity: information loss often induces significantly longer sequences, a phenomenon we term ``Less is Less'' (Lil). To mitigate the Lil problem, we propose an early-stopping algorithm that detects the threshold where information loss exceeds information gain during sparse decoding. Our early-stopping algorithm reduces token consumption by up to 90% with a marginal accuracy degradation of less than 2% across reasoning-intensive benchmarks.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 69,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03051",
        "abs_url": "https://arxiv.org/abs/2601.03051",
        "pdf_url": "https://arxiv.org/pdf/2601.03051",
        "title": "Temporal Graph Network: Hallucination Detection in Multi-Turn Conversation",
        "authors": [
            "Vidhi Rathore",
            "Sambu Aneesh",
            "Himanshu Singh"
        ],
        "comments": "",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Hallucinations can be produced by conversational AI systems, particularly in multi-turn conversations where context changes and contradictions may eventually surface. By representing the entire conversation as a temporal graph, we present a novel graph-based method for detecting dialogue-level hallucinations. Our framework models each dialogue as a node, encoding it using a sentence transformer. We explore two different ways of connectivity: i) shared-entity edges, which connect turns that refer to the same entities; ii) temporal edges, which connect contiguous turns in the conversation. Message-passing is used to update the node embeddings, allowing flow of information between related nodes. The context-aware node embeddings are then combined using attention pooling into a single vector, which is then passed on to a classifier to determine the presence and type of hallucinations. We demonstrate that our method offers slightly improved performance over existing methods. Further, we show the attention mechanism can be used to justify the decision making process. The code and model weights are made available at: this https URL.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 70,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03066",
        "abs_url": "https://arxiv.org/abs/2601.03066",
        "pdf_url": "https://arxiv.org/pdf/2601.03066",
        "title": "Do LLMs Encode Functional Importance of Reasoning Tokens?",
        "authors": [
            "Janvijay Singh",
            "Dilek Hakkani-Tr"
        ],
        "comments": "20 pages, 8 figures, 2 tables",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Large language models solve complex tasks by generating long reasoning chains, achieving higher accuracy at the cost of increased computational cost and reduced ability to isolate functionally relevant reasoning. Prior work on compact reasoning shortens such chains through probabilistic sampling, heuristics, or supervision from frontier models, but offers limited insight into whether models internally encode token-level functional importance for answer generation. We address this gap diagnostically and propose greedy pruning, a likelihood-preserving deletion procedure that iteratively removes reasoning tokens whose removal minimally degrades model likelihood under a specified objective, yielding length-controlled reasoning chains. We evaluate pruned reasoning in a distillation framework and show that students trained on pruned chains outperform a frontier-model-supervised compression baseline at matched reasoning lengths. Finally, our analysis reveals systematic pruning patterns and shows that attention scores can predict greedy pruning ranks, further suggesting that models encode a nontrivial functional importance structure over reasoning tokens.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 71,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03121",
        "abs_url": "https://arxiv.org/abs/2601.03121",
        "pdf_url": "https://arxiv.org/pdf/2601.03121",
        "title": "ToxiGAN: Toxic Data Augmentation via LLM-Guided Directional Adversarial Generation",
        "authors": [
            "Peiran Li",
            "Jan Fillies",
            "Adrian Paschke"
        ],
        "comments": "This paper has been accepted to the main conference of EACL 2026",
        "subjects": "Computation and Language (cs.CL); Artificial Intelligence (cs.AI); Machine Learning (cs.LG)",
        "abstract": "Augmenting toxic language data in a controllable and class-specific manner is crucial for improving robustness in toxicity classification, yet remains challenging due to limited supervision and distributional skew. We propose ToxiGAN, a class-aware text augmentation framework that combines adversarial generation with semantic guidance from large language models (LLMs). To address common issues in GAN-based augmentation such as mode collapse and semantic drift, ToxiGAN introduces a two-step directional training strategy and leverages LLM-generated neutral texts as semantic ballast. Unlike prior work that treats LLMs as static generators, our approach dynamically selects neutral exemplars to provide balanced guidance. Toxic samples are explicitly optimized to diverge from these exemplars, reinforcing class-specific contrastive signals. Experiments on four hate speech benchmarks show that ToxiGAN achieves the strongest average performance in both macro-F1 and hate-F1, consistently outperforming traditional and LLM-based augmentation methods. Ablation and sensitivity analyses further confirm the benefits of semantic ballast and directional training in enhancing classifier robustness.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 72,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03123",
        "abs_url": "https://arxiv.org/abs/2601.03123",
        "pdf_url": "https://arxiv.org/pdf/2601.03123",
        "title": "Gradient descent reliably finds depth- and gate-optimal circuits for generic unitaries",
        "authors": [
            "Janani Gomathi",
            "Alex Meiburg"
        ],
        "comments": "14 pages, 17 figures",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG)",
        "abstract": "When the gate set has continuous parameters, synthesizing a unitary operator as a quantum circuit is always possible using exact methods, but finding minimal circuits efficiently remains a challenging problem. The landscape is very different for compiled unitaries, which arise from programming and typically have short circuits, as compared with generic unitaries, which use all parameters and typically require circuits of maximal size. We show that simple gradient descent reliably finds depth- and gate-optimal circuits for generic unitaries, including in the presence of restricted chip connectivity. This runs counter to earlier evidence that optimal synthesis required combinatorial search, and we show that this discrepancy can be explained by avoiding the random selection of certain parameter-deficient circuit skeletons.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 73,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03132",
        "abs_url": "https://arxiv.org/abs/2601.03132",
        "pdf_url": "https://arxiv.org/pdf/2601.03132",
        "title": "Finite Memory Belief Approximation for Optimal Control in Partially Observable Markov Decision Processes",
        "authors": [
            "Mintae Kim"
        ],
        "comments": "6 pages, 3 figures",
        "subjects": "Systems and Control (eess.SY); Information Theory (cs.IT); Machine Learning (cs.LG)",
        "abstract": "We study finite memory belief approximation for partially observable (PO) stochastic optimal control (SOC) problems. While belief states are sufficient for SOC in partially observable Markov decision processes (POMDPs), they are generally infinite-dimensional and impractical. We interpret truncated input-output (IO) histories as inducing a belief approximation and develop a metric-based theory that directly relates information loss to control performance. Using the Wasserstein metric, we derive policy-conditional performance bounds that quantify value degradation induced by finite memory along typical closed-loop trajectories. Our analysis proceeds via a fixed-policy comparison: we evaluate two cost functionals under the same closed-loop execution and isolate the effect of replacing the true belief by its finite memory approximation inside the belief-level cost. For linear quadratic Gaussian (LQG) systems, we provide closed-form belief mismatch evaluation and empirically validate the predicted mechanism, demonstrating that belief mismatch decays approximately exponentially with memory length and that the induced performance mismatch scales accordingly. Together, these results provide a metric-aware characterization of what finite memory belief approximation can and cannot achieve in PO settings.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 74,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03168",
        "abs_url": "https://arxiv.org/abs/2601.03168",
        "pdf_url": "https://arxiv.org/pdf/2601.03168",
        "title": "Can Embedding Similarity Predict Cross-Lingual Transfer? A Systematic Study on African Languages",
        "authors": [
            "Tewodros Kederalah Idris",
            "Prasenjit Mitra",
            "Roald Eiselen"
        ],
        "comments": "13 pages, 1 figure, 19 tables",
        "subjects": "Computation and Language (cs.CL); Machine Learning (cs.LG)",
        "abstract": "Cross-lingual transfer is essential for building NLP systems for low-resource African languages, but practitioners lack reliable methods for selecting source languages. We systematically evaluate five embedding similarity metrics across 816 transfer experiments spanning three NLP tasks, three African-centric multilingual models, and 12 languages from four language families. We find that cosine gap and retrieval-based metrics (P@1, CSLS) reliably predict transfer success ($\\rho = 0.4-0.6$), while CKA shows negligible predictive power ($\\rho \\approx 0.1$). Critically, correlation signs reverse when pooling across models (Simpson's Paradox), so practitioners must validate per-model. Embedding metrics achieve comparable predictive power to URIEL linguistic typology. Our results provide concrete guidance for source language selection and highlight the importance of model-specific analysis.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 75,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03235",
        "abs_url": "https://arxiv.org/abs/2601.03235",
        "pdf_url": "https://arxiv.org/pdf/2601.03235",
        "title": "Shallow-circuit Supervised Learning on a Quantum Processor",
        "authors": [
            "Luca Candelori",
            "Swarnadeep Majumder",
            "Antonio Mezzacapo",
            "Javier Robledo Moreno",
            "Kharen Musaelian",
            "Santhanam Nagarajan",
            "Sunil Pinnamaneni",
            "Kunal Sharma",
            "Dario Villani"
        ],
        "comments": "",
        "subjects": "Quantum Physics (quant-ph); Machine Learning (cs.LG); Machine Learning (stat.ML)",
        "abstract": "Quantum computing has long promised transformative advances in data analysis, yet practical quantum machine learning has remained elusive due to fundamental obstacles such as a steep quantum cost for the loading of classical data and poor trainability of many quantum machine learning algorithms designed for near-term quantum hardware. In this work, we show that one can overcome these obstacles by using a linear Hamiltonian-based machine learning method which provides a compact quantum representation of classical data via ground state problems for k-local Hamiltonians. We use the recent sample-based Krylov quantum diagonalization method to compute low-energy states of the data Hamiltonians, whose parameters are trained to express classical datasets through local gradients. We demonstrate the efficacy and scalability of the methods by performing experiments on benchmark datasets using up to 50 qubits of an IBM Heron quantum processor.",
        "gemini2.5flash": "",
        "overall_idea": ""
    },
    {
        "order": 76,
        "date": "2026-01-07",
        "date_url": "https://arxiv.org/catchup/cs.LG/2026-01-07?abs=True",
        "arxiv_id": "2601.03244",
        "abs_url": "https://arxiv.org/abs/2601.03244",
        "pdf_url": "https://arxiv.org/pdf/2601.03244",
        "title": "Self-Supervised Learning from Noisy and Incomplete Data",
        "authors": [
            "Julin Tachella",
            "Mike Davies"
        ],
        "comments": "",
        "subjects": "Machine Learning (stat.ML); Machine Learning (cs.LG); Image and Video Processing (eess.IV)",
        "abstract": "Many important problems in science and engineering involve inferring a signal from noisy and/or incomplete observations, where the observation process is known. Historically, this problem has been tackled using hand-crafted regularization (e.g., sparsity, total-variation) to obtain meaningful estimates. Recent data-driven methods often offer better solutions by directly learning a solver from examples of ground-truth signals and associated observations. However, in many real-world applications, obtaining ground-truth references for training is expensive or impossible. Self-supervised learning methods offer a promising alternative by learning a solver from measurement data alone, bypassing the need for ground-truth references. This manuscript provides a comprehensive summary of different self-supervised methods for inverse problems, with a special emphasis on their theoretical underpinnings, and presents practical applications in imaging inverse problems.",
        "gemini2.5flash": "",
        "overall_idea": ""
    }
]